{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'pBnQo8NR0YCI_uaRA_hl3A', 'review_id': '_s2PXI2CMD9CEkdVp-q46Q', 'text': 'I had been anticipating the opening of this place, since I had been inside this location\'s previous restaurant (Claim Jumper) before, and knew that it would be a large buffet that is close to my workplace. I had a chance to try it today and have mixed reviews.\n\nPRICE: $11.99 for the lunch buffet; uncertain as to dinner price. This is a bit steep for for a buffet but it does mean that they can serve a high quality of food. I had an iced tea, and with tip I paid $15 - a bit high for a buffet for my wallet.\n\nSELECTION: I was a little disappointed by the selection of food. About 1/4 of the steam trays were empty; it\'s possible that they might all be filled for dinner, and the available portions of what they did have out was a bit small (I\'d guess that four or five people hitting a single dish would empty it). They have fairly typical buffet fare: a decent salad bar; a few cold pasta selections; chow and lo mein; white and fried rice; roughly 10-12 entree dishes; miso, egg drop, hot and sour, and a spicy thai soup; a sushi bar with probably 5-8 types of sushi; and a few dessert selections, including a hand-scooped ice cream bar with 3-5 types of ice cream. They also have a full bar (which doesn\'t do me much good at lunch, but is a nice addition).\n\nFOOD: I tried most of my typical buffet selections. One overall complaint I had was the temperature of the food: It was a bit on the cool side for my taste, but that is tough to avoid at a buffet in my experience. \n\nI started with the hot and sour soup. It was both spicy and vinegary, loaded with tons of fresh mushroom, which I liked. It had a bit more black pepper in it than I liked, but was still very good.\n\nIn regards to appetizer-style dishes: The crab rangoon was very good, with a good balance of cream cheese and crab. Crab-stuffed mushrooms were flavorful and had a nice snap to the texture of the mushroom. The Chow Ho Fun (thin angel hair-style rice noodle stir-fried) had a good smoky flavor from the wok and had thin slivers of fresh onion and pepper.\n\nFor my entree dishes: The steak in black bean sauce was tasty, with tender, large chunks of beef and fresh red bell pepper and onion - and thankfully not greasy like some buffets I\'ve patroned. The orange chicken was somewhat mediocre, with neither enough spice nor orange flavor for my liking. Sesame chicken was nice, with a good balance of sesame flavor and sweetness. \n\nDessert: I tried the custard and slice of cake roulade (a spiral rolled pastry filled with fruit and cream/cream cheese). The custard was more of a flan-style custard than I was expecting, but it was very tasty. The roulade was fairly bland and tasted like it was only recently from the freezer, as it was still somewhat frozen; it was drizzled with what I thought were strawberry and kiwi syrups, but those really had little flavor.\n\nSERVICE: The server was friendly and kept my iced tea topped off, and (as is appropriate for a new restaurant, I think) asked us for our comments on the food.\n\nOverall, I was impressed with the quality of the food; most of the dishes were much more "crisp" than a lot of buffets, with the vegetables retaining their snap and the coating on fried dishes still retaining some texture in the sauce (come to think of it, this might be why they do such small portions on the buffet). But with a price tag of $15 for meal, drink, and tip for lunch, I\'m not sure that I\'ll be able to visit very often.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2011-12-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FeXsw9JeBpKf7hcnmJJtkg', 'review_id': 'n7xpgSGHTf1lwz-kiQ8MWw', 'text': 'Great service, had the dinner buffet @ $19.99 a person we asked if we could see the buffet first "No problem, have a look!" I looked at my wife for her approval and we decided to try it. Nice selection of sushi, soups, traditional Chinese dishes. They had  snow crab legs and prime rib also. Great dessert choices with several ice creams and cheese cakes etc.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2011-12-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'R3OrJF4kNmXhMwcIon9fiw', 'review_id': 'r4GYqs4x1SHOW6nHXGyXWw', 'text': 'Sushi as good as you find anywhere in Phoenix (not as good as the coast but still good). Hibachi as good as any teppanyaki place in town. Lots of std Chinese buffet fare but fresher and nicely done. Plus gelato and birthday cake for dinner. What else could you want :-). \n\nPrice: 19.99 for adults for dinner - still less than you would pay to eat sushi or hibachi plus everything else. To me that is a good deal.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2011-12-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 1}, 'user_id': 'kUt7V29RumQW8U53ONdbXw', 'review_id': '9tS4fyp0WSWonAZYEPiDpQ', 'text': "Excellent!!  \n\nThis is the best buffet I've been to in AZ (by a long shot).  Probably the best sushi buffet I've ever been to, including California and Vegas.  And I've been to a lot of sushi buffets!\n\nIf you like sushi, sashimi, shrimp, crab, prime rib, Asian food & appetizers, salads, hibachi, desserts, and great service in a nice, clean atmosphere... this is the place for you!  This is NOT your typical Chinese buffet.  The selection and freshness blows the competition away.\n\nThe sushi selection alone is worth the $20.  Nigiri, sashimi, and some really delicious rolls like spider rolls and rainbow rolls.  But there's more!!  There are Asian apps like potstickers, and NY (or Chicago) egg rolls.  There are pretty good size snow crab legs, large cocktail shrimps, mussels, and oysters.  There's a nice salad bar.  There is a great assortment of Asian dishes like walnut shrimp, Korean beef, and roast duck.  There are like 4 soups (the miso was excellent). There's even prime rib and hibachi.  There's a really nice dessert assortment like cheesecake, gelato, and an assortment of cakes, jello, and puddings.\n\nWhen you consider that this buffet is about a thousand times better than the average Chinese buffet, the $20 dinner price is well worth it.\n\nTopping off the whole thing, our waiter was top notch!  He was friendly and very efficient, I don't think my drink was ever more than half empty.  And our plates were cleared immediately.  Also, the wait staff are dressed like fine dining... ties and long aprons.\n\nThese guys have done it right!  As long as they maintain the high quality and keep the price fair, we will surely be back again and again and again.  Well done Jasmine Tokyo!", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2011-12-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 1}, 'user_id': '8vRuietkRQvJ9H5oLb-q3Q', 'review_id': 'sg0Y53sAwudnB-kejPS-IA', 'text': "An excellent addition to the neighborhood, taking over the premises of\n the now defunct Claim Jumpers.  The buffet is splendid and includes a massive assortment of sushi made fresh to order.  The great variety of Chinese dishes leaves one stunned.  Deserts, including five varieties of ice cream, are a perfect topping to a topnotch repast.  And I write only about Lunch!  Prime Ribs, we were told, is a dinner- time addition.  You can't go wrong here!. Well worth a visit.  Even the service is excellent.  Lunch was $11.99, without tea or drinks of any sort other than water.  Seniors are given a 10% discount at all times.\n\nA later visit, in the evening, found the buffet serving fresh, scrumptious oysters on the half shell.  Wonderful!\n\nOur one reservation was with the temperature of the food.  Hot foods were too often merely lukewarm.  We hope this is just a temporary problem that will soon be solved.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2011-12-28', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': '588oY8EejEFCr-ym_2TR0Q', 'review_id': 'KGUiGYgtDSLgcb_ukRrt-w', 'text': "Good asian food selection, fresh fish, and desserts all for $15.  You really can't go wrong.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2012-01-02', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 1}, 'user_id': 'SB37ySvE9n2GY0AJi47nug', 'review_id': 'nLrRP_9Re1sqyuWqw8XtOA', 'text': 'As my fiance kept pointing out, this place has no immersion or ambience. Aside from the sign and a few decorative asian trinkets here and there there is nothing to make this place feel like an "asian buffet". There are faux stone walls and a huge stone fireplace. The thing that got me though was the antler chandeliers...  Antler... Chandeliers... The music they played was 90\'s soft rock. We mentioned it to the server but she said that she had no control over the music choice. The buffett itself was way too expensive in my opinion. We went for dinner and it was 19.99 per person that with one ice tea each came to a bill of almost $80 for three people! And if you don\'t like seafood (as I do not) then your selections are rather limited. 75% of the buffett was seafood and sushi. The other 25% was everything else so I felt like my meal was not as varied as I would like. The food I did eat was good. You just got that really hard, dried out piece of something every once in a while. For the price my dad joked that they should offer cots in back to sleep it off before coming back for another round.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 1, 'date': '2012-01-02', 'type': 'review'}
{'votes': {'funny': 9, 'useful': 5, 'cool': 2}, 'user_id': 'BjwXX-sChcjx2E55B_7rXg', 'review_id': 'wyE9Tg5I6zOmVYBTGt7qyg', 'text': "Here's what you can eat at Jasmine Tokyo:\n\n1) All kinds of Chinese fast food dishes (chow mein, honey walnut shrimp, crab puffs, etc.... pretty unhealthy unless you skip the cream cheese-y, fried, and mayo-filled dishes. The sweet chili calamari was worth it, though.)\n\n2) Mongolian stir fry. There's legitimately a tiny Ghengis Grill-esque section.\n\n3) Over a dozen kinds of better-than-anticipated-quality sushi, plus sashimi (not all the rolls were identified, but they were tasty, so who really cares if it was Soylent Green, anyway...)\n\n4) Something from the shellfish bar... the crab legs were meaty, but not flavorful... at least they're one step ahead of most buffets.\n\n5) A smattering of Japanese delights, such as the surprisingly impressive squid salad, seaweed salad, etc.\n\n6) Meat. There's a section with huge cuts of red meat for those who aren't ready to venture into Americanized Asian food, or just need a fat steak to accompany their Gyoza.\n\n7) Dessert - a sundae bar with 6 flavors of ice cream, cakes, puddings, custard, jell-o, fruit, cookies, mousse, macaroons, cream puffs, etc. The cookies are awesome, especially a la mode, as is the Chocolate Thunder(thighs) cake with banana.\n\nIn a nutshell: \nIt's pretty apparent that there are a handful of ways to get your money's worth, but I'd say the best bet is just to try everything, then eat approximately 27 pieces of sashimi and 14 rolls of sushi. Even if you OD on sushi and die of Mercury poisoning, at least you were economical about it, right?", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2012-01-03', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': 'ipDZ9ligZmozRi0QcH1A1g', 'review_id': 'Piel7XrwPqigHqpeYMdBqA', 'text': "The place is one gigantic buffet.  The best thing I can say about it was that it did look to be very clean however; it lacks any ambiance at all.   The food was terrible.  I went last night with my boyfriend and two kids ages 8 and 10. We ordered no alcohol.  The bill came to $71.03 (not including tip) for four sodas and the buffet for two adults and two children.  I'd be less offended by what they are charging if the food was even somewhat decent. Do yourself a favor and forgo this one.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 1, 'date': '2012-01-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'j3mhJ4_cw6YGOOlWcs8ysA', 'review_id': 'lL6Bxar_Nwn96MueOD352Q', 'text': 'Great addition to the neighborhood.  We needed an excellent Asian food more then the always great Sushi on Shea next door.  I Was so pleased to see them open in the old Claim Jumper building.\nI must comment on the "Lack Luster" reviews before me.  Anyone would could not find something to truly, sincerely enjoy has other issues.  The food is fresh, plentiful, full of flavor, affordable  and a wide wonderful selection.  The buffet is Loooong with a wide array of fruits, desserts, meats, fish and salads. \nAlways served with a sincere smile and pride in what I observed from the cute & friendly hostess thru to the true Asian Chef.\nI am a fan.  I will be back and often in support their genuine efforts, (as well as to serve my Asian food cravings).  Thank you for your hard work.  Lets see some love out there Scottsdale.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2012-01-06', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 4, 'cool': 3}, 'user_id': 'ZkQiXgDYt4MAvvyruBkchQ', 'review_id': 'rcyWJ8sf2egQpE4KTJH8Uw', 'text': "I have read some of the other reviews.  Some people wrote a book.  Maybe if they focused on eating, instead of so much talking.  Serious foodies are more about eating than boring everyone with over typing.  \n\nThis place is new and my waitress said they are working out quirks.  Everyone was very friendly.  \n\nVery comfortable setting.  What I love is that the food is cooked tasting Healthier.  Not greasy like some of those other buffets.  I loaded up 3 plate fulls.  Even though there was lots of sea food, I ate lots of perfectly cooked crisp green beans.  I am very picky about how thejy are cooked.  These guys did right.  The difference between this buffet and all the other guys,  Jasmine Tokyo's food is fresh, and a higher quality of  food.  I'm ruined for those other buffets now.  So if you complain about paying $19.99 for dinner with all that Quality food, then stay home.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2012-01-11', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '4gXOpa5lZE4ncOatOodNUg', 'review_id': 'ymu-PpHVyt6cn3ZEJPcaqg', 'text': 'Poor food quality, overpriced, and certainly no Asian taste. My family and I will never go back. Why is there any positive reviews?', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 1, 'date': '2012-01-15', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'aPxuJN0t7ORfWiRv_Ve15g', 'review_id': 'LlVayf4RQCdU5U6AMfBuow', 'text': "Beautiful interior design with tiffany lights lighting and granite countertop bathroom. Jasmine Tokyo picks a good location and serves great food to North Phoenix and Scottsdale area. I went to Sunday happy hour. The Sushi bar and crab legs are my favorite with many selections. Four types of Asian soups are distinguished to other local Asian buffet restaurants. The deep fried spicy chicken wings are very crispy and juicy.  I really like the ice cream and its creamy taste and various selection desert bars. I can't wait to come back again.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2012-01-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '1HGPIlOKLdQhgetMTrnluQ', 'review_id': 'OWAoqR12oYNci7cEQXWfPQ', 'text': "Maybe 2 1/2 stars.  The food is not warm but tastes okay.  There is a great selection.  The sushi had been sitting out for awhile so I bypassed it.  The staff all seem to not know what is going on, but that might just be because it's new.  Kid-friendly so I'm sure the hubs will make us come back, unfortunately.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 2, 'date': '2012-01-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'FNFJ97BmcQklkYNQNRA7Ug', 'review_id': 'O2xKsyHwnOiHAmD6LFO3UQ', 'text': "If this place had wi-fi I would gladly bring a laptop and camp out here all day while grazing on delicious food and bottomless mimosas. But they would probably frown upon that. Seeing as how this place opened up accross the street from my house recently, I'll have to settle for frequent visits and slowly getting fat over time.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2012-01-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'kUt7V29RumQW8U53ONdbXw', 'review_id': 'W52XdRyaLEGep6oHDNVuxQ', 'text': "Still excellent!  They haven't compromised the quality or variety at all since opening.  As a matter of fact it seems the variety may be even greater.  If you like to eat a lot of sushi and a lot of shrimp, this place is a must try.  Well worth the price.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2012-01-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'LupASMEE14gLE1yUlAWcKQ', 'review_id': 'auLyEmFPCrCLCMFQDM-5mQ', 'text': 'Good seafood buffet for the dollar (not quite as good a value since opening, with them no more lunch coupons).  It\'s comparable to the Todai chain (the best seafood buffet I know in the US) and a better value, and it\'s open for lunch.  There are fine Chinese buffets in the area also offering sushi as kind of a footnote, but selection (of seafood) and quality isn\'t at same level as here.  Highlights are raw oysters, a fair selection of nigiri sushi and rolls (many of which, fortunately, do not feature fake crab), seaweed salad (unadulterated with cucumber), a mini-Mongolian grill (build your bowl and hand off to kitchen for cooking behind the scenes), and very good hot items like "Tofu Lovers."  Service was uneven (one time great, one time not so much, third time we left when we were 10 minutes past lunch hour) but generally everyone is eager to help, including the sushi staff.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2012-01-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '3vML-LnH0dIyHCrqF5xEYw', 'review_id': 'IGP4dbJx5_DmrlXz1d7Nrw', 'text': "I'm not a big fan of buffets but my sister wanted us all to go out to eat, so I thought I would try it out. The selection was ok, they don't make HUGE plates for the masses, more like smaller ones which means fresh food and often. I liked the place, nice selection and clean. The only thing I did not like was the price, $15 for lunch.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2012-01-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 1}, 'user_id': 'f83AQdEH-3Ze4dCoWLi1NA', 'review_id': '3FwrRVyf1Z6UU_tdzt4IjA', 'text': 'The food is good, and they have most everything one could want, but the price is a show-stopper.  For a lot less that $20, I can find everything available here, except the prime rib, for a lot less elsewhere.  There was the potential for a wide variety of sushi, except the platters were always empty.  There was gelato, but only three flavors since they were out of chocolate and mint chocolate chip.  \n\nWith better prices and lots of coupon deals at Oriental Buffet, and a better selection for a few dollars more at Wandering Horse Buffet, this place seems to be caught in the never land middle ground.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 2, 'date': '2012-01-30', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'ncJxowQ7ucVaOE24AO-IXg', 'review_id': 'ZGIaUtRaQbTXdfDu6irqVQ', 'text': 'Visited the happy hour during the middle of the week. I think I\'ll have to go back and actually try the buffet to be able to give a full review of this place, but here\'s a review from the happy hour perspective: \n\nWe simply wanted after work drinks and sushi, however, the restaurant did not make it very clear how the buffet area and the bar area were designated to serve differently. The host also was unaware as to what was half-priced and what was not, he was probably new so it\'s not a big deal.  \n\nYou can tell they\'ve changed very little from the previous Claim Jumper decor, "those elk horns must be from a Japanese elk," and the space just feels too massive for this type of restaurant. Our waiter did great, was comfortable to talk with, but did not seem to know everything about the menu when we tried asking questions. Most of these issues were not deal breakers at all. \n\nThe food definitely tasted above average. The spicy tuna roll and the dynamite roll were our favorites. The sushi was fresh was enough to satisfy. The prices were very good as we were able to get 5 rolls and two drinks for under $30. \n\nIf you\'re looking for a trendy ambiance and a mind-blowing dining experience, this isn\'t the place for you. But if you\'re looking for good food at a good price, Jasmine Tokyo\'s happy hour deserves a visit.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2012-02-02', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'p_CScNk-cdR5jsZQWEqDSg', 'review_id': '4UX4RXuAjoe2aLASQUweKw', 'text': "WOW!!  Anyone who complains is sick in the head!  $12.00 for lunch buffet was excellent.  Sushi was very fresh, fresh Salmon fresh Maguru on rolls.  They had the usual rolls for the sushi newbies, but they had great other mixed rolls, Dog Roll, Dynamite and etc.  The cuts of fish was better than any cheaper buffet selling all fake stuff.  I tried other dishes some simple some harder to prep and was impressed with freshness of food.  Going to Sapporo and spending $50 and going here and spending $12 is a no brainer dude.  \nAlso you get a creative cold salad offerings with fish worth checking out, along with a mongolian wok set up that they cook for you.  Those items on the wok area looked very good and they spend the money on raw product.  On top of that they some interesting desserts and sorbets/ice creams for the sweet tooths and not some crappy soft serve like most places.  That is if you have enough room.  Come hungry, and who cares the interior looks like Claim Jumper, the build out by Claim Jumper was quality tables and booths and interior that no other Japanese buffet could match with cheap tables.  Even silverware is higher grade also than most other $10 places too!.. Sure the bar area is big, but when it was a Claim Jumper nobody was in it either. Lastly the grease level is very low which is good since that is what kills most places too.   As long as they don't cheat on the food quality I will be every week of the year.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2012-02-02', 'type': 'review'}
{'votes': {'funny': 8, 'useful': 16, 'cool': 5}, 'user_id': '34gJ_KlP3RM6jotNT6TcDQ', 'review_id': 'htAM-z5T5ElVU_RzWQfxHw', 'text': "Unless I'm in Vegas, I don't do buffets. So you should take my 4 star review for a buffet like it's an 8 star review from someone who normally goes to buffets. Like I said, I don't do buffets outside of Vegas, but when another food obsessed friend who also doesn't eat at buffets begged and pleaded with me to check out Jasmine Tokyo, I knew something was up. I opened my Yelp app, read the many positive reviews, and saw they even had a Check-In offer for $5 off. Sold!\n\nJasmine Tokyo is located near Scottsdale Road and Shea, where the old Claim Jumper used to be. It's $20 for dinner and I believe $12 for lunch. The Asian calamari, walnut shrimp, stuffed shrimp, chicken skewers, and beef dishes were some of my favorites. They were all seriously awesome and I went back up to refill my plate at least twice. Also very good were the many varieties of sushi (they even offered sashimi!). \n\nFor desert they offered a variety of cakes, such as chocolate, german chocolate, cheesecake, and I think lemon. They also had vanilla, chocolate, and rice puddings. Cookies, fresh fruit, jello and more!\n\nI chowed down at Jasmine Tokyo and I am looking forward to my next visit! I didn't get to try the crab legs, Mongolian stir fry, and some of the other beef and seafood options, but I feel I had my share and left very satisfied. Check it out, even if you are anti-buffet like me.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2012-02-03', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'Mq70QNg8qb3Zhfx2caxjrQ', 'review_id': 'lj3t84cRfdzE7vpYIClGfA', 'text': 'I went at 11:30 for lunch and thought it was a very impressive buffet; food was good, meat tasted like it supposed to and had the right texture, it was hot and good. Great selection on desserts for an Asian buffet too!\nI am only giving 3 stars because upon my recommendation, my husband took his mom here. They went at 1:00 for lunch and said all the food seemed old and cold, so I felt bad for sending them. It may be because they open at 11 and the food was fresh for me and since my husband went later, it was the still the same food? A restaurant needs to be consistent in service to get repeat customers.\nI will probably try it again and give it another chance, especially due to the lack of good Chinese food in Scottsdale.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2012-02-04', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 2, 'cool': 2}, 'user_id': 'ohRev2g3tvXpV3gBnhC-og', 'review_id': '0ZJOu_YxQ2FyyG4irpVpLA', 'text': 'Had lunch here today with fellow yelpers Robyn N. and Rand H. Well to start the place was built in an old Claim Jumper location and all the booths and decor were used again,it is very nice and comfy. The food was really good  they offer a couple of unusual dishes not seen at other Chinese buffets and a good dessert selection. The food here is displayed nicer then any other Asian buffet I have been at. But I still like a couple of the big super buffets better.This place is probably in the top 5 Asian buffets.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2012-02-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'dqeFcKq2L2wiOg9LFT9-UA', 'review_id': 'UkV-mXzjmNAxhAlCnRGXlQ', 'text': 'Super slick setup, not bad for a buffet, ultra friendly service!', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2012-02-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'v26k4Bzy9GiLLlSmDk8LfA', 'review_id': 'cz6mwskZSL9EW92viRzbWg', 'text': 'The sushi was great! The other food was so so. The quality was good just thought most of the dishes were too gourmet for me. The dessert was great. People that compare this to Vegas buffet have only been downtown.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2012-02-28', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'nEL-_kLeN37CSR9fXFY4zw', 'review_id': 'Ni2fbTzEiVWhpGIjvSaGdQ', 'text': "Really enjoyed this place! Went for dinner, and everything was delicious. Sushi was fresh (I loved the Scottsdale roll), and there were a lot of seafood options. I especially enjoyed the Thai calamari, the walnut shrimp and dim sum. My companion had a ton of crab legs and oysters, both of which he said were very good. Large dessert selection, although we were so full that we didn't try anything. Service was very friendly, and I liked that they had people wandering around keeping the counters clean and checking the temperature of the food. I also thought the $20 price was very fair, considering the amount of crab legs, oysters, sushi, and shrimp that we ate. Buffets are sometimes scary to me, but this place was very clean and made me feel very comfortable. I will definitely be back!", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2012-02-28', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'tm3snXzLvv83jwN1-vrqdw', 'review_id': 'fwQD0KNciKtC_B_T9wP2fw', 'text': 'Nice selection. Good sushi. Very impressive. This was our first time and we definitely plan to come back.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2012-03-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'aPxuJN0t7ORfWiRv_Ve15g', 'review_id': 'y6k8QhqFRNAExdyyLHaajg', 'text': 'This was my third times went there (2 Saturday dinners and 1 weekday lunch). I love that place. Every time I will find some new dishes filling up my stomach. Besides my regular chooses such as crab legs, sashimi, and strawberry yogurt, I try walnut shrimps, roasted duck, cocktail shrimps and mango ice cream. Food of Jasmine Tokyo never let me down and looking forward my next tasty adventure.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2012-03-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'KLekdmo4FdNnP0huUhzZNw', 'review_id': 'm_Tm51QqZViCGt2I4IiDtA', 'text': 'Make sure you are hungry. It is a huge buffet. But $25 a person.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2012-03-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TPqXQMBaRdn7wYUP_diphQ', 'review_id': 'FIqsWdbgjZngl9gnj2Wlxw', 'text': 'Opening day, this was probably the best all-you-can-eat sushi buffet in scottsdale area. But after awhile, the quality went down. Now, the quality of sushi you get here is no different then most buffets. For 15 dollars though, I think its still a decent deal for decent sushi.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2012-03-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zCvD9tsDe7ZGKMccvfXFEw', 'review_id': 'fk4H4BEfhmIPDS9sy88oCQ', 'text': 'I had a few different experience with these kinds of restaurant.\nOverall, I liked it. I can tell their food is really well prepared and fresh.\nEntire atmosphere is also really nice.\nIf they adjust the price little bit lower (even $1 less than now), they will get more customers. Overall I like this place', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2012-03-31', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 3}, 'user_id': 'Ti86eeLrIhpNHDpjbla_fA', 'review_id': 'iAHGWnALxcF8dEG12Tc8TQ', 'text': "YUUUUUUUUUUMMMMMMMMMYYYYYYYYYYYY!!!!!\n\nI LOVE this buffet!  Like Paul, I don't go to many buffets, but this one was awesome!  There was Chinese food, Walnut shrimp, sushi, shashimi, salads, desserts, and much more.  My favorites were the Asian Crusted Calamari, Tuna Sashimi, and Walnut Shrimp. YUM!!  I'm getting hungry right now just writing about it. \n\nI was told by the hostess that the desserts were delivered by restaurants in the area such as The Cheesecake Factory.  \n\nThe only thing I didn't like was that there was a limited amount of sushi rolls.  They had a hard time keeping them in stock.  Also, I'm a huge fan of  crab legs, but they were pretty watery for my liking.  Besides that, this is a great buffet!", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2012-04-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '_uPqvlRzNNUTjpuBS8kGYQ', 'review_id': 'pOS5L8bEXGzIhWNwZ2-ZQQ', 'text': "None of the food was bad, but none of it blew my mind either.  I served myself multiple helpings of the orange chicken, but I have had better (I like it crispy, but these chunks were kind of soft).  The miso soup was good as well.  The sushi rolls were only OK.  I think Sushi Brokers has much better rolls.  I did like the desserts (multiple chocolate chip cookies, chocolate pudding, german chocolate cake, and mint chocolate chip ice cream).  The Coor's Light on special was a little flat as well.  \n\nI'm not sure I'm going to be finding my way back here, not because it was terrible, but just because nothing was that great.\n\nAll of the waitstaff, especially our server, were really friendly.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2012-04-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mZA3KS7nFfuY77iigfwRhw', 'review_id': '2Zlp98aTm7xljikIXydemA', 'text': 'This place is great.  Wonderful selection of everything from Sushi and Sashimi to cooked dishes, salads, a carving board and an amazing selection of desserts.  We had a leisurely dinner and enjoyed every single offering on the buffet.  A real winner!!!!!!', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2012-04-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Ja8FvcWiWHEXME2vmTPTkA', 'review_id': 'mskE3wn8J8tLHHOiOPRDKw', 'text': "Definitely an awesome buffet.  Not your typical buffet stereotype.  Love the sushi.   Great variety of things to have.  If memory serves,  it was 19.99 when I was there.  I think a tad high, but someone mentioned 25 bucks, so maybe it's come down :-?  Sake is priced well, and the beers.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2012-04-12', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'iuhvd_Tu_By1JhUJ2-dioA', 'review_id': '0hV9SZcTiS0tD1gvDNZ5yQ', 'text': "Probably the best Asian buffet I've been to. Interior is great and the food is excellent. So excited to have this right by work for lunch!", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2012-04-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 7, 'cool': 1}, 'user_id': 'fl6oI21uXoxVMwfR6lFanQ', 'review_id': 'kUfgB9AXkSaT3ODa1jk7dg', 'text': u"Wowzas, I'm impressed!\n\nLike many other reviewers, I am not a fan of buffets, but when my family decided to meet up here for my Uncle's farewell departure, I sucked it up and tried out Jasmine Tokyo. \n\nFirst of all, I love the fact that they kept the layout, with the tables, booths, and bar area the same. Second of all, they have sushi that is constantly being visabily made and set out! Win! Some of the rolls include: rainbow roll, caterpillar roll, fried jalape\xf1o roll, a boring California roll, two other deep fried delicious looking rolls, and a few other maki rolls. They also have sashimi (tuna, shrimp, yellowtail, squid)! Aside from sushi, they have a Mongolian stir fry station, prime rib, Crab legs, salads, and tons of deserts, including gelato! \n\nI would definetly come back!", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2012-04-27', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'E5qFR0RBQBoXx8FbrOkdbw', 'review_id': 'lzh1ojBeaPe0bsNLnyinyA', 'text': 'Large selection, great staff', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2012-04-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': 'YeK95nGGvYsssVHzcWpmkA', 'review_id': '0_4xMndnjjMhTRAuJr1Dsw', 'text': "Wow! Just wow! Totally worth the cost of all you can eat. The sushi was my favorite and the entire reason I will return and recommend anyone who doesn't like buffets to give this place a try. It's definitely not the average buffet with hit or miss options. The spread was amazing with crab legs, oysters, tons of dessert. Kid friendly selections as well. Our waitress was very nice and we even used the $5 off yelp check in coupon.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2012-05-04', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'KcI2VGSvRhLAmw6vZrc8WQ', 'review_id': '6Lscgzrijk3NsX-6Uk2M_Q', 'text': "I danced between 2 stars and 3 stars with this review.  I'll get to why I only gave it 2 in a minute.\n\nMy dad was REALLY excited to try this place out.  Asian buffets are his thing.  I like them too but I prefer upscale ones.  This one is upscale.\n\nIf you have read any of my other reviews you'll know I am a buffet junkie.  I love them and I will honor and cherish them as long as they take care of me.\n\nFirst off, this is the cleanest buffet in Arizona.  Hands down!  It's nice, spread out with seating and incredibly nice decor.  The layout of the food is great.  \n\nWith that being said, the dishes are your standard Asain fare with a twist.  You can tell the cooks take pride in the preparation and ingredients.  THE BIGGEST PROBLEM IS EVERYTHING IS COLD ONCE YOU GET IT TO YOUR TABLE.  All the food was incredibly luke warm.  If it was hot, it would have tasted better.  My dad went up to the manager and told them this.... Their response.....  IT'S THE A/C in the building.  That has to be the biggest crock of shit I have ever heard in my entire life.  I've been to plenty of buffets in the Valley and not once was the food cold.  They ran the A/C too. All the dishes were pretty cold, a health inspector would have a field day with this place. \n\nNow that I got that out of the way... The sushi layout was OUTSTANDING.  The fish was really fresh and they had almost any roll I could imagine.  I would have liked to have tried the crab legs but there were maybe 10 of them sitting in a bath of luke warm water.  It was like that the entire hour I was there.  The oysters were great..  Please keep in mind... I NEVER EAT OYSTERS AT A BUFFET.  It's the one thing I won't trust.  These were cold and fresh and delicious.  If you can eat $20 worth of sushi on one plate, this is the place for you.. You will get your money's worth.\n\nThe bottom line is this place is worth trying once.  After that, I don't think you can justify paying $20 for lukewarm food.  Judging by the managers response, this is an issue that will not go away anytime soon.\n\nAlso, our server was a real ass.  I am not sure if he just hates his life or was having a bad day, but he was pissed about something.  He slammed my drink down each time I asked for a refill and he was pissed that he had to bus his own tables.  If I did decide to go back here, I would ask for another waiter.  Also this place was dead on a Sunday at 6:30pm.  I don't think this place is going to make it.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 2, 'date': '2012-05-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'chI2p-ROg2tXI2-tT2_G2A', 'review_id': 'i0adyp1Ts0JLOV-A42ZNMw', 'text': "So far one of the best Asian Sushi buffets I've been to since I moved to Arizona. It's the CLEANEST and the service is much better than others buffets in the Valley.\n\nThe restaurant is fairly big, so definitely great for large groups. They have a selection of Sushi Rolls, Sashimi (Salmon, White Tuna, Tuna, Octopus) and a small hibachi station. The also have a fresh salad corner with Romaine and Iceberg lettuce with other veggie toppings. The chinese food selection was great too including prime rib!\n\nI would say the dessert selection was the best. They have ice cream (with a lady ready to scoop for you with a smile!) and individual served cakes (red velvet, chocolate and a couple of asian pastries)\n\nFor dinner $19.99 not a bad price! Plenty of parking too!\n\nI had a $5 off coupon for checking in on google places.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2012-05-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': 'flMTJnE1mA8HDFV_qRafpA', 'review_id': 'B9f6ZrEMGJG7-E8WLpLQDA', 'text': 'WOW Yelpers!!! Looking for a good sushi buffet?? Look no more!!!!\n\nI once went to a sushi buffet in Vegas and was so disappointed. I thought that if Vegas could not get it right..no one else could. Well, I was wrong!!!\n\nThe variety of sushi is amazing!! They also have a station with typical Chinese dishes and a small hibachi area. The dessert selection was vast. They also have this mango ice cream (gelato type) that is amazing!! I ate lunch there until I was full...all for $12 per person. Our waitress was so sweet and attentive. This place is so worth it!! You must try it.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2012-06-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'mlvSgE6I5jY1HS6KsN4yFg', 'review_id': 'Ci9Lwc63PRhrir7mmt5B_Q', 'text': "Read some of the other reviews before going.  So many positives, I was really looking forward to trying this place, always hoping for a good sushi buffet, but always having been disappointed..\n\nFirst, the good stuff.  Lots of variety.  Very clean.  Staff is friendly and helpful without being obsequious.  \n\nBut ultimately, it's the food one goes to a restaurant for, and in this the place fails.  Food that should have been warm wasn't.  Sushi didn't look, taste, or have the texture of fresh.  Rolls mostly tasted the same - couldn't tell one from the other.  \n\nDesserts?  Again, lots of options, all mediocre.\n\nFelt it was really a waste of money.  Won't be back.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 1, 'date': '2012-06-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cJ4sX6aMfgFJNRAmPO-pOw', 'review_id': 'M37h89AiC-AlGfqYZWg6Zw', 'text': "We went late- 8:30 on Saturday night- but were pleasantly surprised by the friendly welcome and the full array of hot buffet and sushi choices.  The buffet foods were tasty and fresh, the sushi was pretty and delicious (try the Shaggy Dog!!) and overall it was a good experience (and my hubby was pleasantly surprised that the Kirin was only $3.50). The only reason I didn't give 5 stars is because of the odd decor . .  the Claim Jumper 'lodge' look together with random Asian accents just didn't work for us!!", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2012-06-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'p_CScNk-cdR5jsZQWEqDSg', 'review_id': 'SzlraMCpkrJD7pcX27pZmQ', 'text': 'The last chick who gave jasmine a single star is clueless! Yes sushi in valley is tough but there are many like stingray and etc. jasmine has wonderful selection and has real nice spicy tuna and spicy salmon and host of tons of other sushi rolls! Price is killer for lunch for sushi alone not to mention the other 60 items you can have!\nThe booths are left over from clam jumper and it would be stupid to pull out high quality booths for some tables honey !  Service is stellar even for Buffett, my glass was never empty and my plates picked up instantly! 5 Stars to me from LA boy who knows sushi!', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2012-06-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2Iq_-vHSKWwlDyWpAEY1Hw', 'review_id': '31JA5b-olbKoWis4Y_Vy3A', 'text': 'Holy sh#t! For over 20 bucks a person this place is awful. Food is subpar. Poor selection. Soggy, cold food. The ambiance is lacking. The location is an old claim jumper and still looks like it. Gotta love looking at antlers while eating sushi. BTW sushi is the only redeeming aspect of this place.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 1, 'date': '2012-07-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8x3PeBPpR9bfQMjOE2JFHg', 'review_id': '6MwLw1Lq94hH6pTk84uwkA', 'text': "Enjoyed lunch here today. Pretty good variety of sushi (best i've seen in Phoenix) as well as decent offering of hot dishes. Included the usual suspects of a buffet and about 8 types of dim sum/dumpling. The dessert selection is better than most with the ice cream being the true highlite. As far as price goes $12 plus a %10 off coupon makes it worth looking into. Not my favorite buffet in Phoenix (my favorite/usual choice is Pacific Seafood Buffet) but for being closer to home makes a decent alternative.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2012-07-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'pRRkHyLIyS8NYU0xPGY-VA', 'review_id': 'lAqp9EfxjDh_dqQjGsByhQ', 'text': "I see my parents as the connisseurs of Chinese buffets, so when they said they wanted to bring me to Jasmine Tokyo for some good buffet fare I figured why not.  This place serves a mix of Chinese and Japanese food.  There's a variety of cold salads, hot Chinese dishes, roasted meats, dim sum, sushi, fruit, and desserts.  The cold salads and hot Chinese dishes were my favorite.  The dim sum was not so great because of the thick wrappers they used, and the sushi was just ok because of all the rice they put on them.  Overall, the food was pretty good, but I would just go for lunch.  I think dinner might be a bit overpriced for the quality of the food.  I wasn't as impressed as my parents, but I think it's one of the better ones in Scottsdale.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2012-07-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '_Vg2vXkC_8_owQhHRUjzUQ', 'review_id': 'ii3OXvlWOyPLiAKWegMyug', 'text': "It was much nicer than I anticipated. Tons of selection, even with sushi! They had everything- and the food portion and presentation was perfect. It's an amazing value for what you get.  Our waitress was very attentive and pleasant- I will definitely be returning soon!", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2012-08-06', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 2}, 'user_id': 'jx104chvz7NbkVytXldUGg', 'review_id': 'cNadpweYLjGc_oEXyhCvRA', 'text': "As far as Asian buffets go, I think this place is as good as it gets.  It's in an old Claim Jumper restaurant and except for the very large buffet stations, they've left pretty much everything as is.  It's comfortable seating and feels most upscale than most other buffet places.\n\nThe food is fresher; it's served on platters in smaller batches as opposed to dumping a huge pile of food into a stainless trough.  There is much more variety and the food is better quality!\n\nSome of my favorites, the calamari - lightly breaded in a sweet sauce, the tempura - huge shrimps and veggies fried just right, the dishes with beef had nice cuts of meat, tender and not fatty/gristly, and the snow peas and green beans were slightly crispy and very tasty.  They also have a better than average selection of salads, sushi, fresh fruits and yummy desserts.  The custard was awesome and tasted just like creme brulee.\n\nThe service is also 5 stars, they were quick to remove our dirty plates and kept my iced tea and water filled without having to ask.   They also set extra napkins on the table and wet naps, without us having to ask!\n\nAs Rand H said, this is the Wandering Horse of Asian Buffets!", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2012-08-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'f9ugSewWw2BVGcy7kyjm6w', 'review_id': 'h8DuqpTX-nVoeTAD40mPSQ', 'text': "Finally an upscale Chinese buffet, where have you been all my life? Away with the mess hall atmosphere, since it is in the old Claim Jumper restaurant, the seating is nice and secluded. Sushi station has a ton of variety and the other choices are plentiful and high quality. The cream cheese wontons are the best and the fruit is cut up, ready to eat - even the oranges came out of their peel. Don't even get me started on the desert selection. Well, if you must, I tried the straw mouse and the chocolate mouse, both delish and even the mundane chocolate or tapioca pudding is served in appetizing little containers reminding me of the wicked spoon in Las Vegas. So much better than the piles you get at other locations.\nAbsolutely my favorite Chinese buffet from now on, I shutter now thinking of my old digs.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2012-08-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '28Feb3wy4_CgUAyUTWhnwg', 'review_id': 'Qe7cmGysf86UiB0FHhtN7g', 'text': "I grew up with Chinese buffet food and for most of my life avoided it.   \n\nHowever, I found Pacific Seafood (I tired it mainly because it was close to work) and realized Chinese buffets don't have to well ... be Chinese buffets.   And now Jasmine Tokyo joins Pacific Seafood as the only .. well, two buffets I will gladly dine.\n\nThey have a generous selection of sushi and dessert.     My favorite dishes were the ribs, coconut shrimp, and the sushi.\n\nIt doesn't look like an Asian restaurant with bright florescent lighting.    It feels more classy.   Another reviewer said it was an old Claim Jumper.\n\nWebsite lacking a lot of info, so I'll give some info here.   At the entrance they had a sign that explained they charged 70 cents per year for a child less than 12.  (so a 10 year would be $7) but later explained the sign was wrong and it was actually 90 cents.  They also offer 10% off for Seniors.   I went to lunch and it was $14.99 per adult.\n\nThe service was wonderful.  Our cups never got empty.  I really like the place, and would consider giving it a 5 star.  But I'm tight with offering 5 stars until at least I have a sequel visit which I plan to in the near future.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2012-08-12', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'zGz5NI4sscO4_6YYH-qVtA', 'review_id': 'kcCy50HE3g-z188HA-BdKg', 'text': "The weekend dinner buffet was absolute tops, I don't think I can say enough, but I'll tell you what I want.......\nALL YOU CAN EAT!!!!\nIt's pricey, about $20 or maybe a little more? My friend sported me on his suggestion of the place. Their website doesn't tell you prices! It's totally worth it for what's on offer! \nAnyway, this is the old Claim Jumper restaurant location, and they kept it pretty much the same with some slight decor changes. The cool belt-driven fans are still there as well as the high booths.\nService is perfect and impeccable. Nuff said.\n\nNow the buffet amazement!\nAll you can eat sushi and sashimi!!! WOW I was in flavor heaven.\nOf course PLEASE take only what you can eat. There's a sign to remind you as well. They don't want you to waste food or the chef's time.\nSalmon, tuna, the works! Help yourself. I also recommend the tempura'd jalapeno roll. SCRUMPTIOUS! There are also tempura'd veggies at the end. Be sure to look at everything so you don't miss things.\n\nThere's a small area that has Oriental ribs, smoked sausage and.... PRIME RIB CUT TO ORDER from the big chunk on the block in front of you. I ordered a thin slice with au jus. I didn't want to fill up on that, I wanted to try a little of everything per my buffet custom. There's also asparagus, which was done perfectly. The ribs were a tad dry, but delicious anyway with that red glaze.\nThey also have a Mongolian grill section if you want. Choose your ingredients and have them cooked for you there. \nCooked salmon, calamari (super yum!), little octopi, clams, crab legs, some of the usual Chinese buffet offerings, shrimp, mussels, oysters! So much to choose from. \nThere's also this amusing little treat on a scallop shell you should try. Cheesy and creamy. I say amusing because I compare it to a fun flavored thing at Hibachi Grill (currently closed, don't know when it will re-open or if it will).\nGelatos for desert as well as a variety of pastries, and anything else your heart desires. There's also Hershey's syrup for drizzling. \n\nThis is the best buffet I've ever been to in the Phoenix area. On par with Pacific on South Country Club for me. Haven't been to Talking Stick yet, but this one is SUPERB!!\nI wonder what the lunch buffet is like, and what the differences are, but the Saturday evening dinner was OUT OF SIGHT!!!\nGO ENJOY!\n\n** Jedi Obi Wan hand-wave **\nThis is the Asian buffet you've been looking for.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2012-08-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'p_CScNk-cdR5jsZQWEqDSg', 'review_id': 'A3yDYQZpq8WvERpKqKIuCQ', 'text': "Hi: I'm back again @ sushi is fresh even better for knowing lunch is only 12 bucks! Lots of extras on the grill extras on fish cold salads, and many items from china, Korea, and all of Asia! Bring an empty tummy for all the fun foods here. Judy my lunch waitress is smiling and always very awesome so ask for her tables! 5 Stars!", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2012-08-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'HMpMXskg1OZAnqGmB0rzqQ', 'review_id': '-ZBzuDOcbc_GZpzSjisdzQ', 'text': "Pretty good buffet joint considering the lackluster choices abound in the phoenix area. The restaurant was very clean, and the booths made the place very comfortable. There was a good variety of food here, although I was expecting much more in the sushi department considering it was touted as a Japanese type buffet. Most of the roles had imitation crab as the main component, there were maybe 2 rolls with actual fish on them (tuna roll, and a rainbow roll), and only 1 nigiri.  All of the roles tasted good but they are obviously geared towards American taste. Most of the roles except the tuna roll has mayonnaise and eel sauce on them. There was no sashimi at all. I must say though that the sushi rolls were very fresh. They only put out 10-12 pieces at a time so they didn't sit long, and they were constantly being made . The rest of the buffet consisted mainly of stir-fry items that were heavily bathed in oil and or fried. This is expected for a buffet and  were ok, but not spectacular. Deserts consisted mainly of cakes, and were not asian at all. I was expecting maybe mochi instead of chocolate cake and jello cubes. The 15 bucks I paid for the weekend lunch was almost worth it, but honestly 10 bucks is about as much as it should cost. $20 bucks for weekend dinner is a bit steep considering the variety.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2012-09-04', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'xB9Yze6uC1mJXEzA8wpWSw', 'review_id': 'fkpPzTUIj18eXgpkSDW3Sg', 'text': 'By far the best buffet I have ever eaten at. Quality food, excellent service, all food was fresh and it was very clean. I will definitely be back! A+', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2012-09-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'p7dvahRPZIWL7T6pFA_0dg', 'review_id': 'GgbDPk11B7WvY26qLerP9g', 'text': u"For sure Jasmine Tokyo is an above average Asian Buffet. After sampling a variety of offerings you can have a very good experience if you zero in on the dishes you like. The high lights for me were the spicy salmon rolls because they weren't the mayo upped kind you get at the budget places. The spicy fish on watermelon chunks was really awesome. I would have preferred the sushi to be smaller in size or with less rice but still the sushi was above average. I liked the great selection of fresh vegetables. The entr\xe9e I liked the most was the tofu stir fry with bok choy.\n\nI was very pleased in general but since it's a buffet it can't be five stars in my opinion because proteins that I tried were a little chewy or overcooked but still much better than your average Asian Buffet.\n\nI'd go back.\n\nI think the dinner price was $21.99", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2012-10-01', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'gIhEoQQLLUHbKbn2_TS1hg', 'review_id': 'O7BOGW4wR16N6P6-FlQh6w', 'text': 'I really liked the food, we came around dinnertime so the food was super fresh! The staff was very friendly. And for the price you are getting a great deal!', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2012-10-04', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'KANXFmatyMUWr2JriEThlQ', 'review_id': 'Bh9WW3JkkAE2c4g7QpGLiw', 'text': 'It now costs 21.99. Still worth the price food is not Asian but, it is good.  All food items were fresh and carefully watched to be sure they stayed fresh.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2012-10-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'tl4z8iSvX7SwJwbSJt-v8w', 'review_id': '57u6h0BYKaOuTAkYoQ-duA', 'text': "I got a little nervous walking in when I felt like I was walking into a Claim Jumper.  I asked our hostess if this used to be a CJ and she said yes at the exact same instant the question became irrelevant - I saw the 'deer antler chandelier' that is classic CJ.  This place took over the restaurant and did ZERO to change the interior.  Uh oh....\n\nI took the kids up to the buffet and after the first pass things got better.  They were in heaven.   Fresh fruit, noodles, many kinds of shrimp, miso, tempura, hibachi, mandarin chicken.  They can be picky eaters but we fully content.\n\nAs for me, I tried a bit of everything.  The crab legs were small and unsatisfying, but the warm bar was good, hibachi was good, but my favorite was the sushi.  They mostly have rolls but they were all good.  They even have a bottle of spicy mayo that you can add to you plate.  \n\nUnique pricing for kids....$.90 cents a year under twelve.  Very reasonable.\n\nOverall we were impressed and satisfied.  Giving it 4 stars now because sometimes when your expectations are low you don't get the real picture until you visit again.  So we'll try it again.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2012-11-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_4GKfTktcFobMsJwQ6YxHQ', 'review_id': 'ljl417Wggbrh4M2ImQOHTw', 'text': 'I\'m usually not a big buffet fan, but this place changed my mind!  It\'s very clean, good service, lots and lots of amazing dishes, AND really good sushi!  Weekend lunch was $14.99, but during the week it\'s $11.99. Well worth every penny. One more comment, this isn\'t the kind of buffet where "shifty people" go. The kind where you need to Purell your hands and arms when you get back to the table : )', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2012-11-03', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 1}, 'user_id': 'uZbTb-u-GVjTa2gtQfry5g', 'review_id': 'lrn_pZPRDpiRX17a-I906Q', 'text': "This is a huge buffet with multiple cold and hot options.  We went here on a Friday night, and prices were $21.99 for adults, not including drinks.  There's a plethora of options that will please just about anyone that comes here to dine. These options include standardized Americanized Chinese food (Like orange chicken and chow mein), various salads, a carving station (They had pork ribs, kielbasa sausage, and prime rib when we went), sashimi and sushi (nigiri and rolls), hibachi, seafood (Such as crab legs, steamed clams, raw oyster, shrimp cocktail, and various Chinese seafood concoctions), and dessert.  \n\nThe menu for the most part echoes a lot of the food you'll see at Pacific Seafood Buffet in Chandler or Crazy Buffet in Tempe, except for the carving station.  As for the quality of food, it's pretty good for the most part.  Out of everything I tried, I was most leery of the oyster though.  I took a tentative bite, only to discover it had a pond-like taste to it, and was very gritty.  The other seafood items were much better.  The crab legs were salty, but the meat inside was sweet and tender.  The sushi rolls seemed a little bland and were dry from age, but the sashimi was better.  They had thinly sliced pieces of white tuna, salmon, octopus, and snapper when I went.  The Chinese food was pretty good, on par with Pacific Buffet, and the prime rib was tender.\n\nDessert included various ice creams and gelato (Such as coconut, mango, and mint chocolate chip), mousse cakes, cheesecakes, carrot cake, German chocolate cake, custard, and cream puffs, just to name a few!  There is also a fresh and canned fruit section at the end of the salad section.  I tried some coconut gelato and various cakes.  The cakes were fresh and tasty, and the gelato had a nice refreshing coconut taste, although the texture had a weird gummy quality.\n\nService was very attentive.  Drinks and plates were refilled and taken away promptly.  At the end of our meal we got a coupon for the regular buffet, and for their happy hour.  We did get $5 off our meal total by checking into Yelp and using a check-in deal, which made the price a little more reasonable.  \n\nOne other thing to note is the bathroom, while clean looking, does smell somewhat sewer-like, so keep your nose prepared!", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2012-11-10', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'PfuPTOzx5u0vucw4fLllKw', 'review_id': 'BxOedCicnl8za-r3z0BaaA', 'text': "Yes the buffet is huge, but honestly it wasn't very good! Especially for 22.50 a plate.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 2, 'date': '2012-12-14', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 1}, 'user_id': 'S1qO3r4m-wdIuoE-e5r8UQ', 'review_id': 'QxvTPbiYi3-DdC00pRRMHQ', 'text': 'We went to Jasmine yesterday for the first time (for lunch) and were blown away!  The restaurant is very clean, the manager so pleasant, and then there\'s the food.  Mounds and mounds of it.  But quantity does not make for a great buffet.  The quality of the food was extraordinary.  Starting with some of the freshest, prettiest sushi and sashimi I have ever enjoyed.  Flavors just jump out at you.  I never got to eat any of the hot, prepared dishes, but that\'ll be for next time.  I had several pieces of dim sum which were excellent.  Most especially the sesame cakes and the pork bun.  Then there\'s the ribs,  Best I\'ve had since leaving New York more than 25 years ago.  If I ate nothing but the ribs, I\'d be a very happy camper.  The meat is lean and tender, and has great "chew" to it.  The sauce is more than flavorful.  Oh, YUM!  I never got around to the soups or salads, but, again, that\'s for next time.  I hope they get lots of patronage and stay around for a long, long time!', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2012-12-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'eRtuJOuHBXoJ3GRlAe_eTw', 'review_id': 'FzS3QUuXLQCU-3LOcZrvuQ', 'text': "I've been here for lunch twice.  I'll be back!\n\nFor some reason, and I have NO CLUE why, there aren't many great options for asian buffets here in Scottsdale.  This place works for me.  \n\nGreat variety, traditional dishes, very well done.  They keep the food freshly rotated and will toss out the food that has been sitting.\n\nThey have a lot of sushi options as well.  I LOVE sushi, but can't bring myself to eat buffet sushi.  Though it looks great, I just need my sushi to be freshly made to order, so I will hit Stingray or Geisha for my sushi fix.  But that's just me.  Definitely don't let me stop you from trying it.\n\nIt's kind of pricy, but it's worth it.  Usually when a buffet charges more, it helps keep the riffraff out of the restaurant, which helps make the experience even better.  No one wants to sit down for a meal only to look across the aisle at Honey BooBoo.  \n\nTry this place!", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2012-12-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'JnFHOLBIdw36CihBAACSKQ', 'review_id': 'orJhxta3eg482R-SqiPONQ', 'text': 'My first and last visit: food was not worth the price, the service stinks, and the staff is very unfriendly.  I will not be going back!', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 2, 'date': '2012-12-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'Qtro4APUHh1wEwnVhciPPQ', 'review_id': 'EsuNubpDJWMLSjUrBJXIpw', 'text': 'Go for lunch on any given day rather than dinner. $21.99 compared to $11.99 isn\'t worth the prime rib and crab legs that distinguish dinner from lunch. Same sushi, entrees and desserts available for lunch as are for dinner. \n\nAnyways, this place seriously is AMAZING. My boyfriend and I decided to go and look at Jasmine Tokyo as a last resort option, as many of our favorite sushi joints were closed from the 2-5ish times. We didn\'t expect to be impressed, so we decided just to take a look at the food and then see if we wanted to eat. \n\nUpon walking in, we were politely greeted by what seemed to be the owner, and she didn\'t seem to mind us looking around before we made the commitment to eat there. The place used to be a Claim Jumper, and the owners/remodelers of Jasmine Tokyo either didn\'t care to hide that fact or didn\'t have the budget to, because the whole inside of the restaurant looks exactly like the Claim Jumper used to-- with the exception of the actual buffet areas (Giant antler chandeliers, same booths, pager return box outside). But the decor really doesn\'t take away from your experience at all, rather, it sort of makes it a funny topic to talk about during the meal. My boyfriend and I found ourselves laughing about it frequently. \n\nWhen we first walked in, we gravitated DIRECTLY towards the sushi. That\'s what we wanted in the first place, so why not. It was beautifully presented, and looked delicious. We were in. We were seated, our drink orders were taken, and then we went to the buffet. \n\nThey had four types of nigiri sushi (salmon, red snapper, tuna, and another), a TON of fun rolls like crunch rolls, "shaggy dog" rolls, and shrimp tempura rolls. They had an interesting variety and some very creative things like a "Scottsdale roll." They also had tempura vegetables, egg rolls, spring rolls, cream cheese crab puffs and pretty much everything you could think of when it comes to sushi. On our first visit, we didn\'t get a chance to try anything but the sushi, but, they have a ton of other Asian foods like chow mien, orange chicken, mushroom chicken, squid salad, and soups. They also have a salad bar, and an area for fresh fruit, but, really? Don\'t waste the room in your tummy at Jasmine Tokyo on Americanized salads and fruits. In about a month, we went there 4 times. We eventually got to taste about everything, and it was all really delicious. But if you\'re going to Jasmine Tokyo MAKE SURE TO GET THE SUSHI. \n\nThe service is pretty sub-par, but what can you really expect from a buffet. I don\'t really see the point in giving a decent tip at a buffet, let alone with poor service. \n\nOverall, on a scale from 1-10 \n\nSushi Quality- 9.5 (for Arizona) \nOther Food Quality- 7.5 \nDessert Quality 7\nService Quality- 5\n\nNow that we\'ve been to Jasmine Tokyo for LUNCH, we find that we can\'t reason to go anywhere else for sushi, because the for the price of one sushi roll at another sushi joint, you can get unlimited, great quality all you can eat sushi. \n\nMAKE IT A PRIORITY TO GO HERE!!!!', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2013-01-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dqFU6sdx3asOlYp7uzmThw', 'review_id': 'Y8WJ3QcPrjpCVRV5PvwfAw', 'text': "Jasmine Tokyo is as good as it gets for Chinese/Japanese buffet in Scottsdale. There really is no other comparison in all of the valley that I know of.  I have been going to Oriental Gardens at Indian Bend & Pima for years, until it turned into a Hooters 5 months ago.\n\nCleanliness - food area was very clean.  Restroom was clean.  Dining area was average.  It is a converted Claim Jumper restaurant, without much conversion other than the food.  There are still antler chandeliers and fake stone decor is the theme.\n\nFood - excellent variety of Chinese dishes, Japanese hibachi, an impressive sushi selection and an enormous amount of dessert.  The Chinese dishes were not very traditional Chinese, but more of the standard buffet selections we are all accustomed to seeing in any buffet, but the nice part about it was that the dishes were fresh, in small batches, rather than large trough style portions.  Hot dishes were well made and the sushi selection was well worth the price of lunch. Desserts were plentiful with a large variety of cakes, pudding, mousse and ice cream (not freezer burned either).\n\nPricing - $11.99 for weekday lunch.  $15.99 for weekend lunch.  Dinner is $21.99 every night.  Drinks are not included in these prices. I don't ever care for the crab legs or prime rib at any Chinese restaurant, so my recommendation is go for lunch.  Our server kept our drinks full and the empty plates were always gone when we came back with full plates, which is a huge plus in my book, so I had no problem providing a healthy tip.\n\nWill definitely be going back for lunch often!", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2013-01-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9Tnds0bhPScGEBXbKn4HqQ', 'review_id': 'iONcV7zFLzye_8s5NKPORw', 'text': 'This is the best Asian buffet I have been to and it is one of the best buffets period. The sushi was fresh and appealing. The vegetables were cooked to perfection. I wanted to try everything, but there was too much to choose from.The $22 price seemed a little steep, but the quality made up for it. We did not even have the crab or prime rib which is a dinner only item. I will return, but for lunch most likely. With the Yelp check in, I received a 20% discount.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2013-01-30', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 0}, 'user_id': 'gZEDfvkK6vVSlYqnSdgPsA', 'review_id': '7rU8u-M87lDoPp4PGolU3w', 'text': "My wife and I have been coming here since they opened.  We also frequented their other location in Chandler when we lived in the East Valley.  In the past 13 years of visiting them we have had great experiences.  However on our last visit when we arrived we were greeted by our hostess who escorted us to our table.  When we arrived at our table I asked our hostess for one of their chairs without arms because I am a large guy and don't fit in their standard chair.  She returned and stated that they did not have one available and if I would be willing to try and squeeze into one of the smaller chairs.  At that point being very offended told the hostess that we would not be staying she stated whatever and turned and walked away.  Now I understand that it is not the establishments fault that their hostess is not much of a people person and to be frank her people skills sucked.  So to make a long story short, for the past 13 years my family and friends have been enjoying the food at their two restaurants and have most likely spent thousands of dollars, that we will no longer spend with them.  If you are reading this please note that we believe that their food is great and they also have a great selection.  I will let you all know how it turns out after I speak with the owners tomorrow.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 1, 'date': '2013-02-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'U4vvxA_sY1EDB2JuJjHB8w', 'review_id': 'zqW9yLOXiGfZbqAzRWJu8g', 'text': 'The buffet was huge with a ton of options but nothing I had was very good.  It was really expensive too for mediocre food.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 2, 'date': '2013-02-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UuqMmo04YTY5NzOZC37V8w', 'review_id': 'juj6rPALzvq-hLiJ_XvnHA', 'text': "Eating out with 3 kids who couldn't care less for chicken fingers, hot dog, kiddie burgers, Mac and cheese, and the like. This place hit the spot for us. A wide variety of food to meet everyone's preference is what can be found at this place. Definitely a place for the family and a hefty appetite. Hot foods, sushi, sashimi were prevalent and gelato to top it all off. If we lived local we would frequent this place. Thanks also to the very friendly rosemeiry :).", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2013-02-18', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 8, 'cool': 3}, 'user_id': '6qL7A04QNfLAj5Tkig34YQ', 'review_id': 'iO8Z714SYYzg3jKAeiSZBA', 'text': "For those of you who have written good reviews about Jasmine Tokyo -- you've got to be kidding!  Although the dining area is comfortable and clean, and the people who clean your table are friendly and attentive, there is a big problem -- the FOOD!\n\nI don't know what good a large selection of sushi does you if it isn't very good.  Of the eight types I sampled, one was decent (crispy onion tuna, despite having only a tiny morsel of fish).  The other seven were fair.  A big problem is that even at 6pm, when things should be really fresh, they weren't.\n\nThe tempura was very oily, the non-fish dishes (orange chicken, chicken with mushrooms, broccoli beef) were nowhere near as tasty as those you get at a shopping center food court.  And how did Jasmine Tokyo manage to make roasted duck with skin that was crispy and chewy at the same time?  (I'll tell you how -- it had been sitting around for hours).\n\nSeasoning is not a talent of the food preparers (I will not call them chefs) -- the spicy tuna was not spicy, nothing had salt or other condiments that I could discern, and so on and so on and so on.\n\nDon't save your appetite for desert -- it is pedestrian at best and has nothing to do with the Orient.\n\nA few things were okay, namely those where good ingredients and decent recipes are all that is needed -- the plain shrimp, the custard, the hot and sour soup.  That's about it.\n\n$22 for this?? Even with 20% off, it's still at least $10 overpriced.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 2, 'date': '2013-03-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'OYNdbu-dDTZvpYR51cm7Kg', 'review_id': 'JlzPJmmB6yBxtGyFZeiC4Q', 'text': 'Food not hot enough.  Decent sushi bar.  Raw meat for Mongolian bar looked pretty unappetizing.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2013-03-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': 'i2QqqRhuc20r27y_fx59KQ', 'review_id': '0IeKY9wsBMrCSY-riDly_w', 'text': "4 stars for what it is a Pan Asian Buffet - nothing more, nothing less.\n\nUnfortunately, I have had my share of bad chinese buffets.  Even more unfortunate is that I typically overeat at them.  That is the risk of a buffet.\n\nHere at Jasmine, the reward is worth the risk.\n\nThis place has several things going for it:\n\n1. it is laid out nicely and has a warmer, less institutional feel to it.  I didn't feel dirty after having been there.\n2.  There is a wide selection of items from many asian cuisines.  Kim Chi, sushi, dim sum, stir fry, twainese, thai, currie etc.  they are all represented.\n3.  I thought the sushi was a nice mix of veggie only, fish, california rolls, even some hot rolls and tempura.  \n4. Wide selection of dessert options (though I typically pass on those)\n5. many nice cold dishes/ salads.\n6. for quality and selection I found the price to be reasaonable.  Is it priced to compete with the $6.99 special down the street, no, but there are reasons to pay more.\n\nI have been five times now and will make it a regular stop for my asian cuisine loving family.  \n\nAfter five visits I have a new comment, curtesy of my brother's visit there with me recently.  There is no real taste challenge here.  Nothing that excites the taste buds.  everything is buffet safe.  Maybe this is a call to spice things up a bit.  Still four stars for what it is.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2013-03-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'zjM_3HCFhicnxfccPf6bUA', 'review_id': '34GyY8aYmIgP8ZJv3OxMMQ', 'text': 'Being born and raised in Hawaii, (home to the orient) jasmine Tokyo is where I recommend people for great sashimi, sushi, and fresh oysters.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2013-04-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9qrey_kl_L6Jn7o2D67xeQ', 'review_id': 'DVrLJGTbgwE5vzR79z_fOA', 'text': "This isn't your stereotypical dirty Chinese buffet place, that being said it was expensive (duh its in Scottsdale). The food was pretty good for a buffett with tons of crab legs, sushi, desserts, salad, and chinese food options. The buffett was huge and the place was elegant looking for a buffett. I've been to other chinese/japanese restaurants that I've liked better for less money. I would go there again, but only for a special occasion b/c it's expensive.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2013-04-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rlXUg6UuCcaNJkW99RALLw', 'review_id': 'z8acAZVl18PWISc6UylXtQ', 'text': "TONS of food.  Great selection.  I enjoy coming here (second visit).\n\nFirst time through is a bit overwhelming; so much food to choose from!  I usually avoid the sushi at buffets, because, well, you never know.  The selection of other foods is really impressive, and they have won ton chips, which make me happy.\n\nA bit pricey, but it's Scottsdale.  And SO MUCH FOOD.\n\nI also don't suffer from my typical MSG-laden-buffet-food-intestinal crisis after eating here...so I guess that's a good sign?", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2013-04-10', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'y6T6_K29ksQMfocjl929HA', 'review_id': '8v4cKRRPdYlcmPKGft1B2w', 'text': 'We have eaten there several times since we discovered it and can recommend it highly The staff are friendly and the food delicious. There is a large selection. Now if they would only offer green tea ice cream.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2013-04-16', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 5, 'cool': 3}, 'user_id': '_PzSNcfrCjeBxSLXRoMmgQ', 'review_id': 'GOPKUWP0_V9unRuweO3pgA', 'text': 'This use to be a Claim Jumper (all the decorations are still there).  So it was a weird feeling seeing an Asian buffet inside a Claim Jumper.  Either way, it is all about the food!\n\nA lot of selection of sushi, sashimi, and rolls; seafood; cooked food; desserts; etc.  I am not a sushi fan, so I skipped that selection.  I tried a baked scallop and after the first bite I had to spit it out.  It was so salty and fishy (not so fresh kind of fishy).  Yikes!  So I stuck with COOKED foods.  The prime rib was ok, needs aus juice!  The bbq ribs was dry.  The rest of the "normal" asian cooked food was ok (orange chicken, S&S chicken, beef & broccoli, etc.).\n\nThe service was great (that is why 3-stars); Food alone gets only 2 stars.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2013-04-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'RsUNADZTrJ5xFXVMXJC1MQ', 'review_id': 'L5NPQCcGl2oOJR9tFpYw8g', 'text': "I really don't like buffet but my wife like this one because of all the variety of dishes. There was a big variety of different sushi and I would say it was ok. The tempura didn't really have a lot of taste. They have a good selection of Chinese dishes with shrimp and clams. The BBQ spare ribs were very meaty and pretty good. Today I thought the prime rib looked a little dry so I didn't try it. The deserts were frozen and not always thawed out. The only desert that I liked was the ice cream. \nThe service was really good. Our server always pick up or dishes in a timely manner and was always there to fill up our cups of water. They were very friendly. \n Overall I thought that the food was ok, not great but what do you really expect from an all you can eat buffet. I thought that it was pretty expensive meal. You just have to really decide if the different variety of dishes is worth the price.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2013-05-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'byx6sjpLqZ11KplnCgE7Jg', 'review_id': 'Ekidgb-d3ylehwQucV67Ug', 'text': 'I absolutely love Asian buffets.  This one takes the cake, as it were. The variety, freshness, and overall food and atmosphere is amazing.  The price is a bit high, but well worth it.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2013-05-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'F9hl4Dn1Ube3A6NShgfXmw', 'review_id': 'UOoMscQYI4z0RJBYE4WY7w', 'text': 'Maybe 3, maybe 4 stars.\n\nThe price is kinda what kills it; even having some kinda groupon, it was still $20 a head.\n\nThe food, however, kinda makes up for it. Said food is a LOT better quality than most buffets. \n\nThe desserts, as mentioned, are Americanized junk (though I think they had some kind of bean-paste roll) but I didn\'t really go there for dessert.\n\nAll-in-all, it\'s pretty good. The price keeps the riff-raff typical "buffet fatty" crowd out, and the atmosphere is better than your average buffet. I\'ll stick with four stars.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2013-05-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'BncUtrl2bphVTu12y5fTlQ', 'review_id': 'GcLrr60jH-_ilA1qwVH6Cw', 'text': "Having lived in Arkansas, where all-you-can-eat buffets were invented and subsequently elevated to a kind of art form, I'm familiar with Asian buffets. They have a huge variety of food, and most of it sucks.\n\nJasmine Tokyo is not like those buffets.\n\nI was completely unprepared for how good it was. I made the mistake of going there for a work lunch. I should have gone on a day when I was free to spend the day lying in anguish on the couch, wondering why, WHY, did I have to go back for the fifth and sixth plate of food? But no. I filled up my first plate with various salads ... and was shocked to find they were all delicious. Fresh, crisp, tasty ... just amazing. I went back, and got some sushi. Their sushi variety was far better than it needed to be. Again: fresh and delicious. I went back again, this time for some of the stir-fried options. And a pork bun. And some miso soup. And some chicken skewers. And every single thing was delicious. I didn't know what to do. I thought if I found just ONE thing that was sub-par, I could quit eating. But no. It was all incredible. Something like 7,000 calories later, I just gave up. I staggered, slowly, out the door, feeling disappointed that there were so many different things I didn't get to try.\n\nYou've been warned.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2013-06-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Cnz5MG6ei6EFotekIvMJHA', 'review_id': 'Ncu7W6C2MLLexEfSvHBcUQ', 'text': 'Wow. Best Chinese buffet ever. BEST SUSHI, best desserts, even 6 kinds of GELATO!!!!!!!!So beautifully laid out. No ref raf just coming to eat piles of crab legs. Clean, great service, just wonderful. We were just Amazed at this place!', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2013-06-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'ru8p3RTlk8f9LB_3zLXURQ', 'review_id': '_ozs2yfr-wGdx1QBuXjGsA', 'text': 'Love the seaweed salad and octopus salad here- that\'s the reason why I come here!\nMy son loves their miso soup, salmon sushi, tuna sushi, California roll, esp. their Mango sorbet. If I ever ask him where he wants to go for lunch, he always says, "Jasmine Tokyo"!\nThis is our special place for lunch- if I didn\'t worry about our waistlines, this is where we would come weekly . . . If not daily. \nAside from a good selection of sushi, they also have a great selection of Chinese/ Asian cooked dishes, salads, desert. \nWe love this place- I hope they consider us regulars there!', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2013-06-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VBrGyYgMR_Jye_LQHGaWDQ', 'review_id': '56oa31peaB68Odn0bEYQTA', 'text': "Came in without knowing anything other than the Yelp rating and was pleasantly surprised.\n\nAt first, I thought I made a mistake when I realized it's an AYCE fusion buffet. I decided to give it a try since the ambiance and service was not at all what you would get at AYCE places.\n\nI stuck with sushi, since that's all I was in the mood for. The fish was fresh. My only criticisms are that rolls aren't prepared upon order, which would make them even fresher but would defeat the business model, and that you won't find the selection you would at a mainstream sushi bar.\n\nMy four star rating is based on the pleasant surprise, decent sushi and nice service and atmosphere.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2013-06-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'l_ENteMNc1-UQMPYmVIDow', 'review_id': 'ctyZCWFN-lfA9zuJx1cBkQ', 'text': 'The food was amazing, so much to chose from. Make sure to use the yelp 20% coupon if you decide to go anytime use because it will take a chunk off. I went during lunch and only spent around $10 for unlimited sushi (great sushi) and other dishes, along with dessert. I was stuffed but it was so worth it. :D', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2013-06-14', 'type': 'review'}
{'votes': {'funny': 6, 'useful': 4, 'cool': 3}, 'user_id': '2KNPtV5E44vAiEr5BvMkUA', 'review_id': 'GrQfRkbHRQ5oZzbl_cAruA', 'text': 'Since our former all-you-can-eat buffet was shut down (for various violations including some that you don\'t want to be associated with a food-place, like human trafficking, illegal residential activities in a non-residential space, a couple of health-code thingys) my lunch buddy and I were on the lookout for a new go-to eat-til-you-puke spot...here\'s where Jasmine Tokyo comes in. It\'s close to work. The food is pretty darned good. The service is excellent. And I hear that they put together a mean dinner-time buffet...and by "hear" I mean I went to it a couple of times and I enjoyed the change of scenery from the lunch time assortment. \n\nOh...and they have gelato. Today I had the salted caramel gelato and a scoop of banana chocolate something or other...YUMMY! There is a little something for everyone and the food is nice and fresh. The sushi is even pretty decent and they have a good variety of it. \n\nBonus: I had a check-in offer of 20% off the bill from a previous visit and you can\'t beat that with a chopstick.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2013-06-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'GAO3UMZnUSMKlbCU1iupOA', 'review_id': 'w44Yt7Rt1yT71iWU2aFteQ', 'text': "Quality of food was above average for AYCE buffet as long as you selected dishes that just came out and weren't sitting around.  Their heating system to keep the food hot I thought was insufficient.  $11.99 For Lunch is a little pricey for the selection, but with coupon for 20% off the price is right.  Service was surprisingly friendly and the place was very clean.  \n\nI'm a fan.  Haven't tried out dinner yet but will in the future.  With the name Tokyo, I was hoping this place was more a Japanese place with other selections, but I would say it's more of a Chinese place with some Japanese selections and other Asian choices. \n\nI would rate this 3.5 stars but bump it up to 4 stars b/c of the friendly staff and manager.  Everyone had a smile.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2013-06-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PBvqn6IVuWE6QiTv1ykLmg', 'review_id': 'uBFzzp6Utd1U2py5Uzchdg', 'text': "I don't understand why this place isn't busier. The prices are great for Scottsdale. The drinks are cheap for Scottsdale, the buffet is huge. The food tastes great every time I go there. I just wish they opened the bar on the weekdays. We need to get the word out about this gem. Places like this needs to stay open!", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2013-07-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6MnqyVY_1RFQlOUPQMeKwQ', 'review_id': 'C3OvmHS0A0wch4LT8reE6w', 'text': "Not as I expected...Dinner buffet for $21.99?  Totally not worth it.\n\nThe food quality is average and below but they charge you like a buffet in Vegas.  \n\nThe Sushi are pre-made and setting on the tray, not fresh made per order.  Very limited choice.  The sashimi are thinly slice and taste not fresh too.  When ask for a sashimi, the guy give you a pile of sashimi and put them on your plate, no presentation or anything..(there you go...eat it!!)  \n\nThe Oysters, some fresh some not.  Few of those are sitting on the ice under the light for a long time, I have some of those and they are warm, not fresh!\n\nSalad and fruit bar, I believe the pineapple from the can, and the oranges are from one of the backyard, so sour.    \n\nThe soup choice are Hot and Sour soup, Egg drop soup and miso soup...very basic and you could find them in any Chinese buffet for $5.99 AYCE.  $21.99, I expect better quality of soup.  Hot and Sour soup, not hot not sour.  Very disappointed.  \n\nThe clams, almost every each one of them have sands in it.  After a couple of those clams, I don't even want to try it. \n\nThe mongolian grill (the noodle, cook per order).  The food choice are very limited.\n\nThe BBQ ribs, too dry!\n\nThe other food are average, you could find it in any Chinese buffet for half price or under $10 bucks! \n\nThis restaurant 1-2 stars the most.  I won't recommend other to try this place, even with a coupon...don't waste your money.  \n\nI would recommend go to Hong Kong Gourmet Buffet, same buffet style, food are better, more choices, taste better, fresh sushi (made per order), and lower price ($15.99), I vote that for 4 stars at least.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 2, 'date': '2013-07-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1J3EW_WdsDoOeQv5j1Ws8w', 'review_id': 'mXDklKdYVOKA3lp6_ZlutQ', 'text': 'Typical buffet food with sushi.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2013-07-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'YrbcT9CB_kW3RQutizG4Uw', 'review_id': 'QSk4y14q5Aw1fWlP190dAg', 'text': 'As expected of an all-you-can-eat buffet, they really try to fill you up with as much rice and as little fish as possible.  The fish is sliced wafer thin and placed on top of a heaping mound of rice, making for a not-so-appealling nigiri sushi.  The rest of the food was OK.  The gelato bar is great, however.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 2, 'date': '2013-07-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cBOFMLICHATi0pHRaDSX9w', 'review_id': 'VUwoJdzL9XQNh1JWRTNnFg', 'text': 'Tried this place for the first time on a whim - very impressed! I haven\'t had Japanese in a long time, let alone a Japanese buffet, so I was pretty excitement. No big disappointments here. They have a pretty good selection of sushi, all of which was very tasty, with all the fixings - soy, eel, and spicy mustard sauce available (all very good!). Can\'t say too much about the rest of the fish because I\'m not a big fish-eater other than sushi, though my friends seemed to really like the crab legs and tempura. \n\nLots of different selections, very good meat - the prime rib was honestly probably some of THE BEST I\'ve had in a very long time, maybe ever. It was medium-rare, just how I like it, and literally melted in my mouth. I know it\'s not very "Japanese" necessarily but it was probably my favorite thing there.\n\nAll the desserts were cute and most of them were very good. Our server was very attentive and kind, which made the experience even better. Plus, $21 per person for all-you-can-eat dinner isn\'t bad at all.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2013-07-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'q1lTmg0h5qT8xXkXsUeeJg', 'review_id': 'T-czu7YQWFPk402EcTHrWw', 'text': "Would give this place 0 stars if I could. The food is terrible and their manager is even worse. Absolute  joke doesn't know customer service and has a nasty attitude. We went in,I had a plate of appetizers it was terrible. I being straving and already there went back for a plate of salad and some chicken fried rice. It was also terrible figuring that nobody can mess up chicken fried rice it was my last ditch effort. It tasted like dog food. I told the girl I was going to leave and she got the manager who told me it would be 6.99 for a lb of food. We ate in total a few crab puffs, at this point  I was frustrated I told her charge me whatever I just wanted to get out of this terrible experience. She then at the cash register gives me some bs about how we would have known right away if it was bad and know she's charging us for one person 20 dollars. I payed while letting her know she was losing a customer. She didn't care. If you want eat at a restaurant who values you as a guest definitely do not eat here. You shouldn't anyways the food sucks.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 1, 'date': '2013-07-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FMgO-XyXAWqVRzUu_hobWw', 'review_id': 'YlxLJWGz4lgu-UUyXkgi-g', 'text': 'Not bad for a buffet but not a good sushi buffet. I have been to many sushi buffets across the country and this one is not on the top of the list. Could have had a better sushi selection since they advertised as a sushi buffet. They had mostly rolls instead of raw fish. The spicy tuna roll was spiced up with the wrong type of chile powder so it left an aftertaste. \n\nThe cooked food was Chinese and it was good especially the soups. This is more of a Chinese buffet with some sushi so the price was not worth it. The coupon made it better but not real happy.\n\nNot sure I would go back for dinner, maybe for lunch because it is cheaper. At least then I will be prepared for a Chinese buffet.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2013-07-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'KvWny9qUZJKrqo_LYesgSg', 'review_id': 'GhYyrs4gmqaFvZBIi5MjlA', 'text': "This building used to be a Claim Jumpers but now is an AYCE sushi/Chinese restaurant.  I can say that it rivals Pacific Seafood Buffet.   Jasmine has an entire counter of sushi choices, a lot of them are 'fried' rolls - which from my experience working in a sushi restaurant back in the days, fried rolls are generally day old or two sushi that can still be eatable if fried:  ie: not fresh.  They also have sashimi: salmon and tuna.  And of course, the regular california rolls.  They also have great tempura.  \n\nCrab legs are puny but not bad.  They have cold crab legs on one counter next to the unpeeled shrimp and oysters and hot crab legs next to the hot dishes such as fried rice, beef and broccoli, etc.  \n\nHubby had the prime rib - they cut it for you - and he said it was pretty good - medium rare.  They also have a mongolian grill type thing where you pick your items and they cook it up for you. I actually have never tried it.  \n\nDesserts are of abundance and my favorite is the flan and the tapioca.  \n\nAnd here's a tip - if you check in through YELP at this place, you receive 20% off your bill!", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2013-08-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'H3-pVvBr5HVwMssf3PojjQ', 'review_id': 'v4VeA4zhqsw79AKYC-zW3A', 'text': 'It is the best Buffet I have ever been to. I normally do not like buffet style restaurants, but this one is awesome. The place is clean and beautiful. The food is fresh and delicious. Love this place.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2013-08-02', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': '_LsbT_uW0UE6rhsWiAIrsg', 'review_id': 'fsR_bG2H4bjUFMv7nT7ecw', 'text': 'the best, clean, sushi fresh, all the food is out of this world, different desserts, vegetables, fruit.  it is amazing.  the place is \nclean.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2013-08-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wqQ-50Sjf9ol3SYaPbA1YQ', 'review_id': '5FMSsLYze9iwxwpTYHPVhQ', 'text': "Wow! I've hit pretty much every buffet in AZ and this is hands down thee best yet! Clean, fresh, great service. Try it out!", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2013-08-12', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'S1qO3r4m-wdIuoE-e5r8UQ', 'review_id': 'IA1cCbniOmmQzX0GUPnTbw', 'text': "It had been a few months since I last ate at Jasmine, and I'm thrilled to say it's as good as ever!  This time the place was way busy, but fresh food kept coming out and it was all delicious.  I still think they serve the best spare ribs in the state.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2013-08-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VboUEFLa9sM5itIM-D6QhQ', 'review_id': '_IZrda-a6R-L0OvkWH01eg', 'text': 'Pretty decent chinese and japonese food. Sushi bar is awesome, lots of variety.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2013-08-19', 'type': 'review'}
{'votes': {'funny': 5, 'useful': 9, 'cool': 5}, 'user_id': 'diDUDx82VePOC1hObkHwMw', 'review_id': 'VICNoUh0CwLaLIU-QntDhA', 'text': "One of the better Asian Buffets in town. I remember when this building was a Bobby McGee's back in the early 90's. Looks a little different and like others have said it was probably a Claim Jumpers as well.\n\nInside still has that old timey western kind of feel with deer antlers hanging on the wall and ceiling fans that appear to be powered by belts and pulleys. The music being played and the decorations are a bit confusing. Makes it feel more like a nice hotel buffet without the scent of an indoor pool nearby.\n\nGiant selection of all types of food including a ton of dessert items. I like the way they use white oval plates in the serving area. It really makes the food pop. Sure beats the typical stainless steel bins that most of the other places use.\n\nI really enjoyed the large selection of seafood dishes. Some of my favorites were the Walnut Shrimp, the Calamari on crispy noodles, several other interesting seafloor critters, and the really cool Sushi area off to the front of the restaurant. They also have a lot of the regular things that you would expect at that Panda dudes chain.\n\nThis is the kind of place that you just need to find the things you like and not expect to enjoy everything. Some of the meats or proteins seemed a little more chewy than I prefer. Best part is you can just choose not to eat it and go back for something else.\n\nDon't forget to CHECK IN on Yelp and you will get 20% off your entire bill. ENJOY!", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2013-08-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'EgKXeSymG63MDXiT_XaReg', 'review_id': 'ELBBBg53fUoDXC0boZAt7g', 'text': "Really good. Lots of good food and one of the cleanest Asian buffets that I've ever seen.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2013-09-02', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'j-kShDJgp5acGhqJAkJHnA', 'review_id': 'gG-3l9uT0a-SmW6U8uJIHQ', 'text': 'Definitely, one of the better buffet restaurants here in town.  High quality ingredients, except for the crab which is your standard buffet type snow crab.  I loved the super white and salmon Sashimi.  Honey walnut prawns are on par with any of the higher end places.  I enjoyed the Korean Beef and the roasted duck.  I have not seen this dish elsewhere but  the shrimp salad with granny smith apples was surprisingly good.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2013-09-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Azpjds8tdopH1kYoJWRjLQ', 'review_id': 'H-YqTQX7VxCR5oeMb_wPPA', 'text': "It's pretty good with the 20 percent coupon \nOffered on yelp.  Otherwise it's kind of expensive", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2013-09-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'YdsG6qN_PaAwyQ7p95Jf0Q', 'review_id': 'G_Gg1AsTJofEQGUM6WVmKg', 'text': 'We came thanks to the good reviews on yelp and are very glad we did. This is going to be our go-to place for Chinese buffet.  The selection of sushi was wonderful! And everything we had tasted fresh.  The pepper steak and Chinese ribs were tender as can be. \n\nAnd the server was quick to refill our drinks. Thanks!', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2013-10-06', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'vrFWWnvZT3h0uOZf7-tfPQ', 'review_id': 'qdQsHkjAHbx3v4tMoUOgWA', 'text': 'Good food - reasonably priced - check in on yelp for 20% off your entire bill :) Lots of sushi options - clean and well stocked.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2013-10-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VUXpsdNeTlcdEUuhHZx5TA', 'review_id': 'NIVcPo8QZEZ0olmOVc-uvw', 'text': 'Food was a 3.5, service and ambience were a 5.  Selection was a 4.5. Awesome to get 20% off for logging in with Yelp!', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2013-10-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '99LlKno1V82E2vaSDr8QlA', 'review_id': 'j0JF7we4esKsQJjsiQef6g', 'text': u'Great selection of sushi as well as cooked food, about $23 for the buffet. I would go again if hola, \xbfcu\xe1nto es? in the area.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2013-10-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_LsbT_uW0UE6rhsWiAIrsg', 'review_id': 'GJdQgFH0rGwqu5dhWFpIhQ', 'text': 'great place, atmosphere and food is the best and everything.  allan is wonderful.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2013-10-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WwtPIz6yNEY2LAo0jfvHxw', 'review_id': 'ISfiT3R9djfGD9atZdvjSA', 'text': "For a dinner buffet that charges $21.99, I think it was ok.  I am also not a big fan of crab legs or prime rib, so that may have made it less enjoyable.  I have had much better at a sushi buffet for cheaper.  I would probably give them 4 stars for lunch though.  Sushi were pretty good but small.  Sashimi was good too but not cold as it should be. Tempura wasn't crunchy.  Lots of other foods to choose from though...from Chinese to udon noodles to all kinds of salads, fruits, and desserts.  Service was consistent and friendly.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2013-11-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ru8p3RTlk8f9LB_3zLXURQ', 'review_id': '17E8uz1QO8Qrd0_xXWzpRA', 'text': "This is the only restaurant my son asked to go to. He (and I) just love this place. The food is consistently fresh, with lots of variety even for a vegetarian.  My son goes for their tuna and salmon sushi, California roll, then their mango sorbet which is out of this world. We've been there so many times that now the staff greets us warmly and always make a point to talk to Andrew and I, which is really nice. \nI'm really happy to write that the last few times we've been in, the place had been busy- which is really great cause if Jasmine Tokyo ever closed, my son and I will go there, stare into the doors forlornly. So peeps keep going to this delish place!\nSushi, sashimi, rolls, tempura, veggies, Chinese food, oysters, shrimp cocktail, ice cream, desert galore, fruit, salad, seaweed salad- are you salivating yet?!  Head over there!!!", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2013-11-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cZmj9qsgVtMihAmnTUos-A', 'review_id': 'hHAT8oxgnep3exYEQfUfLw', 'text': 'Very good with quite a big selection. Not crowded which is a good thing but still fresh.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2013-11-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Kl-8ltrqNYjqxUh3P-62mQ', 'review_id': '_6MQP6Cquwy2l_8Z7jTBIQ', 'text': 'For a "higher end" buffet ($21.99 Dinner per person), this has got to be one of the best AYCE buffets in town! Everything from Chinese, Japanese, real desserts, fruits, salad bars galore. Great customer service and clean restaurant. Just overall delicious, fresh food and great dining experience. Highly recommend eating here!', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2013-11-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'r7d9Dy6dMzMJoZ6MB8s1TQ', 'review_id': 'W3M0dftNE1pbhVh86U3bug', 'text': 'All I can say is"  Yummy for our tummy"  :)\n\nLots of different entrees -- my favorite being the sushi.  Good soups, amazing salads, and wait.. there is even more - the desserts.  Puddings, tapioca, cakes of all kinds, and gelato!!  \n\nGo in hungry - come out stuffed.  The food is of good quality.  Everything is hot and fresh.  I\'ve been there for lunch, and for dinner.  Check online for coupons, that is what I did.  20% off (every little bit helps).', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2013-11-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 1}, 'user_id': 'wttePGxhTumTTUinL5tlTg', 'review_id': 'hXkP4NSnF81N9j8qF-PNfw', 'text': 'If you have been to some of the Asian buffets in AZ, and you\'ve liked them, I\'d say you must try Jasmine Tokyo. \n\nI\'m 6\'4" and I get "Do you play for the Cardinals?" a lot, so I\'m sure that when the proprietors see me darken the door of their establishment they\'re all like "ohsh*t." Fear not, lil Asian lady, for I am not a glutton. I\'m here for the seafood and the sushi and some green tea.\n\nAs far as the sushi selection goes, it beats anything AYCE in the Valley that I\'ve seen. There were at least 20 types of rolls and it wasn\'t just surimi crab and tempura, either. The tuna and salmon and snapper nigiri were really good, too.\n\nIf you have room for some fried rice, this one is delicious and so are the Chinese sausages and grilled chicken. Even the raw oysters were good, and that has never happened to me in AZ before.\n\nService was pleasant, and from the way it\'s decorated, I\'m guessing this was once a Claim Jumper. Anyhow, it\'s a huge restaurant with a huge selection of items and if you\'re a vegetarian, you will be in heaven here with more vegetarian offerings than I\'ve ever seen at a buffet. \n\nSeaweed is a vegetable, isn\'t it?', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2013-11-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'itn1IcuJSiFb8z34Zv5yGQ', 'review_id': '2S-OL9q1jjLBlMb-kTThmg', 'text': 'I went here for my birthday with friends and it was the best decision I made for my birthday.  An all-you-can-eat buffet of Asian food and more!  Definitely worth every penny because you get an amazing ROI when you go to Jasmine Tokyo.  More people should be going to this place!', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2013-11-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'ru8p3RTlk8f9LB_3zLXURQ', 'review_id': 'wEfzrDRYdQT438zg2Z4v6A', 'text': "That's right, another update raving about Jasmine Tokyo. What can I say, we love this place. The owners don't know it but after 2 weeks out of the country, the first restaurant I wanted to go to when I got back to Phoenix was Jasmine Tokyo. I'm glad to see too that each time I've been there it's been crowded which is good since we love the place so it has to stay open otherwise we will be very sad!!!  Right now the parking lot is being repaved so the entrance is from the side but it is STILL OPEN!!!! Just enter from Starbuck's parking lot and you will have no issues. The quality of the food there is consistent, always fresh and tasty. The interior is clean and the staff so friendly!  By now they see me and they give me a warm hello which is always nice. Great variety!  What are you waiting for- hungry?  Go to Jasmine Tokyo!", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2013-12-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LoBGbLMN7s0wmKfL8wdtJQ', 'review_id': 'aeKlXsWPuqf34sM49AVXoA', 'text': "Great selection of food , you get what you pay for . \nI enjoyed the sushi , didn't try the other things .\nOverall happy and cheap ! \nVery big place , ideal for large groups or when alone .\nThey have some wine , but don't Spend your money on it , had the Merlot , was not worth the 20 bucks :D \n\nFriendly staff , check out the voucher for a 20 dollar discount", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2013-12-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'ru8p3RTlk8f9LB_3zLXURQ', 'review_id': 'qY8r8iLwpkJrc14-8_x22A', 'text': u'Another update so recently after my last one~ that\'s because my son and I love this place so we can\'t have a holiday break without coming here to have a bite to eat and say hello to everyone that works there!  \n\nThis time, I was happy to see there were plenty of LARGE groups coming in during lunch, parties of 10 or more.  This is something I\'ve never written about in my previous reviews.  They have a large section by the side where they can accommodate large groups~ thirty or more if needed and desired!  There\'s also an enclosed "patio area" where I\'m not sure if it\'s conditioned or not if you wanted to have a birthday party or a group party there for a "private room" feel as it is spacious and has its own door and entrances.  \n\nAnd it\'s fantastic to see them crowded as usual for lunch because I want them to have busy, busy business so they can continue to be my son\'s fav restaurant of choice!!!\nThis time, we noted there was a new soup being offered~ coconut chicken soup, a new type of soup bowl, and in their hot entr\xe9e buffet area, they had cube steaks instead of steak slices.  Haha, you know we\'re regulars when we start noticing these small differences.\n\nBut THANK GOODNESS, they still had all our favorites of tuna and salmon sushi, California roll, and the can\'t be missed mango sorbet and coconut ice cream!!!\n\nAGAIN, Jasmine Tokyo is OPEN during the repaving of their parking lots.  Just enter by the Starbucks for easy access.\n\nEnjoy!  And happy holidays!!!', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2013-12-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'GA9zq76Vgq0n6o8OpU6jcA', 'review_id': 'BuJvablHBCjpymZVgioZzw', 'text': 'Solid 4 Stars!\nGreat customer service and food selection!\nNot 5 because the quality of food could be better but, you get what you pay for...& for the price-- Jasmine Tokyo delivers!! :)', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2014-01-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'X76Ja2Np2Dvy0cDTE03drw', 'review_id': 'nWk3vpKdBlFYJDDTLkGh9g', 'text': 'We ate there with the family, nice, cozy environment, it was kind of dead for a Sunday. At the entrance of the buffet it smelled like sewer, we were grossed out but wanted to give it a try. We eat sushi 15 times a month... no joke! This place is NOT grade A sushi at all.. you can compare it to Grocery store sushi... it was OK. \nThe variety of the buffet was really good, it would even be better if everything tasted good for that amount of money!', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2014-01-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Neal_1EVupQKZKv3NsC2DA', 'review_id': 'jasTVknNZr3dmXC7rX-gxg', 'text': 'Think of all the chinese and sushi dishes you like and chances are you will find it here. The Jasmine Tokyo buffet is a one stop shop for tackling your craving for noodles, mea, shrimp,  soup, sushi, bokchoy,dumplings. All in one go. Also works for moments when you would otherwise go to a restaurant and be indecisive on what you want or have to make tradeoffs. :)  \nThe price is reasonable as well. The only thing I liked the least were the desserts which tasted quite odd. However, good overall.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2014-01-19', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': '8d5UVE_C00sjNj6zoSNMTA', 'review_id': 'E3Qx8Qpym1t4gHfYhFcJ2w', 'text': 'My family and I love this place and go every couple of months. Why only every couple of months you say? Well, it\'s about an hour\'s drive for us but it IS worth it! My kids love buffets and I have to admit, it is one of the best if not the best in Az. Very comparable to Pacific Seafood Buffet and any upscale Az casino buffets. They have a great selection and the quality is outstanding for a buffet. We usually go for dinner to have the most seafood options available. The price is a bit on the high end for buffets, but remember that this is not the kind of buffet you go to just to fill up on orange chicken and eggrolls.  They have crab, oysters, PEELED shrimp cocktail, and to die for prime rib. Not to mention that the sushi and sashimi will surprise any sushi lover who never eats "buffet sushi". They also have an awesome selection for dessert which includes gelato to finish off your delicious meal! Tip: there is usually a "check in" on yelp for a 20% off the bill coupon...Sweet!', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2014-01-20', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 1}, 'user_id': 'ru8p3RTlk8f9LB_3zLXURQ', 'review_id': 'mZyujZd0bI91frYW6JNzfA', 'text': 'I\'ve been racking my brain trying to think what is the highest compliment I can pay an eating establishment and well, I\'ve decided it\'s a very satisfied "burp". Lol.\nIt might not be very ladylike but hey, it\'s sincere!\nSo here it is a "burp" and a satisfied smile for Jasmine Tokyo!', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2014-01-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'ru8p3RTlk8f9LB_3zLXURQ', 'review_id': 'DlJBFkCOxTlte0xRcZFB3g', 'text': 'Yes, it was inevitable, after watching me checking in so many times on Yelp and talking about Yelp, this time while we were at Jasmine Tokyo, my son took my iPhone, checked us in then started to write a review for our favorite joint. Kids are so tech savvy these days, instead of typing which would have taken him forever being that he\'s seven, he pushed the Siri button and dictated his review. His review was, "this place has the best sushi ever" then he took photos and posted them. \nHe\'s now an unofficial junior Yelper!!!!\nAnd of course we still love Jasmine Tokyo!!!!\nThis time though I was not in the mood to eat heavy and had a lot of veggies and salads instead. Out of curiosity, we counted how many VEGETARIAN dishes they served and we counted 18 vegetarian dishes ranging from the salad bar to cooked veggies to the vegetarian rolls. \nI\'ve been telling you guys this place has something something for everyone. Not just those who dig sushi. \nI seriously love coming here!', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2014-01-31', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 7, 'cool': 5}, 'user_id': 'RsUNADZTrJ5xFXVMXJC1MQ', 'review_id': 'cPjA962LW0gaib-J-T6Ciw', 'text': "I've never really enjoyed buffets, but my wife wanted to come here for her birthday. I never really felt like I could get a good meal at a buffet but I was wrong. \n\nThe sushi was really good. They had at least 10 different rolls and not just the basic rolls but stuff like Rainbow rolls and the likes. Tried them all and they were all very good. They had one sushi chief just throwing out rolls cause the sushi was going fast. They also had tempura which included lots of vegetables plus shrimp. \n\nThey had a meat bar with prime rib, Chinese BBQ ribs, & sausage. The ribs are really good. Nice and sweet. You have to try these ribs.The sausage is ok and didn't try the prime rib but looked good. Lots of good Chinese food with lots of seafood in it and I enjoyed it. There was also a cold bar with salads and fresh fruit. Lastly, they have a pretty good desert bar where they have a server scoop out the ice cream. \n\nSo overall, they have lots of selections of different kinds of food but most important it's all fresh. You could tell that none of the dishes have been sitting out there for a long time. Very fresh and hot. \n\nService was good. Picking up our dirty dishes and filling up our water glasses in a timely manner. All I can say is that the food is really good, lots of variety to satisfy everybody, but the best part is that if you Check-in you get a 20% off your bill. \n\nEnjoy and have a really good meal.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2014-02-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'VBX26pSjUQMTt3pnaUjgrQ', 'review_id': 'BXGUIoW7yUqCyo_AyynjZg', 'text': "I'm giving this place 5 stars because it is THE best Chinese buffet I have EVER been to. The selection is amazing! There is something for everyone, even those who don't like Chinese food. It's very clean, the food is frequently refreshed and the staff is extremely friendly. I especially enjoyed the walnut shrimp. I highly recommend giving this place a try.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2014-02-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oT6XHjvPHmQ0EdQpuOHrPQ', 'review_id': 'MBffVwUheIiJ_iS-f6nplQ', 'text': "It's a pretty good place that is competitive with Pacific Seafood Buffet. The biggest difference is that Pacific has better Chinese food, and Jasmine Tokyo has better Japanese food. I think the place and the food is great though.\n\nCoupons:\nhttp://www.valpak.com/coupons/printable/JASMINE-ASIAN-BUFFET/42895\nhttps://www.doubletakeoffers.com/jasmine-tokyo\n\nOr as of today 2/8, you can check in through Yelp and have the 20% off offer.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2014-02-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Kl7DC102R-vRZc_7yG0XuQ', 'review_id': 'YdpRy5i-TYZJypxQ_nxAGQ', 'text': "Love this place! I typically can't stand buffet restaurants, especially when they have sushi. Here though, the sushi and sashimi are just as good as any sushi place in town (there's even a sushi chef making it fresh!). All the Japanese style food is made so well! It seems like a steep price but for all you can eat fresh sushi it's a steal compared to ordering rolls or sashimi off a menu.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2014-02-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'TBep3v7jQCYbzgJpG1fkyg', 'review_id': 'IUw6ibLoGb75Z9uCLRnAkQ', 'text': 'Yum. Food is really amazing here. The former claim jumper place. Food well I love sushi there and really great beer selections. happy hour 3-6 pm$3 house wines $2 dollar select drafts !!!!sake bombers and more. We have been here more then a few times', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2014-02-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BVtGe9mBr5c4kOEopZO3jQ', 'review_id': 'RDk5UctW8ffZ-TogzAWgXg', 'text': 'The please is great, incredible variety!', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2014-02-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZC-MfjqCaQqosPaL_zQhFw', 'review_id': 'DsOGX0fj62t9H5O9-i80-Q', 'text': 'We went their for lunch and it was very good buffet food. I am going to try their dinner soon.  The dinner has more fish dishes and more Sashimi.  It is also priced higher.  The place is clean and roomy.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2014-03-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '3b9t4W1sUQkAN4n9edtp5g', 'review_id': '4s0l4ogi2bL0s-l69E87dw', 'text': "My hubs and I LOVE Chinese food and had a craving for a mixture - hence going to buffet.  We searched for a place on Yelp and noticed the high rating and good reviews.\n\nI am giving a 1 star because the hostess was super nice and bottles beer was good.  Otherwise the cooked dishes were all luke warm.  The orange chicken had been sitting all day and was soggy/mushy instead of crispy. Peppered beef had a sitting all day flavor. Sushi was sitting out and down to few items on each tray. A couple of the sushi rolls were sitting in puddles of juice. \n\nFlavor seemed bland. Spicy dishes had no spice.  I just hope and pray we don't get food poisoning. Will never go back!", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 1, 'date': '2014-03-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DsxAI_LIP3mxKhpY4kEAyQ', 'review_id': 'DFURzyE-oqaox7pNGFJDeg', 'text': "I was in town Feb 2014 and went here based on the yelp reviews. I have to say I was not disappointed. I went during lunch and found ample and very good selection of sushi rolls, very good hot food as well and great desserts and ice cream. The restaurant has nice atmosphere and the wait staff friendly and attentive. You couldn't beat the lunch price for what you get and the quality of the items. I was very happy I went.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2014-03-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SJVjzro2drITLIURfThQ-g', 'review_id': 's_EDTscHzUqSuGb0uCKyHQ', 'text': "For a Buffet... You can't go wrong. Excellent selection of sushi, hot Asian dishes, a carving station, and a myriad of desserts.. Plus crab legs!! Best buffet experience in AZ by far.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2014-03-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'YEFN3d-9e0cES7bN4kkOGg', 'review_id': 'DHuwXJ7T0kgtDywRnE0EWQ', 'text': 'I love this place! They have fresh tuna and salmon. The sushi are absolutely great but just not authentic. They have been Americanized, which are still tasty. It is a good place to hangout with friends and listen to Asian songs!', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2014-03-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IAH1ziG14JB-3Ya8BCOjig', 'review_id': 'RICkTo9uliXx4pKpUj3Okw', 'text': 'Great variety and tasty food. Love oyster there! My friend and I are very enjoyed and the price met its value. I highly recommend to have a buffets as lunch in Phoenix!', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2014-03-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5caTZPPbG49_t_1PLzIKcw', 'review_id': 'G3LVwutVCjKG3yaWbeopfw', 'text': 'The best spread of Asian food ever! Quite expensive, but worth it. Their calamari is awesome.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2014-04-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zoHllVEvU91xYbTWMMIT0Q', 'review_id': 'dyZLJH6fyZuIiztpADTOMg', 'text': 'Great food!!! Very impressed', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2014-04-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'bwmXfjwrogAaGqV33kSVpQ', 'review_id': '1oewzXuWl0BhsR2Na5njPg', 'text': "3.5 stars. I don't think it's worth full price but look online for some coupons or use the yelp check in that saves about $5/person.  At that rate, it's a little more expensive than Pacific buffet and comparable in quality. The place looks more upscale than the average Asian buffet and dishes ranged from bleh to great. Oysters were a little scary and tasted like dirty pond. I made my money's worth on lobster pieces, hot crab legs and crawfish. The sushi selection is better than Pacific but by no means great. The only dessert worth getting is the ice cream/gelato.  All the other options seem bought from elsewhere.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2014-04-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'IZhMsmqQiRKkkhw4lv9mNg', 'review_id': 'SVc0UP9AMHz4AfbOPBp0Pw', 'text': 'Stopped at this place with my wife and 2 daughters and was pleasantly surprised with the variety, freshness and quantity of well prepared items that were offered.  Would most definitely come here again when I return to scottsdale. Crab, sushi, shrimp, cook to order, prime rib and desserts were very good.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2014-04-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dbrF8KSrTfhC6jgjvsVvuA', 'review_id': 'N4PLde78ccQSK2zx9xssOw', 'text': 'I planned to give 2stars,my teens said that give another one for their yummy ice cream! There are about 5-6 favor of ice cream and they got very good verities of cakes. Their sashimi was bad quality,the oyster on the shell with bitter teaste.The prime rib was cold inside.Only the Chinese selection they made it good. $21.99/adult for dinner and weekends. $.99/yrs for kids under 10.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2014-04-15', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 1}, 'user_id': 'Z7f8i0KSPrM7y3g-bUu3PA', 'review_id': '6ZgKIE4ct1xKWIK98La_UA', 'text': "Beautiful restaurant. That's about it. The desserts were cheap and ordinary fares you might find in an elementary school cafeteria. The duck was gamey. The sushi rice was dry and the neta (fish part) was thin enough to try out for a Paris runway. The sashimi was also very thin, although it was freshly prepared. They had lobster and crab but truth is I didn't get to  eat much of it since they didn't have any utensils available. The best stuff was the tempura and the egg rolls. It definitely wasn't worth the amount we paid. Plus my wife was throwing up all night when we got home. Not sure if there was a connection but it was not the best way for our anniversary to end.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 2, 'date': '2014-04-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'w8xSImfFoXM6TUUzD9mXhg', 'review_id': 'EMPf5ginak0AZCcG4cSR5Q', 'text': "Star ratings really depend on which time frame of the day you go. My family and I arrived there around 12:30pm on Friday, price was good for weekday lunches, only $11.99, plus we had a 20% off coupon, no one can beat that! I noticed that the coupon can be printed at your home with the links provided in the other review.\n\nThis buffet offers more Japanese items than any other Chinese super buffets in town.\n90% of the food items were refilled quickly, especially the shrimp tempura, which was piping hot and plentiful. Items like Shanghai style tiny pork buns (soup inside), cold served Japanese tofu, Hong Kong style shrimp and apple salad, Chinese style Gai Lan veggi, Taiwan style star shaped pineapple pastry, mango sherbet, and the sweet skinless oranges are not served in any of the other Chinese buffets. The surprise goes to the order-to-make udon noodle soup and soba noodle soup. That bowl of udon soup brought back memory of our Japanese trip years ago, the udon texture is little chewy just like the bowls we enjoyed in Japan. The sushi were rolled with less rice and topped with tasty sauces, they are more flavorful than those at Pacific. We could not taste every item as we were full, there is also a hibachi grill order line. \n\nAll employees are very friendly. The restaurant is tidy. My teenage son praised the upkeep of its bathroom, he does not like to eat at Chinese buffets at all, except for this one. But need to go there at the right time. When we left at 2:30pm, lots of items were not refilled and became cold. I can imagine if customers start eating at that time, they won't give good reviews to this restaurant. After all, if the 20% off coupon is available, then it is a good alternative to the other buffets like Eagles, Wandering Horse, or Pacific Seafood.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2014-04-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'yuPBS3fak77lgwO_9SXVYQ', 'review_id': 'lNLlKhxIM1wz5CxCCgQc-w', 'text': 'Stopped by (VERY) for an impromptu sushi pick-up yesterday for dinner. I gotta say - wasn\'t really wowwed or anything. In fact, I felt the spices were "off" and sushi didn\'t appear too fresh. It wasn\'t horrid - I cleaned my plate, but ehhhh.\n\nI didn\'t realize (until I got inside) that it was a buffet-style. Maybe that\'s why? I\'ll stick w/my other go-to places from here out. Spendy too!', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 2, 'date': '2014-04-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'w8xSImfFoXM6TUUzD9mXhg', 'review_id': 'X0rk2bejlDz1duIlLwX_Gw', 'text': 'Got a good meal for lunch, returned for dinner, but doesn\'t worth the $10 difference if the quality of the seafood not being improved for dinners. The flesh of the lobster pieces were "black" color! Crab legs were skinny and bland. I was very excited to try the dinner before going, but now I am afraid to go back or recommend it to anyone else.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 2, 'date': '2014-04-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'juIA7r3sXSgRx2fq1hY8NQ', 'review_id': 'nLZ-lrR7y17EBkIDADIGKg', 'text': "Great buffet! 2nd time that I have been here. We went for lunch on a Sunday and it was $14.99 with a lot of seafood items. \n\n- Oysters fresh, cocktail shrimp were deveined\n- Sushi unremarkable, except the unagi nigiri was good\n- Great selection of soups. Duck soup & black chicken soup were delish\n- Stir fried crab, thai chili calamari, gyoza, honey walnut shrimp, broccoli beef, kielbasa, ribs were great\n- Clams had little bits of shell; give this a miss if you go\n- Vanilla bean and mango gelato - the best ice cream I've ever had at a buffet.\n\nWide selection of items. Pretty restaurant. Servers nice and friendly. I wouldn't come here just for the sushi, but it will satisfy anyone's buffet cravings.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2014-06-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'K_jzjvHTgI3Q10g4ko4NOA', 'review_id': 'oHhE1uSewh6f1D2dzl3R_g', 'text': 'My family have been eating at This buffet since it opened,and today will be the last time for us, it has become a below average Chinese buffet,the sushi was at least a day old,all of the food was barly warm and also seemed like leftovers from the day before. The crawfish was terrible,and both Wife and i said "hope I dont get sick from the warm oysters, the young manager was wearing a flat brimmed baseball cap,when he came to the table. This place has changed hands within the last three years,and should be straightened out before it goes the way of others of the same nature,and no crab legs on a sunday mid -afternoon? On the hunt again for a good quality Seafood buffet,Phx/Sctsdale area. Sorry to see this one ruined.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 1, 'date': '2014-06-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'Lr6hbHj23X3q6m35mjMWOQ', 'review_id': 'pz6SR3rICz2x87Ghk_sH3Q', 'text': "Perhaps no other eating establishment has such a wide swing in reviews as a buffet does.  And this is to be expected:  buffets rarely serve the best quality food; the spicing has to be near neutral to accommodate every taste and -- very important, but almost never considered -- we tend to appreciate and savor food less, when we have an unlimited amount of it and a huge variety.\n\nThat said, Jasmine Tokyo is no better or no worse than any other decent buffet, with the exception of providing more variety than most; having a very large amount of space, comfortably decorated; and not having that assembly-line feeling many buffets can't seem to avoid having.\n\nReading the reviews on Yelp, I can fully understand and agree with almost every opinion expressed from the 1-star reviews to the 5-star.  While it's absolutely true that this place probably has one of the best buffets in the Valley and has a much larger selection of Japanese food than Chinese, it is also true that most of the food won't blow you away.  The sushi is good, but not outstanding; the Chinese food is typical of almost every Chinese buffet; the desserts, the same decently acceptable food you can find in almost every cheap restaurant.  The big exception is the ice cream, which, while also not fantastic, is much better than you'd usually find in a buffet and -- MOST IMPORTANT -- is served to you by an employee behind the counter.  This might be inconvenient to people, who like to serve themselves or who might feel embarrassed about asking for seconds; but it's a very welcome change from the borderline, let's-be-closed-down-by-the-Board-of-Health policy of letting little kids with filthy hands and questionable hygiene scoop their own ice cream out of a communal bucket  (that, of course, doesn't apply to YOUR kids, dear reader ... everyone ELSE'S kids are slobs; yours, of course, aren't).\n\nService is fast, friendly and efficient.  \n\nSo, in conclusion, this really is one of the best buffets I've been to in Arizona; that does not mean, however, that you should expect a lot for what you're paying.  It may be, that some people will not consider a visit here cheap.  Perhaps.  But considering the variety in selection and the fact that I saw a number of people in there with stretch pants and wearing striped shirts they should have thought twice about wearing, it can't be denied, that this place is a good value for the money.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2014-06-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QGVG138MUmimQbOQv_S2tg', 'review_id': 'oBSYDkcJbGRDfR6ckdDNXg', 'text': 'one of my most visited restaurants in Phoenix area. Delicate food and nice environment. always have coupons.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2014-06-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jRu2aeaaZwiFNnLpzyRsYw', 'review_id': '7LXbmeJ6Ukh1sJKbrnNCvg', 'text': 'Best Asian Buffet I have found . Excellent sushi, crab legs, prime rib ... And a good choice of fruits and veggie options if your not a carnivore like myself', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2014-07-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'NNdfPF-UhvLB8FxbsuSC5A', 'review_id': 't9iHexoCxvNuW4Ha8YV-lA', 'text': 'Cheapest lunch buffet.  $11.99/person on weekdays and maybe more on the weekends.  All you can eat everything.  Beverages extra, even soft drinks.  Sometimes there are coupons online for 20% off the whole bill, and I believe seniors can get 10% off their bills.  Good service, and great price you can get anywhere else.  Come try it out!', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2014-07-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4DtBamDdmuYGozIHJN9cig', 'review_id': 'VtBEHQBgZQxvYJ69ziVVKw', 'text': 'Jasmine Tokyo\'s goal is apparently to be the gold standard of Chinese buffet, and it will cost you substantial gold, even with the Yelp 20%-off check-in deal or one of the coupons they send occasionally. Unlike some buffets in the region, the slight queasiness you may feel afterwards is from damage to your wallet, not to your stomach.\n\nSUSHI\nThe sushi section is huge, creative, and good-for-buffet-quality (so, better than supermarket, better than the second-best place on Thomas Road, but not so good as a serious sushi restaurant where it\'s made right when you order it). If your goal is to fill up on sushi, you will probably come out ahead here. They\'ve also added little plates of sashimi, which in late afternoon were not at their peak. If you come when they\'re busy and refreshing this a lot, you will probably do better.\n\nMONGOLIAN BBQ\nIt exists. I resist buffet features that require interacting with servers, so I\'ve never tried it, and I veered that direction only to obtain SESAME BALLS and those cheese-covered scallop things in shells. This place has the best sesame balls filled with bean paste. Should I ever decide to invent the Sesame Ball Diet, I will eat here regularly, 30 sesame balls at a sitting.\n\nSALAD AND COLD THINGS\nIgnore the shrimp, unless it\'s peak period and being refreshed often. The little spicy squid in the other cold section, however, are excellent. BITE THEY LITTLE HEADS OFF, nibble on they tiny feet!\n\nHOT FOOD\nThe selection here is smaller than at cheaper buffets, so there was only one style of dim sum (pot stickers filled with BBQ pork, I think), none of the usual non-Chinese offerings (possibly not a loss, depending), and a limited array of main dishes. The up side is that the main dishes are mostly restaurant-quality rather than "arrive in a dump truck from buffet central" quality. So it\'s very non-gloppy, things taste like something other than sauce, and if a dish purports to contain meat, the meat is the major part, not something you have to hunt amidst cheap vegetables. The walnut shrimp is outstanding.\n\nDESSERT\nAgain, I refuse to interact with ice-cream scoopers (and, in fact, I\'ve never seen that station staffed anyway). The serve-yourself selection contains many of the usual suspects and a few surprises. The mango pudding-cake thing is good, but avoid the pineapple cake. There are cheesecake bites! Have a cheesecake bite!\n\nHeck, have another sesame ball! You know you want to.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2014-07-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 4, 'cool': 3}, 'user_id': 'Ps1Db9zOatoF_76FZNO5CQ', 'review_id': 'xHfBwFfBpCMDDELNdRAlrw', 'text': 'One of the better Asian buffets I have been to.  Heightened by being in the company of Rand H, Robyn N, Norm R and Mike C.  This was stop one in my eating summer vacation from work.  Not one to eat sushi they had some deep fried items I actually liked.  Instead of the pretty common steam and refrigerated tables the platters are much smaller so the food is kept fresher.  A couple of items ran short but only for a minute or two.  They have several folks running around that know what needs to be done.  Really 4.5 stars but folks that know me know I seldom round up.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2014-07-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'nte_amQXKvsNUPdS4zC60A', 'review_id': 'mF2ijpjaVj75wfXQGRXbRA', 'text': "Let me summarize this in 1 word = clean.\n\nThis place is probably the shiniest eat all you can that serves around the valley and I have been to alot of them. Too many in fact. Here's some of their best foods.\n\n1. Sushi ( huge selection ) try the scottsdale sushi\n2. Mongolian beef ( just the right flavor )\n3. Sesame balls!!! (Nuff said)\n4. Dessert ( try their mango ice cream)\n5. Noodles not the pre cook.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2014-07-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'hDlSSyDreM9xY4yQWPm54w', 'review_id': '5zJ_fyVsQoqe5qbVHMcS_w', 'text': "only as fresh as however many people are dining. don't go unless the parking lot is FULL. you want that food to be MOVING!\nif buffet is your thing, this is a great value. such an assortment of dishes!\n\nTIP: loiter at the line and wait until they bring out fresh food then swoop like a vulture. otherwise, you'll have difficulty swallowing.\n\n* korean style rib. good flavor\n* hot and sour soup.\n* choose your own stir fry. Just make sure the ingredients are fresh\n\n# rancid oysters, clams. argh. what was i thinking\n# old sushi. ugh. i'd forgotten what sushi tastes like when it's not made seconds before you eat it\n# most nigiri and sashimi is rancid.\n# skewered meat. don't know what kind of meat that was, but it was off.\n\n\ni cut my teeth on buffet. when I was 3 and 4 years old my dad took me to buffet every day for lunch. whoa the memories!\n\nmore memories... they still have the ceiling fans connected by belts and pulleys from the bobby mcgee's days.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 2, 'date': '2014-07-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'x6JK_aPCw6-y0mCo1YQgHg', 'review_id': '1629i62FEDERgWvTvoJNFw', 'text': 'Really good food. Tons of options for everyone. Waiting staff is nice and refills your drinks fast as well as clears the tables. There is a very selection of sushi  at tadt great and is fresh. They have tones of different styles of foods across Asia for you to try. The mango cake and mouse are delicious.  \n\nWe went on a Friday night ANC Thad cost per adult paws $21.99', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2014-08-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '38rUkH0dA05mJfkUosFBFw', 'review_id': 'Ln9uSNIuUbALBJ67KlJoTw', 'text': 'Excellent food \nWished the service was little better but still nice place to experience', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2014-08-06', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '_oZExq82b7ZOIZCFQxN9GA', 'review_id': '3bK31P7Wga2gqzsSKHNJYA', 'text': 'The food was old and had been sitting out for far too long! Our party of 5 all spent the night with sore stomachs and in the bathroom. This is not sushi of good quality, even for the price. Please skip this buffet, trust me! I would hate for anyone to suffer the way we all are...', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 1, 'date': '2014-08-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cFoiVWF42HSXQEtqxDvdWQ', 'review_id': 'CDrnhiDM3mtHQD8MxYpJYw', 'text': 'I stopped in for lunch today after driving past and noticing it for the first time, then checking out the reviews here.. \n\nLet\'s start with price.. It was $14.99 for Sunday lunch (but for checking in at yelp you get a 10% discount. Drinks (even iced tea) are additional ($2.25 for iced tea). So it was a little pricier than most Phoenix area Asian Buffets.\n\nDecor--Yes, this building used to be Bobby McGee\'s and little has changed with the physical structure. One thing that I noticed (which is a pet peeve of mine) is that with many southwest inspired chandeliers throughout, there were LOTS of burnt out light bulbs. Sure, it was daytime and the place was well lit enough, but that many bulbs burnt out shows a lack of attention to the small details that make the difference between good and great. And, there were many ceiling fans as mentioned in prior reviews, but they were all OFF today.. It is over 100degrees and warm, why weren\'t the on??? The place was a little stuffy..\n\nFood--\n   Sushi--There was a pretty decent sized selection of sushi for a buffet restaurant. It appeared to be fresh and the few that I tried were good. I will say that I am not a huge sushi fan. The sushi station here also included tempura shrimp and vegetables.\n   Seafood--Chilled shrimp--obviously not cooked fresh in house, but come in precooked and frozen (high water content). oysters on the half shell, marinated mussels. But surprisingly, no crab legs. This section also contained the aforementioned sesame balls. Yea, I like them too, but they are the same balls you can get at most other Asian buffets. They are a pre-made, pre-packaged item they buy, not some original creation. \n   Salad--There is a smallish "American" salad bar, but a few more unusual selections such as bowtie seaweed, chilled, marinated baby octopus, shrimp and apple salad, chilled snowpea and edamame..Also included are some fresh fruits such as strawberries, melon, etc..\n   Hot Selections--While the selection of hot food is not as large as many of the "Mega-buffets", what it lacks in quantity, it made up for in quality. Thai Calamari was a very nice fried calamari.. Surprisingly, it was fresh and tender, not chewy like most attempts at buffet calarami. Beef with green peppers had good, tender pieces of non-chewy beef along with green bells and onions. Beef was not an after thought in the dish. Even the old standard of sweet and sour chicken was nice sized portions of fresh white meat chicken in tempura, with sweet and sour on the side. They had some bite sized pieces of duck (I forget the sauce). The duck was tender and moist,but the small pieces made it a little difficult to eat due to the bones.  Other choices included Black pepper shrimp, fresh green beans, and coconut shrimp. Off to the side, they have a grill station that was featured bbq ribs and grilled sausage....Also included was a mongolian bbq station where you can create your own selection of proteins and veggies and get it cooked to order..\n   Desserts--Desserts are not an afterthought here. They do have the traditional "Chinese buffets sheet cake selections" that most other buffets have, but they also have small slices of cheesecake, red velvet cake, a delicious mango mousse, and 6 or 8 choices of gelato.. The mango and coconut gelatos were two delicious selections..\n\nAll in all, I say it is one of the better Asian buffets around town. It is a little pricey, but you get what you pay for. A little more attention to a few minor details could take this place from 4 stars to 5 stars in my book', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2014-08-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'M3Co6vUTXlD-ldK9alnouQ', 'review_id': 'D-ESM8n34AXq_ZDscwgSzQ', 'text': 'Food and service was great. Got a full variety plateful of sushi and had to go back for round 2 for the sashimi! I enjoyed how they refilled everything quickly and the servers were attentive. Dessert is superb. :)', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2014-08-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Qfiys8xUAE77AB2bntcaxg', 'review_id': 't5Gp2eepdUvHSyIvFEQc_w', 'text': "I've been to a number of Asian buffets and I must say Jasmine Tokyo is among one of the top in Arizona (at least for lunch). Though, don't be fool by it's name, this buffet resembles a mix of Asian cultures food and not just Japanese.\n\nI find that just the sushi alone is well worth the lunch price of $11.99. There's at least 10 different type of rolls (Inarizushi, Makizushi, fried sushi, and etc). And yes they do have eel sauces! A big plus for sushi lovers!\n\nNow, the other food there are just what you expect from a typical Asian buffet restaurant (rows of veggies, entry of fried rice/noodles, BBQ Mongolian chicken, ice cream -includes mango/coconuts!, etc).\n\nOverall, it's a nice place and if you're in it for sushi, then this is definitely a place to check out!", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2014-08-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DA9ROlsC2N2_EQKNvvVKhA', 'review_id': 'TX4jcbECenR4aMDsZWs9KA', 'text': 'One of the best buffets in the city.   Oysters Shrimp Crab Legs Prime Rib. Great Chinese buffet and phenominal sushi rolls.  A must try for all restaurant goers', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2014-08-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '88rPPu0WIXPHV0a5SuhjSA', 'review_id': '6v0s2GqlNET4vrT_AgTOkA', 'text': 'All I can say is amazing!! \nGreat atmosphere, great service, the food was amazing WOW', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2014-08-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CCX5B9-C6jWNluNovWnV2w', 'review_id': 'z_EdP6uxoq9rgXxVQh6czQ', 'text': 'pretty yummy!!!!!! I like the orange chicken and the crab legs', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2014-08-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '6Z0Eg0-GUumkW4MyplOPvQ', 'review_id': 'W2fbtfChJEqvjnyGd5XUQQ', 'text': "I was pretty disappointed at the selection of items for the price. The buffet costs $21.99 for adults, which is pretty pricey for an AZ buffet.  The restaurant is an old Claimjumper location with uncomfortable chairs. The sushi selection they had was pretty good and much better than the usual options at a Chinese buffet. There was sashimi, nigiri, and plenty of specialty rolls to choose from. Besides from the sushi, they only had about two rows of hot food to choose from. Pretty much the usual Chinese dishes that are offered at buffets. They also had crab legs and oysters (which my friend said was pretty good). So overall the food was OK, I was just expecting more for what I paid. I probably will not come back, I'll save my money for when I go to Vegas and want a real buffet.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 2, 'date': '2014-08-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 4, 'cool': 1}, 'user_id': 'ru8p3RTlk8f9LB_3zLXURQ', 'review_id': 'PCRtjfnrgs1_3ykfEs5SYw', 'text': "I know this is an all you can eat sushi buffet.  An unknown secret is, they also have a ton of vegetarian options and frankly, a lot tastier than a salad bar. Seriously, the last time I counted, I think I counted over 30 options for a vegetarian. Surprisingly, that's what I find myself gravitating toward the last few times I've been there. I love their mixed vegetable with tofu, their 2 different kinds of seaweed salad, the snow peas, braised spinach salad- yum yum so good!  \nI just love coming here for their cleanliness and bright interior. I find that there are so many varieties here that I don't have to try everything at once- I can come back 2 days in a row and it's plenty fine!  \nI've got this down to a science where even though I'm at a buffet, I dine like I'm at a sit down. If you go during a weekend lunch, they serve raw oysters and cocktail shrimps. I prepare myself a delish plate of 8 raw oysters and shrimp cocktails. After that I have a plate of seaweed salad, veggies and salad. Small portions of course, artfully arranged. Then I have my sushi with a bowl of soup. Then desert- always my favorite- coconut ice cream. Dining in this fashion, I create a very nice 4 course meal for myself!\nWe've been here so much, we chat with the hostess, with the bus boy, with the staff. \nAnd it's great that Andrew can pick and choose what he wants to it. \nWe often come here for a 2 hour lunch! Can't get better than this!", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2014-08-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'q0D2ILwJIB6yLm__RkK5iw', 'review_id': 'ZsBH-oS30QpsssRG_MJ5lQ', 'text': 'For ~$12, we had a good food in a nice environment with the variety of food choices. The desserts also were great.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2014-08-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '7oKYK6SNSl78maRVBeSiKg', 'review_id': 'h6gV_QXgByGpL30wRfS6MA', 'text': 'Very very disappointed. I can only assume that if you order off the menu it is astounding as compared to the buffet. I expected it to be expensive based on its Scottsdale location. However, I also expected the food to be delicious. The buffet is very mediocre run-of-the-mill Chinese buffet food. It took one walk around the buffet circle for me to realize I could have gotten the same food at a cheap China Star buffet. I went for dinner on a Friday night with three other adults and one child and the bill was $110. Nothing I ate was exceptional. The only thing I ate that was tasty was the tempura shrimp. We will definitely not be returning.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 1, 'date': '2014-09-05', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 1}, 'user_id': 'F9hl4Dn1Ube3A6NShgfXmw', 'review_id': 'w2iUAEZkagUVgcLW9N3Xtw', 'text': 'Gotta knock a star off for the service I received, last night.\n\nOur waitress was strangely rushing us along, even though we weren\'t meandering about any more than any other time we\'ve gone here. It\'s nice to talk while we eat, and there were plenty of open tables so it isn\'t like we were holding up service for other potential patrons.\n\nAnyway, we got club sodas and the waitress put them on the bill as regular drinks. Having been here a couple of times and getting club sodas for free (like water), I presented to her that I had asked the very first time I came and they said it was free and that every subsequent visit they\'ve been free. She informed me of the exact opposite, saying they have always charged for it and pointed to the owner. I said "All right, well let me talk to the owner." \n\nShe went to the owner, came back and said "She won\'t talk to you, but she says we have always charged for this since we have to pay for the club soda." I dunno about that last part, seems fishy, but then she said "You were just lucky the other times." I joked "Well, I guess my luck ran out!" and she just gave me a rude stare; creepy, man.\n\nFood was all right, as per usual, and I didn\'t even have to pay since my friend was treating my lady and me for our upcoming anniversary, but that kind of inconsistency and customer-blaming is bad service. I\'m sure they don\'t care, as they get 20 bucks a head, but figured I\'d mention it anyhow.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 2, 'date': '2014-09-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'L_nrYtKmrHxhmnHaMHwGnw', 'review_id': 'ogqg5BA3qx77uGO-WM7oIQ', 'text': 'This place is awesome. We come here for birthdays, graduations and for no reason at all!!', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2014-09-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'i0A-c2yoHySmFhRV2sDR1g', 'review_id': '-g8DyDxNdgsznv4BDfvFSw', 'text': 'This is one of the best Asian buffets in the valley. They have about the best selection of sushi of the buffets i have tried in the valley. Everything was good and I always eat too much when I come here. Service is always very good also.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2014-09-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'h3s6PK3iPuEIwhnkeI3mtA', 'review_id': 'OoCGEkATXq4neVUMHOkhkg', 'text': 'Great service from beautiful staff, wonderful food selection and the sushi bar is excellent.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2014-10-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Vvfxjux5cjzJiuUjhTa1Ew', 'review_id': 'u81ToynRRiv50wkGLqRn_w', 'text': 'Food and selection was great. The service also was nice and the price awesome.  I will be back with my family. Great place to gather:-)', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2014-10-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'P4EuGyRSgjkmF8RBaEO2Vg', 'review_id': '5QOAmAyc7S_v0TtASkWQfg', 'text': "My kids always request going here. They love the sweets. However last week my parents treated our whole family for my kids birthdays and my father and husband got bad food poisoning. Both were up all night with horrible symptoms, (I won't go into the gory details) and it took two days for full recovery. Buffets are always dicey but we will not be returning.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 1, 'date': '2014-10-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'fPufe63Szi5n9x5j9OtZUg', 'review_id': 'qjw4TEV38RUXVZVphcI6vg', 'text': 'Had reasonable expectations as I have been to many similar before.  Sadly I am disappointed.  The positive:  the ice cream is real and good with 6 choices.  The deserts are good too.  The hot food quality varies for nice baked salmon to half frozen oysters on half shell.  Shushi is average quality but fish sliced paper thin.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 2, 'date': '2014-10-11', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': '9SZBVZ-mxebOVa1BlWFtWw', 'review_id': 'qbm2cGRc1YFmXYtrGdcUeg', 'text': 'I had high expectations seeing as it has 4 solid stars with 181 reviews.  Maybe my high expectations is why we left disappointed, with $50 less in our pocket.  Went here for an early dinner last Monday, arriving shortly after 4pm (I believe when their dinner starts).  The restaurant itself was nice and clean, including the bathrooms.  The food, well it looked like the leftover lunch items were reheated.  \n\nHow could I tell?  The ceramic looking hot plates only had a few servings in them.  And the food in it, or I should say the sauce on some of the items, had that look when a liquid sits out and cools off (think gravy) and it develops that skin on the surface.  \n\nWould I go back?  Not for $21+ a person for dinner.  IMO, its more worth maybe $10-15 per person for dinner.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2014-10-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'aPxuJN0t7ORfWiRv_Ve15g', 'review_id': 'oeV0YXxlqKkJFhmBgTQpDg', 'text': "I am a long-time Jasmine Tokyo cater since its grand opening on 2011. Tonight, I brought my family for dinner again from 5:00 to 6:30 pm. I am not sure I went there early or what. Once the cooked dishes were empty, the cookers did not prepare new one. This happened included roasted duck, fruit (watermelon, honeydew, and cantaloupe.), and deep fried shrimps. I understand business may want to save some dimes for not bringing out dishes as frequent as possible to save its margin, yet it is unacceptable for Scottsdale buffet restaurant that charge over $22 per person to keep empty dishes over 15 minute's time frame in a non-rush hour. Inside the restaurant, there were at least twenty people in here. \nI wish the management can make improvements on the food control and dessert table in the future.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 2, 'date': '2014-10-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'bnLNJEKlzPfj74TuADcIdA', 'review_id': 'kAOnzSOBts1q6fO8_dZ9XQ', 'text': "This place has really declined in quality and selection of food.  It's no better than the $8 ghetto Chinese restaurants you find in the rough neighborhoods.\n\nThe food seemed to be left overs from lunch and the sushi was far from fresh. The desserts were sugar cookies, sams club sheet cake and ice cream.  It's not worth the money.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 1, 'date': '2014-10-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Qe6dS64JtNHDg4XsnXJqIg', 'review_id': 'aPeNU94e8E5Zu8DpbooKTQ', 'text': "Not great. Won't be back. Bad service and just Ok food. Sushi was the best part. The Chinese all tasted the same and no noodles.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 2, 'date': '2014-11-15', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'dqmXlUQyDh6d5U2_Zjb-Iw', 'review_id': 'XSuSgeXZq8utcpEbm2INrg', 'text': 'It has been two and half years  since I was last there. The selection was less there were several selections that were out. There was no duck. The fried rice had no meet. There was only one choice of noodles.the service was slow and they only came by once in an hour.  Several of the dishes were sitting for one hour on the place was overcooked.    The place was more like a 9.00 buffet.  The noodles we did have was not gre but did not have any flavor.  I tried to get ice cream but the line was too long', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 2, 'date': '2014-11-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'q2-BOVCW58vc2ekypokxLA', 'review_id': 'd-f5lJaT3Yi0wsLfc1eqSQ', 'text': "This is an amazing place.  The food selection was so enormous you had to be careful you didn't miss anything.  They had appetizers, sushi, salad bar and any and all Asian food you can imagine.  The food was fresh and the place was so clean and neat.  We had a private room for our Holiday Party and it was perfect.  I will be back.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2014-12-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'ru8p3RTlk8f9LB_3zLXURQ', 'review_id': 'yOy0U7d0KgaKPkCLborpng', 'text': "Another update for Jasmine Tokyo cause well, we simply love this place.  The thing about all you can eat sushi buffet places is sometimes if you come a lot, you can get tired of the food as the sampling are the same day in and day out, 365 days out of the year.\nYet there are such abundant choices here and cooked so well that you don't have to taste everything at once!  You can one day decide to eat sushi, one day go vegetarian, one day Chinese, one day just salad, one day the grill, one day the udons and even one day just desert!!!!\nAnd yes, I love the warm greetings from the servers, hostess and always, my son eats plenty and always leaves happy!!!", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2014-12-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'bNzUpGG4FJrT55MsWjykfQ', 'review_id': '-WDqZn5homzvqUtXxuflGg', 'text': "We drove all the way from Tempe because of the 4 stars rating.\nI don't know if it's because of Monday, not many customers,\nMost of the dishes are cold.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 2, 'date': '2014-12-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HKKtEajeVExPt75meJesvw', 'review_id': 'ugSYhwAE9-l_qlQM93YRqg', 'text': 'Great place for lunch.  You can get just about anything Asian, Chineese, Japanees, etc.  All good at a very good price.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2014-12-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CbLVNavh7JUjlYNQ8qR6ww', 'review_id': 'gjjfoGcKd42_TQp9bSWR6Q', 'text': 'A good place for some good sushi. Happy hour prices are super reasonable, and the place has a nice feel.\n\nI gotta try that again. :)', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2014-12-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'U0qjOmfTeNpUJO3luqMEKw', 'review_id': 'h20e5-YyuATwBt-vXPQUEA', 'text': "LOVE. \n\nUnlimited sushi: YES\nUnlimited oysters: YES\nUnlimited everything: YESSS\n\nNumerous dessert options, not all are good, some are from costco, but the food itself is so filling that it makes up for all of it. I do loooove the custard dessert (like creme brulee without the sugar topping) and the gelato is amazing. \n\nMy family loves coming here because of the great value and closeness to our house. Also, it's really clean. The ambiance is weird since it used to be a claim jumper, but who really cares since everything else is so good!", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2014-12-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SZJpIAni48EjrKid3QNqIg', 'review_id': 'N4KTjK5b-oGBKYlgQ8LDzw', 'text': 'Better than your average buffet in town.  Excellent service and for a buffet, pretty good!!', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2014-12-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'm_H6Xff9LphuYlqGCIdBnQ', 'review_id': '5gMB6DZly7y-zzC4bPAiNg', 'text': "This Asian buffet is a cut above most others. They have better sushi rolls and in general better quality items on the buffet. However they do charge more then the average buffet. Overall I believe it's worth the money.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2015-01-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '0eeUhtjuVjnYY2dNTVWQQw', 'review_id': 'aB37wD4VCp-efFz_YlNusw', 'text': "Usually I run for the hills when it comes to buffets, but this place makes me happy! I love a wide variety of food and Jasmine Tokyo provides just this. They have a nice selection of sushi rolls, crab legs, oysters, a meat craving station, noodles, fried rice, tofu, vegetables, desserts, fruit, and many other items. Great blend of authentic Chinese and Japanese food alike. Price is $21.99 per person for an all you can eat buffet, which contrary to some other reviews on here, I think is reasonably priced (for the quality and all that you get). Atmosphere doesn't really match the experience...kind of a rustic log cabin theme with a fire going in the winter (loved that!). Used to be an old Claim Jumper (ahhhh now it makes sense. Yes, I asked the hostess haha). We will be back!", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2015-01-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vEQkTngZ74LP29D_6XdgZA', 'review_id': 'gyEpWtUMBFHeEvoHX9i8AQ', 'text': "The food is excellent here and it's never too crowded. Lunch prices are reasonable, but dinner is pricey.\n\nWe really enjoy ourselves here.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2015-01-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0lXjMakFtAX_iVbKYOCsfQ', 'review_id': 'vwuEN-sVd1FjueLqgLukMg', 'text': "I was looking for a place to take the team for lunch. My team consists of five hungry boys still in their early 30's and they eat a lot.  Looking around on yelp, I found this place and decided to try after reading some reviews. One of the reviewer was on my yelp list and I find his recommendation to be good. If he is recommending it, must be good as I am not a buffet person either.\n\nLunch buffet price was $11.99 per person. The buffet price doesn't include drinks.\n\nThey have fresh salad section, huge Chinese section, meat/seafood section, sushi section and desert section. Selection was so large, no way I get to try every food, I hovered around first to make some assessments on what to try first.\n\nI tried some sushi, seafood, Chinese, salad, and finished with desert.\n\nI think my favorite was Xiaolongbao from Chinese dim sum section. It was made well, I thought I could just eat that.\n\nThey also have Kimuchi, and their kkakdugi Kimuchi.\n\nTheir ice cream looked so yummy but I chose to try several of cakes. Can't pick my favorite as all were good.\n\nNeedless to say, I ate too much and had to skip my dinner that day.\n\nMy team enjoyed the food, I think we all left thinking we could use a nap after lunch.\n\nI would like to come back again for some food I didn't get to try this time", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2015-01-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'ghDL-MQt6BVyWDXReXxCWA', 'review_id': 'DSFrOsVDXhXC0bmv2TSKRw', 'text': 'Food was tasty. However, nearly all hot foods were lukewarm at best. At 6:00 p.m. Many stations were empty. Crab legs always needed refilling. There was p,entry of sushi, which was wrapped.  For $21:00 dollars much to expensive for what was offered. Deserts were good but rationed in small pieces. Chinese food needs to be hot. I was disappointed.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 2, 'date': '2015-01-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dBvjLwFTI9VQCO_2uoKq4A', 'review_id': 'lzhWnpd0ofBk7VC-6aaj2w', 'text': 'Awesome buffet..  everything you want even if you didnt think youd find it there, like prime rib, blue point oysters on the half shell... Crab legs and great sushi', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2015-01-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'NNdfPF-UhvLB8FxbsuSC5A', 'review_id': 'APviy4KbAqlioWpd1Z51DA', 'text': "Food is okay, maybe it's time for a new menu?  Restroom floor is a bit sticky, not really sure why.  Price is still good.  $12 for lunch, which is not bad if you have the 10% coupon or if you are a senior, you automatically get 10% off from your bill.  Drinks are still extra and not included in the buffet price.  If you use Yelp app, you get 10% off, but you only get to use it once.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2015-02-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'xVPhxMatM0AOFcWvYDiGFA', 'review_id': 'UJyYak08ZYtsVKu49m_Idg', 'text': 'Dinner 21$ per person but everything is good crab legs prime rib sushi etcetera', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2015-02-06', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'K56i8CozGHa8vO7Tm4qyoQ', 'review_id': 'Noxrxqo5WbW2sNbw439ihw', 'text': "I've been here any times before and the food has been great .. Until today. It is a Saturday so you would expect things to be fresh but that wasn't the case. Quality of the food is not what it use to be before. It is no longer worth $22. And don't even bother coming for lunch.  \n\nLet's talk about service... If you get a lady named Vickie you are going to have a bad time. She never came to ask us how everything was which I don't expect much since it's a buffet. But we weren't even eating dessert yet and she brought us our bill. She even lectured us about how much to eat! Seriously rude! I gave her the 10% off yelp check-in to adjust our bill and when she brought it back she pretty much threw the bill at us. This was probably the worst service I've ever had. We also overheard her complain to the other customers about why she didn't get a tip. They said the service was horrible. At first I thought that was rude but now I know exactly why!!", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 2, 'date': '2015-02-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'RNoMJJwCVz8AAR-usCvYUg', 'review_id': 'ExkHQOq6b3ijA8UTcD96iQ', 'text': "I really like this place, but ONLY for sushi. It's extremely good, and for $15 all-u-can-eat for lunch, you CANNOT beat it. I wish the cooked foods were on par, but they really aren't. Oh well, it works out since my boyfriend doesn't like sushi much but does like their Chinese food.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2015-02-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Z3qVl-1JgYnAe4py6VC5ug', 'review_id': 'sPdC3lnApb5uPCpBvvqFvQ', 'text': "The only buffet restaurant I will eat in Scottsdale. Period. \n\nThe space and seating are is huge and comfy. We even discovered a new area that is more quiet for group. Food are fresh and delicious. You can also ask for sashimi if they are not prepared already. Great services and price is also reasonable. You can easily find twenty-percent coupon online to print. \n\nIf you love seaweed, it's the best place to eat as much as you like. They also offer few special dishes over holiday. Such as lobster for Chinese new year, steak for X'mas etc.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2015-02-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lkQGb4x5s8DYWrshcYcmkQ', 'review_id': 'WJbZRzjRCFps5GbnHs9KlQ', 'text': 'What a find ! Jasmine is by far one of the best buffets in Scottsdale my wife and family have eaten hear on many occasions and have never had a bad meal. From prim rib to sushi with great service and a clean wide open room (previous Claim Jumper). Never  ate lunch but I will try it. Look for their flyer in the mail.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2015-02-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-H9YRhZ5S5kMX0kumVdZkA', 'review_id': 'B6bQYVHmJxZdcCpRmqUUKg', 'text': "Great quality Asian food for a buffet. We try to visit Jasmine Tokyo as much as we can when we visit Phoenix. Location is a bit far north if you are visiting central Phoenix. However it's worth the drive because it's one of the best Asian buffets I've been to. The sushi section has a wide assortment of dishes. I can tell they take the time and effort to keep the sushi as fresh as they can for a buffet. It tastes like it was prepared for you at the bar. Japanese and Chinese dishes are available! I eat at many Chinese restaurants and the black pepper steak and BBQ pork ribs are the best I've tasted; both tender and has excellent flavor. You can find a ten-percent coupon if you hunt around online.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2015-02-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LPK3JmzmhWF14RYtPC02xQ', 'review_id': 'fEUcUIUyWPRqcZupyGDrug', 'text': 'nice place for family.always comeback there.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2015-03-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'q6d3d3fxBrFd-VQSh3v_4g', 'review_id': '0K0s7GEVyMKGq_Bh1UVRSg', 'text': "This buffet is average. Not much selection and it doesn't really taste all that great. On top of that, it's pretty pricey for lunch. Only good thing was the service, drinks were refilled and plates were taken away quickly.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2015-03-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'xbhBzJkXacOyY2PVYVbymg', 'review_id': 'mZoTr2ZDE6IZGmQZ5iVlNQ', 'text': '$14 for lunch + $2 drinks for mediocre selections and bland food. Not really worth the price for the quality of food.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 2, 'date': '2015-03-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yEZi8RHf99fdrtqVB8KS0w', 'review_id': 'dpewq1_ErtspIBqmqRWpEQ', 'text': "Jasmine Tokyo is quickly become one of my family's favorite restaurants. It's definitely my husband's favorite. All you can eat sushi. He's in heaven. They also have wonderful walnut shrimp, sesame balls, crab puffs, and a million other things including these little watermelon tuna concoctions that are awesome. Live this place and hope it sticks around. For anyone complaining about the price - you get what you pay for. Go do the buffet at Sweet Tomatoes if you want a $12 buffet. This is well worth it for the extra $10 or so. Sushi is EXPENSIVE and that makes this a bargain. Oh, they also have good gelato.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2015-03-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': 'd0wJVf7Gv7v1B-HHYhxZtQ', 'review_id': 'mDccZQZlcxn0DDZnLC5oPA', 'text': "What the heck have I been eating??!  This is hands down the best Chinese buffet in the Phoenix area, hands down!\n\nFirst off this is by far the best sushi spread I've ever seen - including the buffets in Vegas!  Pretty much what you'd get at Stingray is included in the buffet - and we went to the lunch buffet so its not even just for dinner.  They had numerous rolls and unlike other places they don't try to cram a bunch of rice into them.  They also had 4 different nigiri selections and some tempura in this area.  Just this part of the buffet alone is worth the money!\n\nThe chinese food is actually legit too!  They weren't very oily or too salty and they aren't stingy with mystery meat - the quality of the meat is much better than other buffets.  They're also very good about refilling the selections.  \n\nThe dessert was probably the most disappointing.  We didn't try the ice cream - though I really like the fact that its not a community system and there's someone actually serving you the scoops (WAY less gross!).  We had some fruit - strawberries were great and gigantic.  The German chocolate cake was weird and dried out.  Not only was it crusty, the flavor was kind of weird and it was very dense..  The cream puffs were also disappointing because the filling was whipped cream and not very much of it.  \n\nSpeaking of stuffings - they had real crab rangoons with lots of cream cheese and some green onions and crab parts mixed into it to make the filling!  I thought nobody did it right anymore!\n\nDespite the very few disappointments - this is still by far the best buffet in the Phoenix area.  This buffet makes Stingray pretty obsolete - for about the same price we can stuff ourselves with the same food and more!", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2015-03-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'P_LzcrlVXFdgBq_24UnlUw', 'review_id': 'PI0irlTUjaAgNW4iwBVSNA', 'text': "Biggest Asian Buffet I've seen in YEARS!  Food is above average for buffet food as well.  Come hungry!", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2015-03-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'lFuuyO2gM4_9pCcPdUNRmA', 'review_id': 'fs2TziKolmuqvYJny3VsAg', 'text': 'Came here for the lunch. The buffet has a lot of choices.  The service was great, a good 4 stars for that.  The food was ok. The sushi was more along the lines of 2 stars.  They had other things like orange chicken and udon that brought the final star rating to a 3 stars.  You will definitely leave with a full stomach.  I only would recommend this place if you are all about being stuffed for the money.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2015-03-28', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 0}, 'user_id': 'Hn5kxQQ4dyjiBsvOgO6v5g', 'review_id': '79HE8e0ol5Vz1F4Clim0Ng', 'text': "Overall a good experience.  I can't blame the restaurant for me feeling too full when I left.  The setting is a bit peculiar.  The restaurant has not been updated since Claim Jumper was there, so it is not your typical Chinese Buffet.  Drinks are not included in the expensive price.  \n\nTucked in the corner by the sushi is quite possible the best tempura broccoli I have had,  The sushi is pretty decent.  Tried some sashimi salmon and it tasted fresh, but the most of the sushi is covered in mayonnaise based sauces which I do not like as much.  The second trip was egg drop, but no wontons.  The soup was not hot and was not my favorite.   \n\nMy third course was crap legs.  They were extremely tasty, but the were very flaky and a bit more difficult to remove from the shell.  Next was the mongolian bbq which was excellent.  That's probably where I should have stopped but I grabbed the prime rib as well which was game over.\n\nOverall this place has very tasty food.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2015-03-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '_O451-7MZ507UEKRqdUSyA', 'review_id': 'cVQm_nW8WFJisywb64l68Q', 'text': "I don't live in this area of the valley but every time I'm here. I'm coming to this place! The food was very good with an amazing selection of food. I eat a lot of sushi and I recommend this place.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2015-04-07', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'W_R-gVF8OHNrIhtmyhDnyg', 'review_id': 'uqIbGzefar3fIMBtB-yDsw', 'text': "Asian Buffet in the old Claim Jumper location around Shea and Scottsdale Road.\n\nGood selection of sushi and Tempura. Depends when you go how fresh the sushi is. Go when it is busy and the sushi is fresh because of the turnover.\n\nThe meat area is very good with prime rib, chinese bbq ribs and sausage. Prime rib was actually juicy and very well prepared considered it is a buffet. Chinese bbq ribs are well prepared and very authentic.\n\nThere is a selection of shrimp and crab legs but the crab legs don't look like high quality.\n\nThere are of course the usual fried rice, chow mein, mayo shrimp, Chicken teriyaki along with an array of desserts and ice cream.\n\nMy favorite is the salt and pepper shrimp with the head. You have to tear off the head and eat the shrimp with the shell and legs where all the flavor is at.\n\nBeverages are not included.\n\nOverall pretty good food and will be back again.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2015-04-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'S1Ts85FdWgDsL7XKJNVENw', 'review_id': 'uCYOr7jUg7ULJGpk1G3lLw', 'text': 'Love this place for lunch. Cant beat the sushi selections and the clean atmosphere! I usually start with the sushi then get a plate of chinese.... their new soba noodle soup was pretty good too.  Love their dessert selections and cookies. I always leave with one in hand.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2015-04-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'VrvQgZbTZx6M7MTmOlKzdA', 'review_id': '3HwyCtWsJ8H2mryX_uUkXA', 'text': "So understand, my rating is based on a buffet. This is not sitting at a sushi bar for an evening of wildly different sushi. But I was really impressed with how well they did what they did and how reasonable it was. I stuck to the Japanese side, mostly sushi and sashimi, with a miso soup starter. Very fresh. Thinly cut on the sashimi, but remember, they're fighting against the tendency to waste food by many at a buffet. And they did have some interesting specials, such as white tuna and small octopuses. Also fresh oysters and special mussels. \nReasonably priced - $22 for the buffet (and a 20% coupon was nice) and only $5 for 8 ounce sakes. Will surely go back. \nAnd the P.S. - yes, it was weird that this used to be a Claim Jumper and still looks it!", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2015-04-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ZybhZh7gIMVbFoiCVXVqRQ', 'review_id': '8AtxW4rPxRfdf1-RzOWgog', 'text': 'Absolute worst service ever!!\nAlthough only about 5 customers there, we had to walk around and track down\nour "server" 3x!\nEven better... We asked if we could take the bones from our ribs home for our five\nRescue dogs. Server said OK, we wrapped them in napkins.\nLeaving the restaurant, the "manager" starts yelling "you can\'t take those with you!!"\nEven though we showed her they were only bones, & that our long-lost server said it was fine, she kept ranting that she would charge us $4.99 per pound for the bones!\nHard to believe, huh??? But, who on earth could make this up?!\nSo folks, if you want to go someplace to be humiliated, lied to, and made to feel\ntotally insignificant, this is the place for you...I know we never will return, & will\ncertainly warn others!', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 1, 'date': '2015-04-28', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'bjOCS2Klax2RQesqvnhCrA', 'review_id': 'i0ggrgq6AHwg2Ie2jhG5bA', 'text': "Been there numerous times since they took over for Claim Jumper.  Like everyone else, it bears mentioning that as far as decor, they hung a few silk scrolls on the wall but it's still a Claim Jumper complete with hanging light fixtures made of antlers.\nThis pl;ace is owned by the same guys who run Hong Kong Gourmet in Chandler and it shows.  While the sushi is normally very good, the hot food is usually excellent as well.\n\nI say usually (and dropped to 3 stars) because there is a HUGE difference between weekends, when they are busy, and week days, when they are not.  Went last night (a Thursday) it was completely awful because everything was old.  They put plastic covers over the sushi telling you it isn't turning over.  The normally awesome BBQ ribs were leather.  I grabbed a piece of fried fish but passed on the tarter sauce.  It was in a single serving packet which was warm and had blown up like a balloon indicating something was overly active inside.  This morning my dining partner is reporting stomach issues.\n\nNormally, this is one of the best chinese/sushi buffets around, but stick to the weekends.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2015-05-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oKYsXZG039TbabZQIfuz9A', 'review_id': 'zNWn_4JWr92oKTBYHZRrFA', 'text': "For a buffet, this has a great selection of items.  The place is huge.  We go there for lunch, which is cheaper and I am guessing exactly the same buffet as dinner.  There are frequently discount coupons you can find at websites like valpack.  There is a senior discount if you are over 60.  So ok, all you can eat, not a date night, no canned music.  The sushi is not tip top to be sure, but there is a fair selection, and the tempura is pretty good.  Usually there is hot and sour and wonton and miso soup.  There are some American dishes, a carver who has roast beef or something.  It's a buiffet, so it is quick, no waiting to order.  For the type of place it is, a very good value, especially if you are hungry.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2015-05-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BmuBKQ3u1DYqA79nqxcz0g', 'review_id': '0e2tBKWf_02kHSTLWXDnDg', 'text': 'Jazmin Tokyo is the best asian buffet in Az, everything is so tasty, the sushi is amazing!! The gelato is pretty damn good too', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2015-05-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zN69n2m3W2xHduMWM8ghtw', 'review_id': 'RpQ7UsuL-yjmohhwG9YIvQ', 'text': "The only reason this isn't a perfect 5 star review is because it's so pricey. Not that that isn't justified by the exotic selections available, but the price does inhibit our ability to eat here regularly, which we would happily do otherwise. The food is interesting, varied, cooked and presented beautifully, and the service is pretty good. The sushi is really a star, and the tempura is delicious. Definitely a good date place for a once-in-a-while splurge!", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2015-05-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PLPptfP2WWVE2zxNHfaAyg', 'review_id': 'TdtPZOgFZUFppqMXjEMsZQ', 'text': "Pleasantly surprised. One of the nicer buffets outside of Vegas. Clean, no msg overkill, cool offerings like edamame...\n\nNot oversauced like PF Chang's and hits the spot if you're craving Asian in Scottsdale.\n\nWe went during a slow period so I was doubly surprised the buffet food was actually good, since I'm not a big buffet fan.\n\nWould come again.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2015-05-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '5oimAhRQBTFkPe_khRIJSA', 'review_id': '8deQtvphEdHHj3s_AVNttA', 'text': "Food was okay. They have an island full of sushi. They also have Mongolian stir-fry. I was surprised they had duck though! Their crab legs are very skinny..wasn't worth trying. They also have a salad, fruit bar. Dessert section is pretty big along with their selection of ice cream (isn't your typical ice cream machines seem in most buffets). Not sure if it's worth the price for this buffet.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2015-05-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ys1lVK3aWXdmFmK3Ko_aCw', 'review_id': '9EJBhfwkByJxvI4my7ju9A', 'text': "One of the best quality Chinese buffet style restaurants in the Phoenix area that I've found.  The service is great, the food quality and selection follow suite.  The prices are a bit steep for a buffet style restaurant, but fair considering the area and the quality of the food.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2015-05-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 4, 'cool': 2}, 'user_id': 'g2oAVC6PMs64oLPdKWqPIQ', 'review_id': '_kWVPoSkY6qcGFAYEjhDUA', 'text': 'Check the rolls before eating them!\n\nI was in Jasmine Tokyo last Friday (june 26, 2015) for their dinner service. i started my meal at the sushi area. The sashimi did not look fresh and the roll I ate had spoiled rice. I thought it was just the spicy mayo that tasted off. Even my wife immediately knew it was spoiled and did not touch her rolls. \n\nThat roll gave me the worst stomach flu ever!', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 1, 'date': '2015-06-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ciYv5_7pPTRfzqV2YGjHRQ', 'review_id': '705uux_GDLvv8hldWCfzSw', 'text': "I'm rating this as an Asian buffet -- there's no use comparing this place to a highly regarded sushi bar.  With that said, the sushi is decent.  The fish isn't spectacularly fresh, but it's tasty enough for me to eat in unlimited quantities.  :)\n\nThe selection is actually quite good, and I do see servers turning the dishes every so often to ensure that only hot food is displayed.  The restaurant is usually also pretty full, which helps with that turnover process.\n\nTheir tempura is crispy, their soups are just what I'd expect, and they have a good selection of Americanized Asian foods, including orange chicken, chow mein, BBQ and other favorites!  The variety is impressive, so there's something here for everyone, even if you're not interested in sushi.\n\nThe ambiance is admittedly kind of strange because it used to be another western restaurant, but I'm here for the food, so that doesn't matter to me.\n\nYou can almost always find a 20% off coupon in the mail, which I end up using every visit.  It's certainly not a super high quality restaurant with top-notch service, but if you're interested in Asian buffets, this is an excellent place to dine.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2015-07-01', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'lVAr5MCdDG1oV0Rn-ZgKyg', 'review_id': 'PKw_rRS3mrz84Z2gBsPOnA', 'text': 'I went on Saturday night because I was craving asian. It took a bit for us to get a table but once we were finally seated the server was nice and attentive. The sushi was good but half of their selection was fried rolls of some kind. The traditional asian buffet food was average with a medium sized area for non seafood. The seafood was by far the highlight of the meal. They have a decent select of raw and cooked seafood. They also have a nice sized dessert area with cake and ice cream. It is pricey for dinner unless you are my mom who can eat her weight in seafood.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2015-07-12', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'mDy081zgrH0ParlQE_gFyA', 'review_id': 'N-hBs_qVAniogfbarTejQQ', 'text': "What a unbelievably classless place!! I was shocked that a mediocre at best buffet was nearly $80 for my wife, myself and my 3 small kids but the server actually followed us out to tell us that tip wasn't included. That was classlessness to the highest degree! I obviously filled out the receipt and knew the total I wrote. She didn't take our plates, we put them on another table, and they didn't fill our drinks. We ended up drinking water we brought while we waited. The sushi was old even though it had a wide variety. A wide variety of old sushi still isnt good. Half the food was empty and the place was empty. There were 3 cars in the parking lot. Overall, I will never go back and will tell everyone I know to not go there as well. The worst buffet I have had in Phoenix yet!!!", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 1, 'date': '2015-07-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'awfBytSQgTje0DB9k3upJQ', 'review_id': 'OuorDJQMv3gJwtV86APHww', 'text': "Brought my parents and we were all very happy. Huge selection of food that is prepared well. My dad really liked the ribs he said best ribs at a buffet. There is a large sushi selection that was all very tasty. I would have to say that it's the best Asian buffet in Phoenix.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2015-08-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'mDzMELsP_F-MQJUSJiT2ww', 'review_id': '7BPJmf7Z1m4-LjUM9rTLsw', 'text': "I stopped in at Jasmine Tokyo Asian Buffet at the recommendation of my massage therapist who is in the neighborhood. She said that although it is a little pricey, the lunch buffet is reasonable, and she particularly enjoys the assortment of vegetables that they serve. I had just had my massage, I hadn't eaten yet, I wanted something on the healthy side, and it was just after their 11:00 am opening time - so I decided to go directly there. \n\nI rejoiced at finding a parking space in the shade, and counted myself blessed at that point. As I entered, and waited to be seated, I noticed how large and extensive the buffet was. A friendly hostess greeted me and showed me to a table, where a friendly server immediately came to take my beverage order. \n\nBefore even picking up a plate, I walked the entire buffet twice, just to decide on a strategy. The selection was huge, including made to order Udon and Soba noodle soups, to assorted sushi (nori and rolls), assorted tempura, lots Japanese and Chinese dishes, assorted salads, vegetables of every description and with varied preparations, tofu dishes, desserts, 3 Asian soups, and more. There was LOTS of variety. \n\nI decided to start with salads and vegetables, ease from there into slightly heavier fare, and wrap up with a sampling of desserts. \n\nThere was not a vegetable that I tried that I did not enjoy, although some of them needed a bit of additional seasoning. I had fried rice with my veggies, and while it was just ok, it was better than what I've had at other buffets, and was loaded with onions, and other tasty tidbits. On the first trip, I has stuck to very small portions. I would have been perfectly happy sticking with a second plate just like the first, but I wanted to sample additional items.\n\nI loved the Tofu Lovers dish which was in a light but flavorful sauce with lots of delicious broccoli and cabbage. I also tried the mushroom chicken, the sesame balls, and red snapper, tuna, and salmon nori. I opted not to try any of the sushi rolls or tempura. I was tempted to have Udon noodle soup, but knew that there was no way I would have room in my stomach to do it justice. I got a bit more fried rice, and some more vegetables.\n\nThe nori was pretty flavorless, even with wasabi and soy sauce, and a bit on the dry side. Not odd for a buffet, but at least it didn't taste fishy. The other dishes beyond the Tofu Lover were pretty so-so. The beef dishes looked good, but I didn't really want beef today.\n\nI should have skipped the dessert course. The cookies were heavy and didn't have much flavor. I tried four tiny pieces of cake (different kinds) and every single piece was soggy (wet) on the bottom. Once I discovered that, I gave up on the desserts and called it a day.\n\nMy server promptly brought me my check, and closed me out, thanking me for coming, as did the hostess as I exited.\n\nBottom line, lots of variety, lots of what I wanted - vegetables and lighter fare, decent basics, except dessert, and a price that is reasonable only if you eat more than you generally might (I know I did). I'll go back again just for the vegetable selection, but I'll stick to lunch since dinner is almost double the price.\n\nI really don't like buffets, but for a buffet, this wasn't too bad.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2015-08-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zDSFKaHbe9Koukl8QK4tmA', 'review_id': 'Ey_PTYvuq8LjcAYMd2mx8Q', 'text': 'This is a very nice Asian emphasis buffet with a wide variety of excellent food from Asian dishes, chicken wings, pot stickers, edamame, a very wide variety of sushi, food selected for individual grilling, prime rib on the dinner menu, excellent and extensive salad selection, and a huge selection of deserts. We have eaten here several times and always enjoy both the lunches and dinners. Nicely done Jasmine Tokyo.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2015-08-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2oMrpgZVJtyvYlWKm64Uqg', 'review_id': 'MTwW4sAgIEQkcD9LZWMDYw', 'text': "Good buffet. So glad I found you. Enjoyed the variety and space. Lots of food. It's a full buffet. Eat it! Yum!", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2015-08-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'C9xS56J54MMXVnSAHC5Wnw', 'review_id': 'vUU7VuoGGC1Yyf6xcveDqw', 'text': 'Best buffet outside of Vegas. And reasonably priced. Nice variety of Asian food with excellent prime rib tossed in. Service very pleasant and attentive', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2015-08-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VzbLmSjRkdWRURoir_4TSg', 'review_id': 'zzvgZ6i6j1lxTGYWUDrcmw', 'text': 'Keep in mind I\'m picky about food. \n\nFirst off, I didn\'t get sick by anything I ate, one star for that!\n\nWhen we went here, we went for novelty. We wanted to try it all & see if it was all we hoped & dreamed it would be. I\'ll break it down.\n\nYou walk in to a river rock & antler\'d interior because it\'s the old Claim Jumper, they seat you, ask your drink order & give you place settings. Then you go foraging. \n\nWe started at the sushi. There were traditional rolls, sashimi, and sushi. All of it was fresh. Then there\'s non-traditional; french fried onions on the rolls, some mayo, some spicy sauces.  It\'s all tasty, but I\'m sure the quality of french fried onions and mayo are not the quality of the fish. There\'s no "natural" here. But again, we were in it for the novelty.\n\nNext we moved on to oysters (raw & cooked), crab legs, soups & appetizers. All tasty. Boiled snails, NOT tasty, chewy & without flavor even with the sauce. There was a yummy seaweed salad, each piece was tied in a knot & tossed in a spicy vinaigrette, very good. Then there was jellyfish salad, gelatinous & crunchy at the same time...not a great texture for me personally. \n\nAfter that we tried the meats. Everything I had was good & seemed quite traditional. There was hair on my pig feet but...I didn\'t plan on eating the skin so all was good.  The duck was more work than I bargained for, bones to work around. The clams were not very good as they were in a thick yellow chicken bouillon.  There was a shrimp salad too. \n\nOne thing that worries me is people with allergies. I don\'t know if there\'s cross contamination with shrimp or peanut oils & I\'m unsure the employees know either.  If you have allergies, proceed with caution.\n\nDesserts were sub-par but, eh, you\'re full anyway so who cares?? \n\nHere\'s the facts:\nThe sushi is good, and can be fun. \nThe salads and soups are well prepared. \nThe roasted (BBQ pork for one) meat was great. \n\nIf you go in JUST for these items, it\'s worth the $21.99 (and if you can find a 20% off coupon online, even better). If you venture into the unknown (jellyfish, snails & clams) it\'s not. \n\nAlso, we arrived at 5:30 & it was empty. Upon leaving at 6:40 it was PACKED & mainly with Japanese tourists from two tour buses. Go early!\n\nSo our waitress was our cashier, kids are $1.20 per year of age until they hit 12. And the wait staff was helpful & cleared plates fast & filled drinks quick. \n\nThis is a japanese buffet, it\'s not perfect, but it\'s worth going to. I enjoyed myself & definitely over ate, always a good sign.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2015-09-08', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 1}, 'user_id': 'eOq-MyykIN6HUyUhgNr1EQ', 'review_id': 'BrVURXBkTeesQf83HoaySA', 'text': "Ok food wayyyyyyyy overpriced I'm not sure how a family of 5 should cost $125 at a Chinese buffet", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 2, 'date': '2015-09-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'R76nTVEVCsbd6h-qrGtmoA', 'review_id': 'z7hsXLs_CEBxTobCESgI8Q', 'text': 'My coworkers and I go here for lunch at least once a month. We make the drive even though we work about 15 minutes away.  My family of 5 go here on weekends every 3 months.\n\nBest sushi selection and quality for a buffet in AZ.  Not just the usual California rolls or pieces with too much rice.  Website picture does not lie.  Lots of unique creations.  At lest 12 varieties. Tempura shrimp galore, too.\n\nChinese food is also above average.  Beef is actually cubes of steak, rather than the pounded beef slices.  Chinese BBQ ribs are excellent. \n\nSalad selection is unique with seaweed, jellyfish and other interesting items.  Always has watermelon, cantaloupe and honey dew melon.\n\nSeafood selection very good for dinner and weekends.  No one else has oysters on a half shell.\n\nService is excellent.  Drinks refilled constantly.\n\nAnd Yelp App always has 10% off coupon when checking in!', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2015-09-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qYf-AF83CEB1t4kwDOwONw', 'review_id': 'YKdmQUDZGqyokRwTOSj5Eg', 'text': "All the food is very delicious especially sushi and Korean style bbq. And my server Rosemeir is very kind and make us very happy :) If she didn't tell me about overcharge, I don't know about that. Thanks to Rosemeir and maneger! :)", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2015-10-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'wHKz3EjADr9pvyeZ5lPm7g', 'review_id': 'JqsDL1cCncYV1NoQyIxKDA', 'text': "It was so-so.  The service was fine.  But the experience wasn't anything special, and the food was very hit or miss.  The sushi wasn't great, but some of the Chinese options were better.  Short ribs and fried rice were some of the better choices.  I wouldn't go back...  it was ok, but not worth a return trip.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 2, 'date': '2015-11-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'idOT0D1sMQQL7qmjpoIxAA', 'review_id': 'EZ9rSIvGYYbb-w8ry0DCjQ', 'text': 'Spacious. Clean. Efficient & friendly staff! \nGreat variety of hot and cold foods! They \ncould display more sashimi! They cater nicely to large\nparties such as fifty plus people.\nThe price is right!!!! Awesome Happy Hour drink prices!!!', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2015-11-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Bw-aEhDH-V8JXhNqrPATDg', 'review_id': 'sxV0GaMUcA4fvaDhSLxZdQ', 'text': 'Good food and service.the price for lunch was reasonable. The food that was supposed to be hot was hot and the food that was meant to be cold was cold. Egg rolls were on point and spring rolls. Not much of a Mongolian bbq but they tried. The food quality makes it not necessary to have a Mongolian like some buffets need.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2015-11-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jM3JHvhP9M4_EW_IZNBxqQ', 'review_id': 'DDAGa7tWXxRMbMbDGNWG4w', 'text': "Our family came to this location several times with their coupon! Really nice buffet with good price, compared to others. All kinds of Asian food, large selections: shrimp, sushi, etc. Can't find anywhere else comparable in Scottsdale!", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2015-11-04', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'TnDLvxZlsEtrmaehDLn6SQ', 'review_id': 'Ra9g9yTSoTUb5a8ga75Ivw', 'text': 'This most recent visit was extremely disapponting. Got there around d 7:50 on a Friday evening.....the food was old looking and sparsely displayed......very unappealing. They were willing to make more food when asked but it was lukewarm. The price is expensive for quality that is no better th your average Chinese buffet..', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 2, 'date': '2015-11-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LB7HoDg61yWP2CjrueeJUQ', 'review_id': '7LRrKOd1fQIVx9HDiI7-Bw', 'text': "One of the better Asian buffets in the PHX Scottsdale area. They have a dozen plus varieties of freshly made sushi rolls, tempura, egg and spring rolls, a raw bar with shrimp, oysters and crab legs, some dim sum favorites and at least 20 hot Chinese entrees in addition to a massive desert bar, salads, fresh fruit and a Mongolian BBQ type raw fresh grill where you pick your meats and veggies and the chef stir fries it  for you while you wait. Everything is typically fresh and they keep the dishes full. Easy place to take a bunch of folks who all have different tastes and want something different because there's something for everybody even kids. It's a hell of a deal for 15 bucks at lunch. They charge more for dinner and throw in some extra items like prime rib. One interesting detail, it looks like a claim jumper restaurant inside because it used to be one. Antler chandeliers and all. Not quite as good as what you might find in LA or San Francisco but head and shoulders above most Asian buffets in Phoenix which tend to be nightmares of deep-fried meat, sweet-and-sour sauce and greasy noodles.", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2015-11-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'HNL16bizmpMifzkxkaPIYQ', 'review_id': 'aj66-RpiNi7kD-K8Q7FTqg', 'text': 'This buffet had a very large selection. Most dishes seemed to be lacking in flavor and quality. I would go again for this price. $12 lunch', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 3, 'date': '2015-11-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ru8p3RTlk8f9LB_3zLXURQ', 'review_id': '1_K1zIOOZ-LevlxQR177mg', 'text': "I don't know how many reviews I've written for Jasmine Tokyo. I keep updating my reviews because we keep coming back!   However many years they have been open is however long we've been going. \n\nTo tell you how great the staff there is and I hope they read my reviews, once my son and I went to eat, he was soooo tired, after he got his food, he basically fell asleep at the booth while I ate. The waitress was so kind, she did not charge me for him not eating his food. Then we went and ran errands and he was soooo upset that he didn't get to have lunch at his favorite restaurant, we had to go back there for dinner- and I don't remember what happened- it seems like with kids things unexpected can happen, they came to the rescue AGAIN!!!!\n\nNot only is this restaurant my son's favorite restaurant, it's become my favorite too since the staff is so great. \n\nWe've been coming here to ear for many years- aside from the sushi, I really look forward to their vegetarian selections. I think this place is better than many of the salad bars out there. Not only do they have a great, fresh salad bar, they have over 20 selections of vegetarian dishes to choose from. All delicious and freshly made. \n\nI love, LOVE, L.O.V.E. this place and I'm happy to write that each time we've been there, it's packed with happy customers!!!", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2015-11-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'NWdQ4vzWfJ9-Xm8rHLcQKQ', 'review_id': 'a1cTeSSLC4fIuhF24GSEBw', 'text': "Decent food. Two people came out to over $30 with waters to drink. A bit pricey for buffet. I've been to better places in the area", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 2, 'date': '2015-11-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9ZV4mI6JNTce6PWO9Z5HmA', 'review_id': '4HYUpHIkXUbTyiYPWHcs2A', 'text': 'Really awesome place!! The lunch buffet is a great price for what you can get (~$11.99)which ranges from fresh sushi and rolls to Salisbury steak and sweet ribs, udon soup, teriyaki chicken, stir fry, and even salads. To top it off, a heavenly dessert selection, cream puffs and cake and ice cream, even mousse! This is definitely my new go to spot for D.) All of the above.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2015-11-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'dMtL55HrWFRAaLdVNatHBg', 'review_id': 'c8pYn2gxpiSt6H4tCyGY0A', 'text': "I truly recommend this place!  \nFor starters, I do not usually go to buffets but I really enjoy going here!\nMy father took me and my grandma here for lunch today and it was amazing. Great for everyone and a very lovely environment. The food is very fresh and the staff is friendly and very attentive to our needs. I was actually trying to avoid shellfish due to a recent food allergy and there was still so much variety of things that I could eat that I did not feel limited at all. The food is fresh and not too salty. I can't even say what was my favorite thing I ate here was  because all of it was great! It was such a nice surprise to see that they offer 10% off the total bill for checking in on yelp too! That was a sweet deal!\nThank you for such a wonderful lunch Jasmine Tokyo! Looking forward to the next time I am in AZ to come here again!", 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 5, 'date': '2015-12-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dfpSk5I5Kwipo1Nt4eDgkA', 'review_id': '69mXENBxoGRDt265dIVh7A', 'text': 'My family and I went here for the first time. Food was okay, but it was a nice environment and awesome service. Would try again.', 'business_id': '1sNa5oW9ZYX8MbMFkx9LzQ', 'stars': 4, 'date': '2015-12-21', 'type': 'review'}
