{'votes': {'funny': 4, 'useful': 3, 'cool': 3}, 'user_id': 'ODhV53XhesCBLJVfGsJGNA', 'review_id': 'rQ6M4cUNF2_H25hw5WaPOw', 'text': 'Bluewater Grill:  The successor of The Fish Market!\n\nI had the pleasure of dining here with some of the ladies on the second day of their grand opening!  While the prices and portions are about the same as the Fish Market, the food was pretty decent!\n\nThe four of us shared a Baked Dungeness Crab & Artichoke Dip, a Mahi Mahi entree, a seafood [I forgot what it was but it had two types of seafood] ravioli entree, and two Homemade Creme Brulee!\n\nOut of everything we had, I think the Baked Dungeness Crab & Artichoke Dip was the best.  The Mahi Mahi was a bit dry, the ravioli itself was a tad bland although the sauce was incredibly flavorful, and the creme brulee was amazing!\n\nMy boyfriend\'s sister actually works here.  Since she wasn\'t working, I couldn\'t get her to serve us but we had the most delightful waiter:  Joe!  He was very patient with us [four early-20 girls = not easy to handle] and was very amusing [Enunciate the "Creeeeeeeeeeeme Brulee"]!\n\nA word of advice:  The entrees are a bit small so definitely stick with an entree each person!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2009-10-13', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'g6rlp5No6GjEDXkrjvg1kQ', 'review_id': 'RXLS0pOciX8nOONV9eoGew', 'text': 'Formerly The Fish Market..looks like the exact same place pretty much..add a few booths and take out a wall. Decided to try the 5 entree choices for $5 deal that they had going. The Sourdough bread is AMAZING!!! My friend and I tried the Fish & Chips.. It was good no doubt, and many will enjoy. But it just wasn\'t unique enough or amazing for me. There are too many restaurants in Az that DO fit that bill.. to return to "decent". The fish is good, it\'s fresh but it\'s just that, nothing to rave about.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 2, 'date': '2009-10-21', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'bmDivXQy-KB4_dPIS9ZA8w', 'review_id': 'axLsNPDRRMsBEZoZVzQvqg', 'text': "This used to be the The Fish Market. It looks similar to the old restaurant but with a fresher look. I'm glad they kept the Fish Market employees because our waitress was very friendly and attentive. We came for the Happy Hour /Small Plate Menu. I love the small plate concept because I like to try a little bit of everything. The shrimp ceviche lettuce wraps were zesty, fresh and had big chunks of avocados. My favorite was the salt and pepper shrimp. They were so crunchy and delicious that I didn't even care they had eyes. My fiance really liked the burger slider with Gruyere cheese and french fries. It was a great value we each had a cocktail and split 4 small plates for $30! We will be back to try the calamari slider. The only thing keeping it from 5 stars is, I frequently like to preview the online menu before going to a restaurant and some of the advertised prices and entrees were different on the online menu then at the restaurant.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2009-11-13', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 4, 'cool': 3}, 'user_id': 'GnZWh25MyJD1d5FMKl3QmA', 'review_id': 'wIVO75PIzvn-PHmKEqsviw', 'text': 'Those who liked the Fish Market won\'t be dissappointed here, and those who didn\'t like Fish Market may or may not be impressed enough with the slight upgrades to like Bluewater.\n\nWe went with friends after the opera, and we started at the bar with oysters and clams.  Despite a quickly-remedied miscommunication with the server (who I think couldn\'t believe we ordered THAT many oysters), the oysters and clams were excellent.  The new stools were oddly high and interspersed with tall chairs at normal heights.  On a stool I towered over my friend in the tall chair, and did not ahve enough room to get my knees under the bar.  The bartender said the too-tall stools were going to be shortened. Until then, avoid the stools.\n\nNot much else has changed since Fish MArket.  Some new lighting, a stand-up bar separating the oyster bar and lobby area, a bit less junk on the walls (still fishing pictures and stuffed fish), a new fish counter for buying fish to go... and that\'s about it.  \n\nThe menu is also familiar.  The appetizers looked the same, Ducket\'s Bucket included (thank goodness).  Similar entree selections; various fish in various ways.  I ordered the halibut in sweet chili sauce, and asked for the sauce on the side.  It came on the fish, not on the side, and was to sticky, yucky sweet.  I wasn\'t all that hungry, so I dug into the non-sauced interior and the halibut itself was pretty good.  My friend ordered the same thing but did not notice the "sweet" mention on the menu, and she absolutely hates sweet entrees.  She told the waiter she made a wrong choice, said it was clearly her fault, and wanted to order something else.  He was extremely gracious (I think he took it off their tab) and brought a crab and arugula salad that she insisted I taste....and I\'m glad for that because it was fab - lots of hunky crab in a very light slightly mayo sauce, atop fresh greens.  i\'ll go back for that.\n\nMy husband had more oysters, and I already commented on those. Yummy.\n\nAfter the meal, they brought out complementary bananas Foster, which was ok if it\'s in front of me, but I wouldn\'t order it.  The sauce was too overly cinnamon and sticky syrupy.\n\nService throughout the whole meal was nice, and despite us shutting down the place they made no move to hurry us out.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2009-11-21', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 2}, 'user_id': 'hDlSSyDreM9xY4yQWPm54w', 'review_id': 'ME1cAsxyqqgkp8a9SAZIYA', 'text': "Landmark downtown fish house, now under a corporate name. It's about the seafood, and there's lots to choose from. Don't miss the fruits de mer!\n\n--upstairs dining was closed, though not sure if this is permanently\n--subtle changes downplay the former red lobster feel, but still feels local\n--menu printed daily; I'll have to return to see if it actually changes\n--quick visual shop of the sushi bar shows the same displayed dullys as usual. don't bother.\n--fruits de mer stackable platter (see photo) is a fantastic sampler\n--oysters mostly excellent. so good, i had to order more.\n--scallops served sashimi style with sweet kelp\n--crab leg and shrimps good eats!\n--cedar-plank salmon oily, but nice flavor\n--fish 'n chips great for every boy and girl in us, but again, oily!\n\nMake no mistake: We don't do NO tableside service!\n--server must've been forced against his will to prepare tableside in a former job. he SHORE LET ME KNOW he wouldn't do it when I asked about the bananas foster.\n--instead of the gooey mess which arrived, bananas foster prepared with flair (tableside) would have earned another star.\n\nService pet peeves: don't take my request (drink order, request for more lemon, etc.) then go 'round your section checking on other tables and taking more requests. Go get what I asked for! THIS IS NOT DINER DASH! You don't get points for how many tables' drinks you can fit on one tray!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2009-12-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pEVf8GRshP9HUkSpizc9LA', 'review_id': 'J-ji5aDQhjknsjsvyByjWA', 'text': 'Just OK...our salads were good and the service was acceptable.  Nothing spectacular about this place that makes me want to rush back.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2010-01-28', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 4, 'cool': 1}, 'user_id': 'q9XgOylNsSbqZqF_SO3-OQ', 'review_id': 'OC0nzY-vSHsbxsHJB33mKA', 'text': 'I love seafood and have been to Bluewater quite a few times in the last month. The restaurant is a slight upgrade from the old Fish Market. Nothing spectacular, but pretty consistent with decent food and signature dishes.\n\n For Valentines day my sweet beau made us reservations for the "Upstairs" formerly known as "Top of the Market". This is supposed to be a finer dining, better quality experience than the restaurant down stairs. They had quite a deal for  V-day - two meals (four courses) for $100. That and bottle of wine and we spent just under two bills.  \n\nWe get to our table and notice our wine glasses were dirty, we ask for some water and start looking over the menu. A solid 15 minutes passes before anyone comes over to us, and again we ask for water. The waiter takes our order, disappears comes back in 10 without our wine and tells us it will only be a few minutes, again we ask for water. So at this point I am slightly irritated, it has been about 30 minutes, the restaurant is hot as hell and we still don\'t have water..\n\nThe courses begin:\nThe food was good for the most part; the crab cakes and salad were very good and the  chowder was excellent. We were served our main courses without silverware and had to wait quite a while and ask twice to get it. By the time they brought it my food was already getting cold.  I ordered the \nSurf and Turf and the steak was overcooked and lobster claws were raw. Very disappointing. \n\nOverall we were not impressed with the service or the food. Our expectation are set higher for the "Upstairs", I just wish the managers had the same expectations of the restaurant.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 2, 'date': '2010-02-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'ZubK3U5PlTWy4VIQG_Wpzg', 'review_id': '62G0Y8vPPug9_W4e-VjNdw', 'text': 'I\'ll really only come back for the Speak Easy Lounge upstairs in the back. I think Bluewater is overpriced, especially the sushi. $7-12 a roll.\n\nCame on a Thur about 1/2 an hour before closing. Had 2 drinks downstairs before the back opened @ 10. Don\'t order hard alcohol downstairs. Whomever was making drinks skimps on the liquor. They have beer on tap downstairs but was told there are bottles upstairs. They do bring you a glass for your beer.\n\nEveryone that works there we talked to was extremely friendly & attentive! Managers actually shook my hand & asked my name.\n\nOk, so upstairs... The Lounge has become one of my fave places in the valley. The decor is SOOO mellow. There are tables & chairs, couches, or the bar of course. They keep the lights down LOW with tons of white candles lit all over. It\'s very intimate. There\'s an outdoor patio w/ glass tables & big chairs for smokers. Was told they\'re debating putting porch swings in the indoor patio area. Right now there are tables & chairs & lots of candles along the windows.\n\nThe drinks were finally stiff & very tasty! A lot of people order Moscow Mules. They do have a full bar. There were 2 cute bartenders & 1 pretty waitress. Again, they weren\'t very busy. Maybe 40-45 people at the busiest.\n\nThere\'s LIVE music. We were listening to a guy sing & a girl play the cello. Before the live music the bartender had some great music playing. I recognized Tegan & Sara, Metric, etc... My only complaint is the music was too loud. It didn\'t jive with the setting. 1 of the bartenders kept messing with the volume & you could tell they\'ve previously blown out the speakers already. I shouldn\'t have to yell to be heard.\n\nI was told there was a unisex bathroom & instantly cringed. My concern was unfounded though. The bathroom was perfectly fine throughout the night. It\'s actually very nice. Turn the lock & it\'ll tell others it\'s "occupied". The door is HEAVY though. Shove on it.\n\nSo, how do you get to the Speak Easy? Pull around to the back. There\'ll be an unmarked door on the left. It\'s up a few stairs. There might be a guy working there who stands in front of the door. I hear he\'s the 1 that cards (I wouldn\'t know. Came up through the downstairs since my friend knew someone working there). You\'ll walk into a kitchen. There are stairs to the right or an elevator to the left. Stairs are fine for when you arrive, but they\'re a little dark. Be careful! If you\'ve been drinking, take the elevator when you leave. Trust me!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2010-02-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'esomNneHvsEv91MmraM5ug', 'review_id': 'gkacc_Q2GpcT8s4z4gpuVQ', 'text': "I love seafood! So I was really looking forward to coming here. The crab dip was really quite good, but no one taste or saw any crab...just artichoke. But like I said, it was really good and we wound up ordering a second one (there was 6 of us)\nEntree portions were of good size, prices were kinda big, taste was average (except with what my mom had, I think it was the tri tip? WONDERFUL!), server was uninterested/uninteresting (service itself was good. Prompt.), nothing to write home about. \nIt's a more expensive, less tasty Red Lobster. But still good enough to be 2 stars. I would give it another chance. Maybe I just ordered the wrong item.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 2, 'date': '2010-02-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'usQTOj7LQ9v0Fl98gRa3Iw', 'review_id': 'qpcPs65TgtoBxSVxX-lkwg', 'text': "My most familiar place for seafood in the valley. (I am still expanding my base). I have enjoyed each visit to the the Bluewater Grill.  I enjoy the casual atmosphere and the friendly accommodating service. The sushi is basic but fresh as is the selection of sashimi. The fresh oysters are the best, and I can never pass up an oyster shooter, lol a little pricy, if I am craving oysters I go to Papadeaux's for under $6 a dozen there. You can make a meal out of their Baked Oysters Rockefeller which are one of my favorite items on the menu.  The cioppino is great but you must have patience and napkins to work the shellfish out of their shells.  Their linguini with clams and any sauce is the best (again patience and napkins for removing clams from their shells).  Their chowders and smoked fish options are great.  I also enjoy watching as they prepare any item that is being grilled over mesqite coals.  I find myself craving the sourdough bread they serve.  I have yet to be dissapointed, whether seated in the dining room or choosing to eat at the bar. \nI usually go during happy hour and sit at either the bar or the sushi bar.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2010-03-01', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 1}, 'user_id': 'q9XgOylNsSbqZqF_SO3-OQ', 'review_id': 'X1diWOGKDoHWHvEbXEh49g', 'text': 'Had dinner again at the Blue and sat downstairs. While my last experience was sub par, the manager Larry more than made up for it this time.  The food was great. We had the clam chowder soup which is always delicious, we moved on to the artichoke, grilled perfectly and ended with stuffed shrimp. Our meal was great and the service was outstanding. We will definitely be back.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2010-03-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JQtgBuoKz1XeukTbTa0stw', 'review_id': 'bhtC_Z4RQRCaiiG5BeDV0Q', 'text': "We thought we were meeting at the Fish Market...only to find that the Fish Market had closed...and decided to try Bluewater Grill instead. What the heck!\n\nBluewater is definitely worth going to for the fish. My mahi-mahi was devine and there were several other choices that had been flown in fresh that day. But really, my favorite part of the meal was the spinach. Call me crazy, but I would go back again just for a vegetable. Sauteed to perfection...not overdone. Even my vegetable-hating friend liked it. Next time we go, I'm going to try and get him to try the grilled artichokes...they looked fabulous!\n\nFor dessert, we tried the key lime pie. Wow. Sugar shock. Glad we decided to share a piece. Our server told us it is not usually so sweet...but it does vary since they make it in-house everyday.\n\nBluewater definitely attracts an older, quieter, more reserved kind of crowd. And my friend, who had just come from the Phoenix Open wearing golf attire, said he felt a little underdressed...wished he had worn slacks and a nicer collared shirt.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2010-03-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 's339yiWq3AnDbY-dRyqDVQ', 'review_id': '2g81800rEoyjf1IlN6DiRA', 'text': "PLEASE BE SURE TO SEE FOLLOW UP REVIEW.\n\nSorry to have to write this review, but management needs to know... we have been going to the Fishmarket turned Bluewater grill for 20 years.  This is our 2nd trip since it became the Bluewater grill and this was a disaster.  Coming on the heals of someone else telling us about their bad experience, this is not a good sign.\n\nHere's the list:\n- We had to ask for sushi menus, we were sitting in the sushi bar!\n- we had to ask for glasses of water\n- we had to ask for the bread \n- my wife's drink was sloshed by the waitress across her menu and onto the table. waitress made lame attempt to clean it up, we had to get napkins and clean ourselves\n- we ordered one more drink, but it never came\n- when the sushi came there was an open spot on the tray where the wasabi, cucumber salad and ginger should be.  We had to get up and ask for it at the sushi bar.\n- the sushi was so-so.  Probably the worst we have had there.\n- the table was never bused the whole time we sat there.  Literally the menus, empty glasses, plates, etc. were all still there when we left.\n- when the bill came, the ink was so faded you could not read it. Looked like the printer did not work. \n\nThe table next to us complained to the management about their food too.  So management needs to train their staff and get it together or they will be closing there doors soon.\n\nDisappointed because we have been regulars for 20+ years.  We will try it 1 more time because we realize these are training issues.  Love the venue, but staff needs to really improve.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2010-03-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 's339yiWq3AnDbY-dRyqDVQ', 'review_id': 'JVgViltuMZGUW51b9mwK0A', 'text': "I wrote a pretty tough review on March 27.  Since then I have been nothing but impressed.  First you should know that I run an internet marketing company so when I see a business using the internet to interact with their customers, I get pretty exited.\n\nWithin hours of me posting my negative review, Larry Macias\nManaging Partner of Bluewater Grill responded.  He invited me to call him on his cell or at the restaurant - which I did.  He apologized for the bad experience and invited me back as his guest.  I accepted the offer to return but did not want any free meals.  (My previous review was really a knock on the staff, not on the atmosphere or food.)\n\nLong story short, we decided to try it again, but on a big scale. We invited 24 people to my wife's birthday party.  Larry took care of everything and I can now say we are fans of Bluewater Grill.\n\nOur guests had an outstanding experience.  The food was excellent.  The staff was very attentive and professional. And the night became a memorable one.\n\nSo kudos to Larry and the Bluewater Grill, for reaching out to us, turning a bad experience into a positive one and demonstrating how interacting with your customers online can turn into a great use of the business owners time.  Remember, he got me to bring 24 people back to his restaurant!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2010-04-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-6f74MeztMVqdKBUQSM2gA', 'review_id': '-drqgB7R_mYpDZuG8ULaWQ', 'text': 'I\'d been meaning to check out Bluewater Grill (probably for dinner) since it was still the Fish Market- I finally found myself here today with friends for Happy Hour. After this visit, i\'ll definitely be back again to try dinner!\n\nHappy Hour runs from 12-5pm on the weekends, which is great for meeting up with people. There are enough choices on the menu that you can expect to fill up on food, all at Happy Hour prices.\n\nI had our waiter ramble off the list of beers (a good amount which I hadn\'t heard of, intriguing!) but as soon as I hear the word "Hefeweizen", I know what i\'m getting. I cannot remember whose it is, but it was tasty. Beer and well drinks are $4 at happy hour- I really wish they\'d add some of their cocktails to the specials, they sound so good!\n\nThere were 5 of us, so I was able to try quite an assortment of food. (Note: Not everything we ate shows up on their menus online, I noticed the same is true with the beer.) The highlight of the appetizers were fried shitaake mushrooms stuffed with spicy tuna (same as in the rolls). They were wonderful- our server suggested coming back and asking for "Jared\'s version", which substitutes a crab mixture. \n\nFrom the happy hour sushi menu, I ordered a soft-shell crab roll and a fried salmon skin roll for a total of about $15. After taking a few bites, I decided this was well worth the price, probably even normal prices. The crab was perfectly done (crispy legs but not burnt!) and the salmon skin roll, although it took awhile, was delicious. If you\'re a fan of California rolls, the one here is excellent and the crab tastes very fresh!\n\nWe also nibbled on crab artichoke dip, garlic fries, garlic cheese bread, and fish tacos. Overall, there was nothing we didn\'t like. At $4-5 per app, 2 (maybe 3 if you\'re going for a full meal) per person should suffice. \n\nThe service was good but nothing special (probably a little less than i\'d expect if I were there paying dinner prices). It was the middle of the afternoon and not busy, but our server always seemed in a hurry to get somewhere else. He came by frequently, but I only had enough time to ask him for one thing (water, chopsticks, wasabi, etc.) before he was off around the corner. I suspect all his tables were getting served quickly at least! As we were wrapping up, we mentioned how wonderful the stuffed mushrooms were, and that\'s when he told us about the "special" version in full detail. This restaurant seems to have a lot of favorites and specials and history, despite its recent changes. Can\'t wait to go back, whether it\'s for happy hour or a meal!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2010-05-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'h4knhUbSSxwLs7XtEE_pbw', 'review_id': 'S4787b0sHHm9qGISJHl8-g', 'text': 'We thought we would try this newer restaurant after a D-backs game and I made reservations.  No need for that.  On a weekend night there were few occupied tables.  At the end of the evening I understood why.\n\nThe food is OK - nothing special and expensive.  The service is inconsistent.  Our server acted like she wished she was elsewhere.  On one occasion after waiting a rather long time for two items we requested (one had been brought to us) and no sign of the server I stopped a management -type person and asked him.  Several minutes later our server returned and accused me on never asking for the item.  To me one of the worst things a server can do is argue with the customer, whether right or wrong.  That turned me off for the rest of the evening.  In addition the management individual never returned to check and make sure all had been taken care of.\n\nThere are many outstanding restaurants, both in food and service, in the Phoenix area.  Unfortunately the Bluewater Grill is not one of them.  I was very disappointed.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2010-05-10', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 1}, 'user_id': 'usQTOj7LQ9v0Fl98gRa3Iw', 'review_id': 'larql11MZcIf5-73ChHwgw', 'text': "While tempted to give 4 stars, I know it is a solid 3. \nIt may not be the coolest or hippest place for happy hour or to grab some seafood but it is still one of my favorites. I am convinced they have the best sourdough bread in the Valley. Their happy hour menu offers drink and sushi discounts, and other favorites like sliders (burger or calamari), salt n pepper shrimp, calamari, cheesy garlic bread...all priced fairly. They have more stuff on the happy hour menu, I can't recall everything. \n\nMy last visit I had a Stella Artois, the Oysters Rockefeller (not on the happy hour menu but my favorite here) and an order of Garlic Fries (off the happy hour menu). The fries were just as good as some of my favorites from Gordon Biersch, crisp garlic goodness. The Oysters Rockefeller (4 to an order) filled nicely with creamy spinach and topped with cheese...and served with sauteed spinach. Mmmmm.... \nI find myself continually going back. Mostly during happy hour of course, and sitting at the bar. Enjoying each time I go.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2010-05-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'uqK3yvpg5Evk_XgzMW-lAw', 'review_id': 'UEOwkuOv4lDN8M0I2lPXRg', 'text': "Another Smart Shopper deal opportunity to try Bluewater Grill. The deal was for $5.00 California roll, Spicy tuna, Philadelphia, the Caterpillar and Bluewater roll. Normally, it would be $7.95 up to $14.  As I looked around, I recall the memories of having lunch/dinner here when it was the The Fish Market.  I thought the place was larger before. Anyhow, going back to food, sushi was just ok.  Their famous roll was the Bluewater roll, normally $14, definitely not worth it.   If it wasn't for the $5.00 Smart Shopper deal, I don't think I would order any of the rolls at regular price.  This is certainly not a place for sushi lovers.   However, I do like the normal HH cook foods.  The cheesy garlic bread was delicious.  It was very cheesy!  Calamari Fritti with Cocktail Sauce was crunchy and tasty.  I find it interesting that their website HH menu has the Burger Slider with Fries & Melted Gruyere & Blue Cheese for $3.00, but on their HH menu at the restaurant it's $4.00.  Keep this mind when you order.   http://bluewatergrill.com/menus/index/articles40.htm\nService was good when it wasn't too busy.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2010-05-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'h4knhUbSSxwLs7XtEE_pbw', 'review_id': 'EFXvGEOxN-KNeIm_gW4pmA', 'text': 'We had a disappointing experience the first time we ate at Bluewater Grill and it was primarily with the staff.  We decided to try it again and were very glad we did.  The staff was very professional and accommodating.  The food, as with our first visit, was very good.  It was a perfect evening from start to finish and we look forward to returning again soon.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2010-06-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mJp5ELFhZwBlNyViWl9CHQ', 'review_id': 'TsSnEe83qiHA3fIh7Wipcw', 'text': "I was very impressed with their service and quality of food. A group of 20 of us had reservations and so we were shown to a room just for us, for privacy. There were several things that impressed me about the service: 1) we were given separate bills, which I know is a hassle for the server but so much easier for us to determine payments, 2) the sushi orders and entree orders (which come from 2 completely different kitchens) were coordinated such that we all received our meals at the same time (which I thought was extraordinary), and 3) prompt adjustment to the AC (too cold) was made when we requested.\n\nI ordered 2 specialty rolls, the Bluewater Special Roll and the Seniorita roll. EX-CELL-ENT. Delicious and alot of food. The prices were just what I'd expect to pay for such high quality sushi ($14 each). I would definitely return.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2010-08-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SlRP0wlWohWkMgnVF2D2hA', 'review_id': 'bYKyYLinPcNu_HEZ0s59og', 'text': "I highly recommend their seared jumbo scallops with spinach and mushrooms. It's very rich and sumptuous. It doesn't come with very many scallops, but, I still have trouble finishing it all.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2010-08-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4dnDsoHuxUtzhaumxbpR5w', 'review_id': 'PckQNJtjx7xeaqjhRwcYHg', 'text': 'I\'m not sure if it\'s fair to pull the whole "I used to be a Fish Market regular" bit, but really, my family and I had been regular diners of the Fish Market\'s Oyster and Sushi Bars for the last ten years. I have fond memories of trying sushi for the first time and eventually coming to love it, ordering big bowls of clam chowder and freshly baked sourdough bread, drinking my first sake and Sapporo...the Fish Market held lots of good times! When we heard the Fish Market was "closing" we were devastated. But then Bluewater Grill came to occupy the space and it didn\'t seem so different.\n\nHowever, after dining at Bluewater Grill three or so times since the switch, I have to say the same level of high quality is just not there (at least in the Oyster and Sushi bars). So sad! The sushi has been fishy and sent back on more than one occasion, the rolls not as impressive, the service only so-so, and their prices have definitely increased. Also, while I appreciate that Bluewater is working on establishing a new, separate identity, I was super bummed today finding the entire sushi bar has been remodeled and refurnished. The low bar with backed chairs has been replaced with a high bar and barstools, while the dining area has been replaced with high standing bar chairs and tall bar tables. Call me crazy but it wasn\'t so comfy eating and sitting without back support for an hour.  \n\nI\'m not sure how often, if ever, we\'ll be returning to Bluewater. Perhaps it\'s time to give the dining room a shot and order a real "meal" instead.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2010-10-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'ND95DgvN7ba8MabfXE3lsw', 'review_id': 'CVscUwuMlLe--v-jgMuZgQ', 'text': "I had a hankering for some fish yesterday so I decided to give Bluewater a shot.  The food was tasty, though nothing really blew me away.\n\nThe dining area of Bluewater is perfect for a mid-range seafood restaurant.  It's clean, the fresh fish display is a nice touch and the bar area is well put together.  This place definitely doesn't have the faint scent of despair and broken dreams that always seems to be present at Red Lobster.\n\nThe staff was attentive and polite.  Our server had a great grasp of the menu and was able to answer any questions we had.  Food was delivered at the perfect pace, with nothing feeling rushed.\n\nI bet that the appetizers here really shine.  I got the Prawn cocktail, which was very tasty.  The prawns were fresh and the cocktail sauce had just a hint of kick to it.  For an entree I got Ahi Tuna, nice and rare.  The fish was tasty, though the tuna steak was much thinner than I'm used to.  I enjoyed the sides as well.  Sauteed spinach doesn't get much better than this.\n\nMy only gripe, and it's a minor one, are the prices.  The food was good, but it just didn't feel... right to pay as much as I did.  It was good, but it didn't seem to be THAT good.  Maybe it's just me, but there seemed to be a slight disconnect between the price and the product.\n\nI will definitely give Bluewater another shot, most likely during either happy hour or for the clambake.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2010-10-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'di9IJXTJmCa4mO3bZVINDw', 'review_id': '9Y0YNHmjQ1qRwPVef8u3xw', 'text': "This is hard to write because of how long I've been coming to this restaurant.  And I don't want anyone to think I'm one of those people who is unhappy because it's not the Fish Market anymore.  Yes change must happen... and they've made many good changes.  I think it's a good formula for success... but I will not be back.\n\nI've been coming to this restaurant since 1990.  back in the day, I was a fan because of the great seafood.  and that hasn't changed... they still bring fresh fish into town from their own fishing fleet like they always have.  this is a rare treat folks... especially in Phoenix where fresh fish is only available at a few elite places.  but about 5 years ago, I began coming here for their excellent sushi bar.  and that's the part that I'm unhappy about.  yes they still do good sushi... but they have dumbed down the menu... many of the best items aren't even on the menu anymore.  I could live with that until they eliminated the baked green mussels.  it was the best thing.  best thing!  and it's simply not there anymore.  \n\nwhy get rid of something so sublime and delicious?  this was the one thing I always ordered, and even brought out of town friends here to show them.  but sadly, it's no longer available.  and if I can't get that, there's no reason to return to this place.  so, sorry guys... sorry Wade and Tim who I've been happy to work with for over ten years... I've paid my last visit.\n\nUPDATE:  The manager of BG contacted me via Yelp to let me know that the green mussels will be back... if so, I will too.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2010-11-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5RcTRr4GmKcYpjB9_6-Rqw', 'review_id': 'Hg4i2x2kd-ib51SAPwcEVg', 'text': "Decent place to eat for a nice lunch. I didn't find it to be anything super out of the ordinary but the service was good and the grilled artichoke is a dish worth mentioning.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2010-11-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'b93UticvNYIY7YMahegv_w', 'review_id': 'OU3MFyhW9_NydnprlHHdog', 'text': "Went for happy hour after church last Sunday.  It was our first time at the Bluewater Grill and we will definitely be back. The oysters were huge and delicious as were our entered (crab salad and trout). Looking forward to the oysters and trying their sushi bar next.  Nice atmosphere and friendly, informed staff.\n\nUpdate:\nWe went for New Years Eve dinner and it was even better than before.  The oysters, again, were outstanding.\nOur waiter was very friendly and very attentive.  \nOnly slight issue (that was really a non-issue since we came in at 5pm so we could be at the symphony by 7pm) was that they didn't have our reservation.  I heard my husband call earlier that afternoon to double check and it was there but not when we arrived?  Regardless, we didn't have to wait because we were so early.\nNo matter, we will definitely be back.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2011-01-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jvwnIG5wEjdOsqkYJgN29A', 'review_id': 'oD4arSorV5x6Ax6FBRJoBw', 'text': 'Disappointing.  \n\nI\'ve eaten here about 5 times over the last couple years.  This review is for the last two times, over the last 1 year.  \n\nFirst, service has been bad on both occasions.  Seems like they either have assigned twice as many tables to each waiter as they should, or the waiters just are rude, but I have experienced unacceptable waits for each stage of the dining on both occasions, with two separate servers, so there is a real problem.  With that said, servers were nice and professional when they were there... just took too long.\n\nSecond, atmosphere is just okay.  You\'re typical mid-market seafood joint.  \n\nThird, the food is just okay.  I mean it\'s maybe a 3 out of 5 stars, depending on what you order.  Portions are on the smaller side.  I\'ve tried the Mahi Mahi (crispy fried in olive oil on outside with what tasted like a Montreal Steak Seasoning), as well as their Scallops.  The scallops were by far the best.\n\nThe fresh sourdough bread is outstanding... I could eat several baskets if I let myself!\n\nBut for my fourth point, and the most important, the VALUE is NOT there.  It\'s too expensive for what you get.  I feel like every entree, if it was $3-4 cheaper, would be fair price.  Maybe.  But for just "average to good" food, it\'s not worth the prices.  \n\nI told myself after eating there last night I won\'t be back.  Perhaps I\'ll forget that pledge, but I hope not.  Go elsewhere (such as McCormick & Schmick\'s just up the road in Esplanade).', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 2, 'date': '2011-01-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'q5bhK9xUH8rCE92I8fEGoQ', 'review_id': 'o5NR7TTKFC1qKF_37p7tFA', 'text': "Thank you Bradley for the attentive service.  I enjoy it when the staff spends time at the table giving us information.  He recommended the wine, and told me what to expect.  Seven Heavenly was the choice.  It was just as wonderful as he predicted.  We went to Bev Mo, next door, after dinner to score a bottle to share with friends.  The mahi mahi was exceptional the saffron rice actually had visible grains of saffron.  Isn't it a great meal when the fresh veggies on the side are also a hit!  We will return!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2011-01-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'K8AHPHV8bIaOgof2jMl80A', 'review_id': 'PtXZljVZhulKLxr5yqA0MQ', 'text': "We walked frequently to the original South Coast Plaza location of Bluewater Grill, and were very pleasantly surprised to find one right here, on Camelback, in the middle of this Midwestern winter paradise.\n\nAll our favorites FRESH (a miracle in PHX) and mostly unchanged from the Santa Ana and Newport Beach offerings: superb fillets and steaks, the seared ahi tuna, and the battered fish and chips (the fish so light and batter so grease-free--amazing and deceptive).\n\nSince sushi is not a feature of the OC menu, I'm not surprised to read that it has been phased out.  What remains, including the hot, fresh-baked Sourdough Bread, is what has made the restaurant a favorite at home.\n\nFriendly (though not overly trained) staffers, a lovely heated patio (ignored by Phoenicians), ample portions (share a Caesar salad, share a fried calamari and a seared ahi appetizer, share a main dish, share a dessert).  Try not to fill up on bread (and yummy butter).  Walk on over, bring the dog, and enjoy the fine spring or fall night air on the candlelit patio you'll have to yourselves.\n\nIt's not Durants; it doesn't want to be.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2011-02-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'RPmD2ecegyUhzptdDXIFKw', 'review_id': 'rUBD_wLV3PPIvmjUfRWlAA', 'text': "Fish Market was one of my favorites places for sushi, and I was glad to see it didn't lose the things I loved when Bluewater Grill took over. The sushi is fresh, flavorful, and reasonably priced (especially during happy hour), and the atmosphere is friendly and casual. The service is hit or miss, but it's worth it.  And there's something about the hot sourdough that makes it hard to resist!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2011-02-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SgBlfFMQEchUNn3olJ1B6Q', 'review_id': '7InTLwr4uu6sV6BOdkIKYQ', 'text': "We always like to eat our big meals at lunch.  We had a groupon to this place so I wasn't expecting much.  The food was really good.  I had the Ono and it was cooked perfectly.  The staff was very knowledgable about their offerings and they do have daily specials.  We went on a Saturday afternoon and there was a nice diverse crowd.  Sat outside - awesome.  The ultimate recommendation - I would go back...and have.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2011-02-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wcOqMTV92kxOornA42KyoA', 'review_id': 'm0Y3zz9CdSZnMphXW4gnvQ', 'text': 'As you can read I don\'t give any restaurant a 5STAR review; but I really wanted to give Bluewater Grill one...2 Recent visits - one, after dental surgery; got the lunch special; cup of soup & seafood salad...Delish!!! 2nd visit; dinner time; got the choppino; so full of seafood; could only eat 1/4 of the portion...friend got the "black cod" on recommendation.  He is very fussy person when it comes to fish.  Definately will be going back; based alone on that fish with Panko breading!!! - YUMMY!!!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2011-02-11', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 4, 'cool': 0}, 'user_id': 'iwUN95LIaEr75TZE_JC6bg', 'review_id': '0Mjx8NgRDrzJrWYrO3KBjA', 'text': "I went there thinking / hoping this place had some resemblance of its predecessor; The Fish Market.\nBoy was I mistaken.\nFirst, there was nothing that resembled a typical lunch menu.\nEverything on the  menu was $$, including the 1/2 sandwich and fries for 9.95, which I'm sorry I ordered.\nThe sandwich was remarkably small, with 1 small piece of lettuce, slice of tomato and what looked liked a small scoop of tuna. The bread looked like it may have been right out of a loaf of Roman Meal bread.\nThe fries seemed like a normal small portion.\nWhen served, I recall how astonished I was at how small the entire combination was and how I knew I would be hungry afterward since I don't eat fries, however, the substitutions came at an extra charge.\nWhich meant I just got a tiny half sandwich for 10 bucks or a tiny sandwich with cole slaw for even more $.\n\nThis was a lunch experience that made me angry with each passing moment i sat there fuming, primarily due to the lackluster portion, the price, and the mediocre service. \nI really dont like to score a place one star, but in this case, if Bluewater has the stones to sell a small, ordinary 1/2 sandwich for 10 bucks, I feel the need to tell anyone interested how this place offers absolutely no value for the $$.\n\nI will never go back to this place. Once bitten, twice shy as the saying goes.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 1, 'date': '2011-03-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QFox6_-oCyD8CV3knXVNWA', 'review_id': 'z0ycZ3kIqpE78LdhIzzIXw', 'text': "This place is a little pricey and its not really the place for a quick meal but the food and environment is awesome. I'm not a big sushi or fish fan but I'm in love with the dynamite california rolls! I also tried the mauhi mauhi (spelling?) And it was very good, not fishy at all. I ordered the only steak on the menu and it was also good. A little to cuisine for me but when in Rome :). The sourdough bread was amazing. I had the spiked cherry limeade which was yummy but for $8 a drink I'll order a martini next time.\n\nOverall, very yummy! Id love to try it out for happy hour!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2011-03-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'qbhWU6Wn0zvVVct1HkT_GQ', 'review_id': 'vN_-96fItCK2CcqnR7iHew', 'text': 'Last night was my first experience at Bluewater Grill - and I was very impressed.  One of the Managers is a real wine connoisseur and spent a great deal of time going over the whole wine menu with my husband and me.  He has great pride for the wines - as he has personally selected every one and has a number of "exclusives".  He helped us select a fabulous Italian red that was great for our meal!\n\nTo start we had the oysters on the half-shell, which were FABULOUS with fresh grated horseradish shaved on top of the cocktail sauce, which we blended in (I suppose some people may scrape it off, but I LOVE HORSERADISH).\n\nI enjoyed the King Crab Legs, which were plentiful and delicious.  My only complaint is that there wasn\'t enough lemon, which I should have asked for more when I ordered them, since I know I use quite a bit.  The ONLY thing I didn\'t like was that there was no hot cloth to wash my hands with before or after the crab, and not even a wet wipe.\n\nMy husband had the scallops, which were served with a delicious spinach and mushroom sauce.  I didn\'t try them, but he raved about them.\n\nWe each opted for our own dessert.  I was hesitant because it was a list of all the typical desserts that are often pre-bought and just served.  But to my surprise, they make all of their desserts on premises.  I had the Key Lime Pie which was tart and scrumptious and my husband had the Chocolate Volcano.\n\nDavid, the Manager who was so helpful, told us that on Sunday, Mondays, and Tuesdays they have 1/2 off bottles of wine - so I think we will be back on one of those days to try some of the ones he recommended that we weren\'t ready to "invest" in.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2011-03-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XjUW7xfZ0FEfFnGAdXXoHQ', 'review_id': 'Z99kwoiiwCwNMi7oosoK7w', 'text': "Stopped in for some clam chowder and brews after getting rained out at a spring training game today.  Our server was friendly and attentive, the chowder was delicious (manhattan and new England both!). I had the tenderloin appetizer which was in a chimichurri sauce with peppers and onions- tender and yummy with quite a kick!  This location has a sushi bar too.  Make sure to check for Yelp checkin specials- mine was honored happily ($1 draft beer, wine, or well drink!).\n\nThey have beer- and wine-paired special dinners here from time to time, which sound awesome. If I lived here (I'm from CA) I'd definitely be back to check those out.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2011-03-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Xd4bWdBZQRcaEThtiGFl_w', 'review_id': 'XW5Un6-lcLkCbi9gpc7NJw', 'text': 'So..so.. seafood. Not bad for Phoenix. There are many better options, however.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2011-03-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 5, 'cool': 1}, 'user_id': '1gY1N3pkxTzh7kK4BxANyw', 'review_id': 'hYnmOGowIpJ1Tt5APiW3PA', 'text': "I don't love fish, but even if I did, I wouldn't love it here.\n\nThis restaurant has been here for years.  My first memory of it was when I met a lady from a Cat Rescue program, when I adopted my beloved kitty Fluffy.  Fluffy died recently at the age of 15, but she was an awesome cat.  That memory is the best thing I can say about Bluewater Grill.\n\nAs for the restaurant itself, the food is blah.  I admit the food looks beautiful when served, but the taste is just meh.  My fish and chips were average, but the Cole slaw tasted weird.  My husband said his blackened mahi mahi was pretty good, but it was a bit off putting that they charged an extra $1 to blacken it.  Really?  Isn't seafood expensive enough without nickel and diming, people?  The Restaurant.com coupon made the price a little more tolerable though.  \n\nThe wait staff was friendly and the service was good.  They even gave me a black napkin when I was seated because I was wearing black pants.  I always consider that a mark of an upscale restaurant.  However, Bluewater Grill isn't upscale.  The location overhangs a freeway and the booths and tables are more reminiscent of a TGIF.\n\nThe restaurant does have a fish market with a variety of raw fish available for purchase.  While we were dining, quite a few people came in and bought the fish to prepare at home.  Maybe that's a better idea than dining in here.\n\nIMPORTANT UPDATE\n\nAfter reading my review, the owner / manager of Bluewater Grill sent me a private Yelp message and expressed his concerns over my negative comments.  I am very impressed that he took the time to read the Yelp reviews in the first place and then reach out to communicate with me.  He's obviously very serious about making his restaurant a better place.  Kudos to him.  :) \n\nAnd for that, I'm upgrading my original 2 star rating to a 3 star.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2011-03-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '-yZJr73bAoPtlpHUL7JBzg', 'review_id': '6YCjoip1mIwk0WZyUMWXKg', 'text': "My friends and I had a wonderful dining experience at this restaurant. I had the sand dabs which were perfect! They were served with your choice of 2 sides. I had the mashed potatoes and fresh veggies. Everything was prepared well and very tasty. Others at my table ordered the fish and chips, the trout and the shrimp and scallop kabob (I'll get this next time).  All of us were pleased with our selections and enjoyed dinner a great deal except that the trout portion was a little small for the price.\n\nOur server was friendly and attentive. The manager also stopped at our table and asked if everything was all right and did we need anything else. We wanted more lemon and it was brought to us within 2 minutes.\n\nThe best part however, was the mudd pie. I get this everywhere I go and this one was a 10 . A generous portion served on a long white platter with whipped cream, fudge and caramel sauce. The 4 of us shared and it was yummy!\n\nThe only thing that would make this restaurant even better is if they would continue to participate in the restaurant.con certificates. They used to and then stopped.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2011-04-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '588oY8EejEFCr-ym_2TR0Q', 'review_id': 'du8btFCVww7QwMaf9G6zCg', 'text': "Great service and fresh raw offerings.  Our waiter was also very helpful.  Can't really say anything bad.  Good oysters, great salmon and tuna sashimi.  The raw clams were the money, and I expect to be back here every 3 months or so.  I could order some of the cheaper dishes and come back more often, but for me being from Hawaii, where raw fish is pretty much a birthright, I'll save this place for the times I'm truly craving the good stuff.  Don't forget, oysters really go well with a nice vodka martini!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2011-05-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'oBfzK4HHXtbWEWukqWY5rg', 'review_id': '5mevikNMp42YK40o3JJeXg', 'text': 'The restaurant was excellent. Much better than the Fish Market which I found to be no better than a glorified Red Lobster. Service was amazing, and the quality of the fish and seafood was excellent.\n\nI will definitely be back.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2011-05-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '4dnDsoHuxUtzhaumxbpR5w', 'review_id': '6OF327Z7gHJexbCc96j1jQ', 'text': "Thought we'd give Bluewater another shot for sushi. Bad idea, I guess. \n\nLong story short, we wanted to eat lightly and ordered a few vegetable rolls.They weren't on the menu (they used to be, at $4 a roll) so I spoke with the sushi chef (not one of the usuals I see there) and asked him to be creative in whipping something up for us. We were served three boring, small (4 pieces including ends) rolls that were severely lacking in creativity or excitement. \n\nBill comes and we're charged for spicy tuna rolls at $8 a pop. Whaaaa? First, we didn't eat spicy tuna. We're told that's what they charge for vegetable rolls because they're not on the menu. Okay...but again, we didn't order spicy tuna, in fact we ordered the very opposite. And $8 a roll means we would pay $2 per PIECE of vegetable sushi. No way, man. \n\nIt was only after haggling with our server and two managers that we were able to have our bill reduced to a more appropriate price. Unfortunately, the whole experience sealed the deal on being totally over the place. \n\nAnd so begins the search for a new sushi joint... if anyone has suggestions for killer sushi (that includes creative rolls), I'm all ears!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 2, 'date': '2011-06-01', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': '_UAyLUAFAe8lnry2NEfVGA', 'review_id': '3Z090V86hnUTC5Qou9n7hQ', 'text': u'tr\xe9s bon poisson bien cuisin\xe9..cela change des burgers..d\xe9co "bateau" sympa , service souriant', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2011-06-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nybt-z-PyW1uXMRq1UO3YA', 'review_id': 'UPIXAyTwdLCVd1qQ3nlOWw', 'text': "Very disappointing experience. I ordered seared tuna  and it was still almost frozen in the middle !  I've had seared Tuna in many other restaurants and this is the first bad experience I've ever had. I hardly ever send a meal back to the kitchen, however I did send this one back. It was much better the 2nd time, but I don't think I will be back.\n\nI give the staff 5 stars, but the food only earned 2.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 2, 'date': '2011-06-05', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 2}, 'user_id': 'F6QsMoJdvtohlbnST-fDyQ', 'review_id': 'UyVlsJ2uDDaC9zPpfjalng', 'text': "I have not been here since they changed the name. I always liked it before and i think it is even better now. The fish was wonderful i got Mahi Mahi and my date got scallops and shrimp skewers.. All wonderful! We had lump crab appetizer. Wonderful wine, Liberty School Cabernet i really recommend it! Everything smelled good. Even the bread was fresh from the oven.  The only off thing was we were at a nice quiet table and they sat a group of 4 middle age men next to our table. Men when they are out together are very loud. Don't put a couple next to a loud group. Other than that fab!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2011-06-10', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 3}, 'user_id': 'q9XgOylNsSbqZqF_SO3-OQ', 'review_id': 'GrsrguQaINg5NsUgwCEs3g', 'text': 'Much to my delight I visited again on a Monday and was told it was  1/2 off all bottles of wine. Whoohoo! I sat at the bar and started with the Ducketts Bucket, it was a generous serving of clams and oysters in a light wine, lemon butter broth. I had the Mahi Mahi special for my main served with a side of leeks. It was all pretty delicious. \n\nThe food seems to get better every time I come here. I need to remember what a great happy hour they have.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2011-06-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BIAcdA72nNZeENY23H4dIA', 'review_id': 'GM3dW2acpBaaiQS_aQf_ig', 'text': "I have to say that I love this place. I go during peak times and off peak times as I find myself craving their quality. I am from the Northeast (Boston) so I know seafood. This place has delivered some of the best seafood and a menu to match with a reasonable price point that I can not find anywhere. The management is top notch, servers all know their fish and on top of it, I usually end up buying some fish from their martket to take home as I can't get over their freshness. \n\nIf you are looking for a great dining experience that wont break the bank while offering a wide variety of seafood and sushi (and non seafood) options, I highly recommend this place.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2011-07-07', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 3}, 'user_id': '90a6z--_CUrl84aCzZyPsg', 'review_id': 'CnDG6XCO2kYCyxrUz9u3wQ', 'text': 'We sat at the bar and went on a total hangover-driven seafood binge: fresh shrimp, crab, oysters, clam chowder, and scallops. They all tasted better than we expected. The bartender/cook was engaging and I also downed a better-than-average bloody mary. At this price-point these guys have the best seafood experience in town. (oysters were only $1.25 ea)', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2011-07-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Fa0cKTkPhxdYi9HpcuQh8g', 'review_id': '9AWVdl9vqz7vR8mLUcj5hg', 'text': 'Not great.  No, maybe moderately bad.  I just moved my office to the 16th Street Corridor or Squaw Peak Corridor (or Piestawa Peak Corridor, if you are new to PHX), and for the most part the food in the area is great.  Bluewater is not worth a second chance with so many good options.\n\nI went for lunch, perhaps not Bluewater\'s strong suit.  I was alone and sat up at the bar immediately in the front door.  Realizing that I had sat at the Oyster Bar, I wanted to ask the Chef-Dressed gentleman behind the counter if I could order regular (non-oyster) lunch.  I waited patiently until the Chef-Guy and a customer finished their conversation about \'80s Japanese sports cars (a minute or more to be acknowledged) which I did not mind because, heck, I like cars, so I could ask my question.  I was told "I could get anything I want."  I love that statement.  Maybe I want a vineyard, but it\'s probably not on the list of specials.  I was handed a paper menu that already had a half a dozen mayo stains on it.  I hope it was mayo.  To my surprise, the lunch fare included 10 or so dishes ranging from $10 to $15.  I was surprised because I thought it would be cheaper judging from how Bluewater did no remodeling save the signs and flags from when The Fish Company served mediocre fare here.  I blew the bank on the $15 Crab Club.  I asked Chef-Guy what was on it, and he not so appetizingly said bacon, avocado, mayo (the last guy must have got it too) tomatoes and yes, crab.  Simple, right?  I went for it and got a Manhattan (red) clam chowder and coleslaw.  I received a large amount of free bread for one person without asking.  I didn\'t want it.  I got a sandwich after all, and I\'m not carb-loading for today\'s workout.\n\nAround this time, a nice older woman from Hawaii, she told me, sat next to me and she ordered ice tea.  She didn\'t get it.  She told Chef-Guy that she did not want bread.  She got it anyways.  She ordered a glass of wine.  She did not get that.  Another chap at the bar proclaimed , "He always does that.  He gets so distracted."  Seven people are at the bar...\n\nChowder arrives.  It\'s ok.  It\'s my fault.  I don\'t think I have ever had memorable Manhattan Chowder.  If you are from New England and want to tell me how Phoenix food is horrible and how the only good chowder is back east, i.e: bagels, pizza, deli, etc., save your fingers.  I just don\'t care.  Go back east and take your pushy Trader Joe\'s Behavior with you.\n\nSandwich arrives much later.  I didn\'t mind. The British Open was on the TV.  The poor crab was getting a second chance at swimming.  The mayo sauce was running out on to the plate.  The chef should be fined for making a 600 calorie meal into a 1200 calorie meal.  I could not for the life of me taste crab.  I could have ordered Styrofoam Club, I would not have known the difference.  Coleslaw sucked.   \n\nI paid my $21 lunch with water tab and bounced.\n\nOn the good side, it was relatively clean, there was no real fish smell and I didn\'t get in an accident in the parking lot.\n\nBack in the office now, the displeasure continues in my abdomen.\n\n\n          UPDATE        Jeff, the GM, contacted me via email and said that he discussed the review with staff.  He invited me back for another try.  That\'s pretty solid.  We\'ll see.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 2, 'date': '2011-07-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Gi9ngthjLtr3qbbiKjxAPg', 'review_id': 'SPycz9AGAbVBY3AZtoggiw', 'text': 'I enjoyed a night of food and drink at Bluewater Grill this past Wednesday. This was my third visit and I am happy to say that I was just as satisfied as my previous visits. Along with some friends, my wife and I took part in one of the restaurants monthly tastings. They prepared three enjoyable courses, each perfectly paired with a complimentary wine. Our experience was not only a treat for or taste buds, but the extensive knowledge of the chef and bar manager/wine pro made it an educational experience.\nI highly recommend stopping by Bluewater Grill for one of their tastings or just for your favorite seafood dish.....they have great sushi too.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2011-07-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'WtON2Po8HLh6u2AntiASUA', 'review_id': 'NZr2yhyIyGUfSnOlGXW8AA', 'text': 'Have been here now about 5 times and every time the food and service has been great. Having a Raw bar, Sushi bar and Dining room gives you great options plus the regular bar too. They always heve happy hour specials and make good drinks.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2011-08-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-Oz4_yM-0ZRAa1NmIIacGA', 'review_id': 'I945TgNkbmdak5G5-4-pDA', 'text': "They've got the best! Jeff is an awesome mgr that we've known for almost 10 yrs. Wade is our fav server/bartender and is why we keep coming back.  He never gets our order wrong and always makes us laugh!  We are treated like royalty! Food is fresh and service is excellent!  Just ate there today with out of town family and they thought that the service rocked!  Thx guys!!!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2011-08-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'T1OPPwuftnJY4bz44LUiNQ', 'review_id': 'aAcerZFn89lJ7xJ5lvCH4g', 'text': 'I received nothing free. Paid for great food and exceptional service. This was the Fish Market and is now Bluewater Grill. Great happy hour too!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2011-08-16', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 4, 'cool': 1}, 'user_id': 'xZvRLPJ1ixhFVomkXSfXAw', 'review_id': 'sggtc_7ktmuX-dTytczBww', 'text': 'oysters are always fresh and flavorful here!\n\nthe fish and chips are under 10 dollars and are enough for two full meals!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2011-08-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'szbTVEtATfn8f9GxbGGO5w', 'review_id': 'vTidP6z6C5SETy6OjsNI7g', 'text': "3.5*\nI've been to Bluewater a couple times now, and I've had some great food and some that's been so-so.  Our first visit I had the pan seared scallops and my buddy had the miso salmon.  We both really enjoyed our meals, not to mention killer oysters rockefeller and sourdough bread!\nOur last visit (in addition to the aforementioned oysters and sourdough of course) I tried the prawn and scallop skewer and my buddy tried the chinook.  Now, to me anyway, prawn=BIG shrimp U-15 like. But alas, these were more akin to 21-25.  The food was not hot when I got it which definitely detracted from the dish.  The chinook was average.\nSo, in closing I'd say oysters, chowder and bread will probably be my next meal at Bluewater, never been disappointed in those.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2011-08-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'C6Av_qoKe3H5-9BOnzi7yQ', 'review_id': 'ZG8VxrM_RrdDScOuWu2dhg', 'text': "Great Place! Finally a great seafood place in the Valley. Went here for lunch Monday as my wife was shopping up the street at Last Chance (which I call the Crazy Lady Store). Nice ambiance and atmosphere. \n\nRock Star service from bartender Heather. She went above the call of duty in her service. I really admire and make note of when a server goes the extra mile. She brought out samples of BOTH of their chowders for us to taste as they were trying new recipes. The New England Chowder was creamy goodness and out of this world. At the end of the meal she offered without prompting to put our drinks in plastic cups to go. Nice extra effort Heather. \n\nFood: \n\nSourdough bread had great flavor - bit hard on the end caps though. \n\nI had Mahi-Mahi Sliders and they were awesome! Fish seasoned and cooked perfectly. It came with a roasted 1/2 roma (?) tomato that really added flavor to the bite sandwich. Only issue is I bit into it and the friggin' tomato squirted on my shirt. Oh, the bun was also above par buttery and fluffy. \n\nWife ordered a burger, yes a burger in a fish house - blasphemy I say! Oh well, to each their own. Usually the last thing you want to order in a fish house; however, BWG serves a good a$$ burger. I was pleasantly surprised as my wife gave me a few bites. Bonus for ye ol' land-lovers. \n\nNeed to go back for dinner and hit that raw bar. \n\nDouble thumbs up for BWG!!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2011-09-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dWSgEIHadtE_pc2Wz5X-pA', 'review_id': '3ntB-dyps5r5A6kx8Utajw', 'text': 'Second time I\'ve been and the second time still wasn\'t that great. Wanted Sushi and obviously the sushi chef wasn\'t there so I only had a choice between Spicy Tuna and Cali Roll-got both and both were falling apart-Taste ok nothing to rave about. I also got the calamari (which I love) but confused on why they give it with a side of cocktail sauce-Danny was the server he was AWESOME-very tentative and knew all the answers to the question\'s I asked about the menu-On the other hand the manager Jeff I felt ignored our table-As a manager how do you pick and chose which customer\'s to talk to? Well he spoke to the table directly in front and behind he was loud and clear when saying hello, good bye, thank you but all I got was a look. I wasn\'t asking for a conversation but a "thank you for coming" would have been nice-Oh well 5 stars for Danny (the server), 3 stars for the food, 1 star for Jeff (the manager. Will I be going to Bluewater Grill again NO.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 2, 'date': '2011-09-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'D2LUVwshDcUdP1jfb6yCPw', 'review_id': '0V030TpjZLg4PU6d6xKkFg', 'text': "My husband and I went here on a recent Tuesday night around 7:30 PM...I was amazed that the restaurant and bar were pretty full, which is a very good sign for a relatively new restaurant on a weeknight. The decor and ambiance was nice.  It had a good feel and the customers and staff were very friendly. We didn't have to wait and got a nice booth right near the bar...the service was a little slow because the server assigned to our table was also the bartender and she kept needing to go back behind the bar.  She was very friendly and we were not in a big hurry, so it wasn't a big deal for us.  The food was pretty good. We both had some sushi for an appetizer - the Senorita roll is very good! This is our new favorite roll.  My husband got the swordfish and I got the seared Ahi tuna.  I was a little disappointed in the thickness of the tuna cut.  It was a very thin cut, which was fine since I was pretty full from the sushi.   It was seared medium rare, and the menu said rare, I should of asked for their definition of rare because to me, rare means most of the tuna is still red...it was about 1/2 cooked, it was still fine for me.  The price was a little high for how thin the cut was.  My husband loved his swordfish, he asked for it broiled which is different than the menu description, it was not a problem for the chef and it was done very well.  We will be back, its a good seafood place for the Phoenix area.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2011-12-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xooyKqd2qWR1jsZU8iCjzw', 'review_id': 'giWvh2X8WZ5JHGCK6VavFw', 'text': "Great Seafood and plenty of choices.  I was there on a Sunday evening and they were offering half off on bottles of wine!  YaHoo!  \n\nThe food was perfect if a little pricey.  The wine, and the presentation, was excellent.  Service was great and I'd go again.  The sourdough bread is to die for.\n\nIf you love seafood, cooked the way you like it, then this is a place for you.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2012-01-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HEuRXV3g6MNmxizFN_dBLA', 'review_id': 'N3fUG0FNGoKiSRKMoxHLvw', 'text': "THIS IS THE WAY YOU RUN A RESTAURANT!\n\nMy husband and I went here for dinner last night..We both started out with soup..He - New England Clam Chowder...Me - Manhattan Clam Chowder. Both were very good. I was even happier as you will be hard pressed to find anyone in the valley who serves the Manhattan style chowder.\n\nHe ordered the farfelle with shrimp and scallops which he thought was excellent. I ordered the linguini and shrimp which was very tasty.\n\nThe service was excellent. In fact, they thought our food took too long to come out (we  didn't seem to think so), so the waitress apologized profusely and wanted us to know that the management was buying us dessert for our wait. We were blown away by this, since the wait didn't seem long.\n\nActually, the manager himself came by also to apologize.\n\nThe dessert was the banana's foster tower....OMG....it was awesome...\n\nAll in all, it was a very pleasant dining experience and we'll definitely be back.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2012-01-22', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': 'INgdheZOfKZL5ojvH0_n-g', 'review_id': 'RvtVKiK4zxG6_gPuLchrZg', 'text': 'The only reason I am not giving them ONE star is because our waiter provided excellent service. The place has an unpleasant fish aroma...\nthe swordfish was good compared to the over cooked and bland Ono fish I ordered. \n\nour tuna appetizer took 20 minutes to finally get to our table but at least our waiter offered us bread while we waited. \n\nThe best thing about this restaurant was the YELP offer ( $1 for your first drink if you check in on Yelp)', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 2, 'date': '2012-01-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '11m_4W9hPDej-8BOdC-EYg', 'review_id': 'y_pUG-VBCSjZYSWomq_MJw', 'text': 'Great sushi, good portions, both New England and Manhatten chowders are great!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2012-03-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'xi0j2fpeE4yQkpHwq7evEg', 'review_id': 'UPgh_t06zlhfl1lkKvcQig', 'text': u"Will not eat here again!  Last night was our first and final visit to Bluewater Grill.  The waiter was nice but the food was awful. I ordered the blackened sea bass and then the waiter came back and said they ran out. So, I changed my order to the Ahi tuna. I ordered it rare but it was a bit overcooked.  The vegetable that came with it was a broccoli/cauliflower mix. I ordered the red potatoes, which I thought were going to be red new potatoes....but they were basically small steak fries. \nThe ahi tuna was the biggest disappointment. It had a bad taste. It wasn't cooked with any type of seasoning and it tasted a bit metallic. I shared some with my family just to let them see how bad it was. My fianc\xe9 had rainbow trout and his was overcooked but at least it looked like it was seasoned with something! Mine was just a patty of white blah! \nMy son had fish and chips. He complained that it was dry so I tasted it and it was!! It did not have a good taste at all. It was probably the breading that gave it a bad taste. And then the fish itself was dry. \nOh, I forgot about the two good things: \n1.) The clam chowder was great. 2.) I got a $1 drink coupon for checking in with Yelp. \nAgain, I won't rush back to this place; but if I ever find myself here, I'm sticking strictly to the clam chowder!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 2, 'date': '2012-04-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '0TuOVaf4sM11UUbqGRL-4A', 'review_id': '9on2jjRuLaHyRYDamNzJdQ', 'text': "I can't believe this place does not advertise what an good sushi bar they have! We ate at the sushi bar because we heard about it from a friend. The place doesn't have a sushi bar atmosphere more of fresh seafood market. The sushi chefs were very nice and made awesome rolls! We got the blue water house roll and the senorita roll both very delicious. Both fresh and tasty! I will defintely be back to take advantage of the happy hour! Only four stars because I feel the prices were a little over priced and service was a little slow. But I will be back for happy hour!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2012-05-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '8W1vFjOqHzQTo0fSv6Bdrw', 'review_id': 'sVEwIqBzFh-JH4Cz2KdmIg', 'text': "I love this place! My boyfriend and I go here for seafood and it's always great. Some of our favorites are the Senorita Roll, Scallops and Salmon dinners are great! I would definitely recommend it!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2012-05-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'YtEBSTQyfrBHqbGLxFD1vA', 'review_id': 'RmoLPhyls6e_tPj6az4KRA', 'text': "My wife and I went to dinner tonight at this location for the first time.  It was one of the best dining experiences we've ever had. The restaurant has an open area and then a more cozy candlelit dining area where we sat. We ordered the Crab cocktail, the charbroiled Edamame and the Cioppino. The seafood tasted like it had just been caught, really it did  - in Arizona no less....they are doing something very right at this restaurant. The waiter was attentive and courteous making sure we had what we needed without interrupting us. My family has been in the restaurant business for many years, and I could tell this staff was professionally trained. They all were very concerned that we have a great experience and they succeeded. We'll be back and will tell our friends as well.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2012-05-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'xdXeen8BVL51ySXu9ByY6Q', 'review_id': 'RjXExkrYDzK1fiHGGrrqtA', 'text': "Went here for Happy Hour Sushi and drinks again.  It's conveniently located off of the 51 and has an attractive bar area.  I have eaten in the main restaurant and found it to be fine, but not a place I would pick as one of  my favorites.  The sushi is different, though.  We always order off of the Happy Hour Menu and it's all delicious.  They have the typical type of rolls, but also types I have never heard of that have more complex ingredients and flavors.  I highly recommend it.  The Happy Hour prices for food are not as low as I would like, but the sushi rolls are much larger than other places, so don't order many or you will be taking them home.  Happy Hour drink prices are good.\n\nThe service was excellent.  We basically had two waiters and the sushi chef stopped by to see if we had enjoyed our meal.  Even if you have been unhappy in the regular dining room, try going for sushi.  You'll be pleasantly surprised!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2012-05-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'HrMwMgstAwchQHVpj8ZmWg', 'review_id': 'og-GDKQB81I9db-alQG2GA', 'text': 'We had crab and arugala salad and mahi mahi with cilanto lime slaw.   The food was good apart from the Mahi Mahi being a little overcooked for my taste.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2012-05-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'tRGHwa6ejXa8ej_BnJR5ww', 'review_id': 'WBOr-ghGhHkb6dYeuIQOgg', 'text': 'I have eaten at this establishment several times in the last five years. Most recently, as Bluewater Grill, the seafood is plentiful, fresh, fairly priced for inland restaurants offering such fair. I especially like to eat at the oyster bar where warm sourdough bread is served with your meal. Recently, a colleague and I ate oysters before fresh glazed salmon, perfect mahi mahi, cold beer, and good company. We were able to watch a ball game while dining and chatting with the server and bartender. Inside the restaurant is a wonderful sushi bar that is the rave of PHX. The ambiance is getting a little old but still has charm like an old seaside fish restaurant. A little updating will be needed soon. But the food is great, the fish fresh that day, and the prices modestly expensive but worth it. I plan to eat here every time I am in town.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2012-06-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DxHYzSR6bXljibrW823weg', 'review_id': 'ZJrQmvit5-UFM__PVBSmYQ', 'text': "Excellent! Best seafood in Phoenix. We were seated right away. Couldn't have had better service between the waitress, manager and hostesses. The food was fresh, fast and perfect. Check in deal  for $1 drink", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2012-08-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8W1vFjOqHzQTo0fSv6Bdrw', 'review_id': '6l22qheZbqmlj5yg3BYuCg', 'text': 'I just wanted to add to my review because the staff and management at Bluewater Grill were so amazing when helping my fiance plan his prosal to me at their restaurant! We have also loved Bluewater Grill for our go-to date place when we crave seafood, and we have always been curious about the upstairs area. A few months ago we found out they were renivating the upstairs area for events, rehearsals, etc., and we had joked about having our rehearsal dinner there in the future. Well, to my surprise my fiance and his friend partnered with the manager about setting up the proposal upstairs alone, then having a party for me with my close family and friends in the bar afterwards. They even had our favorite service come in and serve us. They were so amazing! \n\nThanks Bluewater grill and thanks to Rachel our fav server!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2012-09-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xfX5LfEnBUWb8iL3B4VqHg', 'review_id': 'eBtuPe93x79u3Y1lhHb6BQ', 'text': 'Ate here with some coworkers.\nIt was not that busy on a Monday night.\nWe sat in the bar and watched the game whilst we caught up with each other.\nI had the Seared Eastern Scallops. \nDeliciouso!\nWe did not order any apps.\nThe beer was cold and the service was excellent.\nI had no complaints.\nOne of my buds said his was awesome and he wanted to go back next time he is in town.\n\nAnother said his fish (Mahi Mahi Daily Special) was a little dry.\nI told him to send it back, but he was content despite the fact.\nI figure if I am paying for a sit down meal with prices higher than a typical chain restaurant that it better be cooked to my liking. \nI deducted 1 star because of his comment.\n\nJust an entree and iced tea was over $32+tip.\n\nLots of TVs in the bar.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2012-09-17', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'kNO6w6EIKo8u6GSykOHBLA', 'review_id': 'uRHv_6N405TP71jB3185Ew', 'text': "I wish I could give it a higher rating, but I can't.  The food wasn't bad.  I enjoyed the octopus salad.  I would order it again or order some of the sushi on the menu.  I just thought that the service was very slow.  It was quite some time before we were able to order.  And it's not like it was very busy.  My coworkers also enjoyed their food.  It just seemed to take quiet some time for us to get the check.  And once we did get it, it was the wrong one.  When you go to lunch during the week, I think servers should assume or ask if we are on a schedule.  We did have to go back to work.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2012-11-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XTJM-IkRS0DC9fzJz4-Hig', 'review_id': 'e95Rg8o_nRV7e8qqWYvGzg', 'text': "Myself and several friends, meet at the Bluewater Grill every Tuesday night for dinner. This place is just as good as it gets. It's nice to be greeted by the staff when we walk in. All the staff is great, the food is great, affordably priced and always fresh.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2012-11-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9kDTgCBNllmp3IGy7wrrDQ', 'review_id': 'pSVD8alJT1eIJcEWoogGsQ', 'text': 'This review is specifically for the sushi bar. I\'ve eaten many times in the regular dining area and its always good However, the sushi bar warrants special attention because it\'s often overlooked. We come here because the sushi is absolutely the freshest in town. The salmon melts in your mouth and the tuna has never had that weird "metallic" fishy taste that I\'ve experienced at other, well-known sushi spots. The food here certainly is not cheap, but I think that there is real value knowing that you are getting fresh fish that is priced comparably or lower than most of the other sushi joints around town.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2012-12-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'aRFzf3hOKwgyQ5MtsJg-fQ', 'review_id': 'yg83mwwxQOOwutBDXJ9U_w', 'text': "Had an awesome girls' night with my aunts and cousins here - Great place to gather!\n\nGood food, nothing special.  Crab cakes and scallops started the night out right.  I had the lobster bisque, but it was rather bland.  I sampled a few fish dishes and all were well cooked.  Next time I'd like to try the sushi bar, since it sounds popular.\n\nService was great.  Would love to see more soul in a quality chain like this.  I will be back!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2013-01-02', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': '45V7-1r79DEG0HbuaKYIlg', 'review_id': 'Ut06UbfaH-7EmfZXCco31Q', 'text': "I am a little shocked right now. Not only have I not reviewed Bluewater, I somehow even missed posting a review back when the building housed Fish Market! That strikes me as very, very wrong!\n\nI've been coming to this building for fishy meals for a lot of years. And I am sure those memories play into how highly I regard this place.\n\nFrom the most recent visits - \nI can eat my weight in fresh, crusty sourdough bread!\nThe bucket of mussels and clams (which we tend to ask for all clams) is always super tasty (and provides a great broth for soaking into the bread!)\nHappy hour from 12-5 on Sundays - $4.00 well, wine, draft and several well priced appetizers makes for a fantastic way to day drink, eat yourself stupid and spend a fantastic afternoon without breaking the bank.\nThe raw bar generally has a nice selection, the sushi bar is a-ok. The New England Clam Chowder is the stuff comfort food is all about.\n\nIt may not be the swankiest fish house in town. None of the recipes will make you re-think what seafood can be. But it's always fresh, always consistent. Service has always been friendly and the one bad experience I have had here reflects on my own insane family - not the staff, the food or the place. And even the bad experience makes me laugh now.\n\nAnd writing this review is making me crave the clam bucket and sourdough bread right now!!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2013-01-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dYWwSXz6qkviCIdyaEUADQ', 'review_id': 'n8ZW6B36RIwTRuXvWthh1A', 'text': 'Very good. I dropped in for a quick lunch and had the fish tacos. Very fresh and very tasty. Definitely recommend.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2013-02-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QDIhUXuNvXPY2Gv94QFiug', 'review_id': 'Op-xhA9Z4Op5_NNCWB7kQQ', 'text': 'Valentines dinner...  Place was packed and the food was amazing.  We sat near the kitchen window and I was impressed with the sanitation and the quality of food that appeared to be being cooked and coming out.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2013-03-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'PV3FFR82wg7bWhtHaI7zdQ', 'review_id': 'arCWZs13O4TeHxsheMHJVA', 'text': 'We picked up an order of bacon wrapped scallops to go on one evening. They were delicious. I was impressed by the atmosphere when picking up the order, and the quality of the food, so we decided to return the following day for dinner. It was happy hour, so we tried several items off of the happy hour menu. The sushi was excellent. We also ordered some salads that were very good. The waitress was friendly and helpful. We will return when we are in the area again.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2013-04-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'adkV-Rt2NjIZzh2tmryeWQ', 'review_id': 'xp9OfRFhVD2iYHaBGPcQaw', 'text': 'Had dinner here to celebrate my new job. Waiter Christopher, knew the menu extremely well. My date is from Seattle and is therefore leery of seafood here. She got the steak and it was amazing. I had the mahi mahi and it was delicious as well. Wine also did not disappoint. Will definitely go back.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2013-05-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'd0wJVf7Gv7v1B-HHYhxZtQ', 'review_id': '1TY_kS1uwE2MpIqhBVXlIg', 'text': "They get A for effort, C+ for execution.\n\nThey're a solid place with decent seafood.  But the prawn linguine was drowning in butter and tasted like nothing else.  The scallops and mahi mahi had a nice crust and was cooked well.  But the polenta/risotto cake was also heavily buttered.\n\nI would stick with just seafood in the simplest possible way.  The prices are decent, not overpriced and the service is great.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 2, 'date': '2013-05-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 2}, 'user_id': 'y5_vrqIylhXMrejM_-x_vA', 'review_id': 'ogzEsirlv2jZdVln6F0awA', 'text': 'I have a new favorite seafood restaurant in the valley...and it is the Bluewater Grill. We tried this place during restaurant week and had such a great experience I can\'t say enough positive things. \nFirst off decor: walking in the entrance on boarded planks is like walking on a pier into a beachside establishment. There is a fish market counter when you first walk-in, so immediately I though-this place must be legit! There is nothing about the inside decor that says "southwest". With all of its\' hardwood finishing, it really did feel like I was back home in Boston.\nOur server was spot on all evening. He was courteous, knowledgeable, and professional. He kept our water filled which always earns a star from me, and just made sure we had whatever we needed. \nWe ordered the ahi tuna and crab cakes for our starters, the miso-glazed salmon and mahi mahi for our entrees, and the key lime pie and caramel chocolate bread pudding for dessert. Each bite was better than the next. Some highlights were the daikon salad that accompanied the ahi, and the risotto cake with the mahi mahi! Heavenly. The fish was cooked so beautifully. \nAfter glancing at the regular menu and their prices, they are very reasonably priced compared to their competition-yet still high quality. I\'m very excited to return here again!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2013-05-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 5, 'cool': 3}, 'user_id': 'ST8Yzlk2MqKlcaLqL2djBg', 'review_id': 'xpuhbJ_OUR3teOv3BdTeqA', 'text': "with restaurant week comes opportunities to try places we normally couldn't afford. except Bluewater grill is quite within a middle class budget. \n\nfirst thing you notice is how it's set up almost like a new england seafood restaurant, but without all the kitsch. and although it's 3 dollar sign kind of place, it has none of the ego of a scottsdale eatery. \n\nwe had several options for the restaurant week menu, pulled right off their main menu. i opted for the crab cakes, the miso salmon, and the key lime pie. the crab cakes were outstanding, with way more crab packed in there than breading. i think it was an aioli sauce drizzled on the side, not soaking into the crab cake that added a nice flavor as well. \n\nsecond course, the miso salmon: cooked perfectly, skin on. i know you're not supposed to eat the skin, but sometimes, that crispy saltiness is just too good to pass up. it was on a bed of al dente green beans and mushrooms (not the canned kind...the real vegetable kind). \n\ndessert was a rich and creamy key lime pie, with just the right amount of sweet and sour, and a crust that was perfectly moist, not crumbly. \n\ntheir whole menu for seafood eaters looks just as delicious as our meal. of note, there is a fish market inside, as well as a bar, and they serve sushi! we will probably make this our go-to fish restaurant from now on!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2013-05-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'qoomHPCaXQ2EHRSvcAzRjw', 'review_id': 'pPkmyEwNcd-rExnu5FfrmA', 'text': "We visited on Mother's day and had a great time. The clam chowder soup was great and so did all our seafood dinners, we will definitely come back.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2013-05-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'AyZ5Ws-6M2E255iaokE-YA', 'review_id': 'KgzuM8GT2llgXZ-ZSMhklw', 'text': "IMHO, the best Seafood in the Valley.  And if it's not on the menu, Tell them what you want and they'll make it for you.  We've been eating there for close to five years now and have never been disappointed.  The food is fantastic, the service is tops and the staff is friendly and they go out of their way to please.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2013-06-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'RK84F1D5HddOfiIWbdWJFg', 'review_id': '1dpaJ28Cjx3xVH27BwAJ2A', 'text': 'We have been coming here for years even back when it was The Fish Market. Top notch place, great staff always courteous and attentive. The food is always great quality and the sushi is awesome.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2013-06-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8E6W1Y-wI0oBMyOX-hHA9w', 'review_id': 'g_U9rxCKDUD2i4GhqE91Kg', 'text': 'Out n about near biltmore so my hunny and i agreed on stopping at the blue water grill. We had steamed clams caterpillar roll and a bowl of the new England clam chowder. We sat at bar where cook prepares appetizer dishes, he recommended his honey badger drink, I never heard of it but tried it any way, ended up having 2. Over all as far as the section we sat in, we enjoyed our meal and drinks and had a good over all experience.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2013-06-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'OUi1t0WF_tXxpPiXuiJIsw', 'review_id': 'RvmoIkQzxMaH25MFRUlLIQ', 'text': "The Bluewater Grill is one of those strange places I should go to more often as it's right in my hood, but no one I hang with ever mentions it. Is that because it's solid, but not shout out loud great?  Maybe so.  One disclaimer: on this trip I wasn't my usual starved self, which can make a big difference on how good food tastes..so you never know, it could have been a 4 if I was hungrier. \n\nWe got the oysters, which aren't my fav thing, but my lovely lady liked them a lot. A LOT. Next was some crab cakes which were pretty tasty I must say. The baked mussels were ok, but far from the best ehhh-va. A bit too garlicky for me. By now I'm getting pretty full, but  still had the Sunshine sushi roll beaming it's way into my future. It was not bad, but not great either. The taste was a bit bland but the texture was somehow an interesting mix of soft and crunchy. \n\nSide note. This place plays GREAT MUSIC and does have decent decor.  Surprised how current and cool the music was with stuff from Edward Sharpe and the Magnetic Zeros, Gregory Alan Isokov among others. \n\nDefinitely worth checking out, but the jury is still out if it's worthy of being in the regular rotation.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2013-06-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'z3xOgubkCYr2qNi7IuG9Rg', 'review_id': 'lI4k1uhNRzsgU8BFWHgB_Q', 'text': 'I am going to give this place 5 stars first our server Kat (hope I spelled this right) was a top notch A #1 server. Let me say the slaw here was amazing I ordered the seafood platter and all of the food was seasoned to perfection. I will make this a regular spot as good seafood is hard to find here in Phoenix.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2013-07-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Bz2igotNP00BeYeo32KaSw', 'review_id': 'Co8o1DmuGxeQhvCAqf6l3A', 'text': 'This place was great! Our waiter Nick was very attentive. The scallops, lobster and sushi were excellent. We will definitely be back!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2013-07-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'PK3TxomYLwZuOXonmYqjNw', 'review_id': 'c-Ud4K9MQUTioxCBQQWr9Q', 'text': 'We went here about a month ago and had a great meal.... I had Barramundi and they modified what went with it for me.... the place was great.... and our waitress was very good!  We ordered Keoke coffee afterward and they were super....We will definitely go again!!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2013-08-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '8AT9WSphWIIC2k8lh__izA', 'review_id': 'l4MvRgW6A_IxqgxS2TESdg', 'text': "Very nice interior. I Love the bar with oyster shooters and the deli and lobster tank!\n\nI'm aware of what fish have the highest mercury, which are substituted and which are lying low on the overfished list. I know what water areas are most polluted and which are not. \n\nI WANT to know the country of origin my fish is from and whether it is wild caught, sustainable or farmed. When I'm paying for something with my own money I make informative decisions and want to know exactly what I'm getting.   \n\nThey serve the EXACT fish that they have on the menu--NO Substitutes. I think that the majority of consumers aren't aware that restaurants AND grocery stores can serve fill-ins or substitutes for the actual fish and essentially lie about what they are serving. Yeah thanks to our lazy and corrupt USDA. \n\nExcellent service from our male waiter--the best I've ever had!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2013-08-11', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 4, 'cool': 3}, 'user_id': 'A9S8rLw35WF4sMCoCYrl3A', 'review_id': 'uYX72fnm6Rg_0Ko2JPYOPg', 'text': "Wanted to have some seafood so I decided that this place would be a good option.  The food was good but nothing special for the price. This restaurant has been in the valley for awhile and I expected it to be a little better. The food was fresh however I wouldn't make this my next seafood choice.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2013-08-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pc7iOC2-zkU8_S2atxHxKQ', 'review_id': 'jHgV3qCqoNw8lgDh_Bo0OQ', 'text': 'I have had several meals here and the service has always been professional and attentive.  Food is good, they know their fish.  Try the scallops if your in the mood!  worth every penny.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2013-08-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'kG8jkVFgOAOq6Ht6RvAjEQ', 'review_id': 'YreV1BQtjRdtsVC6K9zSYw', 'text': "Skeptical is a good way to describe my initial feelings when we arrived at the Bluewater Grill. The decor is very reminiscent of 80s Red Lobster so my expectations were low despite the location of this restaurant.\n\nBoy was I in for a surprise though. Fish was DELICIOUS. Fresh, perfectly cooked, exactly as ordered. Husband had fish and chips and they were not breaded to death pieces of unknown fish. They were just right pieces of fresh cod. I had the scallop and shrimp skewers and they were perfect. It's so easy to over do scallops but these were on the money. Our server was a delight and even hurried things along when we told her we were heading to a show. \n\nI am very much looking forward to a return trip to dive into the menu a bit more thoroughly! \n\nThanks Bluewater Grill for exceeding my expectations!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2013-09-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '698_Zx0Nz7LqnSR-yUmqzw', 'review_id': 'Mcw3PtZhWTrpDRFEalpt3g', 'text': 'Blue water grill (Fish market) has alwys been a favorite sushi spot of mine. Fabulous staff and you cannot beat the sushi happy hour deals!!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2013-10-03', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 3}, 'user_id': '3uU_6L8GnFOHTsO4I3oedg', 'review_id': '6lLSLg2aeskAeSZqS7HWCw', 'text': 'First time here, I was underwhelmed by the food. Crabcakes were pretty tasty, but the tilapia and veggies were not good at all. Our server was wonderful, he did a great job. The food was just not worth the price.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2013-10-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'pz0fF5H1NOmAQgi-TSPUsw', 'review_id': 'CzP3C5E9umw5huDUvGzOCQ', 'text': "Extremely efficient bartender/waiter that served me is John and he did a wonderful job. The grassy bar oyster were amazing to my surprise. I also was lucky enough to have some fanny bays as well even when it's not on the menu. Wash all that down with a draft wheat beer and you got yourself a great Friday night... Even if you're by yourself!  I couldn't stop ordering more oysters. Dinner will be finally be.... Wild prawn linguine! Of course! Oh yeah forgot that I also had an arugula salad with crab meat in between the oysters. The salad was also good with a bit of avocado in there, light and sweet! Wow horseradish are graded fresh!!!!!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2013-10-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'f7Hv9J9GTTXd3XsfRgt3Pw', 'review_id': '3YSXjTHtlBlhcmTyYAKR-Q', 'text': "Was in the area and since I once worked at the Fish Market, many moons ago, thought it would be a great change of pace to have dinner there.  \nWorked out to be a good option.  \nI had Manhatten Clam Chowder with a glass of Sonoma Cutrer and my son went with the Fish & Chips.  \nSourdough bread was warm, soft on inside and crispy exterior.  Doesn't seem to have changed much if at all.\nOur server was courteous and efficient, but then we were a tad preoccupied with our phones too.  \nRestaurant didn't seem especially busy but it was sorta late.\n\nIt's not quite the Fish Market quality but the food is good.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2013-10-13', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 6, 'cool': 6}, 'user_id': 'kffxYQVQsEpF1DVlQlcGCg', 'review_id': '7pslDtlHHyDiXbXijywU9Q', 'text': "Where to begin, well let's start with the Crab cakes and fried Calamari!\nBoth were excellent choices.  Fresh and oh so good.\nI loved this place as Fish market. It was one of my favorite places to go.\nSo now as Bluewater Grill they have made it even better.\n\nThe appetizers were really good. The fish was firm and fresh, always a good sign. The fish tacos were blackend and really tasty. \nT got the Clam Chowder never a good thing for me. But, she thought it was great!\nThe Oysters were really great as well.\nGreat service, nice clean bathrooms.\n\nThey were not taking any coupons from some special they had recently.\nBut, we did not have any anyway.\nPlus there is a Birthday club you can sign up for on line. I have not done that yet.\nBut, I will.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2013-10-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'qb3lltSzKhTSL2jbc9HqyQ', 'review_id': 'iL-HcpD-sCbRSawKUmJjjw', 'text': 'I have been here twice now and I am not real impressed. The fish was not very flavorful and one of the friends with us actually had really undercooked halibut. He didnt even want to order anything else as the first bite was enough for him to be turned off. I was hoping for more the second trip, but left disappointed as i did the first trip.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2013-10-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': '1g8Crb6WGQUsA2l2X3yVGA', 'review_id': 'sAgd_btamn1P0rB4qNLShw', 'text': 'Truly the best Fish N Chips in the Valley! Fabulous Clam Chowder! Fresh Sushi. Great Happy Hour! Fabulous Fresh Fish! Great Oyster Bar! Love this place. Lets all support this so its is here to stay. We do not have any another place like this since McCormick and Shmicks closed down! PLEASE LETS KEEP THIS PLACE ALIVE AND BUSY! Very reasonable priced! All the way around. Cocktails and food. Great ambiance. Friendly staff!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2014-01-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UMYBiZFOqWRXeqGl6DvNoA', 'review_id': '-YiUBDrPg9o4pszOSFm5ug', 'text': "My group enjoyed another great event here!  We enjoy everything about this place from the general manager to the host to he bartender and of course the server. They are able to accommodate groups of any size and they've got a huge upstairs area that a lot of people don't know about.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2014-01-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UMYBiZFOqWRXeqGl6DvNoA', 'review_id': 'w5GgOSf0uLFoG1_o9_50mg', 'text': "Normally I'm here for meetings when I'm running the meeting for a local alumni group, but today I was there for a business lunch. The foods always great and the atmosphere is very conducive to a productive conversation. Great place for a business lunch!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2014-01-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bz7h5YR37ibMgdDZLR3VYQ', 'review_id': 'sL6BNKbuaxS4eKuVDXX1Tw', 'text': 'Their New England Clam Chowder is the best clam chowder I\'ve ever had! Well, I\'ve only had that and Campbell\'s so..... Seriously though, my husband said it\'s really good. :)\n\nThe Casino clam was pretty good too. Can\'t go wrong with clams topped with bacon!!\n\nI had the fish n chips (standard) while he had the Mahi mahi (the "best" fish in the world according to our world traveler friend) and he said it was excellent. \n\nService was great. We\'ll probably come back to try some of the other stuff. :)', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2014-01-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bN2ZXWEaImVW5tyiujDLRA', 'review_id': 'ehFuLeECvbvLdUfflbwnSw', 'text': "I have dined at this restaurant several times and never been disappointed! Great sushi, too, and the clam chowder/sourdough bread makes a spectacular meal to bring home on a cold winter's evening.  Wonderful place to get fresh fish, this is my favorite seafood restaurant in Phoenix!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2014-02-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'LQg5p2vUBFitNWFUcV9mJQ', 'review_id': '-Pq_MsWErTdJ-rv5k-OS3g', 'text': 'This is our favorite seafood restaurant in the Phoenix area. Steamed clams & sourdough bread are wonderful to start with - have had this many, many times and the bread is always warm & yummy, clams fresh - seasoned perfectly. \nHave had many dishes here and they have always been good. One of my favorites is the chopped shrimp salad - the shrimp has always been fresh - with the firm, sweet taste of fresh shrimp. The clam chowder is great too! \nThe fish dishes are fresh - we have had many of them& sides very good as well - the plates displayed well. \nWe have never had a bad experience with the Service here either, always cheerful & accommodating. \nMy only complaint is that the last time we went there the clams were served in a bowl in lieu of the pot they used to serve them in - otherwise would have given it a 5th star.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2014-02-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': 'MLNXzph9nlCXGiSuv5G5Yg', 'review_id': 'QilbTy0KepOZnu5QsBCceA', 'text': 'You\'d probably laugh if any Phoenician claimed to have eaten fresh seafood at a local restaurant in town.  And you\'d be justified in doing so.  We\'re 6 hours from the nearest major body of water and the fish we catch in rivers and lakes here in AZ is outsourced or "farmed".  So let me put to rest any pretenses of fresh from the water seafood.  I can\'t make that claim about Bluewater, nor would I try.  But if you\'re looking for the closest equivalent in the Phoenix metro, this is probably it.\n\nThis place actually used to be known as The Fish Market back in the day before they remade it into a restaurant that also retains a seafood market.  There\'s actually three parts to this place.  There\'s the market area where you can shop for, weigh, and purchase seafood on display in back.  There\'s also an oyster bar where you can come by for a drink and have a freshly shucked oyster or two (pretty cool idea for happy hour).  And most prominently, there\'s the sit down restaurant that has the feel of a more upscale version of Chuy\'s.\n\nI brought my Mom here for dinner.  She\'d been here before, I hadn\'t.  The mark of a good seafood restaurant is always a good bowl of clam chowder so we started with that.  Good chowder.  Not the best I\'ve had in my life, but probably among the best I\'ve had in the Phoenix area.  For dinner I got the Cioppino with crab, mussels, shrimp,  scallops, and clams in marinara sauce.  The sauce was a little heavy, but the mix of seafood made for a rich broth that helped flavor all of the seafood.  I was stuffed to the gills after both dishes so I skipped dessert.\n\nPrices for this place aren\'t cheap.  The chowder, cioppino, glass of anchor steam beer, tax, and tip came to about $50.  Pretty much all of the seafood entrees range from $20-$40.  I probably wouldn\'t eat dinner here very often other than for special occasions.  Though happy hour at the oyster bar would probably be something cool to try.\n\nSo bottom-line, if you\'re a fresh seafood snob and want it straight from the ocean, drive 6 hours west to the California coastline.  But if you\'re okay with the next best thing here in the desert, Bluewater will probably get the job done.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2014-02-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 0}, 'user_id': 'Gf-7bqM-dTaImuvfZGhJ2g', 'review_id': 'nM09Jn4vuaYQJ7iSzQZ8Vg', 'text': "I'm always wary of seafood in land-locked states, but Bluewater Grill is classy and delicious.  This would be a great place to take your lover, or your family, or just get together as a bunch of friends and enjoy the food and some drinks!\n\nThe clam chowder is very respectable (I think they have both kinds, but I had the New England) and the fish and chips is nothing to scoff at either.  My lover had the scallops and they were done to perfection.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2014-02-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '28nsy0LMP9C7K_4bnuSpDw', 'review_id': 'eCH6vvCdDCHr3uyqDyve-w', 'text': "My wife and I have been coming here since it was the fish market many years ago. This is our go place for oysters, Asian style. .. That's with flying fish roe chopped green onions and ponzu sauce. I will usually call ahead maybe 20-30 minutes before and Order about 3 dozen and they will be ready by the time we get there and sit down. Incredible.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2014-02-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4oqxuazr5bvGLNaFugGexw', 'review_id': 'NKt8q6TO7_Wfn87vCE8V1A', 'text': "I can't speak for the sushi, steak or seafood as I don't eat meat, but wow! The service was one of the best experiences we've had in a long time. Came here tonight for my fiances bday and the bartender/server was one of the most attentive, nicest and most polite people ever. And it sucks that I can't remember his name but hopefully the owners will look at the schedule and give him a nod.\n\nThe only thing that made me give this place 4 stars instead of 5 is the fact that when the SO asked if they had any vegetarian options for me (since I was taking him out for dinner at a place he chose but id still like to eat a little bit more than free bread), they gave us, what looked like, a half ass made vegetarian option menu that was printed off center and upside down. \n\nWould probably go here for his next birthday, though.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2014-02-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': 'IzpuiSZBhZssnBG-zqlyvQ', 'review_id': 'zzXssUzoYMWOwJ9k6zZ5Pg', 'text': "My experience at Bluewater Grill was one of the best. To preface the story, my boyfriend and I were planning on going to San Diego, California for our anniversary. Unable to make the trip due to extenuating circumstances, we were unable to celebrate our anniversary. Fast forward one week and he surprises me with a trip to Bluewater Grill, which is a good 25 minutes from home. \n\nUpon entering, I was absolutely flabbergasted. I was immediately transported to San Diego, California's the Fish Market. A place that we went with his parents during one of our many trips. Never have I had a bad plate. Everything was the same, but to be honest, it was even better! \n\nI truly had the best service I've ever experienced. I can assure you that we will only ever go when Kat (cat?) is working. She went above and beyond to provide the best service, practically reading our minds. She happily offered things one would normally be reluctant to ask for. Not only was she sweet, nice, polite, smart, but she was witty as well. Very seldom would I write a letter to a manager regarding spectacular service and this is one of those times (I hope the manager sees this review). \n\nSo since the service received 5/5 starts, I would give the food 5/5 stars as well. Although it was a bit on the pricey end, we received the following for $70 (before tip): \n\n1 Spinach Artichoke Dip \n2 Specialty Fish Entrees \n2 Beers (One was super hoppy and delicious). \n1 plate of San Fransisco style sourdough bread (oh.my.god). \n\nWe asked for a little sample of the clam chowder and it was perfectly thin with tons of crab meat. \n\nI got the mahi mahi with fennel, spinach, and tomatoes in a beet vinegrette over cheesy risotto. Holy cow! One of the best meals I've ever eaten. Next time I'm going for the miso salmon and artichoke appetizer. \n\nI expected to walk outside and be able to walk over to Seaport village in California. \n\nAMAZING!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2014-03-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hd3BHvFC0FFYj_Qh8d43MA', 'review_id': 'q0MUtrDGB1-XW2JM66DJgw', 'text': 'First let me start by saying I only eat lobster, no other seafood or fish. We joined good friends at this restaurant tonight. There are no dishes that I would eat so I guess I was forced to order the $34 lobster dinner. I might suggest one non fish item be added to the menu. Anyway I was happy with my meal. The whole Maine lobster was cracked and was very easy to remove from the shell, the meat was very sweet, I had the scalloped potato which was a huge portion, creamy and delicious and broccoli which was cooked just right. The service was excellent.  All in all this was a good experience. Good location, right off the 51. This restaurant is not cheap but worth the money.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2014-03-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'i8eOsY5hLx_Gz4Dprve0_w', 'review_id': 'sirIpPnm12v-wJHirykbww', 'text': 'We are regulars at Bluewater Grill and are never disappointed.  Best seats................The Oyster Bar with John, he can whip up anything and then some.\nGreat food, great service and reasonably priced.  You can always see Jeff, the manager ensuring his customers are taken care of and satisfied.\nAlways a great way to end the evening at Bluewater Grill !!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2014-03-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'vRLA49l9kmGwG-FYfly5vQ', 'review_id': 'NL9c7G6OkEPVVBgiabgy6A', 'text': "IN LOVE WITH THEIR KING CRAB LEGS!!!  Best I have EVER had in my entire life.  Food is UNBELIEVABLE, bread is so hot and fresh, and service is unlike anywhere else in town.  It's a bit pricy, but you get everything you're looking for and THEN SOME!!  Steak and lobster go good together, try the duckets bucket for starters and then dive into the crab legs or lobster.. You won't be disappointed!!!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2014-03-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UMYBiZFOqWRXeqGl6DvNoA', 'review_id': 'afAmhsvXqZrJB0yXAMLDnA', 'text': "My alumni group holds regular meetings here.  Last night, we hosted 60 people(spouses included) in the upstairs and it was awesome.  The upstairs has it's own bar, and food service area so it's great for large groups.  We had a violinist and the acoustics were great for that as well.  We got great reviews from all the attendees regarding the food and we'll definitely keep coming back.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2014-04-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rpjJyqBBEUHTdZrGfCNOgw', 'review_id': 'o9CQca8xB6Zk_MEMi9pdrg', 'text': "Went to blue water grill last night for date night. I wish the ambiance was as cool as the blue sign you see from hwy 51. Was kind of cafeteria-ish, so we sat in the bar like we usually do. Server was nice enough, no complaints, no praise. Sherry's barramundi was very moist and tender with good flavor. Calamari was tender as well as the clams in my chowder. If your looking for a place with lots of tv's and red lobster style cuisine with a little bigger price tag, this could be your spot. My favorite part was the real mounted great white on the wall.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 2, 'date': '2014-04-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rHhSinSiLBhR4SOFE8E0ww', 'review_id': 'OcnjRdmQF3XbQITo_7yoqA', 'text': 'We have been going to the bluewater grill back when it was called the fish market.  We always enjoyed the fish market and saw it had changed names.  we thought that might be a sign of trouble.  But no.  same quality fresh seafood.  slightly different menu.  it seems to be the only big change is the service.  Service has improved.  this has always been a clean casual place but sometimes the service (back when it was the fishmarket) could be a little slow.but it was never bad.  \n\nnow it seems they really try to go above and beyond. about a month ago we were there and and 2 snowbird couples were seated at the table across from us.  2 seemed to be very picky and just couldnt pick anything out on the menu.  the manager strolled by and asked if they had questions.  they were unfamilar with a lot of the types of fish.  so after talking to them finding out their likes and dislikes he made each a suggestion and said if you dont like it let me know and we will come up with something else.  the suggestions he made were not even on the menu.  we were then made aware by the waitress they will prepare your food anyway you want it. if the menu says pan seared trout... and you want it breaded and baked they will do that.  very nice to know.\n\nthis place is nice because it can seat so many.  you really dont get tied up in a long wait.  if you go before 7pm i have never waited.  and on weeknights never had a wait.\n\nalso luv the oysters rockefeller. very very good.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2014-04-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'i8eOsY5hLx_Gz4Dprve0_w', 'review_id': 'kU2uoqTd8gILmPGYKM6W4w', 'text': 'AWESOME dinner and service as usual at Bluewater Grill.  It is great to have fantastic service, food and atmosphere all in one. The Oyster bar is fantastic.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2014-04-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'ST8Yzlk2MqKlcaLqL2djBg', 'review_id': 'FkWHHQ-Orgxt4zNuZVagOg', 'text': "father in town and we wanted a great place to showcase seafood for him out here in the desert. \n\nwe were seated quite fast and accosted for drinks. with Yelp check-in, your first alcoholic beverage is only a buck! the house red was pretty good.\n\nour server was very friendly and informative. it always makes me nervous when they don't write down what i ordered, but it all came out just as stated.\n\ni had a bowl of NE clam chowdah and it was probably one of the best i've had...both in and out of NE. my father ordered a calamari app and it was just the right amnt of crunch and chewy. their 2 dipping sauces were equally great. \n\nfor my entree, i had the baramundi with steamed veggies and spinach. the baramundi was rich and flavorful, not too heavy on the butter. the outside was seared to a light crisp. \n\nour total for 3 entrees, 3 drinks, and 2 apps came to just over 100.oo bucks. not too shabby for a delicious meal!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2014-05-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'TGiDV5YDWl9sTETZeGfUog', 'review_id': 'w2-kBIQyRbvzKEip4p1tKA', 'text': "Overall LOVELY service and good food. If you haven't tried this place you must try it at least once. The Caesar salad did have a tad bit too much dressing on it but very tasty with one solid crouton on top.\n\nIf you're not a seafood eater (I know this is mainly a seafood place) it's very hard for those who don't eat seafood to find a non-seafood dish. But great staff and worth a try.\n\nGoing to give the Oreo cheesecake a try (doggie bag take home) Will leave a tip later on how the cheesecake was.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2014-05-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_IpoQf30o25x0k7D_x01zA', 'review_id': '2mY3kYSIJyUJ51C1TM79Vg', 'text': "Had Nicole as a server and she is the bomb. (Great customer service). My girlfriend and I had a lunch date here and got sushi and some clams. All the seafood was very fresh and delicious. Spoke with the manager that greeted us when we walked in and he was very generous. They are opening one in Coronado, which is in San Diego. Can't wait to visit when we take our vacations there.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2014-05-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kQ_XJIDfq1cUk5Z5-SdmZw', 'review_id': 'fd4v0NU6b3EIh62chuFMaA', 'text': 'My husband took me here for our anniversary and it was delicious! We ordered the calamari appetizer which was great and cooked perfectly!! I had the king crab legs and it was well worth the price!! The waitress was great as well!! Great customer service from her and the manager of the restaurant even came and introduced himself which I thought was nice! Everyone is really friendly and attentive!! This is the best seafood restaurant in town!!! We will definitely be back!!!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2014-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'IjafRfMSAQpInLlw-Vi0Cg', 'review_id': 'dTuc0wkLhmbU_MbT8jqJhw', 'text': "I'm inbetween giving this a 3 or a 4 star. \n\nCame here with the family, so we had a lot of different plates to try. No complaints on the meat, or the cook on anything. Everything was exactly to order. Oysters were good, but the meat was small. Scallops are good here. I recommend getting anything with scallops. All in all, it got 3 stars because it wasn't amazing, it doesn't leave me with the sense of, I need to have more. Definitely a decent place for seafood in Phoenix. ~I would not do the sushi here, just so you know. ~\n\nAlso its pricey, i guess you are getting it imported from another state.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2014-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tnlU8DC1JcUWXzPKDDM1tw', 'review_id': 'qGqdFmV5_XGzcW8dvytPUQ', 'text': "We have been here quite a few times, and have NEVER been disappointed! I love this place! The best seafood place I've been to so far in Arizona.  The fish is flown in daily and is fresh. You can take advantage of their fish market-so many delicious options. (All the fish they serve, you can buy)\nAside from the food-the waiters/waitresses are all wonderful! Today, we had the best waitress! Kat (or Cat) is so knowledgable, patient, and listens to exactly what you want. She knows her stuff and is detailed oriented! We never had to ask for anything-she was right on top of it all! Thank you for making our night great! And we will be seeing the Bluewater Grill again! :)", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2014-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '-od_wK-TIEWe3bg5S4X_Vw', 'review_id': 'Dz50XCy7etKO9ozfE6d4eg', 'text': u"My wife and I celebrated our 24th anniversary tonight and enjoyed a fine dinner.  After starting out with a couple Happy Hour drinks we ordered the crab and artichoke dip appetizer that was a little spicy - perfect!  I had to try a cup of New England Clam Chowder and it didn't disappoint. We both ordered the prawn and scallop kabob.  The were prepared well and really hit the spot.  A little disappointed we only received two scallops.\n\nSince it was a special occasion we each ordered a dessert. My wife ordered a crem br\xfbl\xe9e and I ordered a raspberry sorbet.  I've never seen so much sorbet served following a meal - easily 6 -  7 oz.  Unfortunately I couldn't even finish half of it and it's not something you can take home in Phoenix during June.  My wife finished 3/4 of hers and was more than satisfied. \n\nFrom N. Glendale it's a bit of a drive but looking forward to trying it again.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2014-06-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'yVNcuySUq6P2lW_z4OvIfg', 'review_id': 'tL0nFYF2KgtO-hqU0vDgMg', 'text': "I make a large to go order once a month for a private party. Every month when I arrive, my order is accurate, ready to go. The manager is very kind and always makes sure I have everything I need. I serve the food at a work function and everyone always wants to know where we order the Sushi and apps. We run out of food every time!  I've been ordering for over a year now and I plan on continuing.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2014-06-27', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 1}, 'user_id': 'kHI1UedCN7pNnYEknsmqDA', 'review_id': '2d2qN-ABxvRz3V98n1Iwhw', 'text': "I was taken to Bluewater Grill last night for my birthday. They were having a special on Maine lobsters with 3 sides (corn, potatoes and coleslaw). The food was excellent, the cocktails and wine were awesome, and my bday icecream desert was fabulous!  We sat by the window at the bar (by choice) and had a wonderful time.\n\nOh yeah... and our waitress' name was Chevy, and she rocked!  She treated us great!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2014-06-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'hDTXAP2YLZxGdLNlzwSy_Q', 'review_id': '5IJuIOZBDrIQzIPNuyOpDg', 'text': "Ate there for the 2nd time and boy, was disappointed.  Our entre's were good but the sides were obviously made earlier in the day and then re-warmed, plus they were tasteless.  For $40 for a meal, I expected much better.  Won't return.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 2, 'date': '2014-07-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'MkpMDl_T9PcV1b8GG25VKg', 'review_id': 'iQxjLf8egDGiJ6LdtwJQ8w', 'text': "Happy hour value is exquisite! $5 Moscow mules that were amazing! Great sushi rolls and the baked mussels were fantastic. Overall 5 stars for the food and drinks. Wish I could give ten stars for service... Christy is knowledgeable, friendly, and very attentive. We couldn't ask for a better experience!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2014-08-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'ZsjBAQiO5lNa_Tzlr3_FlQ', 'review_id': 'j0_IO88Z4sdPNx2cHWh4Gg', 'text': 'My wife and I just like the oyster bar, we get the chowder, some oysters and the garlic prawns. Try to order items cooked right there, sets the mood and experience, its cozy, good date spot. Its pricey but worth it.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2014-08-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Cuf3jK64Oayx_sIDIV3iuw', 'review_id': 'Pp3sPGt7gkEKk3iHJpOhfw', 'text': 'Great place--will always stop in when in Phx. Jeff,Mgr.is totally accommodating every time. The prices are Right On as well as the menu.\nThey have a house Chardonnay--Grand Cru--which is very smooth and buttery', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2014-08-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '9-Aj32oAa0oP-RwqMMvsIg', 'review_id': '3vt-n9Fq_2bbZkmNivz4xQ', 'text': "Outstanding. \n\nWe just made the 8 hour drive from Angel Fire, NM to Phoenix, and we were dying for some great food.\n\nGreat atmosphere, and to top it off John (Murphy) at the oyster bar took care of us. Great, fast service with wonderful food quality. \n\nDoesn't matter of you want appetizers,  entrees,  or the  sushi bar...everything is good.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2014-08-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vefFsm6yblXJvsYCZ16-KQ', 'review_id': 'vC1GbIfkD8GhUcRbSBQknQ', 'text': "I'm in town for an hour saw this place on line before we left Angel Fire.  Chef John Murphy is outstanding not only regarding the meal but in regards to excellent customer service as well. Enjoyed it immensity and will be back later this week. Thanks John! !!!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2014-08-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hFh2O43n69ne6kjxeMVGSg', 'review_id': 'WbLurfcOWRQlmsyzrlhnfg', 'text': "This review is for the fish market portion of the business.  I have not dined in but have purchased halibut and salmon to prepare at home and highly recommend buying your fish here.  Far more fresh than any local grocer including whole foods.  It's a bit more expensive but worth it.  I have returned fish to many of the regular groceries around here after getting it home and taking a close look at it...so I'm so pleased to have found Bluewater, this is the only place I will buy fish from now on.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2014-08-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5_WeO8iPVf__YWo2NMc_Ug', 'review_id': 'ZN6N1vglhVCH90VIxkDWxA', 'text': 'CHRISTY provided, hands down, the best service at a restaurant I have ever experienced. She went out of her way to make sure we had the best experience possible at each opportunity and was completely genuine. Food was absolutely prefect and I will be stopping by much more often!! Much appreciated Christy!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2014-08-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'I1LLP2DTMMCpMgEEpw3K5w', 'review_id': 'bFpeZDNgatJ4YTKqkAdEUw', 'text': 'We ate in the sushi bar and had a fantastic lunch.  The service was top notch, the food was fresh creative, and made to our tastes.  Sushi chef Lorry was amazing!  She was attentive and very creative.  Her service was stellar, and her rolls were delicious.  Judging by other people that came in and  told Lorry to "make me something wonderful" solidified that she is a sushi master.  Will definitely make this a go to place for high quality sushi and great service.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2014-08-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'iGB8kIfiet-OlXEfJLarnw', 'review_id': 'sZOyxpNPtKsn-nHr4xjt8g', 'text': "Had halibut. Was well overpriced and over cooked and chewy. Won't go back. Paid over 60$ for mediocre quality.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 1, 'date': '2014-08-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'sHGTjydp0ugMLEBtdW8aoQ', 'review_id': '1PlBKwvE0UFOrHRZnXaTVQ', 'text': '5 stars for happy hour. I live on 16th and Missouri and their is no better place for hh. Moscow Mule, Bluepoint oysters, fish tacos, and sushi fish. Bomb!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2014-08-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'FMUdVddLXnaW5rkL-nQJ2w', 'review_id': 'Y9OacAGuIX3RWvLY1KwPgw', 'text': "This place was delicious! The service was great as well.  I didn't realize there is an affiliation to the fish market in San Diego.  I absolutely love the fish market so this place was just as good.  We had the clams and mussels which were delicious.  I also had the sea scallops which were soooo awesome.  The service was great and our server did a great job of explaining everything.  Highly recommend!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2014-08-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'B6MNUY9PeJydOWs9Vw597w', 'review_id': 'qL_OKFRHDQCY25pZEc5lxQ', 'text': "Co-worker brought me to eat some blue point oysters they were by far amazing! Also had clam chowder which was not awful when you've had it fresh from the sea.\nDef enjoyed the service & ambience.\nPrices were ridicules thought, however it was worth it.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2014-09-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 's4a0_RQfnPZbDM2MccIh7g', 'review_id': 'Ibpr5QFYTG-uPuM5f5J3kA', 'text': 'I came here late on a Wednesday while on a business trip to Phoenix.  I sat at the bar since I came alone and even though it was a bit late, the bartender was very pleasant and gave great service.\n\nI had a cup of clam chowder which was okay but lacked a good new england clam chowder flavor.  I also ordered fried scallops which are one of my very favorite dishes and they came quickly and were delicious.  Very large, fresh and cooked in a light crunchy batter.  My only complaint is that I only had 4 or 5 which seemed too few for the price of the entree.\n\nGood beer selection and it came in a nice mug which was ice cold.  Pricey meal but an overall great experience here and I would recommend it for a nice seafood dinner destination!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2014-09-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'Yw-xww_bW2vHYEpFmw3-AQ', 'review_id': 'TbbStIejMt1KnEQI9LRYiw', 'text': 'Absolutely fabulous restaurant! Had my traditional seafood birthday dinner here this year, and they did not disappoint! They were running a Maine lobster boil special. The lobster was the best I have had in a very long time...sweet meat and perfectly cooked. Our waiter was fantastic and friendly, even despite the fact that we were dressed in our regular street clothes. Will definitely come here again, and again!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2014-09-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7RMLKkeSYXsYmnwTCOze9g', 'review_id': 'YSuFPjAtILc_u5Kw3y6zpA', 'text': u"Had such a great meal here! We were having a serious craving for king crab legs and I decided to surprise him and take him here for dinner. From the drinks to dessert- the food was absolutely amazing. Best crab legs I've had and the best crab legs he's had in Arizona. Had Creme br\xfbl\xe9e for dessert! Totes amazing!! We will definitely be coming back here very soon!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2014-09-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Um1as2HUAbcq1W9HfpM-Kw', 'review_id': '15Erth0nuDitiWeL9Rbg2A', 'text': 'UPDATE: JUNE 10 2015: I stand corrected..Great food, tonight...great staff. great menu. Great individual who made my last business trip to PHX a memorable one. This is for you Meow.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2014-09-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '9w2nryHRRxgudF1i8DJd-A', 'review_id': '_f7ZSeyPTsoSUB_rlhVpLA', 'text': "Went there for restaurant week. I was originally excited. Ordered oysters (not on the restaurant week menu but I'm from New Orleans and needed them). I would've thrown them back, not even oysters.. Far too small. The restaurant week menus consists of a three course meal.. First, we had to ask for a restaurant week menu... Come on! They originally sat us in an odd corner at a 2 person table (yes there were only 2 of us, but we didn't want to sit there! ) so we moved to the bar. Service was slow. We ordered appetizers. The crab cakes were pretty good.. Not the best but good. The seared Ahi came with a ton of food, but way under seasoned and therefore they didn't taste that great. We each ordered the mahi mahi entree... This was fantastic. The only good thing ordered. Must have if you go. Took desert to go. \n\nOverall, the mahi was nice. But that's it. I won't be going back.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 2, 'date': '2014-09-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'CVssZgB_DM2KncaDgu2Uyw', 'review_id': 'fjerZ58uhISAXON3MmMvGw', 'text': 'I gotta give this place another try .. Only been once!  \n\nI ordered fa few oysters during happy hour and a lunch special.  Nothing special about either of the two.\n\nThe 4 star rating makes me feel like I should give it another try', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2014-10-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yGU2uAmmtxPb-_TSatsn_A', 'review_id': 'bUGtuw2hB-4WRM5eZuQDFQ', 'text': 'Great food. A little pricy however its a great date night place.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2014-10-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'sswYaxw2SCb7bVIif2ao4g', 'review_id': 'XpdZkNJ1g9HSsd9n5Bi5pg', 'text': "Not impressed, for what you pay for their entrees I expected better.\n\nI had the linguine with wild prawns. The sauce was pretty bland and the prawns were way overcooked. \n\nDon't think we'll be coming back.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 2, 'date': '2014-10-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': 'cUeFrgBzMhRjOb_6CeGpYg', 'review_id': '7cXs28RxWgVXKKF7pjy8gQ', 'text': 'The food here was great, but the reason this place gets 5 stars is all because of Nicole S.!! She was on top of everything and was so accommodating. She had us laughing like no tomorrow. Definitely request her when you go in! \n\nSide note - the American Mules are out of this world!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2014-10-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zH6UlcLHkxAm_VJj3FqdLQ', 'review_id': 'jjlJ11w8LAwwYhTX0b7NjA', 'text': "Great selections of fresh raw oysters here.  We ordered pretty much every raw oyster dish on the menu, and the best one is Washington's Chef Creek oyster.  Their stuffs are definitely fresh and the only thing that I have an issue with is their raw cherrystone clams, which is not purged completely so we got a bit of sands in the meat.  I would be more than happy to give a 5 star rating if the cherrystones were prepared professionally.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2014-11-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'NNdfPF-UhvLB8FxbsuSC5A', 'review_id': 'KdGMioeA3OVDqbrPOe_Ojg', 'text': "I recently went there again because I want to use their birthday certificate, $10 value off for everything on your bill including alcohol.  You must spend at least $10 before you can apply that $10 credit to your bill.  Make sure you join their E-Crew mailing list.\n\nI ordered Burger Slider because I want to find out how good their fries are, and I must say, the fries was very delicious.  It's very crispy and in big chunks.  Ketchup was the only sauce available to go with this dish; Next dish was the Fish Tacos.  It used to be $5 for two, now it's $6 for two, I think it's a big jump, but it was very tasty and good.  I don't mind paying for more, but I like the size to be a little bit bigger, I finished my taco in less than 3 bites each; Last dish was the fried calamari.  I lope the two special sauces, one of them was the Thai Chili sauce.  The texture of the calamari was improved, but the serving size is still not enough.\n\nI washed everything down by ordering a Blue Moon draft, the glass was iced cold and the beer was refreshing.  My server was Kelly and her attitude was great and service was excellent.  It wasn't very busy as Happy Hour was just started before I got there.  If you want freshness and great service, you have to go to Bluewater Grill.  And make sure you sign-up for the mailing list for your $10 coupon on my birthday month.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2014-12-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mVfsNmewS5KAFbtYlYhxIg', 'review_id': 'yJQnZ6d1uyDsgFDRWCQPpw', 'text': 'They just can\'t live up to the quality and flavor of the previous owners " The Fish Company " .  Sorry but the transition was a fail :(   I miss my go to place.  Their prices went up , understandable, but the portions got smaller and some of the food didn\'t seem as fresh , almost premade the prepared and plated. My honey and I used to treat ourselves to the Top Of The Market where upstairs they had a more formal dining experience. Maybe I\'m being too judgmental based on a belief that if one place takes over another and serves the same food they should be equal in every way. The service is good , the place is clean and the food is ok. Got $$ to blow ? Then you won\'t mind it here. Personally I have to save up to indulge in an evening at a seafood restaurant and when I do I want the quality to be more than red lobster ( which any ethical seafood lover won\'t go to ) so I will be on the search for a new place to spend my very hard earned money.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2014-12-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KGbow8xh9HR1Cq7cLQYPmA', 'review_id': 'YbApXUuceqvXiDrnNwiUfA', 'text': "I come here after a long day to unwind, enjoy some good food and cold beverages.\n\nThey have yet to fail my expectations ad I have enjoyed several different menu items, libations, and happy hour as well.\n\nBartender is knowledgeable and friendly.  I think he's been there for quite a long time.\n\nI'll be back again soon", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2014-12-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'S6bVo0-JOwV4TzLGDRhe8A', 'review_id': 'hbuQPpTMTJJLQlLc3-tBkA', 'text': 'Took my boyfriend here for his birthday dinner. Outstanding service and the food was on point!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2014-12-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'T56twta8fMh4JzJVVYKClQ', 'review_id': 'Rfgo6K4dBimPMIuKrsh0NA', 'text': "Wouldnt want my review of the entire bluewater restaurant to be about my server. Let's start out with the table next to me had a intentive, knowledgeable waitress & The bar tender knows her drinks! (: I will return to Bluewater!!!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2014-12-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'a5YA2YHQSJ-jWdwR2Qq51Q', 'review_id': 'ZnUnUUvYCyLzAAsvoV9hNw', 'text': 'I am always so pleased with the service I receive from blue water grill. The service is superior! The food is always excellent! I will always come back! Thank you blue water grill staff!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2014-12-30', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'VRDiQMV8GN3JySRjmdraEg', 'review_id': '7xkR-9IQKll-QhoQz26Kcw', 'text': 'Great chowder. Both kinds. And fresh bread which is awesome. The menu includes fresh seafood and veggies. The sushi is reliably consistent in quality and flavor.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-01-02', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 2}, 'user_id': 'MqdtOVPREZffdHmRacWKEQ', 'review_id': '5kvjufxFi7-67mmL78NB5A', 'text': '"The freshest oysters in all of Arizona" may sound like an oxymoron, but it\'s what Bluewater Grill boasts. They proudly showcase two types of oysters a day, one west coast and one east coast. That may not seem like a lot but hey, we\'re in the middle of the desert -- what do you expect?\n\nEast coast oysters are brinier and saltier. They sometimes have a funk that comes from the merroir (like terroir but for the sea). West coast oysters are sweeter and have more fruit flavors like cucumber or melon. Pick your style or try them all!\n\nHappy hour prices are pretty good. On weekdays they\'re 3:30 - 6:30 and you get discounts on some food and drinks (including oysters!).\n\nI also tried the King crab, which was delicious but very expensive. If you are sociable and make friends with the bartenders, they may be able to cut you a deal (half order of king crab, for instance).', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2015-01-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'j-kShDJgp5acGhqJAkJHnA', 'review_id': '-D2ci2qAD-21HhA0EpflHg', 'text': 'I first went to the Bluewater Grill years ago when they first opened and was not a fan.  The service was sketchy and food portions small and bland.  I did not venture back for quite some time but was enticed back because of their happy hour.  They have a fantastic happy hour filled with all kinds of great food including Sushi.  They make a Rainbow Roll that is fantastic.  It is indeed the largest rainbow roll that I have ever had.  Another great thing about their happy hour is that they offer it on the weekends from  noon to 5pm, 3:30 to 6:30 during the week.  If you are a clam chowder fan, you will like theirs.  Lots of clams and served with little oyster crackers.  The staff is always super friendly and attentive.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-01-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KpCUBxJfqwC2srtOCtl28g', 'review_id': 'dYfISwa_tpVHWS4tbZbFLg', 'text': 'The best Cioppino in town with linguine, we share the meal. It is a lot of food for the price. A assortment of sea foods in one meal. Best seafood restaurant in Phoenix', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-01-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZGuFSXcUXWYRkfyaJmP34w', 'review_id': '4RT7qXnUacOCCt2JdZs9EQ', 'text': 'The staff was incredibly friendly and helpful in the decision making process - there were many options that looked good and I always have trouble deciding on what to eat at a new restaurant. \n\nI shared the Baked Crab & Artichoke Dip and the Phoenix Roll with my party and they were both delicious. I especially liked the different types of chips used to serve the dip. The portions for the roll were also very large, so sharing with someone else was not a problem.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2015-02-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UAZRK3pBirif1FD0CCiklg', 'review_id': 'eJvZmxrGsCSnqJXYaFFaBw', 'text': "Great place! The crab cocktail was incredible!  Lump crab and some of the best cocktail sauce I have ever had! Clam chowder and the grilled prawns and scallops where great.  It's a sushi bar on the other side.  Bartender and staff were very friendly. Clam chowder is not overly thick-just right.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-02-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vcHR7ZqctdrCiA9Qkjrg8w', 'review_id': 'bdltjm_eNuTGuckCdd8D0g', 'text': 'Our server Kat was amazing. ..the attention to detail was wonderful.  I  found the whole staff provided excellent service and worked not only together but as a complete team. All the customers around us and on the patio received the same excellent service. We will definitely be back. The Beatles were a nice touch!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-02-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vaRv3wLSVroTFxtDD1GMOg', 'review_id': 'N71gy2bBosfte2E6QTHYhg', 'text': "I love this place, plus the server Sean was so amazing and dealt with multiple complaints like a champion and his manager also dealt with us like a trooper! Thank you so much bluewater grill, I know you were having a rough night and thank you for being so accommodating with our group it means a lot. Every time I've been here problems were dealt with so reasonably and I can't thank you enough! I only order sushi and I've been nothing but impressed, their sushi is Amazing!!  I recommend this place in every way. Xoxo", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-02-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'KpCUBxJfqwC2srtOCtl28g', 'review_id': 'jQpgMQPy1HlJ7YvFKqrApg', 'text': 'Tried the Lobster Roll, great choice! Very fresh and the toasted bread accompanied the delicious lobster a plus in my book. A must try if you visit the Blue Water Grill. The service was excellent with Jeff assisting us to get seated, great customer service!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-02-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Xq7STPHTSmUSzFyGpaJO_Q', 'review_id': 'Jfsw1H9MVyEP7nmKmxcm6g', 'text': 'Came here in January 2015 for the first time. Great food and great service. So we made reservations for Valentines dinner. The food was still good but not the service this evening. \n\nThere was an issue getting my wife seated. They had seated me and when my wife came she was told that I was not seated, and she waited 10 minutes or so before they remembered they had already seated me.\n\nWe ordered chowder and expected it prior to the main course.  We waited a long time (eat all the bread) then came the main course - no chowder. When I asked about the chowder they offered to bring it then. Not what I wanted. They offered to package it for takeout. Also not what I had wanted. I canceled the chowder.\n\nThe main course was good.\n\nThe bread we ate waiting for the chowder was good. Wish we had been offered more.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 2, 'date': '2015-02-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'sIVqfGB2Q-p_Zmb87CdLcA', 'review_id': 'AMTcO4CdfG5ns3f4NVKGIg', 'text': 'Always a delight to eat here. Food and service is excellent.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-02-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '66oDhsKSB_eSrhCKiERDow', 'review_id': 'DKtKNxk4toVu79vW2v4KLg', 'text': "Not bad, though I expected more for the prices they're charging.  Great warm sourdough bread that went well with the creamy New England clam chowder ($5.95).  Water was kept filled.  Waitress was knowledgable and friendly, though a little overbearing.\n\nI ordered the tilapia ($15.95) and it was just fine.  It tasted a little muddy, but not nearly as bad as (for example) catfish I've had in the past, and it definitely was better than Olive Garden's.  I didn't try it with its sauce since I don't care for lemon (or capers).  The accompanying French fries were hot and crisp, and much better than the cold (not even lukewarm) cheddar mashed potatoes (hopefully those will be better as leftovers).\n\nThe manager was very pleasant, and I admire that he was out working on the floor.\n\nConsidering their high price point, I don't know if I'll be back.  Maybe for lunch one day?  Or if someone really wants to buy me crab or lobster?\n\nParking was plentiful but the spaces are striped a little close together, and it got a little congested when multiple people were trying to get in and out at the same time.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2015-02-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3ONMeBb2Moxw_HVHvVS1hg', 'review_id': '9a-K0HZxjbx6bxuxACpObg', 'text': ':) Always good food. Happy hour food options are great!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2015-02-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'xhVC6_6UcRjq3WfVzBG21w', 'review_id': 'ZS9CpeDbTRYfNhpPTUczmA', 'text': 'On 2/22/2015 my family and I went to eat at this location since it\'s one of my grandfather\'s favorite places to go on a special occasion,  the food was great . Our server Ericka on the other hand was absolutely the worst I\'ve ever experienced . She never even told us her name until the third time she came and we had to ask. My Father said "hey there" to ericka and she didnt even smile and responded with "hi". She didn\'t ask how any of us were doing , she left us waiting for our water and soda refills for atleast 10mins and she never brought the straw I asked her for. When we were ordering and asking questions about the menu she said "it says it right there on the menu" .I would hope that the server would be a little more informative or atleast polite .\nShe would walk away before we were even finished speaking to her. \nWe asked her to bring two sodas and she came back with one and my father asked her if she could bring out another and she responded "I did bring out another soda?"with the dirtiest look on her face.\nWe were in shock that we went to spend good money on seafood and our server didn\'t even smile.\nI honestly won\'t even go there again I get better service at Dennys if you ask me .', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 1, 'date': '2015-02-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8uWRWCuMxw3xXjlGpQZSXw', 'review_id': 'PhG3V4gDLTp8cYQFT1fG8Q', 'text': 'The happy hour oysters were a little salty.  Grassy bar oysters were awesome.  Ahi tuna and scallops were great.  Very nice place,', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-02-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'SPDowheZHJBe2HkCdf-cZA', 'review_id': 'VcXey3MM0_zvTp-UOOErlQ', 'text': 'Made a Yelp reservation several days in advance. Received an e-mail confirmation when made the reservation as well as the day of  reservation. Also received 2 text message confirmations day of the reservation. Restaurant, however, had no record of the reservation when we got there & did not honor the reservation when I showed them the above confirmations on my phone.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 2, 'date': '2015-02-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Cv3AQHcfUhxp3kBsqw1LkA', 'review_id': 'KoylAS-jmtV8xyf7yoBM9w', 'text': "The staff was awesome they alone deserve 5 stars, very polite and friendly. I ordered the Seafood Louie Salad combo, and well to be quite honest I've had much better. For  the price of it I expected so much more.  It was put together very sloppy and the crab meat and shrimp were VERY fishy and salty. I've never had crab meat so fishy both smell and taste. I couldn't even finish it....What little I did eat came right back out....   I was very disappointed :-(", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 2, 'date': '2015-03-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7xQ-0v072VzqyKucMe6azg', 'review_id': 'mYc4IPxmv7bqUc5w9q3MHw', 'text': "I have to admit I didn't expect much from a seafood restaurant in the middle of the desert.  However, I was pleasantly surprised as the food was outstanding.  I ordered the fire grilled Australian Barrundi with coconut jasmine rice and it was terrific.  The fish was perfectly prepared without a hint of oilyness.  The crab and baby arugula topping complimented it well.  \n\nFor our appetizers we ordered calamari which was good, if unremarkable, however the steamed clams were delicious.  We were greeted with plates of sourdough bread that were hot and tasty and were kept filled throughout the meal. \n\nAs good as the food was, the service was really outstanding.  We were a party of 14, which is a challenge anytime, however our waiter Josh took great care of us.  He was on top of keeping our water and drinks filled, handled our special requests quickly and pleasantly, and got all 14 orders out correctly and at the same time.  He did a terrific job taking care of every need with a great sense of humor and professionalism.  \n\nI'd definitely recommend them to others and will be back the next time I'm in Phoenix.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-03-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '5yYB5_BOqB5YNj8oJZJ2HQ', 'review_id': 'aFRfCzG7vgg8vd29GUGocg', 'text': 'Not bad but not great either. Our waiter was amazing,  but the food was just a step up from red lobster in terms of taste and quality. I would return but only if I was being treated.\n\nP.s- the scallops were good', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2015-03-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QuMyAHpC62CUzPBFZ9ll3A', 'review_id': 'OkYIuE0W40Az4s0xSbARLg', 'text': "I'm sorry, but I couldn't find anything special or different about this restaurant to separate it from a Red Lobster. The portions are small. The price for the portion is offensive. I had the lunch Fisherman's Platter for $16.95. For a $16.95 lunch I was expecting more than 1 scallop, 2 shrimp, and 1 small piece of fish. I should have paid more attention to the menu, but again the description is a little vague too. It states Panko Prawns (not how many). Panko Scallop (notice no plural s at the end of scallop). Beer Battered Alaskan Cod (does not state you get 1 very small piece). Next time I crave seafood I will drive over to King's Fish House at Tempe Market Place. Prices are the same but the quality of seafood and fish is much better.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2015-03-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'i8eOsY5hLx_Gz4Dprve0_w', 'review_id': 'EjKqiKCPnp09yHWWHdbA8Q', 'text': 'Had another wonderful dinner at Bluewater Grill the other night. You can\'t go wrong with a great meal, wonderful employees and fantastic managers.  They recommended a really tasty bottle of wine called Juxtapoz, a red blend that was outstanding.  The Oyster Bar with the "Dream Team" is where the action is....check it out!!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-03-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '-o3uGadqen-bc1HjMx_8Bw', 'review_id': 'yyzERlBc8HfOCs0k-Szq2A', 'text': "Everything starts with a complimentary loaf of sourdough. \n\nThis restaurant is mostly about ambience. You are transported to a cute little wharf. Pictures of the ocean and stuffed fish decorate the walls. There's a huge ship-in-a-bottle on display. \n\nBut when it comes to the food, like everybody else is saying, the portions are small for the price. I ordered the mahi mahi tacos. The fish is dipped in hot spices but it's not terribly hot because the cabbage and avocado on top mellow it out. They were good but not worth the $13.50. \n\nI picked couscous for the side. Their couscous is not what I expected. I'm spoiled by the cracked wheat/vegetables on top variety. Their couscous is composed of large pearl seeds topped with yellow peppers and sliced almonds. It was very bland. It'd be worth the price if you could pick two sides.\n\nOur waiter, Roland, was really chill and personable. However, I can't recommend the Bluewater Grill. Skip this place and head to Red Lobster.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 2, 'date': '2015-03-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'z8okNv7Ghoi6nW3WKs6pvg', 'review_id': 'X9w6vj_-usMMlbrrlIF_Vw', 'text': "Who knew you could get such delicious fresh seafood in downtown Phoenix???\nLoved it!\nI had a really yummy seafood pasta. My husband had the fresh Barramundi. He said it was one of the best he's had. We will definitely be back.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-04-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5rIoqzuE33ArZE9X6KVOEg', 'review_id': 'Ak7mnF0SucKflLzRoYoYHw', 'text': "A friend and I went to the Grill for lunch today and we won't be rushing back!  My trout did not taste or smell fresh!  It was probably not fresh in the first place or had been cooked and then reheated.  I absolutely should have sent it back but I didn't due to a time constraint.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 2, 'date': '2015-04-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'OluX380mMNb2NwqLRuRa-A', 'review_id': '1hF-nWS6mVjlIGlVmpbIvA', 'text': "The San Francisco Cioppino is an incredible dish,  I rarely get anything else when I go to Bluewater.  Wait staff is always on point.  I recently ordered a steak that came out over done, and the manager came back with a perfect cooked steak and took it off my bill, total class.  I wasn't even upset but he took care of me.  I love this place.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-04-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'sxSVlM1EjWDvCA2FXYsk4g', 'review_id': 'ooewLpEUNZkbcHFDPybLkA', 'text': 'Visiting from San Diego and wanted some good sea food.\nFound Bluewater on line and what as great place.\nOur Server Cat was fantastic, she made the dining experience one I will not soon forget. Her knowledge of and enthusiasm in explaining the menu was phenomenal.\nThe food was exceptional Sashimi, Crab Legs, Steak, Trout, Oysters, and Flourless Cake finished us off. We will definitely be going back', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-04-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'WaQV-0itN-SF3etkLJTWZg', 'review_id': 'o3zO0-KOxBDdGggiNmbOSw', 'text': 'Pros:  Excellent weekend happy hour, great sushi and sushi chef, attentive service, conveniently next to Total Wine.\n\nCons: None.\n\nBluewater is part of our weekend routine.  Sushi deals on happy hour are pretty good, and they have a few drinks for around $5.  Honestly the highest quality, least expensive sushi in the area.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-04-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'aE6ft7BJPLmMSu6CtsBjMg', 'review_id': 'a-3pbNSwzc0VnNNzAv01Xw', 'text': "Man, growing up in the northeast we would always have clam chowder when visiting Boston. This place is just as good in my opinion. If I ever crave clam chowder or want a nice dinner, I'll be sure to come back. The prices are expected and the staff is great and attentive. Honestly I could stop by and just have some chowder for a quick meal for a good price. It's phenomenal.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-04-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MlQ8T64p5a3rvjYiPbv4gw', 'review_id': 'M0cdYwn1u8uiRS_a7WMdHw', 'text': 'Perfect. We were in the mood for a beer and seafood and this place came up via yelp. We had the lobster roll, grilled artichoke, and a dozen oysters.  Service was top notch and so was the food. We will be back!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-04-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WaEC63NNe-2MCk2ovEy_Sg', 'review_id': 'zqNNU0ljza2qP4OgANGXWA', 'text': 'Great date night for seafood and sushi. I could taste the freshness and clean preparation of the food. It seamed that everything was placed on the plate with care and guest perception. Loved this place. Blows the socks off red lobster, joes crab shack and pappadeux or however it is spelled ha although those establishments are reasonably priced and good, blue water grill is the aces. Enjoy!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-04-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0Atvj4LPl6YqDrcbCAbRug', 'review_id': 'd090N252YL3HrpGUfwFfyQ', 'text': 'Exceptionally great \nFavorite restaurant in Arizona \nNice, professional, friendly Manager,\nHard working waitress \nI love Bluewater Grill', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-04-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wdfxHpq0Kf-I_lqS9dmSdA', 'review_id': 'KexVeXllYWau248E0SVxbw', 'text': "I have to say, I've been here a few times, but this last trip was really good!  Had the soft shell crab roll which although was fair to high in price....was worth every cent!  Also tried the baked mussels which was very good.  The fried calamari was actually the best I had in years.  Also had the osysters rockafeller.  Have to say they were really good.  The only dine side was that you got more of them when it was Fish Market.  BTW, I shared all this food with a friend and we ate every peice of food it was that good.   I will be pack with other friends in near future", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2015-04-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kGxcdE3Lhm9sMnCAe2YFFw', 'review_id': 'HjOft1Th70Ut6CgBE1xlWQ', 'text': 'The food was good, but for the price, I was a little disappointed.  The staff was very friendly and our waitress was great.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2015-05-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'U_1RG4bMR7vd_qX2ALIj8A', 'review_id': 'YF6VnZNck4tMz7ExcvXQ7A', 'text': 'Great manhattan clam chowder!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2015-05-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'pQ6ij6cOBRB3yJGHbVZHUQ', 'review_id': 'WdC5kMdU9wzakAKK6Wosrg', 'text': 'The food tasted OK and the service was above average. The value at their price point however, is not. My wife ordered the halibut and I had the scallops & shrimp skewers. There were 2 scallops and 4 shrimp for $26.95??? Halibut "market price" was $32 and change?? We probably will not return.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2015-05-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': 'Ggjr75J7geUifR5Oska8mw', 'review_id': 'luYgWj4_KwNIuWGIQR7ZRA', 'text': "If you're looking for a fresh fish in the valley, this is the place to go. We ordered salmon and Phoenix roll and both were super delicious. Ambience is great but the service... Not too thrilled. That's why I'm giving them a four. Our server was somewhat rude and a bit odd! He also screwed up the bill twice and said that it's because of their antiquated computer. I will still come back though and hope that we won't get him next time!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2015-05-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'nZj3XjaDF5L025_BsG-8MQ', 'review_id': 'JbVRybLnmzSEiiPOfKY8lw', 'text': "I really loved the food here. Salmon was fresh and delicious. The Phoenix roll was good too. I wouldn't recommend it though if you don't like sweet tasting entrees. Also, if you're mostly wanting sushi rolls, I probably wouldn't recommend this place as there is only 5 rolls to choose from on their menu. If you're looking for fresh fish entrees, give this place a try! A bit pricey, but definitely worth the cost.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2015-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uImNN2lIygBD_UguQcJiEQ', 'review_id': 'R5wl26TcrMjhrOtpiD3Xyg', 'text': 'The seafood is fresh and delicious. I ordered the fish and chips and they were cooked excellent. The tartar sauce and coleslaw is house made and great. Reasonable prices drink menu is good.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2015-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'APcVBxRZsiAYX6em1MNaTw', 'review_id': 'ZYDbiJjL-59x67d315-nUA', 'text': u"Great ambiance, great staff, great food. Their happy hour is great and the sourdough bread is the best. I love sitting at the oyster bar, especially when Mark is working. Try the se\xf1orita roll or the crab Louie salad. Can't go wrong! Pictured is the Bluewater Roll. Perfection.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KiNy4wkkQnq4LPm__hNl9g', 'review_id': 'MSjDL8jEjj5w7GI_bukEvw', 'text': 'Food was delicious. Service was fantastic. We all ordered crab legs and I may be bias since crab is my favorite but I loved it. Everything was great about the place. Definitely will be back in the future.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-05-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'dtErUkGCDTwJNjy-U4az6A', 'review_id': '73OJZKKJkEi70wkyA_XYLw', 'text': "This is my favorite seafood place in Phoenix. Service is pretty standard but the food is just phenomenal. The fish is fresh and beautifully plated. I'm always sad when I finish a meal here because I don't want them to end! The music playing is always fun and and they serve the best bread while you wait for you food. They also have good happy hours and offer a Yelp check-in offer (as of May 2015).\n\nBonus: they're next to the Total Wine store.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-05-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JSAJZZ9EC9FAqG6RD6ZKEQ', 'review_id': 'SuIfkuFJTpd3IK2AptwhmQ', 'text': u'Great seafood fresh and made to order! Because of dietary restrictions, I struggle to find restaurants that can accommodate me, so finding one that accommodates me and is delicious is a real treat. Not only were my prawns and scallops wonderful, but the chef made sides (jasmine rice and garlic saut\xe9ed spinach) that were perfect. My husband greatly enjoyed his cioppino, and our friend (a local) had never been here before and was delighted with his meal and will come back. Our server (Chevy?) was very cheerful and attentive, and was very careful to be sure we were all pleased. One extra touch: we were trying to decide on a wine and she brought us samples of the ones she recommended for us to try. Her suggestions were great, but we all liked one very much, and were grateful for the tasting so that we had wine we all enjoyed,', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-05-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8uWRWCuMxw3xXjlGpQZSXw', 'review_id': 'xIaQN_66sOQqP_p6iuLvuA', 'text': 'My second visit. Sat at the oyster bar. Staff is very friendly. The blacken fish tacos were very good. The non happy hour oysters were delicious. The blue points were ok.  This is one of my favorite places for seafood in phx.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-06-04', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': '0wtf_m6GxSBGmr_KvTHPOg', 'review_id': 'TBviGyrgeqSSG8cwQ3ZLmg', 'text': "I took my wife my sister and her husband to the Blue Water grill we had fresh fish some muscles and couple of drinks.\n\nThe bartender at the front bar had the nerve to proposition my wife and sister while my brother and law and I went to the restroom.\n\nWhen we got home we all have a terrible bout of food poisoning which lasted for 3 days.\n\nSo we were very disappointed with the Grill's food and its' no class bartender", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 1, 'date': '2015-06-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Jxglcb4AYPobU1_lOtZDnw', 'review_id': 'xFqvWrmzqmWlADrkEyzcTA', 'text': 'This place has good food, but the portions are very small for the high prices they charge.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2015-06-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'sswYaxw2SCb7bVIif2ao4g', 'review_id': 'wsn3UDmZJ1zIB0CUxoDvLQ', 'text': 'What a difference, from the previous time we were here. This time I ordered the Cioppino with pasta and it was very good. Our server Erica was excellent and very attentive she did a wonderful job and we will definitely be coming back.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-06-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '3hMP1xJ1egtG913C_fXgDQ', 'review_id': 'N1dLyVkwYuUvdHEphuf2Ng', 'text': 'The bread was really good to start the meal but my crab cakes were just okay.  I was really happy for the drink special from Yelp because that helped ease the pain.  Service was just okay as well.  It took a really long time and the restaurant was really empty.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2015-06-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'MyOhc_wvzQUluLYytPxWUg', 'review_id': 'N3lmETrdLI5J1_kEx42ZCw', 'text': 'Great oysters, seafood dishes, and friendly staff.\n\nGreat place to go when in Phoenix!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2015-07-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9MvcUhmwMH9DtM73QRfQcQ', 'review_id': '8MB-tilNSywMQtKZLZNnJQ', 'text': "Server was good and the food ended up being good after an hour waiting for our entree.  The ambiance and atmosphere did not coincide with the prices that were a little high.  Maybe if I had an ocean view our lake view it would warrant those high prices. Sushi prices were outrageous  didn't even try it.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2015-07-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KpCUBxJfqwC2srtOCtl28g', 'review_id': 'RctTG8bTsU1Vxfd2W_s4DQ', 'text': 'Best fish & chips, and best clam chowder in town! The cioppino is the best next to san francisco fishermans Wharf restaurants.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2015-07-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'fdZNvExlO-RuRL3cuRbq1A', 'review_id': '43WuS8RJJw92fM-skRgAcQ', 'text': 'First time I trying this place ... Came during Happy Hour they offer a good range of selections on the happy hour menu. Had the Seniorita Roll delicious! Also tried the wild prawn cocktail it was awesome. Best part is using the Yelp check in feature and getting a well drink for $1 ! Will definitely return!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-07-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HQbh9Erc_UKHJaiaWDqfVg', 'review_id': '_luiLeF981nS7cfDuv5w1g', 'text': 'One of my favorite seafood places in Phoenix area. In my option, i believe they have the best seafood in the valley. We have been there few times and every time the food is great and always taste fresh! For Seafood the price is about right.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-07-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jbeNMx3zV0yg6kGUwbeTbQ', 'review_id': 'Ova5C9GfmD-at0O8ku35ow', 'text': "What an awesome experience. Good customer service was not missed for this business. From the moment of walking in the door until we left, we felt welcome and appreciated for visiting the establishment. I would recommend this restaurant to any who live in the area or just visiting, like me. The staff is totally the best. I can't wait until my next visit to Phoenix to dine here.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-07-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6YB7nN2wwdmpgwCaSPSjVA', 'review_id': '5JlvUXqTD-h_-Lk_HkkIbw', 'text': "Wow!  Been wanting to try this place for a long time - what a great experience!  Went at 3 on a Saturday...happy hour special and ate off the lunch menu for those watching their pocketbook.  We started with the lobster dip and I shared the admirals bake and we added a skewer of shrimp.  Absolutely delicious!  The potatoes they serve are little orbs of gold!!!  It's perfect if you don't want to leave overly full.\n\nWe cannot wait to head back.  Very very soon!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-07-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'Dpi50FrVtvy8Sh7TVbwetg', 'review_id': 'QJxdmjh4yixF7KsLoIDaSA', 'text': 'My folks get fresh fish from here. Always very excellent tasting. I would recommend this spot to any seafood lovers.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-07-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ofxlhi_HKp7myFDpwg9aIA', 'review_id': 'AE-XmWZ7VFoEM9x73sa0Nw', 'text': "Came here with my GF the other night she had never been here and she was craving seafood and I didn't feel like cooking salmon so I said lets go out to eat...I just want to say if you plan on dining here...make sure you come with no less then $60 in your wallet this place is not for the cheap, for 2 people our tab was close to $80 without any alcoholic drinks.  \nSo to start we ordered the Crab Dip for our appetizer, it is very very good and they give you a pretty good portion, we ran out of dipping bread before we ran out of dip. \n\nNow from the way it was described to me I thought the salads were included with our entree, but apparently it is a separate item. I didn't realize this till I got the check... I got the dinner salad almost $6... so not worth it, my gf got he Tuscan Caesar almost $8...not worth it...even thou these things are ginormous I could get a full salad bar somewhere for this price. The salads were good and big, but not worth the $14 I spent on them. \n\nMy gf ended up with the Mahi special and I went with the chicken special. These were both pretty well prepared. My gf thoroughly enjoyed her plate and we kept trying each others dishes. Both of these items together were over $40 They were good, but they didn't stick out as being great. Just kind of OK. \n\nAll in all this place is ok, the service was slow, I had to ask two different passing by servers for drink refills, and for more bread and I think its a bit overpriced. This place may have gotten 4 stars if the service would have been a bit better and the staff would have explained that the salads were additional and spent more time tending to us.  \n\nI have been to better places, I would be willing to give this place another shot.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2015-07-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'WPXEos5Hw5LN3HeOkC7tlA', 'review_id': 'ZtEou-gtb182yGMu21NPiw', 'text': 'I have been going to the Bluewater grill since it was the fish market.\nI take my grandson for the crab legs that are expensive but truly amazing. They cost less than the so called fish restaurant Red Lobster who tried to give him snow crab legs because he was only 10, under the guise of being king crab legs.\nFood always good and fresh , I expect to pay a little more because of the freshness.\nNever been disappointed in food or the service.\nGoing there at the weekend!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-07-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'YzdIgL9yuoxIFyAvkSn0Qw', 'review_id': 'X_KDp3JhduC8d3BhzqnnXw', 'text': "We started off with a half dozen Oysters on a Half Shell and they were delicious.  They were so good that we contemplated getting six more but didn't because we wanted to try their Clam Chowder.  I am not sure which one it was but it was the cream kind.  This was my first time ever having clam chowder and I loved it.  For dinner I had the Fire Grilled Mahi Mahi which was in a creamy herb, leek and ramano risotto, white wine rapini, olive oil poached shallots, garlic heirloom cherry tomatoes and balsamic syrup.  The dish in a whole worked very well togeather but my fish was a little over cooked.  My husband got the Pan Seared Pacific Rockfish which had a roasted red bell pepper polenta, golden tomatoed and Tuscan kale, and was finished with a citrus burre blanc and pancetta lardons. Suffice to say there was not much left on his plate when he was done.  This was not the first time we were here and it will not be the last!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2015-08-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'D6VcEnYtfnXqC74aUWmckw', 'review_id': '7e0nC9nYXumRc6Dgmmfgdg', 'text': "My wife and I went here for our anniversary.  Walking in a got a little nervous as we immediately got a whiff  a heavy fishy smell.  We then realized that they had a small market in the front of the restaurant.  They sat us toward the back and the place was not very busy.  The restaurant decor kind of reminds you of a Mcgraths.  I wasn't quite sure what to expect at this point.  Our server came over and everything was excellent from that point on.  The service was perfect.  Drinks were tasty, my wife had something with a strawberry mash in it that was great.  A small, but nice selection of craft beer on tap.  Then our dinner came out and it was delicious!  I had the fire grilled mahi mahi and she had the fire grilled barramundi.  I would highly recommend both!  I had them leave off the balsamic syrup on my mahi, which I would recommend to anyone to do the same.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2015-08-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '5yqY7NJo4YY3nDsaO-HHzA', 'review_id': 'UmJ5X4BgAe9bE0cRGm_2Mg', 'text': "We visited on Father's Day, this review is late...I know.  We made reservations, which we really did not need, they were not too busy.  We had oysters to start, this was my first time trying them, they were delish!!!  The order came out with different types of oysters, that gave me the opportunity to see the different textures and flavors.  Our entrees were delish too!  I had the paella, my hubby and mom had the Mahi Mahi.  Both were very good as well, with a rich and creamy risotto.  Must try the bloody mary if you are a fan of them... this one came with a giant shrimp and all of the fixings.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2015-08-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LiIQDKORaAYL1JG9g4AIKg', 'review_id': 'KvQcPttiddlDFOvQU8ExxA', 'text': 'My wife and I had dinner there and was fairly satisfied.  The service is good but the meal was just okay.  I thought we were in time for Happy Hour, so we ordered a wine and a cocktail only to find out the Happy Hour is only in the bar, not in the restaurant!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2015-08-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'idEOQq28C7SuX1AlESbLjQ', 'review_id': 'kyrrEXNXHmZEekm25NzPeA', 'text': 'Tried sopporo in Scottsdale tonight for the first time.  The decibel level with the bombastic stuff they call music still has my ears ringing.  We cut our visit short just to escape the racket.  \n\nBlue \nWater \nGrill is the place for us.  Nice quiet ambience, great food, nice people, extensive menu (even my picky grand daughter can find something to enjoy).', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-08-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0JyFz2WalnpDoLZGXOUpXg', 'review_id': 'mkNY6Ayslwpzn2198kxfjQ', 'text': 'This place is absolutely the best seafood restaurant! I ordered the sea scallop, cioppino, barramundi, and wild prawn linguine. All of them are above par!! These are the must tries here. I would especially recommend the barramundi and cioppino with traditional white wine sauce. Their white English clam chowder is super amazing!! Our server, Cat, was super attentive, helpful and friendly. She is the best!!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-08-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'CTVmDq-NSxwcOzHzBvIOYw', 'review_id': 'IaRK4VXJli3Kxb7k92wskQ', 'text': "When my husband and I moved to Arizona two years ago, we were skeptical that we would find good sea food. I certainly didn't expect one of my favorite restaurants here to serve sea food, but how wrong I was!\n\nWe've been here numerous times since finding the Bluewater Grill this past winter. We also make a point to take all of our out of town visitors here; it's by far one of our favorite places to eat in the valley. The staff is friendly and also very knowledgable about their dishes. They are always happy to provide recommendations when asked and to date haven't been wrong. \n\nMy husband and I have had tried a variety of things on the menu and don't have a disparaging word to say about a single dish. Their clam chowders, both the New England and Manhattan are superb. The Oysters Rockefeller is one of our favorites and the oysters on the half shell have always been very fresh and tasty. My husband typically gets the lobster, while my current favorite is their Barramundi dish. It is cooked to a delicate perfection, although every fish dish I've tried has been cooked well and very good.  We haven't tried the sushi, but the fish market selection always looks great and I haven't heard anything but good things about it from fellow patrons. We prefer to sit at the bar and have always heard good feed back from fellow customers. On that note, they have solid bar and cocktail menu as well. Would definitely recommend it. We drive from the west valley regularly to feast!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-08-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DKawGKKwNQ3lxXHGORsL3A', 'review_id': 'J-EAPE4hrstGvZ_dsUN0bQ', 'text': 'Fresh seafood and great lunch service. A great after meeting place for lunch. 2 kinds of chowder for die hard chowder lovers. Mahi  tacos are fantastic and the sour dough bread is the real deal. Sushi is available and the swordfish was so fresh it seems they caught it right before we ordered. \nThe interior of the building is looking a little worn and could use some freshening but go for the outstanding fresh food', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2015-09-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IUn9YT4-9r28c18GfJc3lg', 'review_id': 'vfO40sJ3I5lUybT8BamPCA', 'text': 'We ate lunch here yesterday, after I had a doctor\'s appointment in Phoenix. We aren\'t from the area, and had a few hours worth of road travel to get here. \n\nI chose this restaurant based on yelp reviews, and by the "best seafood in Phoenix" award.\nI also wanted to try oysters for the first time. Bucket list item. Being that this is the desert, I wanted to make sure what I had was fresh! And with the claim of freshness, I thought this was a good choice.\n\nUpon arriving at lunch time, the restaurant was not too busy for a weekday. Decor was decent. We were seated quickly. The waitress came to take our order and I told her it was our first time there. She asked for our drink order. I told her about the yelp well drink offer and brought up the offer on my phone. She looked at it and seemed annoyed. I ordered a mojito and was curtly told that would not count as a well drink. In house beer, wine, basic only. We chose another drink and ordered our other drinks, as well. The waitress left.\n\nWe then received our bread. I it was barely warm, stale (not crusty, stale) and the butter was solid. A bad mixture. We ate part of it and were disappointed with it.\n\nThe drinks arrived. The offered well drink was quite watered down and not good. Only drank about 1/2 of it. \n\nWe ordered our food. I explained that i wanted to try the oysters on the half shell for the first time and was nervous, and what to expect. I asked what choices there were. She told me of two choices. I asked the difference and she told me the difference between the two. I ordered the blue point, a lobster roll with cole slaw and a bowl of chowder.\n\nMy other guest ordered chowder, and we split our food. \nThe chowder was decent. I have had much better. A lot of sand in the clams which was unpleasant and not good for the teeth. I should have said something about it, as it bothered me a lot.\n\nThe oysters were fun to try and really good. I could tell they were fresh, and that pleased me. By far the best part of the meal.\nThe lobster roll was ok. The lobster wasn\'t that fresh and a bit chewy. I have had a lot of lobster in my life, so I know how it should be when it is really good. The bread on the sandwich was a little over grilled. The cole slaw was ok but rather plain. We didn\'t eat much of it.\n\nOverall a pretty big disappointment, other than the oysters. Service was sorely lacking for such few customers. The lunch came to over $50, which was definitely over priced. \n\nNext time we are in town, I will choose a different restaurant as our food was not worth the cost and we weren\'t impressed with the service.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 2, 'date': '2015-09-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'NF9_Fm4dvaZhvzQUL-XknQ', 'review_id': 'q_iOmLtc3RULxuvXu-UKPQ', 'text': "I can't get enough! Best seafood restaurant in the state of Arizona. Reminds me of eating back  East at legal seafood!", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-09-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'enioUICbBzCIPqSZ9JL8jg', 'review_id': 'QXsYkpXvBFlcso9POMlmzA', 'text': 'So I\'ve been coming to this place when it was the "fish market" for over 20 years. Now that blue water grille has taken over they have taken a step back in quality. The so called French sourdough bread that used to be at the fish market is nothing more than white bread with crust, so when one wants to order the garlic cheesy bread and it\'s made on this cheap white bread its deplorable "cost cutting measures" no less, yes it\'s warm like it\'s made in house but it\'ll never be the same and for that reason alone I\'ll never darken there doorway. \nThe New England clam chowder that used to be soon great is garbage now. Why would you change something that was perfect.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 1, 'date': '2015-09-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jaTGwwgDtgW7kK8Wl5UHhA', 'review_id': 'SWtserJ3TN2V3Sefr5Ebpw', 'text': "Great service and our server Rachelle was wonderful. She suggested the Senorita Roll and it was perfect. Ordered the fisherman's platter for my lover and I had the Ahi with grilled palenta and coconut rice. Will be back and hope to have her as our server again.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2015-09-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '6D6eWZywk3tGrgDhkvh6LA', 'review_id': '2G94DEWg2ZNW3wuxqnca1w', 'text': 'You CAN get fantastic seafood in the desert! No really! Like, fresh, awesome, delicious seafood! The staff is top notch, the prices are right, and the seafood is absolutely stellar considering we are nowhere near an ocean. Bravo. Will absolutely continue going back to this place. \n\nSeriously, after 5 years in New England, both the Mrs. and I were blown away by Bluewater. It reminded us of our local haunts back in Boston and was an all around incredible dining experience.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-09-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'R0rhfiNW78Dzc3C3yhJPkQ', 'review_id': 'rmUamR39vLiHAWOfYTui6Q', 'text': 'I tried this restaurant today for lunch. I had the BLT with crab and it was fantastic. Living near the coast, I am used to fresh sea food and this place seems like it was transplanted directly from the edge of the ocean. They have tanks and everything so it truly is fresh. The food was great but, what impressed me most was the staff. Everyone said hello to me when they walked by, my waitress was so kind and I saw regular customers greeted by name as they walked in. I will be back and I will bring my friends!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-09-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'aJE3egcCZrmZrc8ImHiXnw', 'review_id': '232QZFNEFvXeOJZot3FD_w', 'text': 'I am now a HUGE FAN if the FRESH Oysters. They were fantastic. We visited from Northern AZ and I was stunned to find a place like this in the middle of this dessert!!! - Although we found the place fine with GPS, the sign was quite big but the access via the mall parking lot is kind of tricky. Also there was a very pungent odor of seafood in the lace, a bit overwhelming, but the ambiance was delightful and perfect for my husband and I to celebrate our anniversary. We had the Maryland fresh catch of the day oyster platter and WOW!!! Not a fan of the Sushi we ordered, but I must say that the service was fast and friendly. We will definitely come back for the Oysters ;-)', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2015-09-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DvK6uh2YRP5PgDBlgDJK8Q', 'review_id': 'fnO_W9AxeO0Xw2U1kwJbfw', 'text': "Delicious seafood! We went here last night for happy hour. Blackened fish tacos- DELICIOUS! Senorita Roll- DELICIOUS! Ahi tuna appetizer- DELICIOUS! The calamari was also decent, but was definitely outshined by how delicious the rest of the food was. Other reviewers didn't seem to love the service, but we sat in the bar area and our waitress was fantastic! It is definitely a little pricey, even during happy hour, and the drinks we had were nothing to write home about, but we will be back (during happy hour) for the food! Plus if you sign up in advance for their emails you can get a $10 coupon towards an appetizer or cocktail (it took a few weeks after signing up until the coupon came).", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2015-09-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'xDqtmmn9GeqE5E4iEOTQSQ', 'review_id': 'yZ3U7PPXCM6UVqrGtqZGsQ', 'text': "It's OK. The clam chowder was not really flavorful like other clam chowders that we tried, the roll with seared tuna was edible, and the key lime pie was just wrong. So, nothing to write home about.  Will not re visit this place ever.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 2, 'date': '2015-09-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8_CxN4S4AXA0PsUA4kiEOg', 'review_id': '7hUghtGA8ajQmvRNTP3Rgw', 'text': 'The Swordfish is great!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2015-10-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WLZCEJAYADEDs_MZltFW3A', 'review_id': 'FWKBLrnD2fk5nttwMwzTyA', 'text': "I don't know why this took me so long to review, I first dined here back in May and was instantly in love! When I moved to Phoenix I was really sad that I would probably be missing fresh seafood more than anything, but Bluewater Grill has it, and it is on point! I've had mahi mani, snapper, and a couple other fishes, all fantastic. The mahi special with risotto is my personal favorite. I've also dined at the sushi bar a few times (happy hour every day 3-6) and would say they have the best sushi I've personally had, and the chef is very nice. Oysters on the half shell, delicious as well. You also have the option to purchase market fresh fish from the restaurant, which I keep forgetting but is definitely on my list. If you're someone who fishing and fresh seafood are important to you, and found yourself somehow in the desert, you won't be disappointed by this restaurant. It's also my go to place to bring visitors from out of state.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-10-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'b_fE6IWu4hXYbo-yfHZ6Hw', 'review_id': 'iE0SJ0H0_r8ryWOtoM4xXA', 'text': "Came here for a birthday celebration. The value of the meal for the price was very poor. I've eaten here quite a few times, but it has been about 7 months. Thank goodness the clam chowder was the same but the $8 small water glass drink - not worth it, the $13, 5 shrimp cocktail appetizer - not worth it and my 4/shrimp/2/scallop skewer with fried polenta and green beans for $23 - not worth it or my son's San Francisco Cioppino for $25 - definitely not worth it. The birthday dessert was a brownie with vanilla ice cream and raspberry sauce drizzled on it which was fine. But the waitress didn't even bring it, someone from the kitchen brought, stuck a candle in it, lit it and left. We just sat there looking at each other.  Another table had a birthday and their waitress actually brought them their dessert and sang! By far the worst meal and experience we've ever had here.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 2, 'date': '2015-10-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'RbvmE5X2LRGDq1of0fcO0A', 'review_id': 'ht4p8PPS7rf0U_6nk1w31Q', 'text': 'It was our first visit and it was great. The atmosphere was like being at the ocean. The fresh fish display as you enter the cheerful smile from the hostesses.   So glad I brought my Jeanie here for her birthday dinner.  She was craving steamed clams.                                            And our waiter , Rolland (sorry if the spelling is wrong)  was great ,  cheerful, helpful and really enjoyed  him going over the menu and choices . His Mustache was a eye catcher too :)  .                                                                                                                                         Again, for our very fist visit to the Bluewater Grill we are looking forward to coming back and is now one of our favorite places to eat.\nThank you for a great evening.                                                                \n\nTom and Jeanie', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-10-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zp33vVHaIvQsyGNYAEexTw', 'review_id': '9qG4w_SbFPCVi2kYrHlpAQ', 'text': "It was a special occasion, my sister in law's birthday.  I was impressed by our magnificent waitress who's name I can't recall but she was really helpful and kind. Our reservation was at 6 and we were seated promptly waiting for our sons to get there. We were made welcome and soon had the party together for delicious food and our usual passionate conversation. The Barrimundi was especially good and the cake was a great ending to a wonderful meal.  We will be back.  Another compliment to our waitress. We were the Dena Cady party if that will help identify her and give her the kudos she deserves for a job done well.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-10-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XyFgRUJYpGvJLZtnsslAuQ', 'review_id': 'yXQRj0nXctHOm7LJqaeY9Q', 'text': "Happy hour is such a great deal. Blue point oysters are so awesome. Also had calamari, chicken wings, fisherman's platter, sushi, and lobster roll. Everything is top notch, superb quality, so fresh. Had a dark and stormy, and margarita from the bar, delish!!\n Creme brulee was perfect too. Love this place.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-11-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rNsrJbJZl43uFoFIJ30jdA', 'review_id': 'Hrtj1sGLg6xBoc5lH1IK_w', 'text': 'Good service and great walleye fish dinner, just right. My husband got a craft beer, 4 peaks, very good. Service was great, friendly.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-11-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'a5YA2YHQSJ-jWdwR2Qq51Q', 'review_id': '1-8G_hhFOHN_nL0AHSa-HQ', 'text': u'My fianc\xe9 and I drive all the way from surprise to come and eat here as much as we can. We have been coming here for about two years now and we are always greeted immediately, they remember us, and we always have the best service! Katherine has incredible customer service skills! She is extremely professional, and is always so kind. The environment is always welcoming and everyone is always smiling! I tell everyone I know to come here because no matter where you go; the staff, the food, and the atmosphere will never be as extraordinary as the blue water grill! Thank you so much for giving us such an amazing experience every time we come in! :)', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-11-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CljUjBfCB3TKUWbMfHv-BQ', 'review_id': 'WwD7qXGS0mTrqDnxenc2mg', 'text': 'Mark is the man! New to the area, and this is our favorite spot. Great food and service.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-11-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'dXcDIxbDcYdzoNuyOKMEOw', 'review_id': 'Zxplfj_4mZ_cr-ZXVdr4gg', 'text': "I've never sat in the actual restaurant. We always come and sit at the oyster bar. Let me tell you it's delicious. The boys there are so nice and friendly. They know exactly what I want to drink and they keep it coming. \n\nThe steamed clams are perfect. The prawn cocktail is so fresh. \n\nWhat really makes me coming back is how well we are taken care of. Tonight the oyster bar was full and I could have taken a seat at an actual table. Instead I decided to wait for seats to open up. Meanwhile one of the gentleman brought us drinks for our wait. \n\nI highly recommend blue water grill to everyone I know in the area. Thanks for the great food and service.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-11-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rHhSinSiLBhR4SOFE8E0ww', 'review_id': 'oyQ-yA1o1bRYuEvAcgwTZw', 'text': 'in the last year we have probably gone 6 to 8 more times for lunch and dinner and i have to upmy star count from 4 to 5 stars.  the food is always great and perfectly prepared.  and the service is always on point. and if you compare prices to comparable seafood places its on par. quality fresh seafood.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-11-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VD4E91XNSP8_B5fit__u8w', 'review_id': 'X4Nmfs4UfYeMa2klL6nZRA', 'text': 'this place was just OK the rock fish really had no flavor the seemed vegtbles were over cook but tasted good service was OK he was training someone I will go back to try something else maybe', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 3, 'date': '2015-12-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6GCr7RatMmRSs48JFmcA9A', 'review_id': 'g-4jB4PqcjdW4y47ssZS9w', 'text': 'The cioppino is absolutely delicious! I had it twice in the two weeks I was in Phoenix. The amount of seafood in the soup is fabulous: fresh crab meat is mounded on top of the soup (so you can eat that alone, free of the soup, if you wish), and there is a scallop, shrimp, mussels, clams, and pieces of some other fish within the not-too-spicy tomato base. Have is served over linguine - it does NOT disappoint! Our servers during both visits were very attentive and helpful with menu selections. Would definitely return!', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 5, 'date': '2015-12-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mrtNCCx4dICEyatdBCpOwQ', 'review_id': 'QbZ908VZN8rqLua_PcCC6g', 'text': 'This place is just okay. Need to get over any images one may have from the days of Nick\'s , which I know I had (busy fish house in late 1990s). The place has aged, but the food was decent and service not bad. Visited on a week night so things were slow (though it is the holiday season). My guess is it\'s getting trumped by all the "hot new" in Central PHX these days. Go if you really want seafood but it might feel a little like Red Lobster.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 2, 'date': '2015-12-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'omnsw0ricecFkI977r8PvA', 'review_id': 'rIUR8FbskE9N98w86xYkUg', 'text': 'Everyone liked their appetizer, entree and dessert with one exception.  My fish was overcooked and dry.', 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 4, 'date': '2015-12-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'YpzSEDNJ3jGYVjSJf-N5nw', 'review_id': 'Xr3V5LedjW9ZuGk2r2_avA', 'text': "I made a reservation for Christmas Eve two weeks in advance. I asked them to confirm that they would be open and the young man asked his manager. The manager confirmed they would be open for their regular hours and my reservation for six people at 8pm was gladly accepted. So when we arrived on time and found the restaurant dark and empty, we had to scramble to find anything else open. I'm used to Chinese food on Christmas Day but it was a poor substitute for the usually fine seafood and service my family has enjoyed at Bluewater, formerly Fish Market, for over twenty years. No phone call. No warning. No notice. Just a big helping of disappointment. Bah humbug.", 'business_id': '2qqzGBLM9VFwjIuiEKHspg', 'stars': 1, 'date': '2015-12-24', 'type': 'review'}
