{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'wADjHJw7ZTDobphQSLnEow', 'review_id': 'sAgRpJezAbiNP_T178lXyQ', 'text': 'The Harbor Palace is a large Chinese restaurant on the West side of the Chinatown Plaza, and a place that I used to patronize quite a bit when I was hanging around Chinatown with a martial arts school I was involved with. Anyway, it stays open late, til 5 am, and appears to be very popular with the Asian community for larger family dinners.. they have a private banquet room as well. It is usually very busy, but if you keep vampire hours, it is one of the better options for dinner at 3 or 4 am. \n\nThe menu is heavy on esoteric East Asian food....a lot of the menu is not the same old "safe" Moo Goo Gai Pan, but everything I have had there is great.  \n\nHot Pot dinners appear to be also very popular there, with the table-top heated pot of heated oil or water and a plate of various meats and vegetables that are dipped in the pot to cook. I have never gotten around to trying that, but I would like to. \n\nThey also do great Dim Sum, with an endless parade of ladies making the rounds with carts of very cool, exotic stuff that you just have to try, because asking what they are or what is in them is pointless unless you speak Chinese, in which case you probably already know what they are. \n\nFor Yelp\'s obviously large Asian readership, I would say, give this one a shot...it is most definitely intended for you more than non-Asians, but those of other persuasions with an adventurous palate will be rewarded for their daring.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2007-02-01', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 7, 'cool': 5}, 'user_id': 'zTWH9b_ItSdLOK9ypeFOIw', 'review_id': 'ZWnQu_NVVLexfSQaBu4W1A', 'text': "Heading to the heart of Las Vegas's Chinatown, I'm checking out Harbor Palace Seafood Restaurant for their dim sum.  It's about 1 pm on a Saturday and this restaurant isn't as busy as I had hoped.  (Not a good sign.)\n\nMy friend and her dining companion are already enjoying their Pineapple Buns with Egg Custard when we arrive. This is definitely a good sign!  (I'm not sure if the buns were hot when they came out, since I arrived a bit late.)  I enjoyed the sweetness of the custard, but the BF found it to be too sweet for him.\n\nWe ordered their standard shrimp dumplings and pork dumplings.  Both were standard.  They even had the Shanghai dumplings readily available as well.  They were tastier than Orchids Garden's version, that's for sure! http://www.yelp.com/biz/Jur1iiejUFw_YCkfDfy1gQ?hrid=aU3RP30FNJmzdi1e-Ksa-g  And since the red vinegar is left out on the table, you can feel free to drown it as much as you'd like!\n\nWe also had Chinese broccoli, shrimp on tofu, crab/shrimp puff thing, shrimp rice noodle, and chicken feet in black bean sauce.  All were pretty good.  We even had the salt and pepper shrimp that came right out of the kitchen, so it was nice and hot.  \n\nThe downside?  Service was blah, I mean really blah.  The ladies never smiled or showed any personality whatsoever.  And the guys working there were not that great either.  They refilled our teapot, but left it on the far end of the table, out of our reach.  One lady was very indifferent as she slid our order across our table.  They were quick to clean up our plates once the bill was settled, which can be a good or bad thing.  (It usually means they want you out of their fast so they can have the table back.)\n\nInstead of sending the carts to the back for refills, they have waiters carrying a bunch of dishes in their hands or stacking them up and then placing them on a the cart.  I'm not so sure this is visually appealing.  \n\nThe bill was about $40 for four, not including tip.  We found this to be a bit more expensive than Orchids Garden and Chang's Hong Kong Cuisine since we know we ate less here.  (The BF wasn't so sure we got the correct bill even since the guy handling all the checks seemed quite unorganized.)\n\nOverall, the selection was there, although lacking in desserts.  (I did see the sweet tofu come out, but no custard tarts!)  They did have a few things that some of the other dim sum restaurants didn't seem to have.  Sometimes you get the feeling they are really trying to push a dish on you.  I mean, how often can the congee lady come by asking if we want congee?  Because the restaurant is a bit smaller and they don't push the carts into the back, you'll find the ladies 'idling' by one side of the restaurant, which was pretty much hanging out by our table.  They could really use a lesson or two in customer service.  If they can fix this a bit, I might even be willing to give them a better score rather than a stiff 3 star.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2007-02-06', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': '23zYCcnqfru5jdxnTqjgDg', 'review_id': 'mOqGOga8RWM8c98z-s0mkw', 'text': 'Today I realized I haven\'t written in sooo long. It\'s funny reading these reviews due to the extremes of "Yea it sucks" - " Eh middle" - "WTF THIS IS FANTASTIC" . So I\'m not sure if I\'m being retarded...but I always get great service there. Maybe it\'s my wit, and charming personality....good looking, dashing, debonair, fun, smart,......yea...But this isn\'t a review about me. \nOne thing I like - LATE NIGHT! I LOVE LATE NIGHT AFFORDABLE DINING. ESPECIALLY CHINESE! Because you get that craving on Mmmm I\'m hungry. But the cool thing about chinese is you can eat a lot - 20 min later you\'re hungry again! I\'m not sure if it\'s MSG...or it\'s the little parasites living in everyone\'s body from swimming in infested rivers. \nTo be honest. I like the food here. It\'s definitely chinese. But at the same time they do serve to curve the All American Apple Pie Appetite with things like orange chicken, lemon chicken, broccoli beef....zzzzzz Oh I\'m sorry if you order these things...STICK TO PANDA!\nIt helps if you\'ve been to a chinese restaurant with a chinaman. Because they can order! They order fast and in small syllables. Next thing you know you have a feast to feed a small village. \nI do like dim sum here....mmmm dumplings, shrimp or pok. Mmmm and the sesame ball. Ok so good. Good for vegetarian too. I find myself typing but in my head I\'m speaking in a chinese accent....Weird.\nI think they\'ve been friendly to me because I\'m filipino. Oh yea that\'s it. Because the menu is catered to filipinos. Sure I can read most of the Tagalog on the menu. But where\'s the filipino food?? Oh...Rice....', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2007-07-03', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 6, 'cool': 6}, 'user_id': 'pz97SxRe1Vk-5_K6EB9OSA', 'review_id': 'uMPAEqv-xv5iGDYpsmhdSw', 'text': 'The restaurant itself is nothing to shout about, nor was the decor nor the service. In fact, the service was pretty god damn awful to say the least. But then again, this is a Chinese restaurant and everyone knows service is going to be bad. If it were good, I\'d be shocked.\n\nSo after several attempts at trying to find good dim sum, we ventured to this place after I saw it advertised on the Chinese channel while watching TV in the hotel. Believe it or not the hotel had Chinese satellite TV feeding from Hong Kong. I was up late watching old Cantonese soap operas -- but I digress.\n\nSo anyway, one of the places advertised was this one. Hubby thought for sure the food was going to be good seeing it obviously catered to a Chinese clientele. Well he was right. The dim sum, although not artistically created into teeny weenie morsels, were done well. Not only that but everything tasted good. The tripe was steamed with ginger and scallions -- lots of flavor, not like the one at Chang\'s. In fact, the har gow was also very very good (unlike that of Chang\'s). Cha siu bao was above average (and I don\'t even like cha siu bao) and so was the stuffed bean curd sheets.\n\nI was a bit annoyed at the fact that when I asked for iced water, they kept passing the buck to someone else. Finally I just yelled out at a dim sum lady who then yelled out to \'amigo\' in the back who rushed out towards me. Before he could even walk 5 steps I yelled out "DOS AGUAS" and he immediately turned around and got us 2 iced waters pronto.\n\n4 stars for decent dim sum.\n\n1 star for service.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2007-08-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TPWJIxCS8RZuFpz9yyEjyA', 'review_id': 'HxOtftDl06YyWvLHWoUJxw', 'text': "Ahhhhh, I was so pissed after I got outta that place. In one point of my life, I was totally fascinated with dim sum and for my 21st b-day, we decided to go to vegas (so typical). I am proud to say that I was sober the whole weekend. Anyways, we went there only a Sat. morning and it was pretty packed. We had to wait for about 30 mins. First off, the dim sum here is expensive. I think that's the only thing I remember besides leaving the place and regretting I went there! haha", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2007-09-15', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 1}, 'user_id': 'WmAyExqSWoiYZ5XEqpk_Uw', 'review_id': 'G8TVeHOu3GreyOs9LSspQw', 'text': "I only came here once and it was after a looong evening of drinking and gambling.  The food was fine for what it was...nothing to write home about but I had never been so dehydrated in my life the next morning!  Ofcourse more restaurants serve food high in sodium but I had never felt this bad before.  So what's the point of all this?  I guess I am saying there are a lot of better/healthier choices for drunken food.  Fatburger would be a good example.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2007-11-04', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 1}, 'user_id': 'OGOqf0K2Q341apiyRx3t_Q', 'review_id': 'ESV9Z4vUIdaJESxSlaEq_A', 'text': '2.5\n\nMost of us would agree: At 3 AM, just about anything you put in your mouth tastes pretty good.\n\nTired and hungry, I was more than happy to let my chinese dining companions order. Many of our desired dishes were actually not on the menu but  the owner was more than willing to accomodate. Just keep in mind that you may be paying a bit of a premium for your special requests, like $14 for a bowl of rice porridge! Holy rip-off for rice porridge, Batman!', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2008-02-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'lDwOde3TvOH0UFrGL_H27w', 'review_id': 'HOnSdeAQxWQjhf2MK5BItA', 'text': "This restaurant had a rather high rating which I thought would impress my asian elders on our recent trip to Vegas.   \n\nI've been here in the late hours to eat peking duck which wasn't bad, but wasn't great.   \n\nThen I decided to bring a party of 17 to this restaurant for dim sum on Sunday and made reservations.   \n\nI was asked why I chose this place as everyone was disappointed that the food was not that great.   \n\nIt's hard to explain, but it's just hmm...\n\nService was good.   But the food just didn't seem up to par.   Was it bad?   Not really... but it wasn't good.   \n\nThe place we used to go to on decataur which tends to change ownership or names every time we visit (yearly or longer) that I thought I would check this out.   \n\nThe other place had poor selection of dim sum vs. this place, but the food was tastier, hot, etc.   Here is was just... average.\n\nSo I hope the rating drops below the 4 stars because this is not above average and while I would go there again... I must protest their dim sum is not the best and what's funny is that the elders I brought would have rather gone to the restaurant with less selection and packed.\n\nI rather enjoyed not having to fight to get food, but oh well... relaying the message of the party of 17 so that Yelp gives a better or accurate score.  \n\n(Yes, you have to assume that I know what I'm talking about :^P)", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2008-03-07', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'I3QDSkHyHUd3wlmRUb0eyg', 'review_id': '62R5wDTGrtNn9mTMSDyziw', 'text': '4:30 am - SO\'s "weekend " begins, we played a few hours of poker and i\'m starving yet damn tired ...i\'m up for my $2 bk at the cortez room at gold coast ....closed for cleaning ....DAMN !!!  SO talks me into chinese ....Harbor Palace it is .....after 8 days straight of eating chinese ( in china ) i was able to go 5 days of non-chinese food ...uintil now ....squid w/ veggies ( squid very tender, veggies...tasty ...good dish ) chow mein ( huge plate of noodles ...fried...decent...a little dry () and hot/sour soup ( SO always rolls her eyes when i order ...but it\'s not bad , a lil too strong on the black pepper taste but overall, not bad ) \n\na little under $30 .... for late nite / early morning decent place ....if "normal " hours, just an average chinese restaurant.\n\nHappy Eating !', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2008-03-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PQVBhDFe14RZIP_o7ioBZQ', 'review_id': 'qJUU8t5-TB4MAEwcgUGjGw', 'text': 'Discovered by my little sister she suggests I go here, we all meet up around 3pm for a late lunch and the place is pretty empty so we get prompt service. The place was a little dirty, burned holes in the plastic (smoking in vegas? ;) ) but let me tell you about the food. \n\nWe ordered two fish dishes and a chicken dish along with dim sum. The serving sizes were nicely portioned we had tons leftover. And those who never eat fish were eating the food here and asking for me.\n\nWant to know what I ate? we had to call it all chicken for my little niece to eat any of it, so the dishes were scallop chicken, white chicken, and just to tease her mind we called the chicken dish -- fish. And wow was she proud to tell her mom she liked fish :)', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2008-03-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pDRb-eS7lcBQ__pJz072Ng', 'review_id': 'QXTzawhBLzLn6kJCgf_pUg', 'text': 'I came to this place a couple years back. Harbor Palace Seafood Restaurant was a pretty good place to eat. I enjoyed the food that had here.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 5, 'date': '2008-04-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'YO0zOiU_bdkbhGkeIId3jA', 'review_id': 'nYDbzE17XXEO3G8sr-RXvA', 'text': "it was nearly 6 oclock and the restaurant was empty. \n\nthey gave a lot of food for the food. couple of the dishes were salty and filled with MSG. although i must agree that there was a couple other dishes that were pretty decent. \n\n\nquick review, i'll revisit when i have time", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2008-06-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'N2B7jCkHlBieeVFdAKHkAw', 'review_id': 'PmkW-ieBMhDThI1P_DrJyg', 'text': "Harbor Palace serves up average dim sum with a few above average items. The har gow was above average, while the 1K year old egg and pork porridge was bland and tasteless. Other items including the char siu bao and spareribs in black bean were acceptable and average.\n\nThe decor was a bit of fusion between Southern China and Vietnamese dive. Plenty of neon signs all plugged into few outlets which left me eyeing the emergency exits in case of electrical fire. I spied a couple of them moving waterfall art on one wall, which amused me with its tackiness and plebian charm.\n\nPrices for the dinner menu are on the high side, but that seems par for the course for LV chinese food. You won't find those family meal deals available at 99% of the California chinese dives.\n\nService is standard dim sum which means little to no attention. No surprises here. At least you can tip 10% without any guilt whatsoever.\n\nI have a feeling this place is the only game in town for acceptable dim sum, smack dab in the middle of Chinatown. Please prove me wrong!", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2008-06-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'I3QDSkHyHUd3wlmRUb0eyg', 'review_id': 'p1L1B6-F1zJ498jFwXAOUQ', 'text': 'A regular late nite/early morning stop for gf and i  but we finally hit the place for dim sum this last sunday.\n\nThis might be our new "go-to" dim sum spot - Orchids used to be our place ( prior to that chang\'s ) but given their shutdown ( i assume a temporary thing ) for health violations, we need to find a few spots ( we still like PPP ) \n\nGF and I agree that the dim sum was consistently served hot and fresh.  The standard dim sum fare ( served on carts ) but the gf thought the selection was limited and nothing unique ( i agree on the uniqueness but i was ok with the selection ) \n\nthe price is also a little higher than the other places ( $39 bill for the 2 of us - that\'s the most we\'ve paid for a dim sum meal ) but i was so appreciated of the food being well prepared, hot and fresh.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2008-06-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pipzYENeK_CXKpbb0qqpUg', 'review_id': 'UYTcYEwQnVWJ-oqb3LM70w', 'text': "Don't come here! Worst Dim Sum in town...everything was super greasy and didn't taste good. Some of the dishes seems like it was from yesterday. The (Hum Sui Kok) was greasy, soggy and not crispy. Would not come back here again.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2008-06-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'th2B9oqcKUr-FnulGz7nMA', 'review_id': 'MUnQvDC08gmcFXjMpGwNPA', 'text': 'I stopped at Harbor Palace for a late breakfast (AFTER shopping at 99 Ranch Market:--note to self--eat BEFORE shopping for groceries...) right when they opened at 10 AM.  I was extremely hungry, and extremely happy with what I got.  I was too hungry to wait and see what all the carts had on them, so I went with char siu bow (bbq pork buns) and the sticky rice dumplings wrapped in leaves.  Then, call me a fool,  I simply had to have the gai lan  (ChineseBroccolli) with "Korean Sauce" poured over it.  \'Bout the only asian foods I love more than gai lan are fresh lychees and Peking Duck  The gai lan was just as good this evening as leftovers, reheated with a little bit of deep-fried tofu.  I thought the service was decent, not unctuous, not friendly, but decent.  The decor was a bit battered, but I\'ve yet to eat in a Chinese restaurant that has both beautiful decor and great Chinese food.  I\'ll try to go back once a month and eat my way through all the different things they have to offer on their dim sum carts.  That is, AFTER I try the Chinese BBQ place in the same center and Ping Pang Pong at the Gold Coast this Thursday...', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2008-08-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'XsjNluwx6oJdEoTwloWy_Q', 'review_id': 'gc_ZlEfA7csfqRJ03jmNpw', 'text': "We come here almost every year when we make our annual trip for a basketball tournament. They advertise that they have dim sum everyday, but we always go for dinner. Restaurant hours are certainly accommodating to late-night gamblers: 10 AM - 5 AM. They have a couple of separate banquet rooms which can accommodate large groups -- hopefully you won't need one at the same time a tour bus pulls in.\n\nOn our latest trip, we had: fish fillet with black bean sauce, string beans with minced meat, shrimp w/ lobster sauce, deep fried salted & spicy squid, the house special chow mein, orange peel chicken, and eggplant w/ garlic sauce hotpot.\n\nThe good: the string beans were fresh & crisp, and the eggplant hotpot was very tasty. The Hong Kong-style chow mein was very good as well.\n\nThe bad: fried squid was unremarkable and the chicken in the orange peel chicken was tough & chewy.\n\nThe ugly: the fish fillet w/ black bean sauce & the shrimp w/ lobster sauce both had way too much brown/white onion. The shrimp w/ lobster sauce had only six shrimp, and the lobster sauce had pieces of pork, which is something I haven't seen before. The flavor for both dishes was good, but just not enough fish or shrimp in each.\n\nOverall, the food is probably pretty good for Las Vegas as far as being authentically Chinese, but the quality of some dishes isn't as good as you'd find in a community with a large Chinese population (i.e., LA or SF).", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2008-08-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ROwi7cR5FsJOA_P_z3I9bA', 'review_id': 'HPy3H4WWupTwEj8wkcUk5w', 'text': 'If you need to get your fix of chinese food in vegas...this is the place to come!  The best part about it is that it is open past 3am!  The worse part was that our food took over 30 minutes to come!\n\nI highly recommend getting the Singapore style vermicelli noodles.  Sooooooooooo gooood!', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2008-09-02', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 1}, 'user_id': 's3Z6zuj4qzbz5VySoNZikw', 'review_id': 'JYpWg1TbGL_-kjnNXwCEkA', 'text': 'Sam woo was closed so we had no choice but to eat here and we got it to go and took it back to our Hotel room. We found and effin worm in our Kang Kong veggies!!! and then to top it off an hour after I was throwing up all night! Disgusting! Do Not Go here!', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2008-09-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': '362cIkFRui9KKvea0FQ8FQ', 'review_id': 'm2TE1oSN0043Mvgz-nuRmg', 'text': "This place is open till 5am but I'm not sure if it's the best time to try out their food. Our big bowl of jook didn't have much preserved egg and the shredded pork in it was rather dry. The texture of the porridge was on the thinner side and had an odd anise flavor.\n\nDry fried beef ho fun was on the oily side and the noodles seemed more al dente than they should be.\n\nOn choy was nicely cooked and seasoned very well, my favorite dish.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2008-09-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VAC80tw_xGBR3gkvCSppoQ', 'review_id': 'NAcoCY0G9opAzQdnYFtOmg', 'text': 'We went here around noon for dim sum.  \n\nOne of the things that initially bothered us about this restaurant during the first few times we went was that they had a $10 minimum purchase amount to use credit cards.  \n\nWell today when we went, our bill was about $34 for the three of us.  We decided to just have them split it between two credit cards.  The waitress came back and told us "sorry, we have a $20 minimum purchase per card".\n\nWhat????  The fact that they raised their minimum credit card purchase to $20 was annoying, compounded with the fact that the bill was over $20, and she didn\'t want to do it just because it would have been split between 2 cards.  I told her she had no choice but to take the cards because it\'s against VISA and Mastercard\'s rules to impose minimum purchase limits, and they could lose their ability to accept credit cards if we reported them.  She either took my card, or she didn\'t get paid at all. Simple as that.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2008-09-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'v6NHDoNKvcoU0nwLeBl19Q', 'review_id': 'UM1RfnH1j3WnIkVxKbH1ZQ', 'text': 'Came here with the family last night. Service was mediocre. We asked for some pepper and the girl looked so confused. \n\nWe ordered five dishes and they all were either too salty or had no taste. \n\nThe only dish done well was the the garlic veggie dish which is a standard at any Chinese restaurant. All around disapponting.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2008-12-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'A43V-IweZIQkbMnvKf0vrw', 'review_id': 'kGl_MIxGZMJ_PxwNFO0diw', 'text': 'Let me just say that I\'m Chinese-American, first generation.  Grew up in Boston, where there was always good Chinese restaurants, dim sum or otherwise.  Worked with my father (as a kid) at one of the restaurants he worked in (as a busser, the bar boy or general help).  And, of course, there was mom\'s and Grandma\'s cooking, and my friends\' mothers\' cooking, so I would say I\'m kinda in the know.\n\nI\'m in the military, since 1989.  Where I currently live, the only Chinese you get are the buffets, which to me is catering to the community, which doesn\'t have a large Chinese community, if you catch my drift.  I understand that business is business, and some of the restaurants are trying to sneak in some "real" dim sum items, but still ...\n\nWent to LV a few years back, and found out that there\'s a Chinatown.  But I\'ll call it what it is:  Asian Alley (I should say Avenue).  There\'s a large selection of Asian businesses for what you want:  Chinese, Japanese, Korean, Thai, Viet, et al.  (My sister, who lives in LA and occasionally trips down to LV, didn\'t even know until I recently told her.)  It had been years since I had dim sum, and was hurting for it.  Drove down to Chinatown (it wasn\'t too developed back then), and found Harbor Palace.\n\nHarbor Palace reminds me of the dim sum restaurants I went to while growing up.  The food and atmosphere takes me back, and I\'m a kid again, a kid in a candy shop.  If the candy was dim sum.\n\nWent back to LV temporarily in 2008, and decided I will have as much dim sum as I could stand for lunch and dinner (I would get take out).  I would eat at least $20 every trip, so I spent over $250 in less than a month, and that\'s just on dim sum only.\n\nFound out a few months ago that I\'ll be moving permanently to LV around May 09, and you can bet  your ass I\'m heading back to Harbor Palace.\n\nOkay, here\'s the food review.  If you\'ve never been to a real Chinese restaurant, give it a try.  The food you find in buffets is analogous to eating Taco Bell for Mexican.  You\'ve had beef before?  Chicken?  Shrimp?  Pork?  Then most of the dishes you can eat because you\'ve had it before, either as a burger, buffalo wing, or so on.  It\'s the way the food is prepared that I think scares people, because they\'ve never had it cooked that way before.  If you ask the staff, they\'ll tell you what the protein is; vegetables are vegetables, and everybody needs more veggies so eat up.  The dim sum dishes are cheap enough that if you get a dish and don\'t like it, it won\'t be an expensive experiment.\n\nSome may say that the service is a little off-putting, because of attitude or some imagined slight.  That\'s just the way it is, folks.  People go to France and talk about the rude waiters there.  If you already know and go, then why grouse about it?  Keep in mind the staff at the Harbor are immigrants, and English isn\'t their first language, so please be gracious, patient and understanding.\n\nWhy not 5 stars?  With the amount of money the owner(s) got coming in, the place could use a tune up.\n\nOoh, and don\'t forget that there are fish tanks, if you choose to pick your own victim for a meal.  Or, let the kids stand by the tanks and let them watch the fishies swim.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2009-01-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7fGncdxZo-SVfgpxm_52Cg', 'review_id': 'UkrTpIJKEmjLk8_XYuO_TQ', 'text': "pros... one of the few dim sum places we found in las vegas.  i'm sure there were more, but this one was the one we went to.  close to the strip, lots of parking, a big aquarium with a few gold fish, somewhat helpful waitresses.  \n\nnow about the food.  i would come here mostly for the steamed foods.  so the har gaw, pork shumai, cha shu baos, and the steamed rolls.  the egg custard tart was also so good.  the only fried item on the list that made it was the fried sesame balls, which we only tried the yellow bean one, cause they do offer a black bean sesame oblong as well.  the best thing was the sweet silken tofu dessert, which was spot on, and is probably the best tasting, well syrup wise, that i have had.  it was smooth, light, soft and very warm.  the syrup was just the right sweetness without being too sweet, and the ginger taste was perfect.   \n\ncons... well where should i begin.  well the place was a bit run down, carpets need a steaming, the chairs and tables were also very run down.   neon sign not working, and the windows were pretty greasy.  \n\nthe wait staff must have been afraid of me and the wife with the boxes of chinese herbal medicines on the table, or were they just ignoring us for the first 10 minutes.  but then they came by and it was good from there.  \n\nthe fried foods were disappointing, egg rolls were soggy, no sauce with them.  fried noodles also no sauce to accompany them.  somewhat a bit greasy with the fried foods, sounds wrong but if you fry things correctly you get very light and relatively oil free foods.  think of a good tempura, which is light and not greasy at all.  enough said.  all in all just a 3 star place.  when i go back in november i'm finding the other dim sum place in las vegas.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2009-01-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mjj23sMqkPeIUGjiDR_sjg', 'review_id': 'X-tbFDoG8wgVCciTXEKF2A', 'text': 'I was actually trying to eat at Ichiza in the early afternoon, which is in next building over, but I forgot to check that they actually opened up at 5pm.  Still being guided by my rumbling stomach, I looked at nearby restaurants in Las Vegas\' "Chinatown".  While walking around, The Love us on Yelp Sticker on Harbor Palace\'s door caught my eye.  I thought to myself, "How awesome!!  Another loved yelp spot, the food here must be great!".  Oh how I was wrong.  Immediately, when I got in there, the atmosphere was dreary, somewhat old fashioned, and a little unkempt.  I then thought, " Well, maybe all the energy is poured into the excellent food and service, yelp will not let me down!  Again, I was completely wrong.  I started with the noodle dish and BBQed beef, and I ended with those.  I second that prior review, the noodles were both bland, dry, and greasy if you can believe that.  The BBQed beef was damn near all fat too.  I was like "What the hell?  I didn\'t remember ordering a big dish of just meat fat."  This place needs to be checked out by the restaurant sanitary inspector because it looks a little dirty.  My waitress even brought out a disgusting looking fish bucket to show the table right behind me.  What was that all about?  And to top it off, I waited nearly 20 minutes for the waitress to bring me back a doggy bag.  My bill was 20 or so dollars for some reallyyy crappy food.   I felt ripped off, let down, and regretful I even entered the door with the supposed "They love us on Yelp" sticker.  How did they get that sticker?  Did they steal that?  Well, I sure felt that they had just stolen my money.  Avoid this place if you can.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2009-01-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'sDDVSSr9DZFGhexEt3ifnQ', 'review_id': 's-FVGRCK37OUsGskoCeokQ', 'text': "I'm not really sure what the rest of the dim sum scene is like in LV, but I thought this place was pretty good. We waited about 5 minutes for a table on Sunday around noon and although the dining room is pretty small compared to the giant places in SoCal, it was pretty packed. There was a decent selection and I found all my favorites including a few new ones like the roast pork. I just wish they had one of those carts that grilled up the radish cakes instead of putting them in the steamer. \n\nThe 4 of us ate until we were stuffed and the bill was only $32! I think this is a great option when you've had enough with the buffets and just want something different. Plus they're open from 10 AM to 5 AM which is crazy, even by San Gabriel Valley standards!", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2009-02-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fG5DvscEidPKEnYfZUoILg', 'review_id': 'kzJRoMzLSFpmbRWvQCWXZg', 'text': "The portions are huge and it's GOOD! When I try new restaurants, I always order my favorite dry fried string beans. This restaurant is among the best I've had.\n\nAlthough the decor is tired and dated with poor 'cloud' paint job on the ceiling, the main dining room is airy with tall vaulted ceilings.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2009-03-02', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 3, 'cool': 3}, 'user_id': 'Q3fOGZT4YlIZu1gLDooxrA', 'review_id': '4ZP1duyTaoKVpExev5gzHA', 'text': "I had a craving for dim sum during one of my regular weeklong vegas trips, and i've tried other restaurants in the strip mall this place resides, so we gave it a go.  The dining room is pretty rundown and the tables and chairs looked like they had been through the ringer a couple times.  \n\nOn to the food.  The carts zipped around pretty quickly, and i was pleasantly surprised that the service was clutch.  I was seated furthest away from the carts so i had to get up every time to see what they had.  Despite that, good service i must say.  I will list the foods (some with my patented terrible description) that i liked and didn't like:\n\nLikes:\n-chicken feet - i like to eat these things, but i think it's cooler to watch other peoples' grossed-out expressions when i do eat them\n-smelt - surprisingly flavorful\n-spare rib - tender and tasty\n-shrimp dumpling - basic but good\n-the flat thing that tasted like shrimp and looked like an egg, also good\n\nDrinking haterade:\n-all egg rolls were bland and blech\n-calamari just ok\n-the steam rolls i had were kinda cold and blech\n-other dumplings we ordered (not shrimp), take a pass\n\nSo some good and not so good things here, thus my useless 3 star rating.  I will continue my vegas dim sum search to other places, though i may come back here.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2009-03-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'ipbvpgecCA0lPLecBNxUQw', 'review_id': 'cleagqRub_JhXcwAsQSO_Q', 'text': "Went Easter Sunday for dimsum with our Chinese doctor friend and his precious family.  Even with 6 of us, we couldn't begin to try all the things I spotted.  I disagree with Keith (which is unusual), in that I thought they had enormous variety.  You definitely need to go with a large group of hungry adventurous eaters.  We had everything from  taro cake to shark fin dumplings, chicken feet, seaweed salad, crispy tofu -- tofu so many ways I couldn't keep track, simple things like eggrolls, dynamite dumplings of all shapes, sizes and fillings...we had chinese greens and bao buns that were to die for.  Our host explained that we should also order something from the menu -- he picked his favorite soup -- fish maw...but wouldn't tell us what it was until we'd tried it.  I liked it -- until as he suspected -- once he told me what it was -- then somehow it didn't taste as good anymore -- and I'm pretty adventurous...\n\nHe also ordered walnut shrimp which were also great - but one bite put me over the edge -- and I couldn't eat another thing....\n\nI saw lots of things going by that I'd have loved to try...but it will have to wait.  \n\nWe met our host at 11:30 and it was packed with a wait.  They have a separate room for large tables -- 8 or more -- which seems to be the way to go, interestingly, to bypass the line.\n\nThe owner is a good friend of our host's and picked up the check -- so I have no idea what the bill was and never saw a menu....what I can tell you is that we were the only non-Asians that I saw in the place -- and that, to me, is always the best sign of where to find something truly delicious and authentic to eat.  My husband offered to work for free for the owner because he was amazed at some of the dishes served...\n\nWe'll definitely be back for more.  And I can't wait to see the menu...I've about decided I must have been Chinese in another life...\n\nnow  if only I can find my favorite Northern Chinese dish...mock peking duck...", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2009-04-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fDoRfe_kP9N98eWM-8vJpw', 'review_id': '3eCYiYnPYh6dAvMVp9gyXg', 'text': "This was some serious good eating! I wasn't aware of Vegas' dim sum scene, but this place offers simple, traditional, tasty and pretty good service of dim sum for the area. The prices are very reasonable! \n\nThey have the little push carts that go around and that's a rareity to see these days in many of the new dim sum tea houses. It does help to speak the language (Cantonese or Mandarin), as the ladies on the carts will be more attentive to what you want to try or eat. \n\nWe ordered the usual items like ha gor (shrimp dumpling), siu mai, steamed pork bun, chicken feet (yes!), pork ribs, congee with preserved duck egg and some other items.  We fed a party of 3 for only $40 - not bad! And, we were full at the end of our meal. \n\nThe decor is a bit old school, so don't expect to be wow-ed by the restaurant's looks. Parking can be tough on the weekends, but there is a big lot. You just have to drive around a bit to find a spot. Otherwise, this place is a steal.  I would definitely come back again!", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 5, 'date': '2009-04-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'A43V-IweZIQkbMnvKf0vrw', 'review_id': '4fDF7eGERHeqSHVg8GCaQQ', 'text': 'As I had mentioned earlier, I finally moved to LV. Unfortunately for me, I caught a bug or virus or something (will sleep it off after this review) on the drive down here. Wanted something from HP, but nothing too greasy. \n\nWhen I was inching past Hoover Dam, I thought, "Why not won ton mein?" (For those who don\'t know, it\'s thin noodles with won tons and some bok choy in chicken broth.) Not the most complex, but it satisfied a need. Asked for some char siu (boneless spareribs), and dinner was complete. \n\nOh, and they did update the place ... \n\nby putting a solar-blocking shade on the windows. Small steps before big steps.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2009-04-30', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 0}, 'user_id': 'J_7W_xSjzGAsqxrz2mlX-w', 'review_id': 'RCeLLto7aaNzLNdVfDX8vw', 'text': 'Bad service and the dim sum wasn\'t that great either! \n\nAs everyone knows, you don\'t go to a Chinese Restaurant for the service -- it\'s all about the food or in this case the Dum Sum. \n\nWe came here on our visit to Las Vegas and decided to take a gamble on this place. Unfortunately, the house won the bet and we lost. \n\nLet\'s talk about service, or the lack of service. Every time we requested something from the waiter/waitress, we had to ask two or three times. \n\n"Miss, can we have some water?" \n"Excuse me, can we have some water?" \n"Hello? We asked for some water earlier -- can we have some water?" \n\nMaybe they didn\'t want us to get full from drinking, but I sounded like a broken record. When we finally got the water, the waitress didn\'t apologize or seem sorry that her service sucked! \n\nOn to the food --- this was some gross Dim Sum. The har-gow was blah - the chow fun was stick and nasty - the fried rice tasted like crap. \n\nNothing good here!', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2009-05-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tQI5OuWsKU0iMyw7SVS9uQ', 'review_id': 'IR_xdj4eOkQEBBZ49Xb0HQ', 'text': "It's Las Vegas, can't expect too much.  They have your most typical dim sum.  Sweet tofu was the best.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2009-05-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jmK-F4c9x2tIzOTEwrdZ7g', 'review_id': 'lbYTw9bAX-dzWLuefhnjAQ', 'text': "People are right about this place!\nService is aweful, they get upset if you don't order softdrinks!\nTheir dim sum isnt great, and they recycle food, and leftover\ndim sum is reserved to another sucker!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\nTHey also have a credit card minimum which is against the\nmerchant credit card terminal agreement. Very unethical place!", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2009-05-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'EAeDYcYll880spJ-6xIjJQ', 'review_id': 'ctW15wN8szcbEEmxMPD5sQ', 'text': 'I came here on a Sunday morning and the line was out the door. I looked over at Sam Woos, and the placed looked like it was closed even though the open sign was lit up. So I decided the food is probably going to be better over here judging by the crowd. \n\nI went up the front, and waited about 5 minutes and never got acknowledged. I was just trying to get a number to get seated. A Chinese couple came up and spoke in cantonese and they were given seating numbers immediately. So I decided to interrupt and ask for a number as well. The asian lady gave me a dirty look, and the Chinese couple were nice enough to say that I was ahead of them and I deserve a number ahead of them. The asian lady refused and still gave me the later number. As I was walking away I heard .. " he jus stan der like a wood, no say nuthin so no numba!"   \n\nHmm so I guess customer service is not exactly their forte here. Since its my last meal in Vegas, and I have been meaning to try some great off the strip Dim Sum, I just had to deal with it. \n\nI was finally seated about 20 minutes later. The dim sum came at us hot and heavy. I was able to get all of my orange county favorites. The taste however was just as not as good as Seafood paradise in Little Saigon, but I would say its better then Cathays in Vegas.  The price of the food is definitely very reasonable. However the tip they earned was not so much. I expect at least to be acknowledged when I want to pay for service next time. \n\nI have dined at Sam Woos and Shang Hais in the same shopping center, but as far as Chinese food goes, this is the most authentic out of them all. I would come here for the food, get abused a little bit then leave with a full stomach and a stink eye at everyone you see in this place.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2009-07-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '72I2y7ldkaPaTQa3Jjo0Dg', 'review_id': 'qaVorKkw-lb0Md9ifF9cWg', 'text': "We've eaten here several times for both the dim sum (lunch) and dinner.\nYes the place is run down.  Extensive menu.  Reasonable prices, especially the dim sum, loved everything.  Had the house special fried rice and sizzling seafood plate last night mmmmm, even the sweetsour chicken I ordered for the kids was good.  Service seemed pretty attentive, we were the only wide-eyes in there :). Will definitely go back for the food/prices.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2009-07-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wezUxbvvLdnhT7v7D339fw', 'review_id': 'VtnXH7290jPaRLjN_efKzA', 'text': "MAN! this place has suuuuuuuuuuuccchhhh a good location, good name and all. but the food is notttttttttttttttt that good! \n\ni know this place gets alot of business b/c of the location, but please people... venture out and read yelp!!!!!! cathay house is much much much much better than this place. its just a little bit down the street on the right hand side and about the same price.\n\nI will only come here if i am meeting friends here and suggesting another place is out of the question.\n\nhavnt had dim sum here, but my close friend didnt like this place very much either.\n\nI had dinner here... the food was ok, but i've had better.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2009-07-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4dvduL8lWoRyT-IjkjxfXw', 'review_id': 'Pqd8o-I76FQjlPSfX0VwVg', 'text': 'Love the food, place is old and out date, little dirty, service is not that great...', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2009-11-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 's6bnWx8G1xoXyq_F7FjHFA', 'review_id': 'YwQltkTxo7WU7IgUqzfi0w', 'text': "Craving dim sum while on our Vegas vaycay, we decided to try this place out. The food is mediocre, service was ehh, and just about the only good thing was the decent pricing. Maybe it's not a fair comparison, but after dining exclusively at Mayflower for all my dim sum needs (maybe it's a Bay thing), Harbor Palace was a let down. The food really tasted little better than the stuff you get from the frozen aisle of the Asian market.  It didn't seem like the cleanest place to eat either.... So skip this place and find another!", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2010-01-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '10hjlDBhaS0JEMN5d5U-2A', 'review_id': 'SDCCZI5UINswvRD_kxD5jw', 'text': "The Place: Older, Didn't seem that Clean\nThe Service: Rude / Slow... Even though they weren't busy. Food took awhile to come out. \nThe Food: The food was ok. Portions were not that great for Family Style Chinese Food. The menu stated a charge of $1.50 for a glass of water. (Though I wasn't charged for it) \n\nWouldn't Go Again", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2010-01-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': '8JDeA__M765evfPv-xO2pw', 'review_id': 'xQzlIMc6Y6adQMh_TbefYQ', 'text': "We came on here on a monday for lunch and I swear there were more employees than there were customers! With that said, the dim sum ladies still took forever to make it to our table! The chop sticks came with leftover food on it and the dim sum portions were just hillarious! The dad and I were looking on the steam cart and the woman said we have shu mai in both a large and smaller size portion............????? Really?! Never heard of that before. \n\nI'd probably say if you're on spring mountain you're better off going somewhere else because this place is a joke and a poor excuse for a Chinese dim sum restaurant.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2010-01-20', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 4}, 'user_id': '2vl3MXKr8iQOWTNse5kgdw', 'review_id': 'kDB9V0M5jOnpBZofCLDUBQ', 'text': "The mister had never been to the Chinatown area of Vegas, so we decided to have Chinese food for brunch.  Although I had a few spots in the area bookmarked that had higher ratings, we settled on Harbor Palace because we were starving and didn't want to go hunting for the other places.  \n\nThe place is a typical, no fuss Chinese restaurant.  Nothing fancy, but not too grungy.\n\nThey were still serving dim sum, but since it was already 2P, they had run out of most of our usuals.  We were able to get the pork baos, siumai, and shrimp dumplings.  The dim sum was good, but it is much back back in Cali. We ordered some congee, but it was nasty, it was runny and had no flavor.  The highlight of the experience was the service.  We had a nice server who kept checking on us and always had a smile.  In a Chinese restaurant that can be hard to come by. \n\nThe food was not bad, but like the 2-star rating states: Meh, I've had better.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2010-01-21', 'type': 'review'}
{'votes': {'funny': 5, 'useful': 8, 'cool': 5}, 'user_id': 'zTWH9b_ItSdLOK9ypeFOIw', 'review_id': 'ecONYDUcS8s1bh0tNrOQpQ', 'text': 'There\'s a reason why Harbor Palace ranks on the bottom of my list of dim sum places in Vegas.\n\nIt was my second visit ever and it just reconfirmed my experience from the first time I went.\n\nSaturday brunch - 11:30 am arrival.  Not as busy as I would expect.  (Bad sign.)\n\nWe have a large party, five adults and four children.  As a result, we\'re seated in one of the larger tables in the room set off to the right of the restaurant.\n\nWe had barely sat down, especially with getting all the young kids seated, when the cart lady was hollering, "You want dim sum!?"  I was immediately put off with her attitude and probably would have left if it was just the Husband and I.  (My Chinese friend mentioned that her mom has a simple standard of dim sum restaurants - tea should be placed on the table before the food is brought out.  And she\'s right.  Growing up, that\'s the first thing I remember from my many dim sum brunches.  The waiters ask what kind of tea you want (usually as you\'re getting situated), and before the carts come, the tea is on your table.)\n\nBut in this case, we felt so pressured to order from the lady\'s cart and had baskets of food on our table way before the beverage guy came around to ask what we wanted to drink.  (I will say that he brought the tea and water over quickly and had our tea pots filled the whole time, of course with my help of flipping the cover up.)  \n\nWe got the typical orders of pork dumplings and shrimp dumplings.  Nothing special here, more dried out from over-steaming, if that makes sense.  We got a couple orders of beef balls and was surprised they didn\'t cut it in half (I\'ve always seen it cut in half), nor was any Worcestershire sauce given.\n\nRice noodle dishes came by and I asked (in Cantonese) if they had Beef Noodle Roll.  She said they did, looked around, then asked if I wanted the Pork Spare Ribs one.  I said fine, and then she asked about the Shrimp one too, which I said was fine.  (Although she did try sneaking another one onto our table until we caught her in time to just say only one!)  And of course, the beef one never showed up.  \n\nI asked for Egg Custard Bun, and she said they had it, but tried passing off some yellow bean one as well.  We did eventually get the Egg Custard Bun and it was not good....hard, dry and old.  Bleh!\n\nDeep fried chicken wings were decent the first time around, but even better when we got them nice and hot.  The deep fried salt and pepper shrimp was also nice and hot when we got it too.\n\nOther dishes included steamed pork buns, chow mein noodles, Chinese broccoli (been sitting out too long), shrimp and tofu, chicken feet, and steamed beef tripe.  Nothing memorable though.\n\nThe Husband wasn\'t eating much from the very start and I had to wonder why.  He discreetly pointed to the HAIR that was sitting on his rice noodle dish.  Oh. Yuck.  (And unfortunately we did not say anything about it then or at the end since we were with guests.  But normally, we would have at least tried to point it out after we paid.  And no, you never say anything during your meal because we all know what happens at Chinese restaurants if you complain.)\n\nOverall, Harbor Palace is just not that good. We weren\'t that impressed the first time and we aren\'t impressed now.  And the service is beyond bad here.  Sure, I know everyone says you can\'t expect much on service at dim sum restaurants, but this places leaves a bad taste in your mouth.  It\'s not even worth tolerating.\n\nThey do have hot chili oil available on the tables, not just regular chili sauce.  And please stop asking for Sriracha sauce, you know who you are!', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2010-03-07', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'haQaMRoN74xRLDoc0gq0Jg', 'review_id': 'mirCRqkoG6SLqyZY6WKm6A', 'text': 'Food off the menu is pricey and not worth it! \n\nDim Sum is horrible! Reheated in the microwave after a long rancid stay in the carts. \n\nThis place used to be good 10 years ago, but I am so over it! Blech!', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2010-03-10', 'type': 'review'}
{'votes': {'funny': 9, 'useful': 2, 'cool': 1}, 'user_id': 'kB0CGnNz0_B2s0_EupL_lw', 'review_id': 'SiDP2BEjEi6ieiUgS2QcoA', 'text': 'I\'ve had dim sum here a few times, but after the last time I was here, I\'m over it. They have your usual dim sum selection- shu mai, potstickers, dumplings, sesame balls, etc. It has always tasted like your typical dim sum, which is what brought me back. Besides, it\'s close to where we usually stay and it was convenient for lunch before leaving Vegas.\n\nSo why am I over it? The server got upset because our tip was inadequate. Honestly, what server provides you with horrible service and then brings your tip back to you and says, "What is this? This is not enough!"? Oh, it gets better. She proceeded to calculate the "correct" tip amount for us and said that was how much more we owed her.\n\nNeed I say more?', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2010-03-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8RaueDLzY5SSw9AVUrdXiQ', 'review_id': 'S1X38NxP9W_sJzF_igW2-g', 'text': "Best Chinese food here in Vegas for me. The dim sum carts are just endless. I'm not a big fan of Chinese cuisine but this place is an exception. Love the fact that they're open till 5 am.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2010-03-31', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '9VSegbNRzNlGKfBUv23vNQ', 'review_id': 'zo5K7XQzdjCrUN-8HxFC8A', 'text': "Poor Las Vegas needs to UP their game on DIM SUM. As a San Francisco resident, I know some good Chinese food/ Dim sum. Harbor palace seems to be run down and caters more to.. people who don't know what good Chinese food is. They only had about 2-3 dim sum carts going around with not much of a variety to choose from. We got an order of chicken feet which were huge and tasted right, one shrimp and one beef cheung fun which was okay.. an order of spareribs which sucked... and one ha gao and sui mai which were decent, and an order of sesame balls and cha sui bao which I didn't try. We also ordered a plate of beef chow fun which was decent but very very greasy. Over all the dim sum wasn't fresh, but tasted decent, the prices are steep, and not worth it.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2010-04-05', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': '9Pw42f2_KLBPBDi2Aan82w', 'review_id': 'KFElWErmgo8GBrXZXmaB_Q', 'text': 'Oh, my goodness.  My parents and I had longer-than-usual stay in Las Vegas and were tired of food and buffets on The Strip, so we decided to venture into LV\'s "Chinatown" and see what we could scrounge up to eat.  We saw lines in a few places, but we decided to settle for dim sum.  It seemed to be really popular because the restaurant lobby was vomiting out people.  I mean, really, spewing people out everywhere, loitering and waiting about.  My parents, being the stubborn people that they are, decided to take a number and wait.  With a small party of 3, the wait shouldn\'t be that long.  \n\nWell, it was.  By the time I got in, I was starving.  We waited for almost an hour.  By that sheer fact, I thought the food would be wonderful.  I mean, why else would people be waiting that long to eat?  Let down again.  I mean, it was relatively good considering I\'ve been living in NH where their dimsum selection is a little... well, non-existent.  And it\'s the first bite of dimsum I\'ve had in months and months.  So, it wasn\'t bad.  But I am still well-aware that there is plenty of good dimsum back in SF.  I mean, much better.\n\nThey were sooo busy, that no one paid attention to us when we wanted to pay our bill.  And the place smelled funny.  And it was SO crowded.  I was such between my dad\'s elbows and someone else\'s baby carriage.  With a baby in it!  Watching me eat!  Good Lord.  Next time, I\'m sure we\'ll try somewhere else if we wanted dimsum in Las Vegas.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2010-04-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xW2P29VMpMnzth9G-tuLXw', 'review_id': 'krFFxkXIrMo-_eYbj_9Zwg', 'text': "Basic dim sum in a strip mall. Food is fine. Service is what you should expect in a place like this -- few basic dim sum places are going to get lots of service points -- but it works. The food isn't something you are going to write home about , but it is fine. \n\nThe place was not very busy when we went on a Saturday a little before noon. \n\nNote: If you take cab there have them call you one when you are ready to leave, we had a lot of trouble finding one.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2010-05-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZMKWsK5NbtfSZerFjAR9XA', 'review_id': 'rLgs1IvszPC9ifoRmmpwcA', 'text': "Definitely wait to come here after 11:30 a.m. If you arrive early like I did at 10:45 a.m. everything they're serving isn't fresh. The first 3-4 dishes we ate were cold and disappointing. But once they start pushing around the fresh dim sum carts, the food is pretty decent. Just keep your expectations low and do not order the Wonton Noodle Soup (it's not worth the $7). I wouldn't eat here again if I could help it, supposedly there are better dim sum places in Vegas.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2010-05-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MKDjH2c6TJ4RdUlXjXC5OA', 'review_id': '-C6qOPMpMQ85iGuk8tXRmA', 'text': "Best place in town for dim sum... Very nice people... Ask for Henda he's very funny", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2010-05-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'x-6PK36yh2TeMcre6MxEcQ', 'review_id': 'Bzc6pk29T3aoCtnK9SkMsQ', 'text': "Tired of buffets during your annual trip to Vegas?  Check out Harbor Palace!!\n\nDropped by here last Sunday night with Mel and her family.  It was 100+ degrees outside....and 80-something inside.  Don't know if the A/C was on, but it was hot inside too!  The restaurant wasn't very well lit, and the place seemed like it would be dirty, but not dirty enough where you're grossed out by it.  \n\nAnyways, the wait staff was friendly (engaging in small talk with Melly Mel's mom) and offered suggestions while we were ordering.  Food came out super quick - not fast like a typical Chinese restaurant, but SUPER QUICK, like the dealers-taking-your-money-quick at the casinos down the street! \n\nThings of note:  \n* Peking Spareribs were good, but a little sour due to them using a little more vinegar in their sauce than what I am used to.\n* Orange Chicken...yeah, just don't order it.  All white meat, but not good enough I'd order a 2nd time.\n\nWould totally come back......but not for their Orange Chicken.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2010-06-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'oM3U4bWc29qfGU6wI6K8oA', 'review_id': 'PtTVEeWRgcnEUKhI8FbXMA', 'text': "My family always comes here whenever we're in Vegas, but more out of convenience and habit really.  The food here is ok and I would have given the place 3 stars, but it's just soooo dirty here.  I had to take off one star because the bathrooms are horrendous here ... so much so that there were 4 stalls and i almost died going in there ... I couldn't go needless to say and decided to hold it in!", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2010-08-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'saazTlrBfVDGTiXBhkQjKg', 'review_id': 'sM0LpPN7nP7yY7APLp0M1A', 'text': 'This place is OK, nothing special and if you come mid afternoon there is not much dim sum to choose from.  There are better places to get dim sum.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2010-08-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4dn9o693x0MzP-E2Yx9pdA', 'review_id': 'IfkXJx-hbygh2e6ZIbXsqw', 'text': "if you want to eat at a filthy dirty, gross dim sum restaurant, then come here.\n\nthis was my first time eating at this restaurant, and will certainly be my last!!\n\nbecause ichiza was closed for lunch, therefore we ended up coming here for dim sum, and what a mistake it was, i was so embarrassed to have brought my family here.\n\nthe restaurant was pretty empty when we arrived, and they stuck us in a table close to the kitchen, where we can see all the dirty dishes and disgusting left overs, right then, i've pretty much lost my appetite.\n\nthe dim sum selections were very limited, and didn't taste fresh at all. most of the items were cold and stale, and the worst steamed dumplings(chiao long bao) i've ever tasted. the skin was very thick and hard, and not even sure what the stuffing was, definitely tasted like left overs from days ago....yack!!\n\nthe worst part was the sanitation of this restaurant, the carpet/flooring was filthy, and while we were eating, some waitress started to clean and spray cleaning solutions right next to our table, and some of it even got into our foods...i really wonder how this place got away from the health inspection dept.!", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2010-08-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'S5eGOOeuX3A7cvL-wW6TFA', 'review_id': 'tLIbmJvpwZg4rG0KVAuH_w', 'text': "the order.\nshu mai\nhar gow\nbean curd wrap in gravy\nrice noodle with shrimp\ngyoza\nshanghai dumpling\n\nthe food here is edible but i think that's where my compliments stop. the dim sum here was not fresh and they use a lot of low quality pork meat--meaning very fatty parts of the pork. the balance of lean and fat was not struck with this dim sum. the rice flour for the har gow was too chewy and borderline hard (as if it was reheated). the shanghai dumpling was probably the worst thing i had. i personally would not return to this establishment but it is an alternative to much of the generic vegas food. not to mention, when i first started out eating dim sum this would have been acceptable to me as im sure it is acceptable to the new palettes of many tourists that probably frequent this place.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2010-08-27', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 0}, 'user_id': '09Q5Poz8pkfp-_srlEzJpw', 'review_id': 'VYkjz2g-xAXyV2TXUBgilQ', 'text': 'Holy eff I am gonna get started writing a review about this shit hole. Do not waste your time on this palce. Everytime you ask for something it is like a problem.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2010-08-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jmK-F4c9x2tIzOTEwrdZ7g', 'review_id': 'i38NwWecrKPXuzrzliW43Q', 'text': 'Went there again with some people who had to have dim sum and we were in the chinatown plaza, so I  can tell you nothing but their portion and prices have changed, and not for the better.\nthey continue to recycle food, just watch them when they clear a table,\nif theres good food left over, they will not throw it away, and will service to someone else!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2010-09-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ynvM-WH1Wb5q09pEBMwQEw', 'review_id': 'lgsX24w3vbgvTLFp1GyqjA', 'text': "Harbor Palace get hammered here on Yelp...mostly because I think there is nothing special about this place. It is a utilitarian dim sum place that is located in close proximity to the strip and lacks immediate competition. We had brunch here on a Sunday and the food was actually okay. Although I thought the dumplings could have been much better and the shaomai was just okay, I enjoyed the Chinese broccoli, char siu baau, and shrimp har gao. \n\nOur servers were very friendly and the place was totally packed (with Chinese people) when we were there. My only complaint was that the servers with carts were really trying to push as many dishes on us as possible. \n\nI would definitely go back, and I'm still trying to figure out where all the 1-star reviews are coming from....the food was okay-to-good and the price was very cheap. Near the strip, what more can you ask for?", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2010-09-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'BkEy43BhqygdGIwVrfGP5w', 'review_id': 'MuCPqkEvwb4mU79nIRF4pQ', 'text': "I had an overall terrible experience at Harbor Palace.  The service was terrible, the food came out slow, and when it did, the food was very mediocre, at best.  I brought two of my friends here because they wanted some good Dim Sum, and ended up wishing I went to practically any of the other Chinese restaurants in Chinatown.  \n\nWe ordered the Sizzling Rice Soup, Green Beans with Minced Pork, Hong Kong Style Crispy Noodles, and Fried Fish.  The only thing that was even remotely flavorful was the green beans, and everything else was bland, cold, and under-salted.  The noodles were soaking in a bland gravy that tasted like they thickened water and put it on top of the noodles.  The fried fish wasn't crispy and was bland, as well.  The soup came out last, and very cold.  I couldn't believe they actually served this to us.  We tried to complain but no one understood what we were saying, and we didn't see the waiter after we ordered until we got our check.  \n\nOverall a terrible meal, and I definitely will not be coming back considering that HK Star and Joyful House are right down the street.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2010-09-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2lMGYqJU7n_pj6nSxwPo-w', 'review_id': '5KtZ63lKg1dWMJHbLpMCBQ', 'text': 'I recently wen to Vegas with my mother and since we have been there so many times, we wanted to get  night out of the STRIP restaurants. we went over to Chinatown and thought, what the heck, lets try this place. Inside was pretty boring, setup seemed more like your average cheap place. The waiter did not speak good english at all.....service seemed OK at best. My mom ordered Mongolian beef, her fav. which she found to be good and a very large portion. I had gotten the Jellyfish and Fish Maw and Crab Soup.....also VERY large portions. IT WAS AMAZING. I live in Alaska and have been searching form Fish maw and jellyfish since I have gotten back...only found one of them...I would definitely check out this place if you are into hole in the wall authentic places where you can try new bizarre foods.....', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2010-10-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dLiaSopltHUTTuSoifeiSQ', 'review_id': '-tuxmuPCNjDQYlg827LBhQ', 'text': 'Terrible terrible terrible...been going here for many years, always for Dim Sum.  This place has been slowly going down hill but today was the final straw.  Service was horrible.  Selection was even worse...they had one steam cart and one fried cart for the entire place.  The steamed ones were dry and waaayyyyy over done.  Definitely go someplace else.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2010-10-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'eGsxgdgLyTaURyXCFWhjPA', 'review_id': 'GKXmuLnOEZf4jjIruvaCuQ', 'text': 'Place needs some work to be done. But overall I get excellent service here during the late hours after a night at the disco! Hasnt let me down yet!', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2010-11-15', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': 'IgXUM_WyCgqyzA01mN5HKg', 'review_id': 'yMfBKvGA_OaKl7qztHKcHw', 'text': "When I first moved to LV, the new friends I made took me out to eat here.  I thought, chinese? Why not!  But when I saw the servers rolling carts around I was wondering what kinda restaurant this is.\n\nTHEY SERVE DIM SUM! It was my first time ever having dim sum and I had a good experience here.  I noticed the servers would mad dog you if you didnt want anything from their cart.  I found that funny.  They serve all the dishes a chinese restaurant would serve but they're honey walnut prawns are especially good.\n\nAlthough theres other places I would go first for Dim Sum, Harbor Palace is a good alternative. But then again, its in China Town, and other dim sum spots are close-by. =/", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2010-11-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '05j8uCKCa7_R5JdC5k_d8g', 'review_id': 'adMap30aB4k831HxCBXJRA', 'text': 'Compared to the Bay Area dim sum standards, this place is just alright. But, when you are away and had a long night of partying with a hang over, this place hits the spot! Your basic dim sum and reasonable prices. Too bad the cab ride from Aria to Harbor Palace costs $20 in itself!', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2010-12-06', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': '6NXn9bd7TEbmiS7e8yf5Zw', 'review_id': 'uiuzAlMVNZRT-pB3d7Mjcg', 'text': "Holy grossness...I guess I shouldn't be so harsh about this place but the Vegas Strip is the land of food and I really think the competition is tight. If I had to wear high heels and fake eyelashes. I think this place can step up its game too! This place just doesn't do it for me. \n\nPros:\nBanh Cuon with Suong\nService\n\nCons:\nPrice\nLocation\nFood", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2010-12-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yZuN_BimeZeg-ELcUg1fFw', 'review_id': 'bmk3mkntiYY4ZMv1a8YuzQ', 'text': 'The only gripe I have about this place is the slow service. But other than that, for dinner, the food is pretty good.  I enjoyed the egg flower soup and honey walnut shrimp.  The prices are not that expensive, comparative to the ones in Southern California.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2010-12-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LJAM7G7BX2FXtlEfr7zd_w', 'review_id': '9TFqocE_sEX68BAj5DUwdg', 'text': 'Dim-sum for brunch. Harbor Palace in China-town LV. This is part of the "\nget off the strip" adventure.  Thought is was good. Dim-sum was " par for the course "  kinda like  "ho hum dim sum"\n\nDon\'t know why many dim-sum joints paint their walls a putrid green  and, and true to form this place has flat screen monitors with a loop of advertisements.  This is a Chinese sea food restaurant that serves dim-sum. Sited in a "Strip mall" with Chinese/asian motif. \n\nFood: good / basic \nService: hey it is dim-sum, women wondering around with carts\nValue: thought it was ok', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2010-12-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'saiZmxzBIowJbMgPBW1Now', 'review_id': 'v9I2Ke4ScLEVUtrj7sR4eQ', 'text': 'Decent dim sum and a crazy screaming host to boot.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2011-01-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': '_6bFXoUrzam_1SzP3bFLXA', 'review_id': 'M6CnqgQ_M5-YuNW2ln95Ew', 'text': 'Friends and I sometimes make an early morning "dinner" here after a night dancing in Goldcoast. As it is convenient and still open until 5 a.m. (from 10a.m. for 7 days of the week). There is no wait to get seated. The host sits us on any table we prefer on either table setting or booth-type seating. Sometimes,a few or no diners at this hours of early morning. Food service is quick to moderate wait. \n\nNoticeably, the menu have Chinese characters as well as below the English food titles are Filipino language translations. Is it because the owners are also of Filipino heritage or is it that the restaurant\'s dining patrons are predominantly Filipino? Interesting.\n\nA wide variety of entree in the menu consisting of appetizer, soup, various seafood entrees (shark\'s fin, abalone, sea cucumber, lobster, crab, geoduck clam, scallop, shrimp, clam, oyster, squid, fish), various fowl entrees (squab, duck, chicken), beef, pork, vegetable, bean curd, fried rice, hot pot, sizzling plate, noodle entrees. Spicy Items are indicated. The usual soup I order each time I dine here is "Fish Maw with Crab Meat Soup" which is filled with fish and crab meat in a flavorful thickened broth. Hot Pots are generous and steaming hot. Oyster is also another favorite item ordered which are large-sized. Never overcooked. \n\nFamily Dinner Combinations are also available starting from $12.95 - $17.95. A Special Lunch menu served 11 a.m. to 3 p.m. Mondays to Fridays Only at $5.95 is a good deal to have which includes soup of the day, an egg roll and fried rice. Sometimes, this is an order I make when in the vicinity of "Chinatown", conveniently packed in a styrofoam box on a take-out request.\n\nJust not expect quick attention to your needs, the servers seem to be preocuppied with something else when you need to get their service.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2011-01-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'NicOL8ENT68DX1NI-TL58Q', 'review_id': '0eNsIRgsLTrV7agtZujtWw', 'text': "We stumbled across this place in search of a chinese restaurant, just so we don't get sick of eating buffets all weekend. Not only is this the worst chinese restaurant I've been to, this is the worst restaurant period. We went here for dinner and the service was TERRIBLE. Food took forever to come out and the complimentary tea was warm. I've had a lot of chinese food and they have by far the most bland tasting food ever. They use ginger in every dish so it all tastes the same. I had to dip everything in soysauce (which I had to walk up and get myself) just to have some flavor.\n\nTheir servers look like they hate their job, and the decor looks like a bunch of elementary school kids' artwork. I will never step foot in this restaurant ever, and I hardly say that about any place.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2011-02-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'WgK7kyLUxZDqQSyARTpPuw', 'review_id': '0_d8Lp3gVo98T32DXMUlIw', 'text': "What you want?\nThe Fu King Rice.\nYou want Fu King Rice?\nYes.\nAnything else?\nNo, just give me the Fu King Rice.\n\nThe entrees are actually not bad if you wanted some Chinese grub.  But not really worth coming off the strip just for.  It's OK.\n\nAvoid the dim sum as it is usually not fresh and overpriced, i.e. the steamed stuff have been sitting around long enough for like siu mai/har gow wrappers to start to harden.  Aiyah!\n\nAs usual service helps a bit when you can speak Cantonese at these places.  All in all, average.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2011-02-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Gg4YdeioSeXUaJEJvDwsxw', 'review_id': 'm2kid8RiE2KW-_MfVEGE3w', 'text': 'Had the rau muong with chao so delicious.  You must try the sea bass hot pot, it melts in your mouth.  The service is wonderful very attentive and nice.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2011-02-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nvtGOilRudNHkusp8Y546w', 'review_id': 'JUm_s-k1FDuCHarJL2hQ-A', 'text': "Dim Sum? In Vegas?\n\nWe were all hungry and (well, mostly us midwest girls) were craving dim sum on a Saturday, so off we went out of the strip to go get dim sum.\n\nWe reached the little Chinatown plaza outside the strip, went to Harbor Palace and sat down right away. In came the carts- ordered my normals- chong fun, ha gao, shiu mai, etcera, along with my chicken feet.\n\nThe quality was okay. I made it fulfilled my craving? Wasn't exactly the best dim sum ever...but we were hungry and it sure beat Cleveland's dim sum, that's for sure.\n\nMaybe this place would be better for dinner?", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2011-03-02', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': '_tca8Lenkf0plzHqAA9ucg', 'review_id': 'pjEIuoWYGIOAxbT-7WIzHQ', 'text': "WhooooEverrr... gave them more than 1 star you should be ashamed of yourself!.. \nthe dim sum was horrible.. I am in from LA and driving around looking for Chinese food.. didn't want to do any more food on the strip.. My friend and I had to do some shopping so we went to Chinatown.. wanted the usual hole in the wall place.... someone come help me just dig them a hole back to China...who is with me on this...?!.\nthe best thing there was the steamed Chinese broccoli... \nIf I am in the hospital and in a coma from food poisoning, let them know that I ate here..... please pray for me", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2011-03-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '_3mIRrRfuhIr03d_KKKP0w', 'review_id': 'dm-FK57lM-oVJfZirlVd4w', 'text': "We were a little hesitate to have lunch here because there were only two parties in here. A single old lady and a couple who seemed to know the staff. \n\nWe first started w shrimp chow mein. It was a typical chow mein. Flavors were nice, portions were big but lacking the plentiful of bean sprouts I usually like in my noodles. The menu was pretty standard for an asian restaurant, beef, chicken, soups, shrimp etc...\n\nSecond we ordered squid w snow peas and I think a bean sauce, but that's not what came out. We tried it anyway but the squid was really bland and wasn't seasoned at all. I couldn't eat this.\n\nLastly we got as advertised, fresh live fish. It was sea bass today and to choose between steamed or fried, we got steamed. Being said it was live fresh fish I though i'd get a whole fish. I didn't. It was nice and moist, very good, but could have used some lemon, although I don't think that's traditional for this type of food. \n\nOverally I give it a 2 out of 5.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2011-03-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'B_k5Os7KMZUMrqrW38aRZg', 'review_id': 'z3RjDKeGPM-cpBurg9C0wg', 'text': "We stumbled into this place while on the way to another Cantonese restaurant I chose.  My uncle saw it and remembered it from his last visit and decided to go there.\n\nBig mistake (and I guessed he figured that out too, especially after he went to Wing Lei).  \n\nThe service was not so hot and the food was pretty bad.  I wouldn't want to go back at all.  There was just nothing to say good about this place perhaps except that the people were trying to be nice (even though they didn't really know how).", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2011-03-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '97GRnWj7Iv4TXY9OT1E_8Q', 'review_id': 'JY5LAyWQnMtGW6CuEp4dDQ', 'text': "I haven't ate dim sum for quite a while and I miss it so much. So when we headed to Vegas, we want to eat that. We found this place in Chinatown plaza. The dim sum wasn't so bad. It's a nice place. At least the service was good.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2011-04-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2ZcywiOYeMhJwwfdnj1pGA', 'review_id': '6PsQeoAy1T3YfeyzZxOZdQ', 'text': 'sorry to say, this was not good at all\n\ni had dim sum Saturday afternoon. The food was delivered from carts table to table. the flavor was oka but was not the best from other dim sum places, also the texture of "churng fun" (noodles with either beef, bbq pork, or shrimp) was really grainy  eek\n\nso we order pan fried yellow noodles which was better than the dim sum. but still kinda bland. \n\nprice range is kinda pricey from other places i\'ve been to.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2011-04-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'OI-VGo5ij4TMHVw8xWrKNA', 'review_id': 'IYjUWxtV3ypXJCAKnizbxA', 'text': "I'm on a quest to find a Chinese restaurant that's tasty enough to be a regular haunt. Reviews for Harbor Palace have never been great so it really wasn't on my radar. We only stopped in because I've driven by it hundreds of times and curiousity had finally gotten the better of me. \n\nWe had eggrolls, sweet & sour chicken and eggplant in garlic sauce. The eggplant was really good, the rest was fine. Service was lackadaisical, but I suspect the language barrier might have something to do with it.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2011-05-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LpSzCeBORALgF5OlLMpcMA', 'review_id': 'o_Sh6UN2O7wAWaDmsQyWNw', 'text': "They don't even deserve one star. The food is alright but the service is very awful. \n\nIf I were you and looking for a place to dine and relax, this is definitely not the place for you. If they are consistent on one thing, it's how horrible their service is. Give yourself a break and don't try this place.\n\nDon't go here especially at night time; the server which is the only lady they got at night is discourteous and very rude. She was very impatient and impolite, maybe it's the language barrier but there was no need for her to give us some tone, attitude and dirty looks (She kept rolling her eyes, pouting her lips and giving deep frustrated breaths that  to my astonishment she was not ashamed to show us .) as we were ordering our food. We have to ask for water three times before someone actually gave us our drinks. The meal gets bad to worse experience when they forgot to cook one of my friend's orders, who end up not eating. (The first time we went there they also forgot to cook my order I thought it was just an honest mistake, now I know they just don't care. This was our second time to visit and definitely the last).   Everyone in our party of seven people was upset when we left the place.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2011-06-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'NuBAIvbU3ujB0WxtLgxCgQ', 'review_id': 'XQjlLQzdlxLbDwhsJur0WA', 'text': "I have been to this restaurant 4 times before and liked it OK. I find it funny that the menu is in Chinese of course, but also has subtitles in Tagalog.  I like it when ethnic restaurants are full of diners of that ethnicity; They're keeping it real.\n\nToday I was craving the Walnut Shrimp. \nI pull into the parking lot and there's a crowd of people waiting to go in. What !?!? That's never happened before. I guess this is a popular place on Sunday morn compared to the weekday afternoons that I have been here before. I get inside and am seated quickly. And there are ladies with dim sum carts. I have not had that since I left LA years ago. The Walnut Shrimp can wait for another day.\n\nHot green tea was brought to my table quickly.\n\nI got my food from the first carts to come my way: calamari, fried shrimp, steamed shrimp in a thin dough and 2 dessert type buns: pineapple and coconut. I liked it all. The hot food was hot; the fried food was crisp; the dessert buns were soft. It all tasted fresh.\n\nTook most of it home since I was alone and could not possibly eat it all in one sitting.\n\nI think the servers did a good job. They got people in and out quickly. There is a language barrier but to me that just adds to the experience.\n\np.s. After reading Yelp reviews, I guess it's a good thing that I have never seen the lady's bathroom LOL.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2011-06-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '9xaJ7hM8SCrXFowDKZ1kHw', 'review_id': '4lF7FnRIkZR2YKhGIS_Xtw', 'text': "The WORST dim sum I've ever tasted! I'm usually not a picky eater but the food was so bad, I left with an empty stomach since I couldn't bring myself to eat anymore crap.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2011-07-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jqiDWycSAWIhSHIfN_PjAw', 'review_id': 'Nh_Mn5nqTws1Bv6VIa5KIg', 'text': "Dim Sum is decent.  I've had better in many other places, but I don't know of too many in Vegas.  They have the dim sum in the push carts.\n\nWe had a quick lunch at Harbor Palace and it consisted of:\n\n- steamed pork buns\n- shrimp dumplings \n- rice wrapped in lotus leaf \n- sesame balls with red bean paste\n- long rice noodles with bbq pork\n\nIt's tiered pricing and about the same as in most places in the San Gabriel Valley (Southern California).\n\nOverall, I would go back if I wanted dim sum in Vegas!\n\nXie Xie!", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2011-07-06', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 2, 'cool': 1}, 'user_id': 'Ly72PZoHkGZUVWgLH8W2-A', 'review_id': '6VB6UChQ2rq0Cx2m6b5ojw', 'text': 'Okay, so, obviously Harbor Palace is not the best Chinese in the city.  Most of their dishes are so-so, some are revolting, but a few are memorable (braised sea bass in a hot pot = get it NOW).   Their menu is extensive when in comes to the seafood.  Abalone, shark fin, geoduck clams, lobster, crab, they got it! \n\n I will beat you, however, if you order the honey walnut shrimp.  Picture Long John Silver\'s fried shrimp topped with room-temperature, Kroger mayonnaise.  Yep, that\'s their "famous" honey walnut shrimp! I\'m still hunting down the person that recommended it to me.  \n\nAlso, be warned that their waitstaff may or may not mistreat you.  I personally enjoy rude Chinese restaurant waitstaff but you may not.  They get three stars  simply because their staff are extra grumpy.  Really, I love brusque waiters.\n\nP.S. - If you\'re a glutton for punishment, get their frequent diner card.  You\'ll get coupons for free food (I guess, if you want it...).', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2011-07-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'i1_25wj43EhJyk81UcEjXg', 'review_id': 'rtYMbM52om0S_lsuT1lPmQ', 'text': "My parentals wanted to go over here because they heard that it was really good. What they found out was that it was really over priced.\n\nThe decor is decent and there were a lot of tables but a lot of them were empty too.\n\nYeah, the food is decent as well and some items are tasty but some of it was sub-par and tasted like you can get it anywhere else for a lot cheaper. I was not a fan of their dim sum chicken feet which was sad because it was China Town and I would prefer one of the dim sum places here in Utah instead. We got some fried rice, fried fish and an oyster stir fry and they were good but way to pricy for what it was worth.\n\nIn the land of Las Vegas, you can absolutely find a better place than this without looking too hard. So, I'd pass this restaurant and find a better deal elsewhere.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2011-07-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2qGjxnYIhrqPByfaKO6wyA', 'review_id': '9o22mo4ztHNpGHRO4Wx2pw', 'text': "There wasn't anything good about this place. The dim sum dishes were tasteless and cold. The servers were also very rude and had a bad attitude when asked for anything.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2011-07-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'l5xVd2ZS5YqrwxUHmoR3dw', 'review_id': 'g8TQv5cD1eJjSCbzprtUSQ', 'text': "this place sucked ass!my ass would have tasted better.\n1)the false advertisement of late night dim sum\n2)they couldn't make a smoothie because it was apparently busy trust me it wasn't\n3)the lemonade wasn't fresh it was Brisk\n4)their credit card swipe machine didn't work\n\nThey were trying to sell lobster for $28/lb and the won ton soup tasted like the tea, the fried rice had a foul smell and the shrimp was chewy didn't taste fresh.\n\nWhat a waste of a $50 meal. It put me in such a foul mood that even though I was hungry after I couldn't be bothered eating after that I just didn't want to be disappointed.\n\nThe decor was cheesy.Don't go here!!!!!", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2011-08-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 6, 'cool': 1}, 'user_id': '1m-ovYop9xL3HiKjHjwFGg', 'review_id': 'PQjZBHfGbBwmi6Xa2rbEHQ', 'text': 'Un-be-lievable!  We should have stuck to our gut instincts and said "no" to trying out another dim sum place, other than our usual, Orchids Garden.  We should have also read all of the Yelp reviews on this place before entering their restaurant.  What a mistake we made!  Never before have I asked my family to ditch a restaurant the moment we got seated...until this day!\n\nWalking in, my family didn\'t get greeted by the host upfront with his head buried in a newspaper.  No.  Instead, it felt as though we had disturbed him.  It took him a while to muster up a "how many?" before he removed himself from his seat to sit us at a table.  STRIKE ONE.\n\nNext, we asked our server if they had dim sum.  To which she rudely replied, "Dim sum, no order!" seeing we had their menu before us.  Okayyyy.  Understandably, we weren\'t going to order dim sum from their menu, as we are accustomed to ordering from CARTS!  She walked away and returned with a paper menu of dim sum items and a pencil and dropped them at our table; no explanation.  Weird, so I assume, we DO have to ORDER, as we see no cart in sight anyway.  STRIKE TWO!\n\nWe finally get to writing down our list of dim sum items we would like.  We then proceed to asking her for two more settings for our table of four (we were seated on a table set for two).  Without a word, she turned around and grabbed two settings from an open table.  As she began to "place" them on our table, she pushed past my two young children reaching over them, resulting in her "thrusting" the fork and knife toward my husband as he was writing.  Really, woman?  She basically poked his hand with a fork tine, never excused herself for it, and simply walked away.  RUDE!  STRIKE THREE!!!\n\nAt that point, I asked my husband if we could leave.  So upsetting!  As I walked past the server, who then realized we were walking out, I pointed at her and scolded her with a "YOU NEED TO BE NICER!"  Then we left.\n\nNow, I apologize in advance if I offend, I have no intention of it.  But, seriously?  At some Chinese restaurants, you are commonly accustomed to experience a kind of abrupt, hurried kind of service that is typical of their customary practice.  I should know.  I\'m Chinese myself.  So, I\'m not being overly sensitive of the situation at Harbor Palace that night.  I know what to typically expect, or not expect.\n\nBut, this???  The customer service at Harbor Palace should not be experienced by any paying patron, no matter what!  (I should say, the lack of customer service).  They have no common sense of decency when it comes to working with people.  In fact, I believe that because they are "fed" their business via tour buses (don\'t ask me how or why it is that way), they feel the need to not offer good, if any, customer service.  We are NEVER returning to this place again.  They are disgusting.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2011-09-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VqcwMFdkeFgXU_3euvM0IA', 'review_id': 'Tl09L0inDKHeDRYoQ0cXOQ', 'text': 'Ive been coming here for years and this place is alright.\nNot the best I have ever eaten but not the worst either.\n\nI usually come here late at night or in the morning/early afternoon.\nLate night I usually order a fried rice.  Either the Yang Chow, BBQ pork or the salty fish and chicken fried rice.\nI also usually get an entree like fish with black bean sauce, fried pork chop with salt and pepper, fish with spicy salt and pepper or a soup like the won ton or the hot and sour soup.\nAll the above dishes are pretty decent flavor wise.\nGood enough for 3am as far as im concerned.\n\nThe other times I goto this place are in the early afternoon for dim sum.\nLast time I went for dim sum they had the carts rollin around as usual.\nI have never had to fill out any type of paperwork to eat dim sum at this place.\nThe dim sum is decent.\nI usually get sesame balls, pork bun, shumai, harcow, and chicken feet.\nAll pretty standard in terms of flavor.\nNothing really stands out or lets me down.\n\nThe service not bad at all.\nI have been eating at Chinese food joints for over 30 years from Hong Kong to Thailand to San Francisco to New York to Jakarta....you get the idea.\nAll that "Asian folks are so well mannered and polite" is some stereotype junk.\nThese cats wanna know what you want to eat and drink and thats it.\nDont expect any type of convo/banter especially if you dont speak the same language.\n\nLots of folks mistake cultural differences for bad attitudes.\nDont get it twisted folks.\nWe all have bad days and good days.\nMaybe I got it all wrong but then again im not an over sensitive attention monster.\n\nFood: B - Step up your food game guys, dont get complacent.\nService: B - Train your employees to handle problems better.\nCleanliness: C - You really need to do a complete cleaning of the store\nOverall: B-/C+ - I will continue to eat here just wish they would improve.\n\nThis place aint as bad as people are saying.\nAll the basics for a great Chinese restaurant are there.\nManagement just needs to remember that they have to try and improve every single day...', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2011-09-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '5xaUJttThuSZBKm2Xihdag', 'review_id': 'nkAkcXCdQoYDX3d8FFS13w', 'text': "For some reason I think of buffets and steakhouses when in Vegas but hey it's always good to try something different, so this is my first Chinese restaurant in LV.\n\nService was okay, dim sum food was average, prices were cheaper than Mei Sum back home.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2011-10-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5HiyH0ZWaWOsTo7J-DNAlQ', 'review_id': 'LcPwEfBhcnyxo5Pv8sd0TA', 'text': "This place has the best seafood congee!!! It's not on the menu. Everything else sucks excepts this congee. Tastes perfect. Seafood comes with fresh fish (don't remember which fish), octopus, scallop, shrimp, ect.  Yummy!!!! Dont get anything else, u'll b disappointed.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2011-11-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'saxysyKoVEp1SsqYwIPurQ', 'review_id': 'ZzXBtLX5CZN5RIAOB5Vlqw', 'text': 'Food taste good.  Portion is very small.  There is almost no service but charge 18% tip - this is not right!!!', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2011-12-30', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': '6IrKMXmBE1t1w7iJ4EZ1wg', 'review_id': 'kmJFf4jSqXQLCwH4__mweA', 'text': "You know what the best thing about Harbor Palace is? \nIt's next to a Mr. Sandwich baguette shop. After being completely revolted by this place, We ended up hungry and went over for some delicious roasted pork sandwiches. \n\n(yeah, this place sucked that bad. Greasy dim sum, surly dim sum ladies.  The steamed beef roll wrapped in bean curd was disturbingly sour. We stopped ordering after only five items, but the damage was done - a $31 tab to leave the premises. But I guess it's the only game in town, so that's why it's still in business.)", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2012-01-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yxA6JtV0-lrOfisefOGYeQ', 'review_id': 'PWDkfRjoZaEPrIS-4DYe5A', 'text': "The only reason why we went here was because after a 4hour road trip from CA we wanted some dim sum to start our weekend off and since the Harbor Palace was listed off offering it on the Malls board we walked over and decided to give it a try.\n\nThere wasn't much variety after looking at 4-5 different carts that's all they had to offer. The siu mei and the chicken feet were the highlights everything else was bland and not exactly worth the meal . Go save your stomache for one of the places to eat at in the malls or try out ping pang pong down the road for better dim sum.\n\nThough for some reason the place was filling up pretty quick i'm assuming is because of that sign thats posted listing off all of the restuarants and what they have to serve. I guess its a plus that they serve until 5am on weekends.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2012-01-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'x0gFshv4biRbHxpS6kuc0g', 'review_id': '2GOkLnGujeUBSob83EvNuQ', 'text': "So we stopped in here for some Dim Sum Cantonese Style. \n\nAfter only 2 carts, I was able to get all of my favorites.  I love it because all you have to do is point and they serve it to you. It helps that I speak Cantonese, so I was able to request my favorite, but I can see how this would be frustrating to others who are not familiar with Dim Sum. \n\nYes, they do have chicken feet.\n\nUnless you can read Chinese, chances are you won't be able to read the check and know exactly how much it will cost you, or know the actual name of the item that you ordered. Meh.  Sometime's I'd rather not know. \n\nI thought this was a great place for Dim Sum, but it certainly is not a good place for Dim Sum beginners without an old Chinese person or a seasoned Dim Sum eater.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2012-01-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'MI76B2xNe_eb1V9SZ7K8FA', 'review_id': 'rSDnA-_QUc0imzqqOC512w', 'text': 'This Chinese restaurant is quite famous online, and there are lots of positive comments online. Last night we tried to have dinner here, but was blown away for the long queue here, so we decided to have another trial here for its dim sum. I am not a Cantonese, and I believe that the dim sumshouldbe ok, and might not accomplish a five-star. Its choice is not so plentiful, however the price is quite smiling, so I will give it a four star to encourage.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2012-01-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': 'h2VvAa1wXQGUsmskPlSzgg', 'review_id': 'IAncfG3p4Em-KJIhaLXtqg', 'text': "DIM SUM review only.\n\nWe came here on a Wednesday during the lunch hour and had the dim sum.  This is by far the ABSOLUTE WORST DIM SUM I'VE EVER HAD.  Hands down, there is no competition.  The siu may tasted old and disgusting; the shrimp dumpling was slightly better, but not much to care for; the spare rib pork on top of rice noodle (huh?) was tasteless and so was the BBQ pork in rice noodle dish; congee also had no flavor; har gow was just lukewarm and tasted just ok.  The best thing we had was the egg custard pastry.  I won't come back here for dim sum ever.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2012-02-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'jHf_i8i4LwaknsIE0rJHMA', 'review_id': 'rvmyrXVhRZ3dg246sE9njQ', 'text': 'Dim Sum... anytime... Every visit. Every Time. Only place you can find the noodle rolls with pork ribs. The shrimp and beef noodle rolls are good too. the noodle is not too thick and cakey. Also has buy one get one free Lobster with noodles. Great deal. about $30 bucks. Tastes way better than Orchid Garden.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2012-03-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ty2QGeDJsV9zp9GmlXrCrQ', 'review_id': '2XWgx0SaIHJ3aXH-yV8iWQ', 'text': 'IF I COULD GIVE THIS PLACE ANY NEGATIVE STARS.. I WOULD GIVE THEM A -2*\n\nthe food SUCKED!!\n\nstaff was okay.. but the food SUCKED...', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2012-03-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'NLYuD7EMyWeShb1hUDXz1w', 'review_id': 'GG1LvF-EDp9Ln0IoJ-T7rg', 'text': 'Food was not great. Service was very very poor.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2012-04-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'NkfzbJxUNhtMwcmdDRudmA', 'review_id': 'qAIEzS_8CY8JMSrphNWwgg', 'text': "Dim sum is good when it is fresh however, to me it seems like they lack variety. And as another person mentioned unless you can read chinese you won't be able to tell what you are being charged for or the name of the dishes. So if you want to order them in the future I guess you are just going to have to wait until you see it in one of the carts. I like their shrimp ball, and crab ball the most but when they do have a lot of variety it is really good. I would recommend it.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2012-04-03', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'PxGRY17Pj6T-t5YtE7ny5A', 'review_id': 'GCZjAuyJcId1oEt9-_b73w', 'text': "Dim Sum so sad it will make you cry like a little baby that just had dim sum so bad even a little baby knows it's bad. Waaaaaaaaaa. \n\nIf you never ate Dim Sum before you would leave thinking Dim Sum is short for Diminished Sumthing.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2012-05-05', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'vKKFs8j2SwUKYis2r--vbA', 'review_id': 'VsyL9tENyj67f6STVUM4tQ', 'text': "It was Sunday, Mother's Day and the Clippers had just eliminated the Memphis Grizzlies and we decided to go get some dim sum to celebrate.\n\nOne of my buddies had just got through saying he had never had bad dim sum and how bad could this place possibly (possiblai) be?\n\nSo we got a few items from the cart, typical dim sum stuff, and it wasn't a good sign when we all said, 'that's shumai???'\n\nWe ended up finishing what I think was 6 plates worth of stuff, got the bill and saw that it was pretty pricey for dim sum.\n\nWe were still hungry afterwards and ended up at Lee's Sandwiches at the next plaza over.\n\nDefinitely wouldn't recommend this place and not too sure there are many other dim sum options in Vegas.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2012-05-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '80F2PO2BfG7AbMCRNO4C1w', 'review_id': 'n7Pp3B16bs3OGw6JQhlAxA', 'text': 'What can you ask for as a Chinese in Las Vegas........ to have a dim sum place around the Sin City China town..\n\nHowever, the fact that I am from the San Francisco Bay Area..... makes this restaurant a really so so so so place........ \n\nNo offensive...but remember, You are in Vegas...not Macau..... so, having more authentic Chinese food around is already a good thing', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2012-05-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'A45w6PqA5Gpe1hRixrJ8fA', 'review_id': '-v1R9ZhXgEEaCntqtjFOPg', 'text': 'After a big night out, went out here at 4AM to grab a quick bite before heading home!\n\nService was fast! Like "You-Just-Ordered-10-MINS-ago" fast but sh*t...\nFOOD WAS SERVED COLD!!!!\nand i meant, NOT EVEN WARM or ROOM TEMPERATURE at least?\n\nThe two quickest food you think they can prepare in a hurry,\negg drop soup and chow mein,\nwas probably a left over from the night before and\ndidn\'t even bother to heat it up for us! \n\nYUCK!!!!\n\nDo yourself a favor!!!\n\nGo somewhere else or just buy yourself a bowl of noodles from 7-11.\nDon\'t even think about going here!!\n\n\nLOVE LIVE THE "PANDA". LOL', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2012-05-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jgi5UUoABzGZGbvudI9n9Q', 'review_id': 'qKnIDlF2xSjMPLgrHPSHPg', 'text': 'Purpose of visit: late lunch after spending the morning shooting each other during paintball. Group decided to go for a lighter meal given the time. Service is quick and efficient. Food is above average Chinese. Some of the dishes we ordered was fried pork chop. Pieces we battered and fried but a little small. Steamed whole sea bass. Garlic and spring onions made this dish very fresh. Fried rice and noodles were typically reliable.  Space is large and old accommodate a group of 12 very easily late afternoon.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2012-06-10', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'vI7wZxTprpMl2fj_IHU3iQ', 'review_id': 'miRZqdHhYU3fgqEM_rwT-w', 'text': "I had a late night special meal - sweet and sour chicken with fried rice, complimentary hot tea, soup and oranges for dessert for ~10. \n\n- tea was smooth, soothing.\n- waiters are hasty. fast service. \n- unclean yet not filthy restaurant.\n- Not a deal. Small portion.\n- disappointing taste. tasted like sweet and sour chicken at costco. \n \n-____-\n\nI came back here for their lunch special on Monday and I ordered \n3.95 level c Dim Sum\n6.50 lunch lemon chicken\nfor $14\n\n- The lunch special came with egg drop soup which was pretty good\n- I enjoyed the lemon chicken. \n- It also came with an egg roll \n- Average Lunch special taste \n- Free hot tea! Bonus! \n- Dim sum that I got was pretty good. \n- I'll come back for lunch", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2012-06-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3vs4PFjqk7mVDUCQjNuypw', 'review_id': 'LkWYz8BGZbzvdA-4md2iMg', 'text': 'went to Harbor Palace for dim sum,most was cold and the same carts came around 4 or 5 times with the same cold dishes on carts.Used to be a lot better but seems like things have changed for the worse.will not be going back anytime soon.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2012-06-16', 'type': 'review'}
{'votes': {'funny': 5, 'useful': 5, 'cool': 5}, 'user_id': '1HyygPKSSOiaM0wkM1pP8Q', 'review_id': 'B1cBDbCvwvWR8F8xddmHqQ', 'text': "This place is dingy though clean. It's painted in a lackluster pastel light blue on the inside. No frills at all here. They serve dim sum the traditional way by having ladies come around with carts. The quality of the food did not convince me. We were also pretty sad that the Chinese Broccoli was not ready yet.... We love our Chinese Broccoli....seriously love it too! They have a very homestyle flavor to their food here. Not that I know what homestyle Chinese food tastes like so much as the food has a really basic flavor to it here. It doesn't really stand out. Some of the dumplings reminded me of Mexican style chicken soup flavor. Not that that is bad really, but still I am used to better tasting dim sum. Service is not bad. They kept on asking if we wanted tea refills which s really good for this kind of place - especially when it's busy. If you do not wish to understand that some people that work and serve food in this country don't speak English terribly well you won't like it here at all and of course - you will mistake it for bad service. Parking is a breeze. This restaurant is in a nice big lot where many of the buildings have pretty Chinese style roofs.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2012-07-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6dhx-yQmS5u3W4OmaByhyw', 'review_id': 'PP6NbOWsthqa19ECjzOQMw', 'text': 'Review regarding Dim Sum: I used to come here a lot, and it used to be good. When I heard they had dim sum, I was so happy. When they brought the first tray, I wanted to leave. They have a very small selection, and it made me want to cry.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2012-07-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JNibWajiJd-9_7pw9mJnMA', 'review_id': 'AFT8H_O9PkRBYSnnkGjDRw', 'text': 'JULY 27 2012 people go around in carts or u can order from the menu. The decor is ok. Overall this place is alright the food is not really that great. I would plan not to go to this restaraunt', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2012-07-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'k9dOovr280EaPSfT_1OEPQ', 'review_id': 'TJVDsuP4dYbKvN7g5W589g', 'text': "Yuck Yuck about 2 years ago this was a\nDecent joint for authentic Chinese What Happend??? I am in Vegas and my family chose to return What a Mistake and where do I start First of all the place was filthy the rest room faucets were broken only hit water worked the tea was served with Luke warm water we ordered four dishes came out to $70 the service stunk my two boys wanted a smoothie for desert so I ordered two after I paid for the bill we waited 25 additional minutes as they forgot and were under staffed other people were upset at the bad service Chinese and tourists And the food was ok at best I will never go back there again and it was so bad it felt like the place had been taken Over due to a gamblers debt and the new owners have no idea when it comes to running a restaurant Funny thing I asked \nMy wife if she wanted to walk out when we first got seated but we stuck it out as\nWe were starving kid thing but I should have trusted my instinct and visited the restroom before I ordered This place stunk and if they don't clean up there act I have a feeling they won't be in business very long", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2012-07-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DVhevmCvTvK9Sb1gpEoE2g', 'review_id': '33cuy989fAegHk7kTITXsw', 'text': 'nothing special', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2012-07-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'OREybxlO8hJtkhwr8vFq8A', 'review_id': 'TRnvoDkJFeg1VuGR8erLcA', 'text': "The food was horrible!  First, the Cheung Fun (rice noodle rolls) were hard.  Second, the lady was asking if I wanted Siu Mai and I said yes.  The Siu Mais came with no wraps and they tasted awful.  Later on, I saw the real Siu Mai with wraps and ordered.  They tasted bad too cuz they were sour!!!  but they were the usually Siu Mai I eat.  I asked the lady about the ones without the wraps, she said those were Crystal Siu Mais.  The first lady didn't tell me about it.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2012-08-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ild2KpCzKCD-LPRIwBULog', 'review_id': 'mkXlzKjkwEdEUBxRy7UXbQ', 'text': "Worst service, workers speaking loud on their phone, flies all over, workers don't speak english, unable to use their own coupon, food sucked.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2012-08-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qHYE_F8y0EdjBjhYpmY4Jw', 'review_id': 'cORzDSZ3pVNm2E2KM-_YBg', 'text': 'The dim sum was decent but the selection was small. Price was good but all dim sum places should have good prices!', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2012-09-05', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 2, 'cool': 0}, 'user_id': '4qI-obiq1VXru-tVpK7zkQ', 'review_id': '4TdvQZKJm0sGOkSfwZIuEQ', 'text': 'Lackluster service with takeout quality food. \n\nMy girlfriend and I took her father here. We entered the restaurant and the host was on a personal phone call with her back to the door. We listened to her for a while, then she realized we were there and quickly hung up. We were sat at a table with a dirty table cloth under a pane of glass. \n\nThe president was in town and Channel 8 was showing the speech. I asked if they would show the speech on one of the three TVs which were all turned off. The manager said the TVs were reserved for advertising, and turned on one of the TVs to some type of advertising channel which did not show advertisements for the restaurant (think video games and movies.) The other two were not turned on. \n\nThe menu has approximately 200 entrees and took a while to read. The servers seemed impatient, and I do mean servers, as we had multiple servers.\n\nWe got our appetizer, and the server spilled the sauce on the table. She said, "Oops," but did not clean it. The entrees were not far behind, and the same server set the first dish in the sauce she had spilled. \n\nThe food was food, and I cannot say it wasn\'t. Her dad and I ordered a two person family dinner. It was greasy, bland, and surprisingly poor quality for $15 a person, but it was still food. My girlfriend\'s hot pot was bad. It was still food too, but she did not enjoy it. We ate until we were full, and then I used the bathroom.\n\nWhich brings me to the bathroom. The exterior door was filthy; the kind of filthy which causes you to dread entering the restroom. Think "behind the gas station in Kingman, AZ" dirty. Once in the men\'s restroom, you will find there are two urinals. The one on the left was leaking onto the floor, and the leak spread under the other urinal. This makes it impossible to use without standing in the leak. The leak runs even further under the stalls, and I imagine your pants would get wet if you had to sit on the toilet. The floor was sticky in the dry spots. \n\nWe shall never return.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2012-09-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'kIeNCDLD4M3e0HCQX7OMZw', 'review_id': 'dYiVdeYWGsRyqWL_uMspDA', 'text': 'Very bad,  waitress!\n\nBad service, long wait time.  Crazy prizes. Specials not on holidays or weekend is what she told us, But it was a Wednesday (no holiday)....', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2012-09-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'aExCH-OpVtoAsCODVjHtHA', 'review_id': 'cKq0tvCy8-eVBZUiEUsYEQ', 'text': "Service is pretty bad, food is very good. This place is one of the few places in town that does daily dim sum, so i've been here quite a few times. Lots of ultra traditional dishes, so be sure you know what you're ordering or you may be in for a surprise.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2012-10-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Uegb2JdR9ZZ-ia1sUsLITg', 'review_id': 't_kokF5JctAXI_Hf94MdDg', 'text': "I hate giving 1 star, but the place is dirty!  YUCK YUCK YUCK!  I hate finding this out after I ate, but that's when I went to the restroom and wish I hadn't seen all the dirt on the walls, floors and I could see into the kitchen, YIKES!  Where's Kitchen Nightmares?\n\nThe food, tasted OK, but nothing super or special.\n\nThe service was quick and good.\n\nBut I can't get over the place being DIRTY!  YUCK YUCK YUCK....ICKY POO POO!  NONONONO Not again....", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2012-11-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qc_9Sex0i56iEBX3ugaOzA', 'review_id': 'vMMKmCXzmI2t6f_aeBzakQ', 'text': 'Charged us $96 for a catfish after quoting price as $30 (still too much for the small gnarly fish we got).  All I could do was laugh and wish I had eaten on the strip.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2012-11-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'L4pX8XKjXtiHy8GoDv6X1g', 'review_id': '_z85YU22mBW0J7oqfT9cgQ', 'text': "This restaurant was better than what people reviewed. Good service, decent food, very affordable, and some what clean. \nYou are in the Chinese restaurant. Don't look for super clean.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2012-12-20', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 4, 'cool': 4}, 'user_id': 'iERVlopXuW0WPZ1hJv7VRA', 'review_id': 'BSuujjqCZBe5u9G5e5mfVw', 'text': "After a long night in Vegas, I was craving dim sum the next morning. I have been to Harbor Palace for dinner several times but it was my first time here for dim sum. \n\nI have to say, the dim sum was not good! It was very disappointing. I ordered siu mai, har gow, chicken feet, shrimp rice roll, glutinous rice wrapped with lotus leaf, pork bun, and this vegetarian dish. The soy sauce for the shrimp rice roll was really watered down for some reason so the rice roll tasted really bland. The chicken feet was alright but it was a little too oily for me. The siu mai and shrimp dumpling was alright too. You can't go wrong with ordering that at a dim sum place! The vegetarian dish was a little weird. They used too much corn starch to thicken the sauce and you can tell because the sauce was chunky. It was very unappetizing. \n\nThe decor of this place is kind of runned down and old. It definitely needs some renovation, especially because it was one of the restaurants in the main plaza of Las Vegas Chinatown. They should make an effort to build a better image for themselves and for the town. \n\nThe place was also understaffed. There was one lady taking care of 3 carts! I felt bad for her that she had to take care of all these tables and also manage her carts. \n\nThe tea that we ordered was also not that good quality because after the second refill of hot water, the tea became really bland and lost the taste and aroma of the tea! Usually tea leaves can last through couple of refills. \n\nI am still on the search for a good dim sum place in Vegas!", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2012-12-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uUq1ZbuuWIY65zsKUOj-Rw', 'review_id': '382I7Zql62vi6D7aOODHtw', 'text': 'This is the dirtiest place to eat Chinese food ever!  We sat down we saw the bowls  and the spoons on our table still have left over rices. One of our water cup has a yellow ring inside and i was able to remove it easily a straw, not sure what it was so we left that cup if water alone!. Either the health inspectors in Las Vegas are too gamblely or they always been doing a lousy inspection job!!', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2012-12-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'HzfjwKJ2JBUfGlBKqU-tKA', 'review_id': 'hDYU7un728BMofAlUQm20A', 'text': 'If you\'re craving dim sum in Vegas, this place in Chinatown is okay. It\'s not the cleanest; it\'s kind of dimly lit, but the food is not bad. I received room temperature Shuimai (the crab cakes wrapped in wonton wrappers); NOT a good sign. However, their tofu dessert (Dofuhua) was pretty good. Overall, their food is just average in temperature (never "fresh"), taste and price.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2012-12-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 4, 'cool': 0}, 'user_id': '2MfOxr17iC_jRqERBUQNAg', 'review_id': 'FqOTTdDDCu96u5WKGipmdw', 'text': "Didn't try the dim sum. I had a hot pot instead.\nA few points: \nRice is extra, only 80 cents, but extra all the same. Not a place you go to for that chinese dinner combo with the soup and egg roll included. \nNot particularly clean. \n$20 min for credit cards.\nAll things I expect in a more traditional chinese restaurant. \nAt any rate, bean curd and mushroom hot pot was actually quite good. \nI didn't see any carts going around with dim sum, so I wasn't able to try any, or maybe I was supposed to ask for a special menu? I don't know, but I'd like to come back and try the dim sum next.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2013-01-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3doFTfMWpYCoUs-0jNMhyA', 'review_id': 'HLrBAAONwGCBtS17YCo4UQ', 'text': "Came here I believe the night before Christmas. It was Super packed! Not only this restaurant but the whole plaza! No parking, plus all the crazy angry Asian drivers.\n\nThe sat us at a table by the entrance, so while we were eating people were standing by us waiting and just looking which is SUPER awkward. The tea cup and spoons were not washed thoroughly. They had some weird stuff on them. They were also hosting a party in one of their side rooms which is annoying because they reserved the room on a really busy night. Which meant that they got to enjoy themselves and not really have to wait when everyone else were crammed in the main room.\n\nI would have given this place two stars, but I understand that it was super busy and that they were doing their best. I felt bad for one of the service people because she was kind of old and she was running back and forth trying to service everyone.\n\nThe food was ok for me but my parents love how the food taste, but they don't really know how to eat.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2013-01-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oYLhjeQafwz8h-h_zcqMVg', 'review_id': 'umQTY91Vt-c9qZY3hOMWBg', 'text': "Dim Sum is Okay.  Staff and service are good. Dim Sum prices are pretty good.\n\nAverage Chinese Dim Sum place, but don't know any place better that is close to the strip.\n\nOverall three stars, just close your eyes if you need to go to the restroom.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2013-01-05', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'wW6ELGEFbrSrwuhhUaBKOw', 'review_id': 'oMj_epA1--Tw6RzbR19qDQ', 'text': "Bless our server, she was doing her best. But the management and restaurant have no idea what's going on. Everything is dirty. We ordered 8 dishes and only 7 came out. The server kept asking the kitchen for it, we could hear the yelling, but it didn't come until the very end of our meal. When I tried to complain to the manager about having the late dish taken off my bill she tried to pin it on the server. It was not the servers fault. The restaurant is unorganized. Food is decent but not worth the extravaganza", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2013-01-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': 'YAjMnT_aU3pNDgYO-rUUFg', 'review_id': 'rW54x7ZDL9zZ3oY75MWbDg', 'text': "This is my go-to late night chinese food fix restaurant. usually order salt n pepper shrimp (no head, no shell) or salt n pepper pork chops or Mongolian beef or beef broccoli or beef chow fun or I dont know what else. But I of all the times I've eaten here, never had any bad food. Everything tasted good and since we were there late, never had a problem with service. I recommend this place for dinner anytime.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2013-01-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': '8vgElUXinzSbnKsOeJOA_w', 'review_id': '76DuZ-1xjRMp7oBKUsRuYQ', 'text': 'They chased us out for tip!!!', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2013-01-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4Nb_V3i3i1AoJqIPs1ORdw', 'review_id': 'byo_xSspy52fJLLIKJdL0w', 'text': 'Good place...perhaps there are better places in Vegas, but it is Alhambra/san gabriel style...dirty but GOoD!!!', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2013-01-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1u5PXgM3MODAu_iBd4Wtzg', 'review_id': '-mbTVReYqOfKmD_7rwZ1-g', 'text': 'First impressions. This place is dark, dank, and depressing. Inattentive customer service, even allowing for lowered expectations for a Chinese restaurant. Waitress checking her watch as we order. Dim Sum average at best. Or at least what we were able to try. After our initial order, the carts just powered past us and our outstretched arms. No more for you round eye! Do yourself a favor and research dishes here on YELP before visiting. Know there are six pages of Chinese language menu and very rudimentary English descriptions.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2013-02-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6phsGfhy7kP_UTcLf4Z33Q', 'review_id': 'aLY3LRADj8Txyo8FIEf41A', 'text': "I walked in with a $15 Restaurant.com coupon.  I asked the hostess/cashier if I could use the coupon for take out.  She said yes, but there would be a 15% gratuity added to the bill which is clearly written on the coupon.\n\nI ordered Potstickers ($6.95), Steamed Salted Fish with Pork ($10.50), 1 order of Custard Tarts (Don Tot) ($2.10), and 2 orders of Deep-fried glutinous rice dumpling with pork (haam sui gau) ($2.10 each).\n\nThe 6 Potstickers were huge with a thick dough, just the way I like it.  The filling was generous and tasty.  They weren't burned.  It came with a side of hot chili oil.  I would order them again\n\nThe Steamed Salted Fish with Pork was a childhood favorite comfort food.  Not every Cantonese restaurant has this on their menu.  I think it is an acquired taste to eat stinky fish.  It came as a steamed ground pork patty with julienned ginger and salted fish on top.\n\nThe 3 Custard Tarts were bite-sized.  That was the last order on the Dim Sum cart.  They were with a silken custard in a flaky crust.  Yum!\n\nThe 3 Deep-fried glutinous rice dumpling with pork were good.  They are best eaten fresh and not reheated.\n\nI would order everything again.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2013-02-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '6phsGfhy7kP_UTcLf4Z33Q', 'review_id': '1WDuTAoWOm_yA7JEk39e4g', 'text': "This was my second visit for Dim Sum using a $15 Restaurant.com coupon.  They were located on W Spring Mountain Rd/Arville Rd in Las Vegas Chinatown.\n\nAs soon as we sat down, the metal carts surrounded us and kept on coming.  We started with:\n\nShark Fin Dumpling:  4 good sized thin skin dumplings filled with meat.\n\nPork Spareribs in Black Bean Sauce:  Average, a little fatty and not much black bean or jalapeno.\n\nCustard Tart (Don Tot):  3 small bite-sized custard tarts.  I got these off the cart before they ran out.  Too many times I've gone to Dim Sum and the Don Tot are not ready or they are sold out.  This is one of my favorite childhood pastries.\n\nThen we ordered:\n\nShu Mai: 4 shrimp and pork dumplings with a small shrimp on top.  More than bite-sized.\n\nHar Gow: 4 dumplings filled with small whole shrimp.  Most places mince the shrimp.\n\nDeep-fried glutinous rice dumpling with pork (haam sui gau): 3 crisp dumplings filled with ground pork and dried shrimp.  The shrimp was a nice touch.\n\nGreen Bell Pepper with shrimp: 3 slices green bell bepper topped with a shrimp paste.  This was a dish that not all Dim Sum houses serve.  My friend will be back just for these.\n\nBaked Coconut Custard Buns: 3 baked buns filled with coconut custard.  My friend said Oakland (California) Chinatown is better.  I thought they were decent.\n\nThe carts kept on coming around. They didn't have a large selection of Dim Sum, but we could have ordered some items off the menu.  I was looking forward to the Chinese tamales, Sticky fried rice, and BBQ pork pie, but did not see any.\n\n It took a while to get the check and a To Go box. There are a lot of other Dim Sum houses in the Las Vegas area, but I would come back.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2013-03-06', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 0, 'cool': 0}, 'user_id': 'nOLkxWFLbZtvLm_bVKLDcw', 'review_id': 'jIlqYA9IRWlVl21bzRHCvA', 'text': u'This is one of the first Chinese joint to opened up Chinatown, and I really cannot stretch how distinguish this place is.  It is one of those place you cannot avoid seeing driving down from the Strip.  The d\xe9cor was quite run down and dirty.\n\nThey served dim sum and other Chinese dishes.  Dim sum looked ok on average, while some of them looked somebody like vomited on it.  The taste was mind blowing in a negative way.  Some of them tasted like cardboard, while some just tasted bitter, and choices seem very limited.  The regular dishes had a unique bland flavor and gooey look to it, which was not appetizing at all.\n\nService was terrible here!  We called out for to the staffs a few times with no response and finally had to make some loud noise to get their attention, which really reminded me of mainland China.\n\nHarbor Palace Seafood... Thank you for giving our group diarrhea on the way back to Utah, something was definitely undercooked.  On another hand, I found my worst Chinese restaurant in Las Vegas.  I never knew such taste can exist in dim sum, even worse than the worst in my home state.  Maybe that is one reason to try this place?', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2013-03-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'yhW42EwRoU4XGtexub2ELw', 'review_id': 'iCuA2GnMM1yaqhHgiYmq9w', 'text': "While visiting Las Vegas I was eating at the Fremont Hotel's Seafood Fantasy Buffet on Tuesday night with my family..........a few hours later (into the evening), one of my family members experienced projectile vomiting, & ungodly nonstop diarrhea from eating at the Fremont Hotel's Seafood Fantasy Buffet! \n\nThe next day when it was time to eat again, there was no way that we were gonna do any buffet! \nHad to look for something to take out, and something light for my loved one, so off I went to the little Chinatown area on Spring Mountain Road.........I found this rather large Chinese restaurant called - Harbor Palace Seafood Restaurant.\n\nIn I walked, and the first thing I asked them is if they sold juk (Chinese porridge)?\n\nLucky for me this was our savoir! I was able to get the juk that I wanted for my loved one, it was rather expensive, but when you need it, you need it!\n\nThis place offered seven types of juk -\n\n1. Frog Leg Porridge  -  $19.00 for Large\n2. Seafood Porridge - $17.00 for Large\n3. Fish Porridge - $17.00 for Large\n4. Fisherman Porridge - $17.00 for Large\n5. Pork Porridge - $12.00 for Large\n6. Chicken Porridge - $12.00 for Large\n7. Beef Porridge - $12.00 for Large\n\nI ended up ordering the Fish Porridge...........it was the perfect thing to have, when you have a loved one ailing from a queezy stomach.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2013-04-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'sfoLpwqB767Yw2cBkqMx3A', 'review_id': 'fLodQS1ZKT91SYPsFBE_Sw', 'text': "My Wife and I were brought here with friends while in Vegas and we really liked it.  I don't understand the reviews but hey it is what it is. All of the food tasted fresh,  plus get this, my service was good.  Now, I can understand why people think the staff is rude, but they were nice enough for my group.  I totally will go back to this place next time I'm in town.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2013-06-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UAVo9UxTnVHJbCNRfX45Bw', 'review_id': 'iedCrP3HqQ5cTMeAfDnv0g', 'text': "Ehhh, probably didn't help that I had dim sum a week later in SF but I think my whole group agreed that this place was mediocre. \n\nService was slow and the ladies weren't the friendliest people. Definitely do not come without someone that can communicate to them.\n\nFood was alright, but it didn't taste very fresh even though we came shortly after they opened on a Sunday morning. It wasn't very busy and there weren't many carts to choose from but I might be spoiled with dim sum joints in CA. \n\nOverall, food didn't taste fresh nor very good and the lack of service made it a lackluster experience. It was cheap, only ~$10 each with 7 people! But I probably won't be back. \n\nTip: They only split card 4 ways so bring cash!", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2013-07-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PYsDAuI_T8x3Ock_UaIAgA', 'review_id': 'nGtVNAJo_WWv5phD8gn7mg', 'text': 'Very good Dim Sum. Some of the food was warm at best.   The rest was hot and fresh. I don\'t know why people are giving bad reviews.  I\'m Chinese and it was fine to me. I\'ve read bad reviews about the bathrooms...  They are "Circus Circus" clean bathrooms NOT Mandalay Bay bathrooms which is fine for a small restaurant. The people are very nice and polite. The prices are a bit on the high side compared to other places but I am not from the area or state so I cannot comment on the cost of living.  I had hot tea but asked for cokeS for my wife and daughter and they knew to bring forks for them.  Overall they have good food and good service, but prices on the high side. There were 3 of us and the bill was $60+. However I did have some take home so you could subtract about $8 of it...  I also went a bit overboard since I have not had Dim Sum in quite awhile.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2013-07-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cdX519UFG43i4QmELcXW0Q', 'review_id': 'pPcXQly_tk8pPtDDr2tUFA', 'text': "Terrible place! Food is alright but not the best. There are also these ladies that just push they're ugly carts around the whole restarting forcing you to buy the food on them. I think that's very distracting and annoying! The owners or mangers of the place are like hawks on your shoulders. They literally watch your every move as if you're going to rob the place!! Service isn't that great either.. probably wouldn't reccomend to a friend", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2013-08-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6DuBPBgCN6YMowFwrp_P5g', 'review_id': 'zZXC6WJi5qu08a2soqA7Fg', 'text': 'This place is okay. I go here for Chinese food. They have good beef and chicken dishes. The Lobster and noodles was pretty good. The sizzling rice soup is not great. I have had much better. The rice is not crispy enough.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2013-09-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'fMhukM-JFXdwqtpNVX-1dw', 'review_id': 'Jwwua8In5CCrsHhVrNyOzQ', 'text': "I wish I could give this place 0 stars...but the lowest I can give is 1. ANYWAY, service is ridiculously AWFUL in this place. I don't know if they have something against Filipinos, but three groups of Filipinos have walked out since we sat here.  Yes, I am here at the restaurant writing this review.  Why?  Because we have been waiting for our dimsum for 20 minutes now.  I am doing this review to kill time.  When we got here, we were never handed the menu.  BUT, the other two groups who came in after us, were handed their menus AND GIVEN SUPER VIP TREATMENT.  They gave their drinks right away and their menus.  When we flagged down the person (with glasses) at the front reception area who sat us down (since no one was around to help us) to ask for menus, he dropped the menus on our table as if we were a big inconvenience to him.  Same for when he dropped off the food we ordered...he dropped it on our table like he was forced to work today or not getting paid to work here. Also, while writing this, three groups of Filipino have walked out of the restaurant because of their service.  SO, if you are craving for Chinese food...DO NOT COME HERE!!!  Service is terrible!!!!  Avoid this place!!! Go somewhere else where it is worth to pay your hard earned money for food and service.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2013-09-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'N9KfP52_YdKCqBlPD_0khQ', 'review_id': 'xIBJMuKRiGK-uqYhVVEdWw', 'text': 'This was the worst dim sum ive ever had! Went there for lunch atound 1 pm there food wasnt warm because the lady asked us if we wanted it heated up. We should have just walked out then. There was a hair on the soy sauce container too. Lost our appetite after that. Grocery store dim sum would have been better.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2013-09-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'OsZLfkUnMb0uevVOfB9WiA', 'review_id': 'MQyMAgjdQVFrsZH8XuTIzQ', 'text': 'We love dim sum and our most favorites are in SF. We got to this one by accident and it was pretty good we even got some bao with chicken in taste we never has. We also order cod fish ala carta which was excellent. The service was good and even few that spoke reasonable English.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2013-10-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'bTkhGBk0Exrdi8S4Kj24mg', 'review_id': 'RlEV-i_qzQfjZEgAZMtN6w', 'text': 'They sat us down without giving us a menu. Then, we noticed all of the dishes were dirty. We had to get out of our seats to ask for food, and then we were not given straws with our drinks or napkins. We sat forever waiting for the bill, and no one came to give it to us. Once we went up to pay, the cashier lady was acting very odd. The food was average to below average, the tripe was poorly cooked. I would NEVER return to this place.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2013-10-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'efA2XiN-I8NEszcLLlLQUw', 'review_id': 'W7ddJb1WcSvc7uSi2sx2lQ', 'text': "Good for a dim sum fix, and a cure for a hangover.\n\nThey've got all the usuals, normal price for dim sum, and attack you once you sit down.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2013-11-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IiXWEzvvR9Gai8Fm3xbflg', 'review_id': 'v6UUa5irtMPYln4zqO8jbQ', 'text': 'The dim sum here was pretty good,  and the service was relatively friendly.  The location is right in the center of Chinatown.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2013-12-21', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 2, 'cool': 1}, 'user_id': 'l_Rmfx6knwTkhqsCg5b1MQ', 'review_id': 'gUkehnXnEsEqKjihkG5G_A', 'text': 'Food was great !!! Service is extremely poor!! I granted a dollar tip! Due to a huge language barrier orders were lost in translation. Even if you ask with a charming smile accompanied with a polite please the waitress greeted you with furiously rolling eyes and a disgruntled grunt! Seriously where is my water?!!! I am parched!! \nTip for tat: if you work in the food service industry, Do not count your money in front of your customers with a smile then serve your customers with an ugly frown and poor service!!!', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2013-12-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'KtEm1pFXaecJmyAzHxAuwg', 'review_id': '389nAk-QYRXmJ86Gaj6gpQ', 'text': "Service sucked; asked for water 3 times personally and a few times by others at my table, and it didn't come until after we asked over 5 times. Same thing for additional sauces. Huge language barrier in this restaurant; bring someone who can speak and understand Chinese for adequate service.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2014-01-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1_eIzvIrV0YCOSyJl5VQ4w', 'review_id': 'vYIwiCZU-Eqmvhecrbvjow', 'text': "One of the worst places I have ever been to. The service is horrific and the server named Chuong is terrible. I made 3 simple requests and he still could not carry it out. The food is decent. Would not recommend, not getting your money's worth.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2014-01-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'j-d2-0DvXiBBiCPod0PrKA', 'review_id': 'kYOnLgRhK1g-fTuSP2Az8g', 'text': "I came here with my family of 4. we came at 9:50 am and there were 2 tables already here. Right when we sat down they asked us what to drink and rushed us to pick our dim sum before we even poured our tea. My dad asked to give us a second to drink our tea first and the staff started giving us attitude. They neglected us and we're talking to each other (a lot of cussing btw).\n\nThe food was the usual but extra strong in MSG and starch. my spareribs and cow stomach was covered in starch. small portions for expensive price. I won't recommend anyone to come.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2014-01-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tsHLYG_zoQjlXB3jS__-VA', 'review_id': 'B-fx1cr8FlPUTCGGnr6WsQ', 'text': 'This place is AWESOME -LY HORRIBLE! I honestly wished I drove the extra mile and went to Cathay House.  This visit will actually keep me from returning.  Dim sum selection were very minimal.  Wait time for drinks was bad.  And when I asked for a specific dim sum the lady looked at her cart and took off without answering my question! WTH!  So with that being said... happy eatings!... else where! :D', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2014-01-05', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 4, 'cool': 1}, 'user_id': 'XS6XLOnFntrT5yz8jjXbBg', 'review_id': 'mgpcERPG6V7aCKVVY6LaVA', 'text': 'Oh. My. Sweet. Jesus. What. In. Lord. Buddha\'s. Name. Is. This. Restaurant. Doing?\n\nWhere to even begin here? The food is piss poor, the restrooms looks like the one from that horror movie "Saw", and the service because of the language barrier is horrible. (I may be Asian, but I\'m definitely not Chinese)\n\nThe waitress was nice and kind, but she didn\'t understand anything that we were saying.\n\nThe food smelled off and was unbelievably greasy, you have no idea. I wish I took photos, but I couldn\'t because I didn\'t want a picture of that disgusting pile of slop on my phone. \n\nPlease heed my warning, do NOT eat here. DO NOT EAT HERE. Don\'t do it, it is a total waste of money. This place is terrible. I will give it a second chance only if it steps up its game better.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2014-01-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zbZoHaOSfyCZyImStJix1g', 'review_id': 'LU4DMvVfUZFPPa-kRQkoOA', 'text': 'My friend did not like his beef dish, and the cut was low quality. I ordered steamed vegeys off the menu- they charged $25 for that. Are they for real? Not planning a return trip.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2014-02-07', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'AlkZ6hhB9rcm504vjI1mNw', 'review_id': 'vsjTI04xBHbdutoRug2P7A', 'text': "Good dim-sum ruined by extremely bad and rude service.\n\nThe dim sum is great, we always get the bbq pork buns, shumai, chicken feet, stir fried noodles, rice noodle with short ribs, etc. \n\nService on the other hand was pretty sad. We just ordered five waters and we were halfway full of food before it came out, and we had to ask about 3 different servers.\n\nNot much else to say, this place has great potential, but let's face it. You are in Chinatown. You are in a traditionally ran Asian restaurant which means service is last on the priority list.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2014-02-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-sdNsyAIHfzLUmQupsaxsQ', 'review_id': 'yqqA1E0cmNHH2DO4n1nJuA', 'text': "I'm shocked this place didn't have better reviews. I debated between a 3 and 4 star.  Either way I would def go back because the dim sum was amazing.  We went on a Saturday where we are used to only getting Dim Sum on Sundays where we live so that was awesome. The staff was super nice.  Lots of selection, the calamari was good, the Taro was very very good! It had the usual dim sum items like chicken feet but had not as common ones like the whole baby fish and bitter melon.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2014-02-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 't2sBog4AegU7z25fpLzwOA', 'review_id': 'm7fppYvLqgdQsATrSBtrWQ', 'text': "Their foods are really shitty, I got food poisoning here and I can't even stop throwing up and shitting like AVOID THIS PLACE IF YOU CAN", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2014-02-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'TjFa1dbcsuCWeR4JrCINqQ', 'review_id': '2CQ7nunD-JnN569s_PWhTw', 'text': 'This place is great we will definitely be back again and again and again! They also have a late night menu that looks good too! We ordered the family dinner B. Everything was perfect! 5 stars', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 5, 'date': '2014-03-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 4, 'cool': 0}, 'user_id': 'UVxcmcaRFif5RH9halWhbg', 'review_id': '8HQvZeXcw6wIKjxu1bKzZQ', 'text': 'Have not been here in years AND WILL NEVER GO BACK!!!!!, After reading the other reviews it seems as though nothing has changed.  I still remember the visit here vividly as it was the worst experience i have ever had at any restaurant in my entire life!\nI remember how dirty the place felt with the tacky decor, should have been a sign to run. Second issue the host had attitude to seat us in a booth with two children said no children allowed in booth. Didn\'t wanna hassle finding another place though because kids were hungry.\nWe ordered walnut shrimp, Mongolian beef, salt n pepper pork chop and fried rice.\nAbout thirty minutes later I ask a guy where our food was. He said what food!? So I say never mind we are leaving. The original lady who took our order saw we were trying to leave started shouting "why u leave no pay, food coming u need to wait" [sic] 5 min later they proceeded to bring out food, they brought out fried shrimp, soup and Chinese broccoli. I said we didn\'t order this. She argued yes you did. By now I\'m so livid I didn\'t wanna make a scene so I asked my husband to deal with them before I explode. So I go to the car. 20 minutes later he is walking to the car with the food we didn\'t order and I guess our order then I see the lady chasing him and saying no tip for me not even one dollar!! OMG are you serious?????!!!!!! She had the audacity to literary follow him outside and say this in the parking lot! Of course no tip, not after the absolute worst service ever !! That I thought was the worst part. My husband gets in the car to tell me the check was $83 meaning they charged us for the food we did not order!!!!!!!!!!!! He said the host who takes the checks wouldn\'t budge and said how does he know its not our fault and we keeping the food anyways even though we said we didn\'t want it he said ok we still made food if u keep or throw away u still have to pay! Unbelievable!!! If you want to experience a nightmare go here! Not saying your experience will be as horrendous as mine , but just thought I\'d share my dining out nightmare here as I can see I\'m not alone In this. \nYelp should have a "worst restaurant poll" guarantee this will come up! Shut harbor palace down!!!', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2014-04-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FSfG1je--GlwIKJuHDOJ8Q', 'review_id': 'NT4pcmVgWMCnoutF2qM9Xw', 'text': 'It was an ok price for the food. The food has a good taste. I ordered the Chicken Wings and it was soooo gooooooood. If you check in you get a free egg roll. I gave this place a 4 star because they gave me a veggie egg roll.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2014-04-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'iMbmI5lielqPguWVCZvFFg', 'review_id': '6WgjM95tEICCjmNwscPLQQ', 'text': "Absolutely no customer service!! The waiter doesn't even offer a greeting just rudely asks what we want and then quickly walks away before we can finish what we're saying. Food is just ok. Decor is outdated. Definitely will not come back here. Good luck getting the checked. Waved down the server but they ignored us. Not that we wanted to pay for this awful experience.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2014-04-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'b6xWh9Np7j7yfKsRigqUVw', 'review_id': '9tWzrNkqf3mqYEEIuvZUsw', 'text': "Took my wife and daughter in for lunch. before we were sitting in our chairs we were bombbarded by 3 or 4 hot carts of various delights(not really my thing) One menu for the 3 of us we ordered sodas they came in cans with glass of ice (I used to get that when I was in PI) Wife and Daughter ordered #4 chicken chow mein I ordered #7 the beef chop suey.  one cart can by with pot stickers they were the highlight of the meal  then another one said to try the fried noodles tasted like they used burnt oil to fry them inedible, then the lunch came not worth 1/2 star for taste or presentation. Sorry I know times are hard but this was not worth the $34 it cost us for a budget lunch.  \n\n   Now for the service, waitress was impatient with us one menu for 3 people wouldn't' try to answer our questions, Was rude to my wife.  I am going to learn to cook chinese food for myself.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2014-05-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GO8PtTEs0ZYfTXyA-n1kaA', 'review_id': 'GEYQpeOGYrcNha0xoARzyA', 'text': 'We had a lot of fun here and went twice in one week.   Dim Sum was the reason we were here.  We enjoyed all they had to offer on their Dim Sum menu.  All the food was great and prices were exceptional.   If you are traveling with a group, this is so much easier and cheaper.  The staff was friendly, Restaurant was clean, coupled with the great food and service - what more could you want!!!!!!', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2014-05-13', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 0}, 'user_id': 'kXh7c7abRmmqRx3zeqB1mw', 'review_id': '4e4a-Ulk3mKPsvHO-jgPdw', 'text': 'Walked in on a Wednesday, and there wasn\'t a wait. I can see why. The carts took FOREVER to come around. The "servers" were MIA. Asked for a soda, and it took about 20 minutes to come. The food here is blehhh. The service is nonexistent.... The people rolling the carts, rolled right passed us and didn\'t even ask if we wanted anything! RIDICULOUS!!!! Probably will never come here again. Sticking to Cathay House!', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2014-05-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fLlSoz17okUmRKxz4Bf2Jw', 'review_id': 'EhjIwEwjSWOpjr_4W2woxA', 'text': "Horrible service. Waitress didn't understand the order. Dirty. No paper towels in bathroom. They didn't wash their cups before they gave them to us. Had nasty residue on the bottom. Disgusting never coming here again.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2014-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'q03UhUfK29MqZp1iToIFuQ', 'review_id': 'TUuTtzDlWl7Smhf1aIbvBQ', 'text': "Had dimsum here today, the usual siomai, hagao, spare ribs, chicken feet, sticky rice and veggie dimsum. All for $23.00 and we're very satisfied! Yum.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2014-05-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'AVw90dTTKgS-fJfxmMC2KQ', 'review_id': '3Xi56B-dpcJit2BN8dBvqQ', 'text': 'We drove across town to eat some late night Chinese food, to find they closed 30mins early. All because they felt like it, the employees where sitting at tables with their phones out. So unprofessional I will never go back and I am a regular.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2014-06-10', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'tqViRSzaW-Kim_er4kuGVw', 'review_id': 'YkIwNgtSLRoXIzgRdgpviA', 'text': "I love, LOVE dim sum and my family and I have been coming here for over 6 years for their dim sum. Honestly I haven't found a place that serves anything better than this place. I gave three stars because their service is mediocre. It's impossible to ever get any ones attention and good luck with sitting the corner of the restaurant-- you'll have to holler at the cart ladies to even come your way.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2014-06-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'egz_iClkAxRn7NbqqWAZrA', 'review_id': '7It-WTGeMz2SnXCVQO07UQ', 'text': 'The service was aweful. Staff seemed to be pissed off at life. The food was not that great.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2014-06-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'NaiqyHYwGGMrXud4WnlUkQ', 'review_id': 'GPbpQn8lEPPAikMzh_M7PQ', 'text': 'very nasty food and service,,, house fried rice taste like poh poh and fish entree is a no no...overall a nasty place and oh receipt is all in chinese and has no breakdown.....', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2014-07-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'sE-m4GnRC0jDK8E2AmvDUg', 'review_id': 'of4A38WLnNVHRL8z-SZWTQ', 'text': "Is so bad. The food on the menu sound great but totally different when they come out. The price is too high and no lunch special either. We used to eat here in the morning for dim sum. Decide to go for lunch and I don't think I'm coming back anytime soon.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2014-07-02', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 5, 'cool': 3}, 'user_id': '9A2-wSoBUxlMd3LwmlGrrQ', 'review_id': 'UHEVFGSWxPODoowXfxe1IQ', 'text': 'Nothing says "I\'m thankful for American independence" like 1AM dim sum on the 4th of July! This place is regularly open til 5AM, which further begs the question: how I have I not been here before?!\n\nLate night dim sum menu is about 15 items, we sampled quite a few.\nSteamed pork buns were solid, pork shumai were tasty, shrimp balls were fresh, beef tripe was not my bag, and the noodle in the spare rib rolled noodle dish had an odd flowery aftertaste. \n\nOverall, flavors were solid and pricing was fair. Service was nonexistent despite 4 employees walking around. Orchid Garden is my usual go-to spot for gut-busting amounts of dim sum, and it sort of works in Harbor Palace\'s favor that they have a limited menu: I can come by more often without completely throwing my health goals out the window!', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2014-07-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yYenYP_aqQBFrMVhMbENGw', 'review_id': 'fPlHgPyDAzdSooig43CPWg', 'text': 'Was told by local friends this place is a tourist trap. Well, there was no wait on a weekend, the food was solid, the price was reasonable. All good!', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2014-07-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'tzy6RdLSaEeFGbs41CjsDw', 'review_id': 'JkH5DQejuLXDtJwEBUkOdQ', 'text': "This place has changed over the years or do they not serve good food unless its the weekend.\n\nWe came on a Monday with a large group for dim sum. The shui Mai was ok. The dumplings were ok. The pork ribs were ok. The rice congee was ok. The steamed shrimp with rice noodles were day old that were warmed up with watered down soy sauce. It was gross. The chicken feet were cooked in a vinegar sauce and that was awful. The shrimp ball was old tasting too.\n\nThey use to be very good for dim sum but what happened? I feel bad but it must of been the case of the Monday's. lol. Don't think I will return for dim sim here. :(", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2014-07-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HswiO5S7Hdg1h1R0DLHGJw', 'review_id': 'm-_38rAScubxzna0C2S2JA', 'text': "Food was horrible.  My fried rice looked and  tasted like yesterday's dried out rice.  It was hard and crunchy.  Disgusting!  The war wonton soup was disappointing.  Soup had no flavor and the ingredients were soft and bland.  The only thing I enjoyed was the diet Coke that came in an unopened can.  Over $70 for lunch for 3.  Never again!", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2014-08-06', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 0}, 'user_id': 'rfuxpQScGOhzOtZlwdJvSA', 'review_id': 'AF8D4g1G_E4cYw7zj5wQGA', 'text': "Uhhhhhhhhhhhh horrible service!!!! And food takes FOREVER! Literally waited an hour for the food..... If you're seated in the back room, be ready to not get your food. Trust me.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2014-08-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KaNipypVUbj1lr1gDfJ2gQ', 'review_id': 'yJEltWTTmFEoaq_VlKAWdg', 'text': "So, I never write reviews, but I had to.  Avoid this restaurant!  The food was bland and just not good. I've had better take-out Chinese food. Checked in to get the free egg rolls. They were extremely oily and not tasty.  Again, avoid this restaurant. It's not worth your money let alone your time.\nOh, I agree with the other reviews. The service is lukewarm.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2014-08-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FSfG1je--GlwIKJuHDOJ8Q', 'review_id': 'uAhsYLc5hCcfN6ukGeA46Q', 'text': 'Wow. The food was Good and the price was meh. When they saw us order alot of food they gave us a dish of fried rice for FREE!!! When you check in you get one free egg roll. THEY GAVE US THREE!!!! The waiters were nice and told us alot of info about the food. There is a lot of space to maneuver and get food at ease. I recommend you to come to this restaurant.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 5, 'date': '2014-08-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'gA6AbNt4YQDhlQqu8SnFVQ', 'review_id': 'MRL32pGVZ7bKZR566pjLAQ', 'text': 'Horrible!!!! Horrible food and service too!!!\nOrdered chicken poridge, the chicken was smelled!! Dimsum its just ok..i could make better than that.\nAnd talking about the service?! While we still eating with full of food on the table they gave us the bill already, really??!! \nAnd right before we left the waiter yelled at us asking "u dont give me a tip??" We did left tip on the table, she dont even check it just yelled and asked us! Very very rude!\nNever ever in my life will back to this place again!!! Neveeerrrrrrr!!!!', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2014-09-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ASgMm1HBB9z-r45M8g_Opw', 'review_id': 'Gm5z3P7hDeGatwrX8Us81Q', 'text': 'Went late night and was the only table in the place, good service the duck was very good tender with crispy skin and also pan friend noodles with beef were good too. Would go back again.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 5, 'date': '2014-10-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '3W6BikW2QCfHXr3BHha1WQ', 'review_id': '2FjTgICct_n-WDpHxbcZpA', 'text': "The worst place I've been too!! Food is not in good quality and cost $6 for one dish dim sum!!! And server was not efficient and seems lazy!!! If you ever want to try dim sum!!! Do not go there!!!!", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2014-10-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JWhXZy2bZSAJmLg9u1bFrg', 'review_id': 'bciBAFS4qsDaVY7Ra29OvQ', 'text': "if you i can give this negative rating, i will. bad customer service. dirty food. don't come here.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2014-10-17', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 0}, 'user_id': 'n4sKtyo0p078mIl0szNMgw', 'review_id': 'MhU0eBjOrMcoryp8zhuVOA', 'text': "This is the worst restaurant I have ever visited. The workers seemed out of it, customer service is non-existent and the food is just awful. The waiter spilled seater on my friend and he didn't even apologize. Everything we ordered was disgusting, the batter on the tempura vegetable was heavy and oily. Avoid this restaurant at all cost!", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2014-10-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oNXlUpLvc4_AbsbbQ8HYVw', 'review_id': 'hJ9UBxZ9nZRQKh-5FhGYaQ', 'text': "We come here with my cousin from Calgary who was visiting. I did not check out reviews before I came here, we were kind of in a hurry to find a place for dinner so I suggested this place. They have dim sum everyday, and hours are from 10 AM - 5 AM. They have banquet rooms which can accommodate large groups.\n\nWe had quite a few variety which I don't remember. Large selections on the menu.  The server did not understand much english. Overall, I thought the food was good.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2014-11-12', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'kkBPK9TdW0cbpkKIXXhQRQ', 'review_id': 'eI8RIFOD64QeVWsRnocXcA', 'text': 'My family and I love Dim Sum!  The Harbor palace serves great Dim Sum. We were seated quickly.  Our drink orders were taken    Promptly.  The carts were full and came around often.  The service was great.  My kids loved the fried crab claws!  We all loved the delicious dim sum and the salt and pepper shrimp.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 5, 'date': '2014-11-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '77j6setwoCDX5gXQ0lQ5qw', 'review_id': 'YoI54RTfEM2KD7Ho0fF1Pg', 'text': 'I was very impressed with the dim sum at this restaurant.  The food was very good, the service was very good, and my family and I left very satisfied. We will most definitely be returning.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 5, 'date': '2014-11-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'enmarFfy3qx8wCXjgyEwSg', 'review_id': 'E9terM-2H27VLT06tYB9mg', 'text': 'Limited dim sum selection. Slow and inattentive service. Skip it and go somewhere else.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2014-11-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'sM0AhwRlDkv7cHiV44F9UQ', 'review_id': 'IVjcQqxPv49WRytOqSNH1w', 'text': 'Their appetizers are very good..its all Ive tried..the service is very bad!  These Chinese people there dont treat u too well if unless ur their race? It feels like..so far bad experiences at any of these restaurants in China Town on Spring Mountain Rd. Their menu does not have all the Dim Sum listed?  Weird..Id say', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2014-12-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nSqz4CNk04X2LQ9Vg4NvhA', 'review_id': 'K6W_0gXAIYsCMhh0yolnow', 'text': 'Have been coming here for more than 10 years and the place had not change so much. We always come here when we are in town after church before heading back to California or late nights after drinking. Dimsum cart is our favorite specially the shrimp hargow, shrimp fried rice,  fish or from legs congee and steamed Chicken.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 5, 'date': '2014-12-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '00SPgr07ngqriooGtBoiUw', 'review_id': 'OfDGQaRv-aq5H5RkmHeLXg', 'text': 'Horrible service and worst food ever!!!!!!! The lady there served a noncooked pork dim sum to us and yelled at us she knew nothing about it. If they allow 0 star in Yelp, I will definitely do this!!', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2014-12-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '9B3cFb4GobS0nRbvJ-yWLQ', 'review_id': 'OnIg6L97VSqOdLwg6kE8BA', 'text': 'I do not know what other people talking about but this place is nice. Very good rost duck and dim sums. Very fresh and cooked to order and price is avarage ( actually rost duck is cheaper than other chinese restaurants in neighborhood)\nOpen ntill 5 am and rice and tea is free. Highly recommended.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 5, 'date': '2014-12-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'Fju_dLKhwg6pV4ejPRzQig', 'review_id': '_29TNtgpFEj6eIvAHXPaRw', 'text': 'I like the variety of Chinese food here.  Service is fast and good.  Gr8 sauces and seafood choices.  I had the beef chow fun in black bean sauce which was delicious.  Can change ingredients in dishes to suit your taste.  Loved the Korean pickled veggies given b4 the meal.\nNice hot pots and sizzling plates.  China town location w/lots of parking/seating.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2014-12-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'eSOBSwfeRV_PDKMw1bAbGQ', 'review_id': 'CqhcZD4WbwpfUb0fNKZ1FQ', 'text': "The service here is so bad that my family and I would not ever come back to again no matter how much we crave for dim sum. \n\nThe service ladies were not trained to be in this field at all. No smiles on their face, grumpy when handling our food and request. We asked for a high chair by the time they brought it out after many reminders, we were almost done. \n\nOn top of the horrible services, they gave themselves a tip added to the bill of 15%. We really don't  mind giving tips if their service was at least half decent. But for this place I would not give them a penny in tip for the way they treat their customers.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2014-12-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'cUAK4rBvwhBUdW3mhUF6IA', 'review_id': '2Gjpk-fpTKubeNCEEyq2Pw', 'text': "This place is horrible. The lady ran out asking my dad why he only tipped $5. They're pathetic.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2014-12-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yOatBjPWpAS6pNMXc19cSw', 'review_id': '-LINceP1v2PjTM1h3ge-rw', 'text': 'Do yourself a favor and by pass this restaurant.  We came in for DimSum and the food is way below average.The service is terrible. Our silver ware were dirty. We will not be back. Terrible.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2014-12-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'YgcyRwl2q_Rt-FJRNVAo9A', 'review_id': 'mezIqSVomvnQIUJf64sJsw', 'text': "This place has terrible service. Most of the waiters don't speak English. I wouldn't suggest going here! (ps they don't cut up their bok choy!!)", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2014-12-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'j-3HqXtKLSdZAYSksspy1Q', 'review_id': 'IMvVYts8caQ2q78W2TNpRQ', 'text': 'Ordered dim sum for take out. When I arrived, two of three items were unavailable. I asked for two other substitute items. Also unavailable. Why did you even take my order when you are out of what I asked for?!? Next time, save me a trip.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2014-12-29', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 2, 'cool': 1}, 'user_id': 'UHNIPTJsX_OL_DYH-nfzzg', 'review_id': 'ex3NDA3AxeR1aY_Mlvxiyw', 'text': "This place is so dirty. It's ridiculous. They obviously don't change their table cloths under the glass at the tables after each party leaves because there are sauce stains on most of the table cloths. So gross. Service sucked also. \n\nDon't go to this place unless you want to eat at a dirty ass place.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2015-01-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'S-pXLu45OxsDvDf9l_ZXyg', 'review_id': 'gsj9HQviYSUC5JZp1xRHbw', 'text': "Food's taste are very delicious, no doubt. A short haired & average tall woman seems to be the owner gives awesome customer service alongside with young waiter. But that day was our unlucky day, my girl ordered a yang chow fried rice and seemed they put extra shrimps on it. Despite curious, we did not think negatively.  On night, she began showing alergy symptoms : itchy, rashes, red and swolen skin. We know very well that she has no alergy to any seafood. It resisted for more than a week, thanks to her pediatrician to slowly make her recover. Yeah, there is always a lesson to be learned.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2015-01-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'f6SqVEQ3jlP_K-6TgHQq6g', 'review_id': 'kNBoEYTl3HKTobxsi1dpEg', 'text': 'Good service.  Always consistent.  Its irritating seeing others bash it.  If their expectations are THE PALM then pay THE PALM prices.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 5, 'date': '2015-02-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '761cNz17G7_evFWFYB7Qhg', 'review_id': '3AxyRt29fcEFHieN7MZD3w', 'text': "Ok here we go! Stumbled upon this place and what a great find. Simply put, delicious. I am not a huge fan of dim sum but could tell by looking at it that it's authentic. Ordered off the menu, beef with oyster sauce, wor wonton soup, combo fried rice, mu shu pork all fantastic. My new go to Chinese restaurant.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2015-02-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'kDihzbl6fDy7vZyJeqptQQ', 'review_id': '9z-boE7SHi-ifzsfeIHcYA', 'text': "After a failed attempt to go to Pho Kim Long for dinner, my family and I decided to eat here. \n\nBig mistake.\n\nThis is definitely the worst Chinese restaurant I've ever been to.\n\nMy family and I didn't really have a problem with the servers, it was really the food that was quite lackluster.\n\nWe ordered dim sum (I want to give an extra star for the fact that they serve dim sum for dinner, but I just can't) off of an already used dim sum order form. We got the siu mai, har gau, shrimp balls and salt & pepper squid. The salt & pepper squid was basically fried squid flavored rings of batter. It was like eating hard squid chips. And that was so disappointing because my family loves well made salt and pepper squid. The siu mai had an odd aftertaste. The only dim sum I thought was okay was the har gau. \n\nA lot of their condiments (soy sauce and chili oil) resided in dirty containers, so we were afraid to use them because they seemed old. The chili oil looked to be more oil or some other liquid than chili, which was kinda gross. \n\nThere's also no refills on drinks.\n\nSafe to say that we're never eating here again.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2015-03-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'vPMkzLzp77JQCUF6AAS1vw', 'review_id': 'ZtDOEfgy2iKuEtNlHE49wg', 'text': "Worst service ever! One word RUDE! This place use to be so good, busy, great customer service, not anymore. Went on a Sunday around 1pm and no wait (which I thought it was weird because from what I remember there's always a wait) there were only 5 other groups. Dim sum was horrible and cold and apparently they ran out of everything. Eveything was dirty; table cloths, plates, utensils, cups, everything had to be taken back for a new set. And if you needing anything no one other then your server could help u everyone else will ignore you. Horrible!!", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2015-03-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-xjcGZ9kbmrI2hy-94Pjpg', 'review_id': 'tgcI6zMaYkNSVVYN12rsaA', 'text': 'So bad! The worst Cantonese Dim sum place I have tried in my life. The food taste extremely bad and food are dirty. The rice roll seemed to be cooked several days ago, rigid and not soft at all. Disappointed', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2015-03-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '57sotoMiXJUsgMK3sBVFUQ', 'review_id': 'YsSfe-3j3JpmIqXZaWplJQ', 'text': "Our group wanted to get out of the strip to get some good food so we stopped here to get dim sum. The dim sum was really good. Everything was made to order and came out hot. Price range wasn't too bad and the service was good as well. This place needs some renovating as the decor is outdated and the bathrooms are dirty.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2015-04-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '8_RWvow6XqGai69YEJHsRg', 'review_id': 'HH_dE8znoDhaNoOaFeS38Q', 'text': "I ordered through Eat 24 for delivery. They waited 35 minutes to inform Eat 24 that they don't have a delivery driver. By now it is too late to order delivery from any other Chinese restaurant. It's extremely unprofessional that it took so long to let them know they couldn't deliver. Will never try to order from this place again.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2015-04-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FBIRw-1l7ksbsBC1us-z8A', 'review_id': '-neQBCLpsEj6AYZ3wWZqow', 'text': 'Over all a good place to eat, 2 stars because my cup was dirty at the bottom of the cup.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2015-05-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yuvl_YyI79MukNd8wauOzA', 'review_id': 'D0vCaOvQEZ1W0fOMLsyhcg', 'text': 'The reviews don\'t lie. Unfortunately I didn\'t yelp fast enough before my family walked in and got seated. Service is awful and I know that\'s expected but it was even worse than I imagined. These ladies walk up to your table expressionless and speechless as if you can see through the damn tin dishes to order from their cart. A staring contest ensues until you ask... So what do you have? After a while, the ladies started flashing some smiles and we noticed it was because they were looking at our infant son. So if you want slightly friendlier service, bring a baby with you. \n\nFood was "passable" as my hubby put it. He liked the chive and pork dumplings and not much else. I was taught to leave with at least one positive thought, so hmm... Egg tarts came out hot and fresh as we were about to leave, so that made up for the experience a teeny tiny bit. Also, the person who brought us our check who may or may not have been the owner, was super duper friendly and sweet. She said "please join us again soon!" She gave us some coupon and commented on how cute the kids were. Okay, I shall give you TWO stars.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2015-05-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GdXR1BGMkYgK5UXHWfWD5w', 'review_id': 'UXbZYxtaKs6EHQCltgUkgQ', 'text': "Awesome food! I really like their black sesame chicken and their pan fried noodle dish. Couldn't stop digging in! My friend took me here for some late night dinner, and we were both starving. We were more than satisfied and left with an eminent food coma. Has a lot of potential!", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 5, 'date': '2015-05-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Lq7eayh9vCvD-ZfcuWMcEQ', 'review_id': 'ZixvnsRg5Hx1Imi7YCXd0Q', 'text': "The outside of this place looks nice, and that's a big plus when you're looking for somewhere to eat because it stands out. The inside however, doesn't. I wasn't pleased with the atmosphere inside, it reminded me of a Asian supermarket. Everything was kinda old looking, and it just didn't set the right mood for me to eat.\n\nThe food was mediocre. I've definitely had A LOT better. I know my dim sum and when it's not the way I expect it to be, I'm in a bad mood. The people there seem to hate their jobs and service wasn't all that great. I didn't eat a lot, and didn't bother taking anything to go. If you don't believe me, go check it out.\n\nNot a place to go if you're looking for good dim sum in Vegas.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2015-05-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Gjp6lvovRtiZLzq_ii0ELQ', 'review_id': 'f9ztyZPL59ShEhi5JPev2g', 'text': 'Terrible service they probably came once to ask if we we\'re okay with drinks. The dim sum that i asked for was cold and needed to be "warmed" up never going back', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2015-06-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'YkpZ2nL426z9o79htgt2yA', 'review_id': 'imHYFOHfZz24VEEcndJA7g', 'text': "If I could give this place a zero star I would. \nIn conclusion  of you want to have decent Chinese food this is definitely not the place. Oh and don't even mention the service. It's the worst I have ever seen. \n\nI have been here many times and each time I give them an excuse for their shitty service like oh they don't understand English, but today is my last straw. \n\nMaybe because of people like me who keep giving them chances that why they are still able to open for business. Well. NEVER AGAIN. \n\nPeople if you want chinese food. You better off spending your money else where. They are many places near by. \n\nGood luck to whoever that wants to eat here.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2015-06-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZiwnkQHO-Nvk_tL6fF3Efg', 'review_id': 'j7Ox6sRli7S7syZryZ2-sw', 'text': 'Past 8pm late dinner last night, 6/5/15. So hungry so prepared to order. I was not particularly satisfied last February visit but craving for Chinese so we decided to give it another try. Ordered Hong Kong Style Seafood Pan Fried Noodles, Mongolian Beef, Salt & Pepper Squid, and Dim Sum to try (pot stickers, chives dumpling & beef ribs). It didn\'t take long and within minutes our order served one by one - so glad cz we we were starving! Food was good and surprised to say that this time around, service was decent. It must be because the place is not that packed. Our servers were fast to request for water refills, etc - place overall decently clean/presentable. The man who initially took our order actually came back towards the end to ask if everything wz ok ... that never happened before in any of our previous visits. Again, maybe because it wasn\'t as packed, but hopefully it stays that way. We\'ll come back again to enjoy good food ... next time we\'ll order "duck".', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2015-06-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MGYc0hnkE2oMR_eS1TteZg', 'review_id': 'PDm9F5pUdkpVnnEtMarhIg', 'text': 'They have a banner outside stating "Best Chinese in Vegas - 2015"  What a lie.  Worst meal I had in Vegas, worst dim sum I\'ve ever had, and they charged me $17 for the 2 plates I tried, but couldn\'t finish because they were COLD. Ponder that statement: Cold food in Vegas in June.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2015-06-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JAK-MNXRcojMV1sqrmbQgQ', 'review_id': 'KRZCG2MzvGEOHinRqsgDEw', 'text': 'Great food.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 5, 'date': '2015-06-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DeUYfuEjDj2YeMHAP4h8Tw', 'review_id': 'qlc6PBe4--FbDsqQ4ErR1w', 'text': 'This place is fairly decent. The dim sum was alright and the service was ok, not very attentive. You are required to  spend a minimum $20 to charge your credit card. Smehhhh... Not impress. No wow factor here for me to come back.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2015-06-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '63rhj5tDvB2tGcoNzO_1GQ', 'review_id': 'J3zTuaAeTy2IbxNn07mzMA', 'text': 'This place is horrible with customer service and their staff is wearing this weird mouth guard wth.... Got me wondering what is wrong with this place!!!! Food is old, stale, and you have to chase your food down cause they attack us with one cart of dim sum and then that was it. All I can say is horrible horrible horrible service. Never coming back', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2015-07-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'w_QGRAw4AlF2GExbk0OzBw', 'review_id': 'IlxvTRrAh2VtW5G8sFdfPg', 'text': "I usually yelp places to eat and wish I yelped this place before coming in. We decided to eat here as there was a sign rated as #1 chinese restaurant. Would never go here again. Bad service, dirty, and below average food. The peking duck was the worst I've had. Drenched in oil and skin not crispy.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2015-07-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6otM04J1q_O2oe7yrWBZ8w', 'review_id': 'PxH04X5bf3E-VQIgu7GiQg', 'text': 'Bad & Slow service.   Saturday at 11:00am 7.3.15. Got a table for 3 in 5 minutes.  Got our drinks right away then the first dim sum food cart came about 5 minutes later. 15 more minutes and no food cart in sight.  We got up & paid for our so called dim sum bill which was 15usd & ZERO tip.  We headed over to the Jade which was formerly Cathay House.  Got all kinds of dim sum food in 5 minutes or less.  Speedy service and food was great also... NEVER AGAIN, HARBOR PALACE..... SMALL and Bad Service.... Save yourself the time from waiting and head over to the Jade which is about 1 miles East of Harbor Palace on Spring Mountain', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2015-07-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'V3XipfYV1U4WYbe6Whjzlg', 'review_id': 'JkrHUYzoe__9l_SnvREt5g', 'text': 'Not my favorite dim sum, but still enjoyable.  Average service.  Bathrooms smelled like a mix of chlorine and bleach.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2015-07-05', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'im1tG7uayE9aLKk0VgICJg', 'review_id': 'JBAd1YFMhFau5DJQIudejg', 'text': 'Terrible terrible service. Worn down uncomfortable booth seats, not many dim sum carts and restroom pretty messy. Good luck,', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2015-07-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'd-Pynje4HfSQTWd_RPiHlg', 'review_id': 'BK53aWtsyCL8QqcBzd0z_Q', 'text': "So good. Best meal I had while in Vegas. Don't bother ordering off the menu because they come around with lots of delicious dishes on carts. Each dish ranges from $2-$4 depending on which cart you take from. It was very confusing at first but once we figured out the pricing & cart system we enjoyed it. Want something different & authentic? Come here.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2015-07-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'v8AR4Ix2lfgrizDEniDi_w', 'review_id': 'V7MQg3wnE8nA81irIistUw', 'text': "This is the only place I go for dim sum in Vegas. I absolutely love it. This place hasn't changed much since my last visit 10 years ago. The food is always wonderful.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 5, 'date': '2015-07-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ed19m0iYHBkPwJTNkShBDA', 'review_id': 'rYlmZEAifZdLMOfXJ9AlEA', 'text': 'Late night in Chinatown this is one of the few places that are still open at 1:00 in the morning. Despite the dirty/sticky menu, the food actually quite nice. Beef chow fun was tender and flavorful, and the mushu pork was well cooked. The bread tortilla was dry though, and made it tougher to roll up. \n\nStaff friendly\nParking easy\nFree egg rolls!', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2015-07-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qrFFZ5CspN2Omb5PzYYUTA', 'review_id': 'VP1R_Wd_nF91GnepWv-Z1A', 'text': "I love the food here that is why i come back. But most of the time, the guy in the front, maybe the manager, i really don't know who he is, IS SO EFFIN' RUDE!!! He's usually there late in the afternoon to late night. He showed me where my table is without giving the menu. I waited for it and nothing. I stood up and walked back in front and asked for it politely, he was writing something and did not even say anything or looked at me, when i was asking him the menu. I walked away thinking that maybe he was just really busy, then when i was already seated, he said Hey! Here's the menu, without moving his feet and trying to say, come here and get it! So stupid! Then i actually realized that he really did ignored me face to face when i approached him about the menu in the first place. And because of that, I WILL NOT BE COMING BACK TO THIS ESTABLISHMENT EVER AGAIN! RESPECT YOUR CUSTOMERS! CUSTOMERS EXPECT SERVICE! GOOD SERVICE!!! THAT IS WHERE YOUR TIPS COME FROM!!! WE PAY FOR IT!!! I STILL PAID FOR IT!!!  I will not hesitate anymore to drive to the next block to go to ORCHIDS! Tourist come here because this is the one in the main Chinatown block and because they didn't know about the other ones around. Maybe now i know why there's more customers at Orchids. I am not connected with Orchids, i just had the oppurtunity to compare the two big ones. and i am just a of dimsums. So customer, do your research first. You can always feel full after you eat, but don't you think it's much better when you feel full and feel good after you eat?!!!", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2015-07-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3qs6AOsycZssuUR6wxHMRQ', 'review_id': 'OSunezJwVpPNgVNkGOfoKQ', 'text': "The service here is terrible. Charged us for a soda we never got then when I said something when we got the bill they just minus the cost of the soda not the tax. I left no tip because we didn't get any service. We had to call someone to take our order we had to actually had to get up to get the bill and other than dropping the food off at our table we saw no one. The food was just ok and I have never ordered spare ribs before and got them boiled with nothing left on the bone. A waste of $40 for just two people.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2015-07-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TQPRjdahWGHey3Nn9iFErg', 'review_id': 'EWelExyrO0YJGVqLK1JuPw', 'text': "It's a shame. The food was great but the management is a joke, and the service is non existent. We ordered one of their select combinations which includes an appetizer, soup, rice, and a couple proteins. We ordered one consisting of beef and chicken. Turns out they dropped off someone else's entree to our table. No one said what the dish was or even bothered to stop back by until the other table questioned the where abouts of their food. Management came to my table insisting I pay for the dish we didn't order or eat. It wasn't even the correct dish for the other table. There's plenty of places in the area with good food as well, but it be a task to find a place with such poor etiquette as Harbor Palace. \nDine else where!", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2015-07-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '98sIxmBlA7iV4f4uqs_oiw', 'review_id': '4-GQy0qm_J2NL-shnx6ffA', 'text': "I checked into this restaurant without going through the reviews from Yelp. That was a total mistake on my part. I was visiting Vegas and went to a grocery mall and I saw this dim sum restaurant nearby with beautiful pics of dim sum posted on the window. Due to convenience, I checked into this restaurant and ordered some dim sum.  The quality of the dim sum was sub par and I totally regret not checking out current reviews on Yelp. Dim sum there did not taste good, quality was not good and in such a highly populated Chinese community in Vegas. The problem is that it's expensive. I would not mind paying more for quality and good dim sum, but not on this restaurant. I used yelp review to find a close to 4 stars review on a dim sum place in Vegas called Chang's Hong Kong cuisine, dim sum there was undoubtedly much better than this restaurant. Always check for reviews from yelp first before trying a restart out, or you will regret.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2015-07-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'LtwlzUFD_WLFhKtQXslTxQ', 'review_id': 'yMHid6H4PhxIBoTj_UkEhw', 'text': "Came here as a last minute stop before we left Vegas. The food wasn't amazing nor horrible. The workers were nice and weren't annoying like the other asian cart ladies who try to bribe you to eat more. The lights gave the place an uncomfortable feel. Overall, Harbor Palace wasn't the best dim sum place that I've been to.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2015-07-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GWF4bAwP7ZamnW8SerI2MQ', 'review_id': 'KE0ekB4J7iz1iy3i4GEAuw', 'text': 'Its a pretty typical chinese seafood restaurant. Been to worse been to better. One comment is that their food is way too salty for my taste buds and i can taste alot of mag used in the process. The service was decent as well. I can see that they are trying but some are inexperienced waiters... Took like 15 mins after we sat down to get our order taken. But if you really want some chinese food, its not a terrible option.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2015-08-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cPcecjS96tT_yaQWAZgT9w', 'review_id': '_QyP6aaC5cdbdE1svDEeRg', 'text': "I came here for DimSum because a friend recommended me to this place.  The dimsum is really good, but the service isn't quite as good. I would definitely come back here for a meal again!", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2015-08-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6FuLGud3rWchf6zg-T6Kag', 'review_id': 'b9pgbNMSUtH-KmqYja4PhA', 'text': "Overall, it was a good experience except a man was screaming at a customer over the phone. Hot and sour soup was extremely sour. Server offered to change the soup for me, but I didn't eat it again. So, I wasn't sure how it was afterwards. Recommended if you are a dimsum fan.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2015-08-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0YrHbr_d96OUSXfzPR6ygg', 'review_id': 'ii0IxI516IRzGAgGlNzJOg', 'text': "Sunday night for dinner here and it's a joke. \n\nThe restaurant is very run down and outdated.   Service? HA! I could have served myself. It's ridiculous, unprofessional and annoying. We've waited 40 mins for our food. I asked our server what's taking our food so long and she said it's crowded tonight. No it's not. Half the restaurant is full. \n\nFood was just mediocre, not even good plus it didn't even give the runs so it's not too bad.  Nothing impressive.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2015-08-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'NTd-IBRc3bqNr7CrX8ph4A', 'review_id': 'UZQQVWjXm4wFra8DOEltOw', 'text': "The flavors are great here but the portions are small and the food gets cold really fast. Dim sum never tastes good cold. They put a ton of flowers on the tea so it's really dark, even after adding more water. The bean curd it perfect though. The tofu is really smooth and it has the perfect amount of sweetness. Great for a quick dim sum fix.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 3, 'date': '2015-08-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'GLbCvr33xaU0l4B9fC_dew', 'review_id': 'bMty7ceskf4THPb2Ma01bg', 'text': 'Best dimsum! Yea right. Not a best place to get dimsum. Taste awful, and very expensive.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2015-09-04', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'ki_iURPJnUGuONvI8wxEBA', 'review_id': 'E0Yjzlk10i8KFp4qNj7Fpg', 'text': 'Dimsum is so awful! Expensive and with the taste, it really is not worth it. One plate is like $4-6. I can go to another dimsum place for cheaper and better food. Really regret coming here. Rude waiter/ess doesnt even want to serve us. My advice is :  the best thing they have is water or else JUST DONT COME HERE!', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2015-09-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'D5ezOR7VquF0qOng4GSu_A', 'review_id': 'H04SQyKHRTkiLcjPOyyCaQ', 'text': 'When we came in, we thought it was a decent place. When the food come in the staff with the dim sum cart were really rude. The food was overprice and some of the food are bland. The chicken feet was so salty. Totally do not reccomend to eat here.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2015-09-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'pZZp1vXh1jDTWDxuqsKSOw', 'review_id': 'YZB7SYleq075HPMGjAIXlA', 'text': 'Great food and friendly service. I ordered the fish filet with black bean sauce and its great.  They also have dimsum', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 5, 'date': '2015-09-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'zIp0-nVVVJBSuwst6GfPpw', 'review_id': 'Pc07DaZml5BpYUydqmnfAQ', 'text': 'Went looking for good Chinese food found they were open and was not disappointed at all good service great food good prices nice friendly staff love love love it will be back', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 5, 'date': '2015-09-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'YlR4NgV8IYw1dIzEF_yLZQ', 'review_id': 'M6zvEaiVW8Jsb9sdJI3gOA', 'text': "We're driving around looking for dim sum restaurant and we found harbor palace restaurant . First one lady come out point us to the table , when we about to sit another lady tell us to go to different table can hold eight person and our family had 9 adults and two kids . Dim sum restaurant but they said they don't have shrimp dumplings , and everything els taste like they made from yesterday , bad service , bad food .", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2015-09-29', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'o6wSQPZdKa-NVZLlOzs32A', 'review_id': 'opZ6eCj635bhaPOJ-vFBvw', 'text': "I was headed home from Vegas and was Hangry. I gases up and H.P. Was around the corner.\n\nThey were cooking and it smelled great. Sometimes I let my nose make eating decisions for me. Not always a good idea.\n\nThis place needs serious cleaning. My shirt was sticking to the chair..............Ewwwwww\n\nOk, really I felt like getting up and leaving but The Saue Mai was tasty and I was close to death food wise so I stayed............and prayed.\n\nWell I'm still alive n well so as they say. Prayer works.\n\nAh, I won't be here again. You can if you're a good at praying.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2015-10-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ms0i0XIu1C0pUwOeNEr8kw', 'review_id': 'xz66IDXMGUwNceQ6d410QA', 'text': 'Our first time we were here, we were satisfied.  This is our second visit and it sucked big duck beaks!  Horrible service, no dim sum carts coming around, horrible service!  NEVER again!', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2015-11-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '76lRa2ddDYu2AxAr6YvY5A', 'review_id': 'xx7RD6pdnllrXj-tMBrBjQ', 'text': "I've been here a few times with my family but thats because we didnt know of any other places for dim sum. Here are a few of my complaints: 1) they charge for hot tea when most places dont. 2) not all of the food is served hot even though you see steam rising from the pans. 3) some of the food carts just pass you by without even acknowledging you as a table waiting to see what food is available. 4) you dont really get much service here. \n\nI think Im gonna try to find new places for dim sum next time im in vegas.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 2, 'date': '2015-11-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HmVXlLhsxRGOF8Sef_81Gw', 'review_id': 'CXjKl9bLyuMtlza3O5voBw', 'text': "Nice place, good service, good food. The only thing is they don't give us more sweet and sour sauce hahaha. The prices are good and it's a lot of food. It's good for late dining they close at 5am", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 4, 'date': '2015-11-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'iTVrU7UsU0kLosy1YvmuQw', 'review_id': '5OLEQTvDVocGGel9rb5Y_w', 'text': "Place is a old, foods were ok, not enough servers working for this Thanks Giving holiday dim sum. Waited a long time for everything. Servers were not very happy keep saying sorry too busy. We didn't even get out hot mustard sauce we asked for when we just sat down. :-)", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2015-11-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'PC-Z--HWSFqEf69Pt6ok_g', 'review_id': 'K_IBPyoPvcuoP58rdFR7EA', 'text': 'Bad service from the wait staff.  The host, was the ONLY one that should be working here.  He was very nice.  The ladies pushing the carts should be fired.  They stand around and talk to each other. They get mad if you wave them over for food.   Customer service is very foreign to them.\n\nFood is cafeteria/food court quality.  You could buy the frozen dim sum at the store and it would taste the same.', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2015-11-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'x3-MN0yYDIL8p4CHY9ywvA', 'review_id': '9kPRrzaVjDvgFnPKn9Y_FQ', 'text': 'Horrific!!! . bad service, bad food. Couldnt wait to leave. Before choosing this place after a 4 hr drive into Vegas and hungry at 12:30, we said lets pick this place, can never go wrong with dimsum.... Was  friggin wrong!! sat over 15 min with just a table cloth. No one came to our table (not even the cart ladies) for chopsticks, water, plate...nothing! I had to get up to ask. the cart ladies kept not going our way for over 10 min (even after we recd utensils. The floor planning is horrible. People were getting up with their tixs just to go get their own food. After 3 friggin horrific gross plates 45 min later (because thats all we could stomach) we left. 3 plates for $11.85. Are u kidding me!!?? Went to the bakery nx door,paid  $1.50 for my tasty heavenly bbq pork bun. Never again to this place!!', 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2015-12-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cK2egwn7eDldbZ2S7_shSA', 'review_id': 'kUo6-2is7cyyMzqTtuvnow', 'text': "The food was alright but some of the foods we ordered were cold and not fresh. Also the plates, chopsticks, and cups looked a little dirty. Later on during our lunch, some other people came into the restaurant and were seated to a table close to us, but they were arguing and the manager didn't do anything about it. Once we were done we paid our check and got our change back out of $40 and they still asked for a tip, which was was very rude. Tips are voluntary and shouldn't be asked for. I paid them a tip even though they didn't deserve it because I'm for sure not going back there again.", 'business_id': '8-HkVgPClpSli0ug3Uk-sQ', 'stars': 1, 'date': '2015-12-21', 'type': 'review'}
