{'votes': {'funny': 1, 'useful': 4, 'cool': 1}, 'user_id': 'l53FUDHRHLg7BQ89KgAtxQ', 'review_id': 'atgecgd-pp6MZoqB2E1jTA', 'text': 'Man this place gets packed at lunch!  But of course it would - HUGE  slices of NY style pizza are flowing freely around this place.  And some awesome lunch specials.  In the $5-6 range you can get 2 1 topping slices and a drink, 1 slice and a salad or 1 slice and some wings.  They even have a student special for 1 slice and a drink for like $3.65.  Nice.  \n\nI wasn\'t lying about the size of the pizza.  I measured - longer than my wrist to my elbow.  About as wide at the top as my hand from finger to tip of wrist.  Will this be the same for everyone?  Um, duh - no.  BUT I\'m not obscenely small or funky shaped so you can trust me that this is a huge piece of pizza.  \n\nThe place is cool.  Seating outside on the covered strip-mall strip watching folks walk out of LA Fitness nearby or inside.  During a packed lunch good luck finding a table.  It can happen, but you have to be like a hawk and swoop on in quickly.  \n\nHint - if you want to shock and amaze your friends - get their 24" Party Pizza.  Heck, get more than one.  The boxes alone will shock people.  Huge huge pizza.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2007-05-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'FNbm3ycU2BF8C17UFfWzOg', 'review_id': 'OcDgDS-R_wwIn5L-KbTT7g', 'text': "Since I moved to Tempe a year and a half ago this has become my favorite Pizza Shop, by far. They have the best part of NY style pizza right there on the counter: The Shakies, all the goodies that you can shake on top. I'm a Garlic Powder, Parmesan, Red Pepper guy myself. I hate when a shop says it's NY style and has no shakies, that's part of the style, go to NYC and you'll see. If you get the slice special, you won't be eating for awhile, good deal for the money you pay. O and they have wings, mmmm, god-like wings made the right way with Frank's Red Hot.\n The only reason that I cannot give Venazia's 5 stars is because of a couple bad delivery experiences. The last time I waited an hour and 15 minutes before calling to check my status. The owner(Brian?) answered and explained that I had called back and said that i was picking it up instead( o, really?). I asked him why he didn't call after the order sat over an hour, plus the fact that whenever I call they already have my number, so a different number would have called and no one on this earth knew I ordered anyways. He didn't seem to care either way, which is bad customer service, especially for a loyal customer. So I felt kind of slighted. But I won't let that stop me from eating their great food, I only eat-in now  :D", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2007-07-29', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'DBdGycigal-eU4BajGje9g', 'review_id': 'iG8SAokwUGbziUqGqEBjig', 'text': "I have been a customer of this place for years.  The pizza is the BEST in Arizona.  I'm sure some flakes from california won't think so, they like their california pizza kitchen crap.\n\nIf you like NY style pizza, this is a taste of home.  My wife and I practically lived here.  Heck, I became friends with the owner I was there so much.  He really cares about his customers and making a quality product.\n\nThe party pizza is 2 1/2 feet wide, it will feed 4 hungry college students.  Make sure you ask what the daily special is.  The lunch specials are great as well, 2 HUGE slices and a soda for about $5.\n\nThey use Boar's Head Cold Cuts, which are THE best you can use.  No cheap crap here.  Get the Italian sub with Greek dressing (instead of Italian).  It is INCREDIBLE!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2008-02-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'rjlb-7-JcmM6fR64ZpyTug', 'review_id': '1eBcJAKnuOObXYtyCaqv_Q', 'text': "I tried this place for lunch the other day and it was pretty good. The slices are huge!  I usually need two to fill me up, but two was almost too much for me at Venezia's.  I could've just as easily been satisfied by one.  I got my slices to-go, but the inside looked nice and clean.  It's a good place to grab a quick bite. \n\nWhat I really like about Venezia's is that you can put whatever topping you want on a single slice of pizza, instead of having to choose from what is already made like at most other pizza places. They just put the topping of your choice on a cheese slice and pop it back into the oven.  Also, there was a nice amount of sauce on the pizza, I hate when there is no sauce!  The only sorta bad thing I noticed, which is probably to be expected when eating pizza, is that it was extremely greasy.  Even my coworkers commented on how greasy it was, but they didn't seem to care anymore once they tasted it!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2008-04-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'HOleI3jz1MLNUJ6cc1x0Pw', 'review_id': '5Yoakgpr_8quPtnG6OiW2Q', 'text': "My husband has been craving good NY-style pizza for a while now, and I found Venezia's thanks to Yelp. I went in person to place a to-go order and the place was really busy - it was filled with people sitting down to eat, waiting for to pick-up a phone order, and placing to-go orders. The woman who took my order was still really friendly and patient, despite how busy it was. I ordered a large one-topping pizza ($10.50 with a coupon I found in the paper menu sitting on the counter), a dozen Honey Hot boneless wings ($7.99), and a small salad ($2.99). The wait was 20-25 minutes but the woman was upfront about how long it would be, and the food was definitely worth the wait!\n\nThe pizza was really good - tomato sauce that was savory, not sweet, the right amount of real mozzarella, and a crust that was the perfect combination of crunchy and chewy. The wings weren't the best I've ever had, but they used good-quality chicken and had a pretty flavorful sauce. The salad was also pretty good, with fresh lettuce and pepperoncinis. A lot of pizza places skimp on the salad, but this was a decent side salad for ~$3. \n\nVenezia's is a great place to get good-quality NY pizza and sides. They deliver, but I'm not sure how far they'll go. Definitely worth checking out if you're in the area.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2008-06-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'zKyJDKJwAfWGB4HKXp9snw', 'review_id': 'qBlZYmEJ649t33-hfYTBrg', 'text': "Venezia's is by far the best place to get a slice in Tempe. 2 slices and a drink for $5.50, and the slice are huge and can be hard for me to finish. The pizza is always fresh and hasn't been sitting out all day like at Slices. The wings and salads are average, but will get the job done when needed. The sandwiches are legit, but stick to the pizza, you won't be disappointed. It used to be an awkward table set up but they just re-did the seating. Bottom line it's the best NY style slice around!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2008-07-21', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 1}, 'user_id': 'l81ILmOhky5bG7o4r3rkhQ', 'review_id': 'nyZvlRBuBZzOZPiBxiy8aQ', 'text': "Word to the V jobs.  5.75 for a drink and 2 slices or a slice salad and drink...\n\nI must hit this joint up 3 times a week.  it's so affordable and the pizza is legit.  Slices are large and they remodeled it, so it's comfy.\n\nThe slices are large and in charge.  May I suggest trying one with green chile and with Feta.  They hook up the tables with Garlic, Oregano, Parmesan and Peppers for you delight.  \n\nGo here now!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2008-09-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'FaIl5hn9UFz_x-K1e_pYMA', 'review_id': 'lgkNn7M_mVmFyNj2zAL6wA', 'text': "Truly the most inefficient restaurant that I eat at, or have eaten at, Venezias is a place with good food but little idea how to properly serve it. \n\nAs a native northeasterner I've been to many pizzerias but I've never been to a place that takes your order and takes your name when all you want is a slice of pizza and it's situated two feet to the left of the register. \n\nPlease, just take my money and then scoop me a slice onto a plate and hand it to me or scoop it into the oven and then wait on the next person.\n\nVenezias makes things far more complicated than it has to and I've had my order screwed up numerous times there. \n\nThe restaurant has something called a Party Pizza. It's the restaurant's largest size pie. It's the slices from that size pie that go on sale as individual slices. If you order a pizza pie to go that isn't a party pizza (say a large or XL) you get a different size pizza that I believe actually tastes different. \n\nThe slices are actually excellent. It truly is NY style Neopolitan pizza and the chicken wings are good too. Service is nothing what you'd expect in a pizzeria though.\n\nIt's NY style pizza but not NY style service. Everything is done slowly and overly methodically. The Tempe location is a crowded, narrow, suck-in- your-gut to pass by someone kind of place. That's not unlike other pizzerias, but in other places you only have to wait around for your order if you have something that needs to be cooked. \n\nVenezias makes you wait in some kind of pecking order to get your slice when a server behind the counter reads your name off of the register receipt. That's just bizarre. For a small cramped place that gets crowded during lunch they waste so much time asking every customer their name and then typing it into the register so it prints on the receipt. \n\nAlso, this is a pizzeria, not a fine italian restaurant. There is not a need for luxo-looking pleather booths and chairs to go along with fancy new tables. The old rickety ones were just fine. \n\nThis is a grab a meal and go place, not a break out the candles and wine kinda joint. The metal tables and chairs you have outside are just fine. The new accommodations take up valuable space in an otherwise cramped dining area.\n\nGood pizza, good wings, strange service and prices that have risen steadily over the past few years. It it were more efficient I'd give it another star, I'd even go there to eat more often than I do.\n\nAddendum: As of the Fall 09 this place has expanded and is actually too big. It's quite comfortable though and patrons seem to spend a longer amount of time there than before. There are a few flat screens on the wall too. Their method is still strange  and they call slice orders out over a microphone. Sit in the back dining room and you might not hear your name. Service even got a bit friendlier. I added an additional star (going from 3 to 4) for the renovations and friendlier service.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2008-09-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'qOQjwzKxR9UlBNr2OBJ0AQ', 'review_id': 'qMxry32KKboJKLtWvi3CcQ', 'text': "The pizza here is decent New York style, but average.  I haven't had a bad pizza here yet.  I've had the chicken parm & meatball subs and thought they were good.  The calzones are decent too.  The wings are pretty average also.  All in all, their pizza is good enough to add it to my pizza rotation.  They have a decent consistent  product at a reasonable price.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2008-10-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'GkWuTgewni9bzPM4HUCO-g', 'review_id': 'oYVdXvYW_o3yz6EsRC89UA', 'text': "I'm not a college student so I'm not basing my rating on whether it's cheap or the type of deals I can score. If you are looking for that review, stop reading. If you are someone like me who is over the age of 25 and is interested in finding a great pizzeria and craves NY style pizza then this review is for you.\n\nThe pizza is good but disappointing. There are better NY style pizzerias in the valley....much better... Rays, Gus', Jimmy and Joe's Pizza. The pizza has a lot of yeast so you feel full after two slices.  The yeast also takes away from the flavor.  The cheese lacks flavor and tastes as if there is little salt in it. The meat toppings such as their Italian sausage is small and has little flavor. They advertise as if they are an authentic Sicilian style pizzeria but it honestly tastes like imitation NY style pizza. \n\nI would strongly suggest not ordering their 12 inch pizzas. They won't feed 2 people and are basically slightly larger than a personal pizza.  Go with the 16 inch.  About the pizzeria itself....Yes, you can eat there but this joint should be viewed as a carry-out only place. The only people eating there are teenagers or college students who are grabbing a bite to eat before they go out or after they come back from the bars. So unless you fit into one of those two demographics, get the pizza to go.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2008-10-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'OsYh3jArm6fgozczE85ZeQ', 'review_id': 'wVsrJjqouzrPccUilb0lkA', 'text': 'when i first came here I really loved this pie.  The extra larges are pretty awesome.  I have come to like thin crust more though so I am not as partial to this pie as i once was. It is kind of doughy.\n\nGood pie though. If you suggested we go I would be up for it.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2008-11-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'dPTtIXt1__JkM878pmEXdA', 'review_id': 'UNPHjolXbJUxL49HAI6JxQ', 'text': "Big. Greasy. meaty. \nInteresting that this simple foundation is enough to surpass what I would normally consider fatal flaws in pizza:\nAbsence of cheese (maybe I'm not New York enough?*), and \nit really does seem to take longer than reaching over and handing me THAT SLICE RIGHT THERE should.\nThat's cool. Time for one phone call or a quick visit to neighboring liquor store.\nOh- and Venezia's's staff has never scolded my freshly purchased booze being in their place. Great Job!\n\n*I'm pretty sure I ate plenty of cheese on my visit there, though..fondue pot of the world", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2009-01-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'X6GycoLMzQaocXBANVnB4Q', 'review_id': 'mVaOlg3hwQS2mco7PdECMw', 'text': 'I first tried this place not long before moving to Tempe. A friend of mine had constantly raved about it so when I was in the area we finally hit it up. When he told me to get the 2 slices and a drink special, I was perplexed.\n\n"Do you want to split an order of wings or something too?", I asked him.\n\n"No, the two slices is enough food. Trust me."\n\n"Two slices? I\'m a grown man, son."\n\nIn my stubbornness I ended up ordering some wings with the pizza. As usual, it turns out I made a mistake. When you\'re eating with veterans of a food establishment, listen to what they have to say. The slices showed up and they were just massive. Apparently the single serving slices come from the huge party size pizza which I\'m yet to have ordered. I was full after both slices and a couple of wings, and this was despite me putting in significant effort to eat all of the wings to prove how right I was. \n\nThe pizza itself is nothing too special, but is extremely greasy with good crust. They pack the cheese on too, which is always commendable. Basically, this is really good pizza at an affordable price. You can eat two slices of pizza and get a drink for around $5-6 and can order pizzas at a price very similar to that of the large chains.\n\nThe above is why Venezia\'s is great. They effectively replace all of the pizza delivery chains with better pizza at a similar price AND have single cheap meals AND have good sit down areas. It\'s not gourmet pizza. It\'s probably not better than some place you wait in line to sit down in a restaurant and pay $20+ for your medium pizza. Venezia\'s is just delicious, affordable, convenient local pizza. That, boys and girls, is the type of place you get the most utility from. I have probably eaten here more than anywhere else since moving to Tempe with the possible exception of Haji Baba.\n\nThey also have excellent wings and some really awesome daily specials. For example, on Fridays you can buy extra large cheese pizzas at $6 each after buying one at normal price. The staff is friendly and they have fairly late hours. Oh, Don\'t get the Italian Stallion pizza. The description is great but it\'s just not that good.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2009-02-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'gjuGV0llM71Islcvt2OIHw', 'review_id': '-3VKPRGRqSJZ-hYlNq6MSw', 'text': "Venezia's has terrific pizza.  period.  locally owned and operated by a family who really cares about their customers.   It's all we eat anymore when it comes to pizza.  it's close, delivery is fast and the pizza is great.  an impressive list of ingrediants like spinach, artichoke hearts, and other stuff you don't usually get in a chain pizzaria makes it easy to customize your pie to your specifications.  you can also order online! two greasy thumbs up!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2009-03-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '0csAyu4VGRViDLRL3I3AXg', 'review_id': 'vp7K9Ksn1yYmgGTgcKuGVA', 'text': "Great pizza for a killer price, 2 slices and a drink for only 5.32! So much good pizza for about what you would pay at slices if not less! If you go to McClintock High School or are in the area don't pass this up!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2009-03-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hFtlFksrcLaWHGPNa6SmeA', 'review_id': 'InZ1SwLWJyQwmkNqUnaTBQ', 'text': "this is basically the only pizza i eat. it's best when it's extra extra hot. their homemade salad dressings are so yummy. and their marinara is perfect- i could eat it like soup. don't laugh, you would too!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2009-03-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': '5Td84D4oDkkgxsMeqcrTRw', 'review_id': '7PxPzUmQEbt22axboy1pOg', 'text': "When I worked in the on-line retail world our company would order pizza from Venezia's.  Then I found out I was working with one of the owners.  He left his secure job to start slinging pizza's full time and hasn't looked back.   \n\nI miss not having one of their pizza's at least once a month and last night we decided to order a pizza for dinner and I also had one of their small tossed salads.  \n\nI have yet to be disappointed with any of their food.   The homemade lasagna is awesome.  Their tossed salad is more then just a couple of pieces of wilted lettuce and cherry tomatoes. They have cucumbers and some wonderful peppers, which really adds to the flavor, and a plethora of croutons.\n\nWe always order one of the specialty pizzas the Venezias Special.  It's made of awesome goodness.   If it were up to me I would eat one of the Park Avenue or White pizza because those are my absolute favorite.  \n\nThe prices are higher than a chain restaurant but you also get what you pay for.   I'd eat here three times a week if I could afford.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2009-04-21', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 4, 'cool': 2}, 'user_id': 'OD2Kgy7ofGFm8NCICkqeBQ', 'review_id': 'YM10LJv4-t7cZQCpKOG9lA', 'text': "Love this place!  It's a little expensive for me to eat regularly (I'm a cheapass), but I have yet to regret it.  The pizza and wings are great.  I recently had a calzone from there and it was delicious!   Decent delivery time and they have regular specials.\n\nThe establishment itself is decent.  I've been in there once or twice and it was uncomfortably busy, not to mention packed with indie hipster emo kids or whatever they're calling themselves now.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2009-05-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'w-BbcR34gpoY0thRiPhZTg', 'review_id': 'J3xNwhCVJEoiMwWHspyd3w', 'text': "Fantastic pizza.  The slices are large, and the lunch specials are pretty darn reasonable.  When it comes to wings, I'd go with the medium, unless you're in the mood to sweat, in which case the hot are a spicy treat.  The place is pretty small, so it's not the best for large groups.  Grab it to go or have it delivered if you're with a bunch of people.  \n\nThe folks running it are swell, the food usually comes out quick and the pie is great, not too saucy, and perfect when you're in the mood for NYC style pizza.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2009-06-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uhbiaLowmnoeT97PMoAwdQ', 'review_id': 'N2T9vk7hBfluJtz97D7E_A', 'text': "Really good pizza. Close to ASU. Just be careful because it's really hot!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2009-06-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DFi16_-IV_4MkkwxVnX9EQ', 'review_id': 'UVgG8kLYWgr5Sr0_6h9iQQ', 'text': 'The best pizza in Tempe.  The dough is high quality and soft, thus the crust is fantastic.  The sauce is also very high quality and not soupy or liquid lava.  The toppings are baked in and on top of the cheese so when handling the big slices, everything stays together. Great bang for the buck with the combo specials and the daily specials are not too shaby either.  \n\nNow to the calzones. Oh my lord the calzones. Nuff said.  \n\nService is good. Atmosphere is good. Everything is good.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2009-06-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'd2RAl63RTdfZF7kcuKcj-g', 'review_id': 'TBa_9Gjn1cBA8IKlVsmYog', 'text': "5 for pies, 3 for slices.\n\nSlices are pretty hit or miss - sometimes they pop out stale, with the toppings obviously thrown on last minute, and sometimes they come out lovingly crafted by the Hephaistos of pizza in the fires of delicious.\n\nIf you order a pie, then you're guaranteed freshness.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2009-06-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Qfe65uvHyyFsNVQ6pqnk9A', 'review_id': 'WUXHcLZODWWlktHr4UO_UA', 'text': "OH YEAH! Good quality pizza, speaking from someone originally from Chi-town where Lou Malnati's Chicago style deep-dish pizza reigns supreme, for Arizona. If you decide to have your taste buds bust through a brick wall the way Big Red does, try the Italian Stallion (but add some pineapple); and you are guaranteed to leave with the inevitable, kool-aid-smile of satsification. \n\n(Although, Round Table Pizza's Maui Zaui still has our heart)", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2009-09-10', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 0}, 'user_id': '8gX8VpBo0dnSlKkWIdhIrA', 'review_id': 'XrqsFNEWpK596vKMDjeSPg', 'text': 'After seeing people come back to work with these white Venezia\'s pizza boxes for the past couple months, I suspected that they knew something that perhaps I didn\'t...and I was correct. What they knew, and I had the pleasure of finding out today, was that you CAN get a damn good lunch for under $6! Their special consisting of 2 huge one-topping slices and a drink was just right...I left fully satisfied and full, without that "I just swallowed a brick" feeling. I definitely intend to make this a regular weekly lunch spot, keep up the good work guys!\n\n**UPDATE** I just need to make a quick addition to my review here, I have recently fallen in love with their chicken pesto pizza, oh my, this stuff is AMAZING. Granted, 6 hours later when you burp you\'ll taste it all over again (and my friend\'s wife doesn\'t appreciate the garlic breath that results from these slices), but it\'s a sacrifice well worth making. Also, even though they charge extra for a side of ranch, it\'s a necessity for dipping and a perfect compliment to their crust.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2009-10-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'e44rUPb0ne7hcmEo6MzRGg', 'review_id': 'hPPAgMH7JDLS2t_uVH0Hmg', 'text': "i love their lunch special!  you can get a huge slice, 6 wings and a drink for under 6$.  my favorite here are the wings - i get honey medium (its not on the menu, they have honey mild and honey hot, but they always make it for me) and they are really good.  the pizza is tasty - nice crust and just enough sauce.  they have lots of toppings to choose from as well.\nthe place is pretty small right now, but they're expanding next door.  it should make eating in a lot easier.  take out is simple too.  they have an online ordering system that is easy.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2009-10-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zCC6huLkNBEr3JUgQyxJbg', 'review_id': 'JTpbdfCi6Sec8E39oKXRWw', 'text': 'For the overall experience of dining in, I have to give the place an average rating. Is the pizza good? Yes - definitely good. The Wings? Yum! I love the hot wings. I have never ordered a full pizza, only a slice. Typically I go with the 1 slice + 6 wing & drink combo for $6.\n\nWhat detracts from the experience for me is the wait - today I ordered the above mentioned combo at 11:45 and while the wings arrived somewhat quickly, the slice of pepporoni pizza took a long time. I finally had a complete order and started eating at 12:15. The second thing is the size. This place is about the size of a closet - definitely sucks if you are trying to fit a group of people. By group I would say more than 3. There are a few tables in the main room, a couple outside and some in the back room. The problem is there is no traffic flow - the hallway between the rooms is narrow. If the tables are filled, which normally they are, people stand in the room, the hallway and make it challenging to get through. The fountain drink machine is in the back room and makes for a pile up while people try to find a spot, fill a drink and try to back out of the way. As popular as the business is, an expansion is definitely needed!', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2009-10-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yh7Jop3WGJQKTPZq0zoPvg', 'review_id': 'OwqIAfAOX1SmiUN4w8dv1g', 'text': "OMG, I found New York quality friggin' pizza, and they DELIVER to my house!!  (yep, they're the fold-'em-in-half and wolf 'em down while you run for the subway kinda slices...)\n\nWe also got the spaghetti and the meat lasagne.  Both are excellent, the lasagne especially so.  Breadsticks, cheese garlic bread and regular garlic bread:  all really good.\n\nSmall hitch with a missing item in a large delivery order, which they handled so quickly and so perfectly, that I'm calling the service excellent.  \n\nA great, independently owned NY style pizza place with amazing food and great service...  Heaven in Tempe!!\n\nPS  You can order entirely online, with a really good user interface that includes pictures that match what the food really looks like.  I love that.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2009-10-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'joIzw_aUiNvBTuGoytrH7g', 'review_id': 'JXqlEPpfZgi8rYD3R8S5mw', 'text': 'Pillowy soft crust with dusted semolina on the bottom with gorgeous sauce that has a real "bright" fruity tomato taste, and silky smooth Mozzerella cheese makes for a great slice at this place.  Exceptional values are available at lunch as well.  Many pies available for selecting a slice at lunch, and the atmosphere is unpretentious with a checkerboard feel to it.  Staff was friendly.  Downside are the ASU types that frequent the place - and that lame placard that indicates it was the #1 slice pizza chosen by ASU residential life dormatories... who cares?', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2009-12-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5BWawb-Of895TjZyWqlu5g', 'review_id': 'Ku41Y0Nqm_PcIR4Iu30wEw', 'text': "Fuhgettabout it...this is some damn good New Yawk style pizza!!  It's about time we had a decent pizza joint in AZ (compared to NYPD).  I think what defines this place is the variety of lunch specials around $6.  Oh yeah, did I mention the enormous pizza slices?  I usually rock the 1 slice and 6 boneless chicken wings combo and I struggle to finish it all.  The wings are decent but the chicken and pesto pizza is phenomenal, I highly recommend it.  If you're not in the mood for that, there are a variety of slices to choose from.  I'm confident you can find something you like as they have it all.  I've never had the calzones but I hear they're very good (and large) as well.  My only complaint was that prior to them remodeling, it was a bit cramped in there but since they've now expanded, it's a great place to come to for a fast, cheap and good pizza slice.  Good stuff!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2009-12-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Z6_d6w5G5QkosYMRhct_Vw', 'review_id': 'Ti4hlKdxxh2XTAqw9amUCw', 'text': "I've had pizza in every major city in the USA and this is hands down, THE BEST, anywhere!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2010-01-04', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'xGoJzg_yhTU16TVynBP4uw', 'review_id': '_vzLjuI2kY880Gv44OXDvQ', 'text': "Not to bad! It is hard to find good pizza in Phoenix/Tempe, but this was not bad.\n\nThe crust is very good and has that nice dough flavor.  The ends are just as edible, and fantastic dipped in ranch.The sauce was excellent. Plenty of cheese, but a little light on the toppings. Pizza was a little sloppy, which I don't mind, but it did required a knife and fork. They seem to have fantastic slice special that is super cheap: around 5 dollars, and they have a student special as well.\n\nIf this pizza was in any other town it would only get a 3 or 3.5 at best.\n\nThought it was kind of lame that they charge for ranch, especially when you are paying 17 dollars for a pizza. But no other drawbacks.\n\nPlenty of places to sit.  They do deliver although they charge 2 dollars, and the lobby is littered with flat screen TV's for the football junkie.\n\nService was fine. Typical fast food type service. \n\nOverall we left full and satisfied! We will go back.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2010-01-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kRH3HttbiNoD-BgomNVVtA', 'review_id': 'd8jCRvc6W1R1DHEuokILPg', 'text': 'Solid pizza! Great prices and the HUGE 24" pizza is great for parties or, should I call it now... the 2010 SUPERBOWL PARTY feat OUR AZ CARDINALS!!! (one can only hope). Last superbowl, i ordered (2) of the party pizza\'s, and it was more than enough for 10 people. \n\nThe toppings are fresh, and the dough is excellent. The cheese and sauce are both above average.\n\nAfter rennovating the interior, this place went from college late-night hang out, to modern semi-upscale establishment. \n\nThe employees are still friendly and the pizza, still excellent. Wings get a 7/10 on my scale. pretty dang good.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2010-01-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KYeLSM3MQpirmHukVV5Iow', 'review_id': 'cBCjIWjZlJ6-CpEkQG4naQ', 'text': "This is, hands down, the best NY-style slice I've had in Arizona.  It's big, greasy, and tasty.\n\nThey lose a star only because it's not quite there with NY's best, and it has been a little inconsistent in the past, although I haven't had much of a problem with that lately.  \n\nGreat value if you want a lunch close to $5.  Even a college student will find this place affordable.  Their wings are also delicious, and I have lately found myself gravitating towards a slice and wings instead of two slices.\n\nAlso, if you found this place cramped before, you should know that they recently remodeled.  What was previously the entire restaurant is now the kitchen, and the dining room is more than twice the size the restaurant used to be.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2010-01-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3ZWV5fivqiTmzrKsiyGiVg', 'review_id': 'G5LG8D1TeODhx8wVf_A4wA', 'text': 'Not your average pizza joint. It may be in a strip mall, ironically located outside of la fitness, (and yea there have been times as I was leaving that I wanted to pickup a pizza) and look and smell like a standard pizza joint - but taste that pizza and tell me it is average - fantastic sauce makes fantastic pizza.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2010-02-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rYZeLgKIoyAxhMdL12-wRw', 'review_id': 'LjYtOS0R-YaRIfUh7m2rTA', 'text': "I can't believe I hadn't heard of this place before.  I've gone 3 or 4 times now, and it's been consistently good.  Standard lunch price for a pizza place, good greasy pizza, and I enjoyed the boneless wings.  Next step is for me to become the FourSquare mayor, 'cause I'm all Web 2.0 and stuff.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2010-03-02', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'XiHx6-Sg9aCu0XrEfeNJ-w', 'review_id': 'YUsYZ_5y32Y8UC4gKcKoIA', 'text': 'Great place to grab some slices for lunch or to get a whole pizza for whatever. \nThe toppings are great, perfect amount of sauce, and always extra cheesy. \nThey have great specials for slices and the rest of their menu. \nGood choice for a casual pizza place in Tempe.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2010-03-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'A3PEy6o-lQ-kRX3PXJo3hQ', 'review_id': 'je4JWrmz6SRK_c0_DUMWUA', 'text': 'It was a beer, pizza kind - of - a- night. And a mighty fine one at that! First time trying the place out... heard about it via a junk mail insert advertisement, decided to give it a go. Called in an order for pick-up. Ready in 15 minutes. Perfect. Tried the BBQ chicken and added pineapple pizza, yes I know it sounds weird, but quite tasty. \n\nThe best part of the experience? Why seeing the YELP sticker in the window of course! Hoorah!', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2010-03-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2TX0Gv0k6ZtEfVyImcvnNQ', 'review_id': '44Az7rPLFBMX1OsfgGTz-g', 'text': 'The pizza here is pretty tasty, and the slices are HUGE- my stepdaughter got three meals out of a single slice.  I think they put entirely too much cheese on their pizza.  I like to be able to taste the sauce, and not have to search for it under an inch of gooey cheese.  I recognize that I\'m probably in the minority in that sense.\n\nThe sandwich I had was so-so.  It\'s called the "Italian w/ peppers" or something along those lines, but there were no peppers on mine.  I like that they serve Boar\'s Head meats, because as far as lunchmeat goes theirs has the least amount of junk in it. \n\nTheir fries were awful.  They tasted like reheated fast food fries.  I paid an extra $1.25 to "upgrade" but I won\'t do it again. \n\nAll in all though, I\'m glad this place is in my neighborhood.  It\'s clean, cheap, quick and the pizza is FAR better than any of the chain places in the area.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2010-05-04', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 0, 'cool': 1}, 'user_id': 'H3ieSfAzIkoX7Cdv3pj6RA', 'review_id': 'WjXi3DxAlyhzvLLptX72xQ', 'text': "Dear Venezia's,\n\nI hate to default to standard letter format for this review but this is the best way that I can keep it from devolving into a total creepstore gush.\n\nI love you because when you deliver, it gets to my house hot. I love that you have been here for me during finals. Without you, I would have lived off of Clif Bars and Vitamin Water alone. You provided me with the necessary carbs to go on thinking for another 12 hours. Sometimes, you even gave me fruits and veggies. I appreciate that, \n\nI didn't give 5 stars because sometimes (just sometimes!) your pizza is uber greasy...but I know it's not because of anything gross. It's all the cheese you put on there. I like the cheese, hate the grease. I'm sorry that there's no middle ground on this.\n\nAside from that, thank you for the tangy sauce that doesn't taste like someone dumped sugar in it. Thank you for the crispy/chewy crust (how do you do that!?) and thank you for being local.\n\nSincerely, \nThat weird chick who looks your hot, indie boy drivers up and down\n\n*I re-read this and realized that, standard letter form be damned, I was still plenty creepy. Sorry Venezia's...", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2010-05-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'YBOyn0hfUNjmbVOFbs0FSg', 'review_id': 'Z1F8Roy55X50MI_JzXK5cg', 'text': 'Great Pizza! The slice specials are a good price. The wings are good. The large pies can get expensive but I have no compliants about taste.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2010-05-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2ziJA4_AnTCAPIXzkq10nA', 'review_id': 'hYrso5dwZSKK3K1CjGYw6w', 'text': "Pizza and I have a long standing love affair. Growing up in Chicago, I am definately a fan of deep dish. However, in my travels I have grown to love many of the different types of pizza made in this great country. As a result, I've had some horrible pizza and some pizza that would make you smack your grandma. \n\nWhen I stumbled upon Venezia's last year, I was skeptical. I've grown very picky over the years and was having a hard time finding pizza in tempe. So I did a random google search for pizza in Tempe and came across venezia's. Since then, my family has had a torrid love affiar with this wonderful establishment.\n\n\nTheir pizza is awesome. The crust is always perfect and the sauce isn't too sweet. They do tend to go a little heavy on the cheese at times but it doesn't seem like overkill. Their calzones, wings and cheese bread are also delicious. We tried some of their desserts last time and they were great.\n\nThe service here is wonderful. I love a place that I can order online. Nothing stinks more than having to repeat yourself 15 times to the person on the other line who is standing in the loud pizza shop. The food always comes hot and fresh. They actually have cheese and peppers with them which is always nice.\n\nTheir prices are great too. Perfect for something that tastes so wonderful.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2010-05-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'i94sMKEeWy2ipDaTqyK1Fg', 'review_id': 'BO-puhvfhM7D9rsVoH0QHw', 'text': "I don't know why anyone would ever use Domino's after eating a slice of Venezia's! Their sauce is out of this world and so tasty, as is their crust. You can tell they make it by hand everyday.\n\nAnd their lunch specials (and they also have daily specials) are just the right size. I had a slice of pizza and a small salad for less than $7.00.\n\nThe Tempe location is large inside, but around lunchtime it is really busy! We got one of the last tables. Venezia's is a definite must for pizza in Phoenix.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2010-05-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'B7mOEA-S2acoo1S4t8wZ-Q', 'review_id': '7aEZJho8_p7H7dx3B0zamg', 'text': "Probably my favorite place that delivers to the girlfriends house. yeah i COULD get hungry howies, i COULD get Domino's but i want real pizza from a much smaller company. the price seems fair for what you get, their lunch special seems like a great buy, thier wings are pretty damn good to, i like all the specials they have, but ordering on the website can be a little tricky. I'LL BE BACK!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2010-05-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'jJlgHIU9ltclRKnhswpCvg', 'review_id': '4jEOYA9a6h2PuRQaQmvaTQ', 'text': "I am addicted to Venezia's.\n\nA while back, a coworker picked up a slice for me and I was not impressed.  I don't know what was wrong with me.  \n\nI re-tried Venezia's on my lunch break four days ago, and I have eaten there every day since.  I brought my boyfriend there, and he is obsessed as well.  I am boring and usually just get cheese pizza, but my boyfriend always gets the slice of the day and raves about it, whatever it is.  I also got the Combo B last night, a slice of pizza with a small salad and a drink, and the salad was impressively good.  The Balsamic dressing was excellent, too.  Everyone should try this place out.  The pizza slices are huge, delicious, and satisfying.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2010-07-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'kq5Pdsy8Znyh9KEkxWT_QA', 'review_id': 'vQFzb5TzBG1ZJeDgXgm9RA', 'text': "Venezia's is one of the greatest lunch spots ever!\n\n1 slice of pizza, 1 salad and 1 drink for $5!! \n\nAnd don't misunderstand, 1 slice of pizza is bigger than your head. They have a slice of the day in addition to their regulars, but don't let that stop you from getting creative.\n\nThey also have the most amazing ranch dressing for dipping. \n\nIt gets a big crowded on Fridays, so go early. But if you're on a budget and you're looking for some tasty pizza, this is where you need to be!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2010-07-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XsqrW1jBKg2IFuyGbn6YiA', 'review_id': 'lgClOSsxi7AmYBOstRlLdA', 'text': 'Simply the best pizza in Tempe!', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2010-07-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'M6oU3OBf_E6gqlfkLGlStQ', 'review_id': 'ceE2PvECx_JCW5QNURqh4g', 'text': "New York pizza is not made on a conveyor belt oven!  Electric, Coal or Brick are the real ny oven types.\n\nHere they use the same oven that any Papa Johns, Domino's etc uses. it does not create a proper crust, but this is just one of the problems.\n\nThe crust seemed to have corn starch or excessive flour on it creating a paste in my mouth with many bites.\n\nThe staff seems to be a bunch of high school / college kids who rather be socializing than tossing pizzas.\n\nthe inside is large and has decent seating, but why come and sit here when there are many many better options. \n\nEven their coupon is misleading as with the 1 topping coupon you save a whopping $.75 on the first topping,\n\nDon't come here for pizza it is low quality non NY style food.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 2, 'date': '2010-08-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'OMC3DRyGrDbq-oMtdRAH8Q', 'review_id': 'opMgleg4ypZhZnxaWttAmA', 'text': 'Being from NJ, I have been in search of good pizza for nearly a decade out here.  It is amazing how badly some places can screw up a food that is so simple.  Dough, sauce, cheese.  Venezia\'s does a good job of making a simple and tasty slice in the way I like it.  Greasy and limp enough to need a fold.\n\nI have eaten slices there and gotten pies to go.  The trick to Venezia\'s is always get the slices or order the same size pie that they serve there.  I think it is 18" or so.  The smaller pies just don\'t have the same quality of thinness.  They have a nice little combo of 2 slices and a drink for 6 bucks or so.  The slices are very big (they cut an 18" pie into 10 slices I think) and you will be more than stuffed.  \n\nWith all this being said, I too have a pet peeve with a place that uses a conveyor belt (1 star deduction for it).  I prefer to to have my pizza guy with heat burns on his face from slaving over a giant oven and be able to cook/reheat my slices to perfection.  For what it\'s worth though, they make the best pizza on a belt.  When the options for cheap, greasy, and flimsy pizza are minimal, I can\'t be too picky.  Aside from how they make it, the end result is all that really matters and they pull it off.  \n\nThe place is very big inside and always clean.  It is hidden in a strip mall.  I live about a 1/2 mile away and didn\'t find out about it for a few years until reading reviews for it.  For Tempe, it is the best traditional-ish option when it comes to the simple goodness.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2010-08-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0lRVGE6OlgsrGlPGLXL6uQ', 'review_id': '_ddAIQzXl_HhD0qiC1Et8A', 'text': 'We got the party size and 2 slices of the Chicken pesto. All the food was great and filling. My kids were done after only a slice each.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2010-08-23', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 3}, 'user_id': 'VcIlVWhLQLlKoHfVhsA97w', 'review_id': 'YSxWFX9prDz6WY7GW9WvYA', 'text': 'The way I see it...I\'m not gonna go to New York and complain about Mexican food, not gonna complain about Seafood in Arizona, not gonna go to Detroit and complain about Hatch Chili...common sense tells me that a business will Use resources available to imitate what they are used to wherever "back home" may be. There\'s a fine line between complaining(crazy assumption that food should be the same as it\'s origin) and reviewing(telling us what the food tasted like, not what it "should" taste like) establishments. \nFor this review, love the cheese pizza, Italian sub and hot boneless wings. \nOf course is the disclaimer that if an establishment actually claims ingredients, supplies, etc... Then it should own up to it\'s claim...', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2010-09-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'I4GAIZhlwLkGXa9PdQ18rA', 'review_id': 'M35B8uW45LfuTPkJLayXlQ', 'text': 'NY style.  big and greasy....in the best possible way.  meat lovers is awesome.  the wings are good.  lunch specials are really special.  go to pizza place for pick up....  delivery... or stop in and see the food challenge wall of shame.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2010-10-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5NF3TDfmhpqBoZHhAKoqRA', 'review_id': 'UfdrCmVCxOZAX4rVcoNLqA', 'text': "I thought it was ok.  we ordered a x large pepperoni to go, I'll probably try something else next time,", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2010-10-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'RT7vDC5qkDLZp3qR8qBX7Q', 'review_id': 'ldPbFCzuWFY0WxWbhil3Rw', 'text': 'I love the pizza and wings hands down. Lately, they are starting to lose quality like the chains. The last time I ordered pizza, the cheese was barely there and the toppings were sliding off. \n\nI usually order Ham + pineapple and 2 dozen HOT wings. I used to order honey hot, but about 6 months ago all of the wing places started setting honey on the side instead of in the sauce (conspiracy?), so I just order hot and pour my own honey on.\n\nThe coupon deals on facebook and emails are the exactly the same as on their website. If they had better deals that could compete with the chain prices a bit more, I would order more often.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2010-10-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LHQ2fuC2RDS-Md_dN2O1IQ', 'review_id': 'fPvL0yeAx9mXLjaC5bUPWw', 'text': "Good place for pizza, perhaps one of the best in the area. Great slice/combo specials. A slice, 6 wings, and a drink is more than enough to fill me up. The pizza is good, the staff are friendly, and even the wings are good. \n\nI like to get the slice combos, but they don't really bake the toppings into the pizza, so they kind of fall off (unless the pizza was already cooked with the toppings). Otherwise, the crust, sauce, and cheese are all very good.\n\nThe wings are pretty amazing as well. I like honey hot is weird, its like hot but just honey on top, and its very watery, which makes the wings soggy. Weird. The mustard hot and hot are pretty good complements to a slice of pizza.\n\nI did the party pizza challenge with a friend. Its a little tough, about 10 slices per person, but definitely doable. We weren't on drugs when we did it like some other people were, who somehow happened to finish it in 5-10 minutes. Ie, at the Tempe location, two sorority looking girls did it in 15 (they probably weighed no more than 200 lbs combined). Meanwhile, my friend and I, weighing in around 350 lbs did it in 35 minutes. Am I whining about a food contest? No, just don't try this expecting to get it done.\n\nThis place has been pretty consistent the few times I've been there. I appreciate that. I hate it when a place is awesome the first two or three times, then it drops off in quality and can be a coin flip every time you go. So far its been very consistent.\n\nThey stay well connected with their patrons on FB/twitter. I won a free slice through a contest. Free stuff is always cool. It shows that they appreciate us.\n\nAhh the raiting. This was close. I can't think of anything particularly special about this place. The pizza isn't special, the wings aren't special, and I haven't tried much else. However, I wouldn't hesitate to come here ever, and there are times when I get cravings for this place. There isn't much in Tempe that is close to this sorta stuff. My baby brother loves this place as well, and so does my GF. I'm sure they'll never say no if I wanted to come here, so I think that means this place deserves a 5.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2010-11-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'uZbTb-u-GVjTa2gtQfry5g', 'review_id': 'jxlcPDlTmKbNGCqFh1ZRcA', 'text': "NY style?  Not so much.  NY style means large, thin slices of pizza that you have to fold to eat.  I didn't really find any of this when we ordered a large pizza to go.  The dough was too thick, and it ended up tasting like a regular style pizza you can get anywhere.  Sure, I'm not expecting 100% authenticity here since we are on the opposite end of the U.S., but I didn't really see any semblance of NY in this pizza.  In addition, our mushroom pizza hardly had any mushrooms in it, and the ones that were in there were shriveled, small, and hidden inside the pizza- I probably wouldn't have noticed any difference in taste in this mushroom pizza from a regular cheese pizza.  We ordered a dozen honey hot wings as well, which I liked substantially better.  They were a nice combination of spicy, salty, and sweet.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2010-11-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZqWm6r_YMRgesJtoe_1eew', 'review_id': '869Ufpxbzwl7Pp7lV5Tpyg', 'text': 'This is why I love the yelp app for my phone. I can find good places to eat and bookmark them for later. Venezias was one of those bookmarks and today was finally the day. Let me just say that the reviews were spot on. Me and the wifey loved the pizza and wings and the new redone interior is very nice and spacious. The pizza is on the doughy side which I love but for those who like more of the cracker thin pizza be warned. The wings were good as well and I will certainly be back for NFL Sundays to feed my guests. Thanks to my boy Andy B. For the tip!', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2010-11-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'k8vE4MWAvcAYjQ7EyZGkug', 'review_id': 'T_QJgUk0vRgn0mIwvaiPgA', 'text': "This was my second time trying Venezia's. First time was during an office staff meeting. I had chicken pesto both times.\n\nI am normally a very harsh pie (pizza) critic... Having been born in Europe, I have high standards set for what a pie should taste like.\n\nHowever, Venezia's has definately been able to live up to my grand expectations. I must agree with the rest of fellow Yelpers, this pie is to DIE for!! We definately been blessed with a slice of PIZZA HEAVEN!! :)\n\nSo... get in your vehicle and take your hungry butt to Venezia's. You will not be disappointed!!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2010-11-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'gOacA6lWopfUXlJETVxpxA', 'review_id': 'YGcYFSxuoSK0egPOB1I3pw', 'text': 'There are a lot of good pizza places in the Phoenix area, but Venezia\'s takes the "pie". There\'s more than just pizza on the menu. The wings are my favorite. I can\'t find any better wings around town. The daily specials are what do it for me. The price is affordable and you get your choice of combinations. Best place for a business lunch or even to hang with friends and watch the game. Overall Venezia\'s is my number one choice for pizza.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2010-12-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'Xm8HXE1JHqscXe5BKf0GFQ', 'review_id': 'itvuay9VJzGdKNbUCxMYsg', 'text': 'Not too thick, not too thin, good ingredients and the pizza sauce is tangy and flavorful. The hot wings are good too - not totally drenched so you can still taste both the chicken and the sauce. Delivery was on time and prices are reasonably cheap. I will definetly order from them again!', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2011-01-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'f5nCzPxSauEc811_Zt5k4A', 'review_id': 'ikGoSGtdVqt31mVMcK1U7Q', 'text': "I eat pizza very rarely but when I do Venezia's is the first place that crosses my mind.  Hands down the best pizza for your buck in my opinion.\n\nBear in mind I've only eaten the 2 slice special the entire time I've eaten there.  Even when its the height of lunch rush the service is impeccable and quick.  The staff are friendly and helpful.  \n\nWhen I first started frequenting the establishment 5-6 yrs ago it was a hole in the wall but they remodeled a year or so ago and there are plenty of tables.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2011-01-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ahXmdKsanBCT6ImDa6dFhA', 'review_id': 'bRu_Wc3H9TLht8DrNfNwXA', 'text': 'Venezia\'s is my favorite pizza joint in AZ!  \n\nI\'m deducting 1 star for the service. I know this place is popular, but I feel like the service could be a little quicker. The slices are awesome, though. \n\nI\'m a Midwest kid, so I\'ll probably never understand what makes "authentic" New York pizza so special, but all of my NY friends love Venezia\'s, so they\'re obviously doing something right.\n\nFeeling brave? Grab a buddy, and tackle the 24 inch party pie. You\'ll get your picture on the wall!', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2011-01-27', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'fPHLPrymsyb6WSFFKoMrTQ', 'review_id': 'FJjbUc84c3XgQbifoOl-jw', 'text': "Venezia's pizzeria is a pizza joint that I found on Yelp and decided to try on a whim.  Usually we do take-n-bake from Papa Murphy's but I was in the mood for something new and less healthy so I ended up getting take-out from here. haha  \n\nIt was good.  Nothing spectacular but, pretty tasty.  It's a few miles from my house though so I probably won't go back.  I have discovered less healthy options in take-n-bake so, I'll probably stick with the easy and less expensive!\n\nWon't see ya there.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2011-02-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'KSTOdz0lSFCkqBSRNwjERA', 'review_id': 'Al4dWLjUO2pDDQy6TLFgPw', 'text': "One night last week, I decided on picking up some pizzas and wings on my way home from work for dinner. I wanted to try some place new. While browsing different menus of various pizza places, I was sold on this one because I saw that they carried golden wings which are my favorite.\n\nOn their website they had different specials and I decided on the family special which consisted of 2 large one items and 2 dozen wings for $31.99. Pretty decent deal I thought. I added an extra topping on each pizza and my total was just under $40. \n\nI like my pizza extra crispy so when I got home, I popped the pizzas in the oven for a little while to crisp them up. They were pretty good. I think it definitely made it more enoyable that I crisped them up in the oven for a few minutes. MY favorite type of pizzas are wood fired thin crust ones, but for NY style, these are rated pretty up there. \n\nWings were decent. They are pretty good sized wings and the sauce was on point. I'd imagine they would be better eaten in house freshly made. The crispiness was no longer there after being closed up in a box and making the drive home. As you can probably tell, I like everything crispy :) But still I liked them. They also had a handful of other flavors to choose from but I'm pretty much sold on golden wings everywhere they carry them. \n\nVenezia would be a top pick if I was craving for NY style pizza. I would order from here again, or actually maybe dine in next time, so everything could be eaten freshly made. Also, huge plus that the restaurant looked cleaned and organized. I actually imagined it to be a little dinkier, but to my surprise it looked like a place that could possibly be suitable for a casual date.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2011-02-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '3gIfcQq5KxAegwCPXc83cQ', 'review_id': 'rxbDPhnJifl-mu8JtW5fvQ', 'text': "The BF and I picked up pizza from this place for linner today after I looked it up on Yelp. We ordered a small half cheese half pepperoni pizza and some garlic bread. Both were alright.... nothing too special. It wasn't too expensive and it was better than fast food pizza but it wasn't great and I probably wouldn't go back again.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2011-02-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'x0r-IamYgKMgF3v7tJ_PTg', 'review_id': 'sSkVeaRAPkyKs4EcweiGbg', 'text': 'amazing wings and awesome pizza-the combos are reasonable and my boyfriend and i are seriously considering accepting their "party pizza challenge"', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2011-02-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'n6LeAoIuDR3NfIBEsmL_zg', 'review_id': '_kzx1UQ02IMjHgdnNETiPQ', 'text': "Amazing pizza.  The staff could care less about you and your love for it but its so damn good they know you'll be back regardless of them paying attention to you.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2011-03-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'OM9UIyw9mkqS7lOKJgb59g', 'review_id': 'Zcjl2d0WF1BrwBOBhM0Duw', 'text': "I called ahead to order a pizza thinking it would save me some time. When I arrived, they told me it wasn't ready yet and they would call my name over the speakers when it was ready. So I paid for it and sat to down to wait. After 45 minutes, I finally asked when it would be ready. I saw the worried look on the girls face when she realized that my pizza had been sitting in the warmer the entire time I was waiting. \n\nNo one ever called my name over the speakers. When they finally handed me the pizza, they didn't even apologize for their mistake!\n\nThe pizza here is excellent, but the customer service is terrible.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 2, 'date': '2011-03-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'nkF7xDv8v-HITsU8KvrjNA', 'review_id': '7Nqvi4KSLs2yPaqBZTrMnQ', 'text': "Feeling a bit sluggish one night during vacation, Lisa H and I decided to order from a local pizza joint.  After searching Yelp reviews of places near our hotel, Venezia's seemed to be the place to check out.\n\nVenezia's online menu was nice and comprehensive.  A lot of the pizzas looked really tempting, but we opted for the simple, large one topping pizza (pepperoni), so we could take advantage of the Yelper discount that was available.  We also got an order of the family-size breadsticks.\n\nVenezia gets big points for having an online ordering form!  Nicely done!\n\nBut they lose a few points for taking over an hour to deliver to just a few miles away.  Yes, yes, I realize they're probably consistently hoppin', but 60 minutes to get my foodstuffs was a little longer than I'd normally be willing to wait for pizza.\n\nThat being said, the pizza and breadsticks did arrive warm, despite the long wait.  Everything was really tasty, definitely some good pizza here!  I was a big fan of the crust.  Just thick enough not to be obnoxious.  And obviously still foldable to be considered NY style, right?  The breadsticks were also quite delicious.  But for two people, the amount that we ordered ended up being way too much!  I guess that's better than not enough.\n\nOverall, if I lived in the area, I'd probably be back to check out more of Venezia's menu.  Good eats at a decent price, for sure.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2011-03-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'OJ4FQEvd2h8QXCMHwCostg', 'review_id': '2PnH65ilFHqDF9Hgphgf2g', 'text': "I love all the food here.  Wings, sandwiches, and of couse pizza.  They recently remodeled, and the place looks great.  They have a very large dining area, and of course delivery and take-out.\n\nIn college, we ordered the 26 inch pizza on a regular basis.  It is collossal!\n\nThe 2 slices and a drink or slice, side salad and a drink special for around $5 is a winner too.\n\nIn general, everything they serve is good to great.  If you are a jerk you could probably find something to complain about, but overall, nice people like this place and this place likes us.\n\nNowadays, I am a big fan of ordering the following:\n\n1.  Italian Sub\n\n2.  Large 2 topping suggestions:  \n\n                          a.  Fresh garlic and tomatoes\n\n                          b.  Pepperoni and black olives\n\n                          c.  Pinneapple and Jalepeno\n\n3.  Any of their specialty pizzas!  They are all great!\n\n4.  Wings.  These are decent wings.\n\n\n\nOverall, Venezia's is doing enough things right to please every member of your group, so it is a good place to bring your family or friends.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2011-03-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mAWDlmTrBCbxZftZfdJf3w', 'review_id': 'oqV4suuLRSWZhjXGNDsN4w', 'text': 'Did take out was very good will return again', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2011-03-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'ChasWJt6OMCsIpPg4Uly8g', 'review_id': 'dhlqZiZidXQflKo25TtmOQ', 'text': 'This place is great! They make pizza, wings, sandwhiches, salad and pastas, though I have only ever tried their pizza. They prepare a good variety of pizzas to choose from plus their slices are huge. So far I\'ve had the pepperoni, pesto chicken, and buffalo chicken - all excellent (and great crust). They offer a "party pizza" which is 24". The place gets really busy during lunch hours and it may take awhile to receive your order, but there is plenty of seating. Just be aware of the idots that stand in front of the fountain machine.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2011-03-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'iwZ_7QuZ1tzT6pIZmOlDQg', 'review_id': 'k1Nv_zI2oD6d4C81s2PPnw', 'text': 'Only had the garden salad and the bread sticks.\n\nSalad was fresh, the "homemade buttermilk ranch" dressing was Top-Notch.\n\nThe bread sticks had a good flavor, not too salty, not too chewy, and the marinara sauce was very good too.\n\nThey are right beside the LA Fitness, and you can smell the Italian cooking as you are walking in or out of the gym...Yum.....:)  In fact, that\'s why I tried this place.\n\nWill try the pizza at a later date.\n\nThe 26" Party Pizza for $21.99 looks perfect for large parties.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2011-04-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'cCNucgcprU1pEr_TH5qfaw', 'review_id': '1068pSMC7Jh8GbSDmxavsA', 'text': 'This is by far my favorite delivery pizza in Tempe, the quality is ALWAYS amazing and the ingredients are fresh. The crust is a new york style, and the slices are big. The chicken wings come in many different flavors and are very meaty and not fatty at all, they have those perfect chared crusty bits on the outside, and moist and juicy inside. The pretty much have something for everyone. I am a huge fan of their greek salad and calzones (easily feeds 2 people).. I can really go on and on about how wonderful this place is, but you need to experience for yourself.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2011-04-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '2nXFEyQ06RfcdAXIPbxuwA', 'review_id': '1-kKdNoWqkcuwwQtIjPDIg', 'text': "I have been going to this pizza place for about a year and a half now. Even though I graduated from ASU over three years ago, I had no idea this place existed until my husband went there one night with some buddies after a study session. He came home with a large piece of pizza that was so good, and while it was one of the biggest pieces of pizza I had seen at that time, I ate the whole thing. \n\nI have been hooked since. The pizza slices are huge, the slice specials are very nicely priced, and it is never so crowded I hate coming here. I have been to this location and the one in East Mesa, and I have to say that this one is way better. The pizza just tastes better, even though its the exact same pizza. We usually only get slices. We tried a whole pizza one time, but for some reason it just didn't taste the same as the slices. I don't know what that's about but in my opinion the slices are a better value anyways. My husband and I can eat dinner of two slices each, and each with a drink for under $15. And that's a win in my book. I usually end up taking one of the slices home for lunch the next day as well. So I get more than one meal out of it. \n\nIf you want to eat some good, cheap pizza, definitely hit this place up. The pizza comes out hot, fast, and delicious. You wont be sorry you tried it.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2011-04-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'qa05pUVNapADHZXpHMPMeA', 'review_id': '0Zh3XGZkh3Jy0ITNF6434g', 'text': "Big, greasy, messy, delicious pizza. Venezias has a nice, large dining room with a bunch of tvs and great food specials and lunch specials everyday. Two huge slices and a drink for five bucks? Best deal in town. Nothing rewards your hard workout next door at LA Fitness quite like heaping gobs of mozzarella... you are seriously missing out if you haven't been here.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2011-04-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bxEyfFAEc4KI4lM4wqwWEA', 'review_id': 'yDzFMN5lRtxCa_50EBXY3A', 'text': "Found Venezia's on the Bing app on my phone.  The place was large, roomy, and clean.  The staff was patient and friendly even when we changed our minds 3-4 times when we were at the register.  \n\nTheir pizza and wings were good enough to merit several visits back during one week.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2011-04-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1wMGLaMIH7CcmJ2htS1rmw', 'review_id': 'lgAcBskYqsEnhitVqUlIzw', 'text': "Personally, I don't care for their pizza, though it is decent enough that I'll get it sometimes with a coupon. Their sandwiches are very good though. Delivery is efficient, and the prices are about what you would expect. In all, a decent place, but not outstanding. I still miss Luigi's.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2011-04-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'FKr5gdOPW7BAPjkND7XJ6Q', 'review_id': 'ptVhUBfwy1p0Y98dyBDYig', 'text': "There are few places that I have not out-grown since my ASU days and this has to be one of them. Their salad and slice special never gets old. LOVE the combo slice and the barbeque chicken slice. Also, if you've never seen anyone complete the 24'' pizza challenge... it is a must!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2011-05-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LA5SlWyJxM76zN7RbL6I0Q', 'review_id': '7dSFhZFerUt6obueAKL-cA', 'text': "I like Venezia's for lunch, the slices are huge the wings are some of the best, and you don't have to spend a lot!!   If you like NY style pizza your will enjoy Venezia's.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2011-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0trzEjjPIY1kjbl35Eucsg', 'review_id': 'CUQG2sBE_cNtuZzdMF-iMw', 'text': 'Hands down the best pizza by the slice in Arizona. Went once a week for about a year! Tell everybody to try it. If you are up for it, try the "Big One\' pizza eating challenge with a friend.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2011-06-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XDVABSG5JRXry3Dm45vnyA', 'review_id': 'dlsrubyoJNZFnjkO6vLLfQ', 'text': 'Meh. Friday night and they have tons of pre cooked pizza sitting there. Not fresh, salad that came in the combo was decent.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 2, 'date': '2011-07-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '6xjl0O7tDpQs3jv2t7ojxQ', 'review_id': 'Piq9DbecfLSNob1nEhA6Hg', 'text': 'Good pizza but not amazing.  Quite a big selection though.  Co-worker said calzone was very good.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2011-07-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_w9Heqb4e-597dC-3JP_qg', 'review_id': 'vVKH0IUvijtMlNnS5WYV1w', 'text': 'Solid place for pizza by the slice. Quality eats at reasonable prices. I have enjoyed my food every time!', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2011-07-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'px6RIT_CcE2Z1Jd52C8TQQ', 'review_id': 'mDdQ7lcWVPITx4lsuSRCJw', 'text': "Theres not much to say about this place. I live less than a half mile away and they deliver fairly quickly, so it's definitely my choice over pizza hut and dominos. I wouldn't go as far as to say the food is amazing or anything, but it's great for pizza cravings in a pinch.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2011-07-18', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 1}, 'user_id': 'V1atePrrmijiJdjFhayXCQ', 'review_id': 'XQvX1bfjlbskQXtNmqgy3g', 'text': "This place by far is the BEST big pizza by the slice you can get in AZ.\n\nNow don't come comparing it to some gourmet pizza, oven baked, organic or whatever people are getting into these days!! This is just a big AMERICAN pizza that is greasy and good. I say American is because have you guys seen a real Italian pizza?? Then you'll know.\n\nI can walk in get 2 slices of pizza and a drink for around 6 bucks. I usually will try to make atleast 5 to 10 trips a month here just to satisfy my pizza craving.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2011-07-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'UWhxz-hO6cYy1Y2pLowrJQ', 'review_id': '3_J5s8bavVNaJNC4rXMA2Q', 'text': 'Venezia\'s has the best boneless (and regular) wings in town. The "Gold Medium" sauce is fantastic...it tastes like a mix of hot mustard and buffalo sauce...very tasty. I love their Vegetarian specialty pizza. The slices are huge and covered with fresh veggies.\n\nI\'ve also had the turkey sub, Greek salad, and regular side salad (with DELICIOUS made in-house ranch). They have great China Mist iced tea as well.\n\nSo why only 4 stars you ask? They take FOREVER sometimes to make your food. 15-20 minutes when I\'m ready to grub on a piece of pizza can feel like an eternity.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2011-07-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nckGxUh53b1yu0gOkib6YA', 'review_id': 'uO_OvXOz6rgHeJMPmqaXCQ', 'text': "Oh where to begin?\n\nThe mouth watering Meat Lovers' slices? The succulent Pesto Chicken slice? The filling lunch specials? The glorious subs? Or that spectacular feeling of filling up the ten stamps on your loyalty card and getting two free slices?\n\nYou must go to Venezia's. Their slices are massive, and their Pizza Challenge will put most grown men to shame. Coupled with their wide and varied drink station, $6 will get you a meal fit for a king.\n\nFriendly staff, awesome deals if you follow their Twitter, and most importantly, fresh iced tea & lemonade that can be mixed into an Arnold Palmer. \n\nI think I'll go there now...", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2011-07-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tGj_PsKIWBaSvhycNqfJqg', 'review_id': '_LLDb-fIfSahCgBNWDL-IA', 'text': "Wow - finally a pizzeria that reminds you of a New York slice - until now, we haven't found anything in town as good as NYPD Pizza - but have to say, this was really good today - and the prices are better than NYPD - also, our food was out very quickly, and was HOT, which is a really nice touch compared to what you usually get!  We will definitely be going back, maybe to try the Party Pizza Challenge!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2011-08-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Qdg7qQ9Tai7Uw2TCoQhEFw', 'review_id': '-U8jFSIlGN5kbXMGXgr8ow', 'text': 'The first time I went was on a Saturday around 6pm. The place wasn\'t all that busy. I like that you can get pizza by the slice, and it\'s a big enough place without being huge. The atmosphere is typical of your "new york style" pizzerias, in my opinion.\n\nI got a combo slice & a drink. My date got a slice of sausage pizza & a water. It was under $7 for both of us total! \n\nI devoured the slice. It was huge and the flavor was perfect! The crust was crunchy, which I love, and of course the classic grease dripping from the slice and possibly my face! haha.\n\nI\'ve been back 3 times in the last 3 weeks for lunch. It\'s always packed and super hopping! They have great food, they\'re quick, and at a really good price! How can you beat that?', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2011-08-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'EUG5XBMKNticPO7KXxZ7WQ', 'review_id': 'l2haEtXtNKHQd0o4mx7zNg', 'text': "I'm a little bummed out about Venezias...A couple of time my bf has called to inquire about slices of pesto pizza in the evenings, and each time the people at venezias mentioned that they only have pesto slices at lunch. I obviously can't eat a whole pizza, so I decided to wait until i wanted pizza for lunch to go ahead and order.   so today the bf called at lunchtime to inquire about pesto slices, and lo and behold they had them.  so he drives to tempe  to pick up a couple of slices of pesto pizza.  He gets home, opens the box, and the slices have chicken on them, which nobody mentioned to him at venezias.  I'm a vegetarian so these slices of pizza are now useless. he calls to mention this to the folks at venezias, and they say the never serve slices of pesto without chicken on them.  I'm left wondering why NOBODY mentioned this in the 3 phone calls over the last month in which we inquired about slices of pesto pizza.  beyond that, they don't offer to replace these slices for free, or anything. pizza in the garbage.   bummer, big waste of time and effort.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 1, 'date': '2011-09-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '2s47BLZNzhTFvv-Or0zjHQ', 'review_id': 'MvQjqRfJZhybjSGYzWszIg', 'text': "Hmm,  been eating here off and on for the last several years;   and I've noticed a very definitive decline in quality of the pizza since they expanded this location.  The last two times I have ordered, once was for delivery; the other was store pick-up.  \n\nIts a battle of pizza in Tempe, and when i spend almost 20 bucks for a pizza; I expect it to be pretty tasty.  The delivered pizza was not, in both sauce and toppings, it was nothing spectacular; and the delivery took almost an hr. Which, might of contributed to the pizza not being very good.\n\nMy most recent pizza, was in my assuming that a picked up pizza would be fresh and better than my delivery was. I was wrong; the white pizza (no sauce, olive oil and ricotta,) was possibly worse than the delivery. And, for 20 bucks I could of gotten 2 pizzas at jamies pizzeria in the neighborhood that I KNOW would of been better than this.  \n\nOh well, I don't know if their expansion has led to the quality going down, or that the place has many different locations now and as such whatever was special is no longer so, but its very obvious to me that whatever I thought was SO GOOD about venezias prior, is not. And I won't be trying it again.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 2, 'date': '2011-09-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'eWb3LTlYzRGrP4DiQjHXcA', 'review_id': 'TyoBiCBcLh4o5gSvTxnfgQ', 'text': "Great pizza, toppings, and wings. The price for the special (2 slices and a drink) has gone up which doesn't it make the stamp card worth while anymore, but I'm fine with water. The slices are large and two easily fill you up. Definitely my goto place since I am located in Tempe, as well as in my top 5 pizza places in the valley. They also have a food challenge here which entails eating a party pizza (5 slices each) with another patron. Some dudes supposedly took this down in 7 minutes, I don't believe it.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2011-09-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3wT2nMenh6XxchJFZZuexQ', 'review_id': 'jGFhvGJHBaG8x_rMbfRaYw', 'text': 'Great pizza! OMG the cheese cake is my favorite I love it here and the pieces are huge! excellent customer service I have ordered from them 5X and still going!', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2011-09-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jV448syTIP9qGpzlknP_0Q', 'review_id': 'cmYL3ft099ERwzqBqIJeGw', 'text': "Amazing pizza and wings. Only place I go to for Pizza since I've lived in Arizona.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2011-09-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lLnBArluikBGDqrGmotJ-w', 'review_id': 'dOLlBxMYr6-Wp3ZRaD3tew', 'text': "I enjoy this for my delivery place.  The food is very yummy and the delivery is on time.  Lots of choices for delivery and accepts cards and/or cash and you can order online.  \n\nThe Blanco could use a bit more of the butter/garlic thing, but it is adequate.  I like the pizza okay, and it is definitely better than average, but i would probably put it more at a 3.5 than a 4.  However, you can make your own combination and one of these days I'm going to hit on the perfect combination, but so far, my favorite is pineapple and canadian bacon, don't hate me.\n\nThe Baked Ziti is amazing.  I also have to rate the appetizers high.  For fun when I dont' mind going over calories there is fried zuchini and for when I want to be healthy there cut veggies are lovely.  The antipasto salad is a winner!  \n\nThe one time I had to complain (forgotten ranch dressing for the fried zuchini) they handled it quite well.  So I am a satisfied and returning customer!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2011-09-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QyD2Qud3raKhKfGWuirh4A', 'review_id': 'scemyQeadlb4KXn0Be4kxw', 'text': "I went to the Gilbert location last week for lunch. Had a couple of their HUGE slices... one pepperoni and one chicken pesto. I always come to Venezia's when I am craving pizza and want to have a FULL meal. They have really great prices for the quality of food you get. The Gilbert location is huge like the Tempe location so its perfect for a large group to go to.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2011-09-27', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'ZsjBAQiO5lNa_Tzlr3_FlQ', 'review_id': 'LSmeE8wQ1t5CuN22EiGDTA', 'text': 'Great large slices of pizza! Salads and wings are great too... Good lunch for under $10. We buy 3-4 of the party pizzas for work and the guys love it!', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2011-10-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4YcJqGGs9Ayi11SmgVnNVg', 'review_id': '05AykkfvTolWs_Nd05q5kg', 'text': "I grew up next to a small family owned Italian market, and I learned how to love good pizza.\n\nWhen I came to AZ I was a little worried I wouldn't find decent pizza. I mean, pizza with really flavorful, crispy crust and quality toppings. With all the hype surrounding Venezia's (and not to mention the flyer I got in the mail) I decided to try it out.\n\nSo disappointed. \n\nFirst, I waited an hour for the pizza. Second, I don't mean to rain on their parade but the Venezia's Supreme I got reminded me of the supreme I'd get from a very common, larger pizza chain... hmm... in other words, super salty and too many flavors clashing on one slice. Third, the crust was a bit bland and mushy like it had been sitting in the box for too long. If I wait an hour for a pizza the crust better be crispy, but sadly that was not the case. \n\nI'm going to give this place a second chance, though...", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2011-10-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'lt8EDfC80IpHzGKlj8qGpA', 'review_id': '10F86ueOz7I77rmYliKP8g', 'text': "The best Italian pizza place in Phoenix! Doesn't beat a true New York style\nPizza, but it gets really close! The Pesto Chicken pizza is the best thing on earth. Their wings are really good too! Definitely a must eat place to go in Phoenix.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2011-11-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FmwWPEQMcxCGI5K1yqAXaA', 'review_id': 'EVWwnq0RlnvutzP819zOHw', 'text': 'Only had their pizza as takeout here.  It was above average.  Would probably try again if in the area.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2011-11-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'SxZV-iqRoO1ERfrQvKbpkA', 'review_id': 'pCo6g-hylHhH16Xq1mzNsw', 'text': "I love pizza. Period. Cheese sauce and bread. Holy g, in an oven with awesome toppings, who came up with this amazing meal and why aren't they beatified if not a saint. Come on Roma, get on that, we need to know that Italian!\n\nBut seriously, Ive been to pizza places all over the country and this is my favorite type - big New York style slices, pipping hot, not too greasy and loaded with a delicious not too sweet sauce. Venezia's is my favorite pizza place in this style in Arizona. Ive been to Pizzeria Bianco and having had to wait the 2 or 3 hours to be seated til I was so hammered from being at Bar Bianco next door I couldnt remember what I ate or how it tasted from being so hungry, I can easily say, Venezia's is where you should go if you want a great filling slice of pizza in the Valley. They also catered an event I promoted with several of their party pizzas and they were delicious. They always have courteous quick servers and I even enjoy their fountain drinks. Not to mention, they always have great specials if you follow them on Twitter. On Tuesdays, you can get a huge slice of pizza and a large drink for under 2 dollars. I cant say enough good things about this place, check them out, theyre amazing.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2011-11-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'N7T6hOunTPxLk2AiWrQEmg', 'review_id': 'FmZoRmENK8oS5AMzJVAEWg', 'text': 'This place is EXCELLENT.  My only complaint is the line at lunch time!  Great pizza, fair prices, good wings, all around great place!!', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2011-12-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MKqHo7wYjU0b3cP5_bHsNw', 'review_id': 'DAmdVQgU9BL5XEV5IZFD9w', 'text': 'At work, when we say, "Let\'s go for Pizza", we all know that it means "Let\'s go to Venezia\'s".\n\nI have been going there for a long time. It used to be a really small place with like 8 tables. It was always packed at lunch and sometimes we had to leave because the line was too long and there was no place to sit.\n\nGood thing that they make good pizza, and business is good. They rented the store next door, broke down the wall and redid the place.\nNow it has flat screen TV\'s and lots of seating.\n\nWe usually go for the lunch specials: 2 slice, or slice with wings, or slice with salad.\nThe price is reasonable, but not too cheap. But it is the flavor and texture that has us coming back.\n\nYou will have to try the crust to understand it.\nIt is a thinner crust, but has the right combo of crispness and chewy-ness, if that makes any sense. Their wings are good too. Salad was kind of \'meh\' to me, but some healthier folks like that combo.\n\nThe pizza is never cold, even though they pre-make the slices, and you can see what they have, as you line up. After they take your order, they will toss your slices back in the pizza oven for re-bake/crisping. This sounds funny, but is actually really good.\nWARNING - SLICES ARE HOT. My friend seems to always burn his mouth on it, when he gets it. You can request to not re-bake if you like, but I like my pizza hot.\n\nHave not tried their Hero subs, supposed to be good, but I can\'t bring myself to not eat the pizza whenever I go there. Favorite slices are Pepperoni with extra cheese, and their Chicken Pesto. I prefer my wings there plain with the sauce on the side, depending on the maker, they sometimes drown the wings in the sauce, which I do not like (I prefer the wings crispy).', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2012-01-04', 'type': 'review'}
{'votes': {'funny': 5, 'useful': 6, 'cool': 6}, 'user_id': 'n9Zg0jlOGtxfIrvoPm6Hhw', 'review_id': 'VPhwawmsdQmNi1BbL2Ut8Q', 'text': "I love pizza.  I think it should be granted its own food group.  \n\nI typically don't care for places that serve pizza by the slice, becuase it tends to appear old and dry.  A little scary.  Not so at Venezia's!  Their pies are hot and fresh from the oven, and they are HUGE!  They yield beautiful slices of NY style pizza, with just the right amount of cheese & sauce.  I have never seen a slice of pizza so big.  So of course I had to have two.\n\nDangerously becoming a new lunch favorite!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2012-01-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'zJ2eI-uGtqfUVX1GsyB0Lg', 'review_id': '92UlsBLsKw6lLctD2-DcFg', 'text': "First experience, I wasn't particularly impressed. It's okay, plain and simple. It can be a bit greasy at times. I always get the pizza when I go there, I have no problem with it. It's not the best nor the worst I've ever had. \n\nThe customer service is usually pretty quick, never had to wait more than a few minutes if there's a line.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2012-01-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': '4gIi4L7e870qFbnRemaoBA', 'review_id': 'S16AeLHlMPeNCafOKPYBNg', 'text': 'Wow, this place is phenomenal.  Super fast, tasty and inexpensive.  They have slices of the day as well!  Today was buffalo chicken!\n\nTypically by the slice restaurants sell you pizza that, while delicious, is almost always a little dried out and old.\n\nThis place is fresh with every slice!', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2012-01-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '04xW5mhSBaCzpjbcf2VSZg', 'review_id': 'SaIhwM2OZe4l01s6yr7Nww', 'text': "This place has the greatest sauce in the valley. Seriously, its awesome. Excellent if you just want to stop in and grab a slice or get a party pie (2 or 3 feet across, gigantic!) delivered to your home. They also make Sicilian pies! That is amazing in the valley, no one has Sicillian! \n\nTheir sandwiches are also great, at least the hot ones. The cold ones suffer from the problem that all cold sandwiches in the valley suffer. We just can't seem to get ham, roast beef and turkey right here in AZ. Its weird, seems easy, but there's just something off with the cold cuts in the valley. \n\nThe staff is rather young and not very experienced. There is a lot of turnover. So there are issues where you ask for a meatball parmigiana sandwich and are told that there isn't one...you have to tell them that a meatball sub and and a meatball parmigiana sandwich are the same thing.\n\nAs an east coaster I always have to remember to not order subs as heroes, as then I have to argue what is on my gyro. Because gyro is pronounced (by Greeks at diners as well) in NY with a hard 'g', largely IMHO because subs are called heroes. \n\nNonetheless, their delivery is great and the food is excellent! Their chicken parmigiana sub is a runner up for best in AZ!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2012-01-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'h7-lk_BmctsFjcO79G7jWg', 'review_id': 'w3mOPPqgSvQUHotu0T53IQ', 'text': 'I\'ve ordered delivery from here several times, and while I don\'t think its "phenomenal" as other reviews have stated, they\'re aren\'t too bad.  The calzones are huge, but skimpy on the sauce.  The Buffalo Chicken pizza was actually pretty good, if you like the taste of buffalo wings (just like their description says).    I think the best thing about them is the amount of food you get for the price, even if the food isn\'t phenomenal.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2012-02-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jZMvU2OcjlzxPNIXIyHP3Q', 'review_id': 'Ut4gz3ZHOJfqIb8FfLXeNw', 'text': "I'm new to the area and was craving pizza so after looking online I selected Venezia's   I ordered the Empire State. OMG! So flavorful! It is more than I'd usually spend on pizza, but it's Valentines Day. It takes about 45 min to arrive, but well worth it.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2012-02-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '-yAE-352Ks7zwx6wKIzeTA', 'review_id': 'J1y_kuI0_D5nBG3UBGvpPw', 'text': 'When I first moved to Tempe this was one of the best places for a slice. However more recently they have been getting pretty bad in quality. I actually prefer some of the cheaper places in the area because their quality has gone down so much.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 2, 'date': '2012-02-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uWr21MBjmfojZ4MFaVlong', 'review_id': 'POrN0f-pcmiH2pcyScz3KA', 'text': "This is quickly becoming our favourite spot for pizza, especially when we have the boys. We've never had a bad slice, and even their pastas, salads and canolis are really good. \n\nThey have something like 8 different slice combos: some with one slice and a salad, some with a slice and wings, two slices, one gourmet slice and a salad, etc. Every meal comes with a drink. And the prices are fantastic! $3.50 for a slice and soda, and the slices are huge! I usually can't even finish a slice. $5.50 or so for 2 slices and a soda. About the same for a slice and a salad. I mean, really, you can't get much better than that! And their pizza is pretty close to perfect. I'm a fan of their sausage, their pepperoni and their meat combo. The veggie pizza got rave reviews from my partner, and she loves their salad! \n\nIf you're not a fan of the college crowd, this may not be the best spot for you, especially on a Friday or Saturday night (it is close to ASU after all). But if you don't mind the noise volume being slightly on the high side, then do yourselves a favour and swing by and get a slice!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2012-03-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'c6Bfoxh50v0sPTQZRjP-Wg', 'review_id': 'MWUDSbeaiGWyxjzOeo-ATA', 'text': "I've been hearing how great this place is so I had to go. They claim to have real NY style pizza, so being from NY I had to find out for myself. The antipasto was good, but the pizza was a disappointment.  We got a supreme pizza and would rate the topping quality as fair. The meats were pretty bland. The crust was a bit soggy and the sauce lacked seasoning too. The cheese was just average. I'm sorry if I'm offending people that like this place, but it's not NY style & quality pizza.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 2, 'date': '2012-03-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ergzjT2C16zRrV9W7jQ-Sw', 'review_id': 'BcMnFcnL-3b1NrTI_SuQgg', 'text': 'I will try not to make this review too "cheesey", my aim is to be "topping" your expectation or at least "meat" it. (that\'s three by my count, booyah)\n\nThis place is my "go to" place for pizza. The pizza is delicious and the value is excellent. They have about 10 specials that they run all day. The specials include 1 slice, 2 slices, 1 slice and 6 wings, 1 slice and a salad and much more. The specials include a fountain drink as well. Just to give you a price point I usually get the 2 slice, 1 topping special with a drink and that is $5.75 plus tax. Now when I say the value is excellent it is because the slices are colossal, They shouldn\'t even call them slices they should be called slabs of pizza.\n\nI have only dined-in and the service has been pretty quick, naturally the slices will come out quicker then the wings but the service is still pretty quick. There is plenty of seating and usually sports on the televisions.\n\nAll-in-all this is a great place for the following reasons:\n1. Great food: Pizza = great, Wings = decent, Salad = what is a salad?\n2. Great value for the amount of food.\n3. Roomy atmosphere where you can bring the entire family or a group of friends to feast on the goodness.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2012-03-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '9ugxOdRzasySNRoqLQki5w', 'review_id': 'oAenMtyvQi2hl14ectq_Iw', 'text': "Four stars: I do not give 5 stars unless everything was PERFECT.  It is close with Venezia's and if I could give a half star I would.\n\nI have never been to the place, have always ordered delivery.  Even though I am technically outside their delivery area they have no problem getting my food to me.\n\nPizza: Good, better than most places.  Slightly greasy but that is the kind of pizza this is.\n\nWings: Awesome!  Love the crispy (no breading!!  Yay!) skin and their sauces are premium.  I especially like that when I order the Honey Hot they send the honey in a separate container.  Might just be me, but I think they taste better with the honey added right before eating.  And their Hot is just my level of heat.  The lips are still tingling 5 minutes after I am finished eating.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2012-03-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qzBdVRX0K18LC7Dd_hYJWw', 'review_id': '7AJYe6P76f2_giO8HwYJpQ', 'text': '1. Great quality, size pizza, salad, wings for the price.\n2. Great pizza sauce and wing sauce.\n3. Pizza could use a lil more sauce, more ranch for salads.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2012-05-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7tA6O_H0uWtszsIbolpgsw', 'review_id': '3C6haRHnjlnk5wyBpV1UdQ', 'text': "great pizza! i love this place. i love that you can order pizza by the slice. whatever you order, know that it will be delicious. \n\ni just wish the location i go to wasn't next to the gym i go to. i'm gonna be honest...i've gone in there after a workout before. ha!  ;)", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2012-05-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0cUeP41LWMpjI6b6Z6X4yQ', 'review_id': 'ggbKCbcSURu9em1fjy_eGg', 'text': 'This pizza is very tasty and they have really good salad and wings too! The hot wings are hot. Ranch is good too! Its NY style pizza and delicious.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2012-05-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'qu8w1fUZnqON5ikXVpis0Q', 'review_id': 'l7cM_J-CqHeTj4RMCqy6lA', 'text': 'Get the finger-licking-good honey BBQ wings. The regular BBQ wings are pretty tasteless though. Convenient for popping in quickly and popping out and their party platters are decent for feeding large crowds. I frequent this place more because of its proximity to my place than the quality of their food.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2012-05-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'FqG1lUAOR9yTQTxIvwxoUQ', 'review_id': 'br9g7IL8-L7TvGy4a5TdGA', 'text': 'Awesome piazza. Must try their Italian Stallion', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2012-06-04', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 3}, 'user_id': 'pFA8pj5P7Khl1aZBtvdzpA', 'review_id': 'y2gVjuCrnlAjC4cktvRCqw', 'text': "Lets start with the bad first then we can go on to the good. \n\nBad- I wish they served beer... why? Well what goes better with pizza and wings? That's right... an ice cold beer. \n\nGood- I absolutely adore the pizza... it's super delicious. I usually get the slice + 5 wings + drink... my slice is usually pepperoni or mushroom... it has fantastic flavor for a great price. It's by far my favorite pizza place in Tempe. I also love that they offer a food challenge here (not that i would be able to do it, or even attempt it) I love watching people do food challenges... it's just so fascinating. haha\n\nI am in love with their wings... I usually order them in HOT. I thought by reading the menu that the wings would be really hot, but I was surprised how comfortably hot they were. There was no hesitation when eating them. \n\nI know I'll keep coming back for more... it's my go-to pizza place. :D", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2012-06-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'WNbR-Otm3G-hcVnDU-o83A', 'review_id': 'qhcuuu8fcpZYX5bY0XVAfg', 'text': 'After a bad experience, I was convinced by a friend to try it again (delivery), the pizza was vastly better, and the even followed the special instructions listed on the internet order. (Thanks for the awesome whale on the box!)', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2012-07-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MvBSXHfkGL9Tynl14gdK_A', 'review_id': 'qJt0xpWEvQ6tmun2xVvK7w', 'text': "Love, Love Love this place. Best pizza great price. Coupons online. Can't say enough. Had some today they delivered to my work. YUM!!!!!!!! Good wings too. Great lunch specials. Try it out!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2012-07-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'BlSlcDEEeBg5KGqBkE-Lng', 'review_id': 'clNWILv-t8TGuaID0DLg9A', 'text': "When I used to live in Tempe, this was my favorite spot for Pizza! I always thought it was so funny how it was right next to LA Fitness. The pizza here is amazing and their combo's are so cheap. I think it was like 2 slices and drink for like $6. Their wings are really good too! Try the wings with the gold sauce! They do charge you .75cents for the ranch though, but its delicious! I'm so happy they expanded with more seating!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2012-07-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'UM6ARMpyqvM2aJ3Wnzwcog', 'review_id': 'D3n7ylIXf7QEq4ZPXB-WgA', 'text': u"4.5 stars.  They make a really good thin crust  NY style pizza.  We also like the wings ALOT!    We do delivery 9 times out of 10 and they are fast and the pizza and wings hold up well.  I don't care for the BBQ wings but my kids love them.  We all like the honey hot wings. \n\nThey hands down have the best lunch special in town. We were here the other day and got 3 slices plus a drink and 2 waters for $10 plus change.  I had a slice of the special pizza with sausage, pepperoni and jalape\xf1os. I'm usually not a fan of sausage but this stuff was really tasty.  The slices are huge too.  I left full but if your a huge eater you might want 2 slices.  They are local too so I like to support local businesses.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2012-07-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ypz7hxOCnrg8Y8vxHJU-sQ', 'review_id': 'sxQ28fJ8_xkO8zn3adO9eQ', 'text': "Went here for a late Sunday dinner and loved it! The place is so much bigger than it looks on the outside, seems to go for days. I ordered an A and my roommate ordered a C. I like that they use letters rather than numbers, made me feel a tad awkaward when ordering but who cares now.\nThe pizza slices they give you are gigantic and true NY style. Then but not a cracker crust, plenty of greasy, melty cheese too. For less than $7 I got 2 big slices and a drink. I'll def be going back.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2012-08-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'eiA073MhHpCdwBq8u_luZA', 'review_id': '-5Ja7WUmNik8TH_IRuYD0g', 'text': "Solid option, especially for Tempe.\n\nNot on the same level of pizza in SF but Venezia's....\nYOU WILL DO FOR NOW", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2012-08-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'DrWLhrK8WMZf7Jb-Oqc7ww', 'review_id': 'OmSTUyAuEwMOm2lAzcNnrw', 'text': "Another pizza place where the pizza didn't really look that good, so I opted to browse the pasta section. It really is a limited section, covering only Baked Ziti, Lasagna and spagetti and meatballs. I chose the baked Ziti with garlic bread for $8.50 and threw in 2 homemade meatballs at $1.50. WAsn't expecting much because of the small selection, but everything turned out decent. The meatballs were actually baked into the pasta, instead of on the side which was a nice touch, but overall the dish could have used more sauce. Besides that the ricotta and mozzarella were all present and the thing was well baked. Pretty tasty and a good two big solid pieces of garlic bread, which for a change lasted throughout the whole pasta meal. It's kinda more like a factory in there with all the activity, but get your stuff to go and leave the screaming kids way behind.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2012-09-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hTkkYkHxDo2YJ03TkykNQA', 'review_id': 'mA3OWdO0j8NK5UIoVZrevw', 'text': "Venezias deserves 5 stars. Let me start off by saying that a lot of the negative things people have said could have been resolved if you just spoke to the manager, that is what they are there for. I love this place. I ate here and thought pizza couldn't get any better, and I was right so far. I went to New York and tried various pizza places that were actusxally new york pizza from New York in and around Times square. That pizza doesn't even come close to Venezias. It is better than actual New York pizza from NY! I love it, and I can't say it enough.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2012-09-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'E0WJRXk3uiwHiWiXG8kADA', 'review_id': 'geQYGd0EWVA2DbLPf6lAfA', 'text': 'Well, I hate reviewers that leave a  back story before every post... but I must say being from New York this is the closest to N.Y. style pizza you will ever get living in Arizona. \n\nThat being said...\n\nThis place not only taste delicious but it has great specials... all freaking day. I usually get special c. A 1 topping pizza and 6 wings ... extra crispy always.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2012-09-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1487s0OknkP4RMurllDKSA', 'review_id': '6zR5MiJ-E4PDpCeFHfEt1g', 'text': 'this was our favorite in Albuquerque and its here, soo glad and so good... the pizza is  awesome and the hot wings super spicy!', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2012-10-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-a7d79eTKvmkpHZT7ePYDQ', 'review_id': '38Sb0rvPRuyWV0Bg2d2SeA', 'text': "I've had Venezia's a few times and have found it to be great. I'm impressed by what a great value it is. I have been in for lunch and ordered a large meal that included 2 giant slices with a soda for 6 dollars or so. The pizza is not the best I've ever had, but it is still pretty awesome and probably the best you can find like this for the price. I recommend it as an excellent place to grab a quick slice!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2012-10-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'BVvOPie8AA2xrHsjbyrd_g', 'review_id': '76vBWFDf37TBMB0lUvKt3w', 'text': 'Do not know how this place received so many good reviews. This may have been the worst pizza I have ever had. I figured I would spend a little more money, and try some place new. I figured, well, this has to be better than Dominoes, or Little Ceasars... Not even close to as good as those subpar places.\n\nThe crust was spongy with no flavor. You could taste the low quality in the cheese and toppings.\n\nIts really bad, trust me. Do not overspend on a pizza here. If you want quality pizza, go somewhere else. If you want just an average filler type pizza, stick with the chains, they are way better than this place.\n\nPeople think its good because of the name, and the authentic new york back story. \n\nDONT BE FOOLED!', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 1, 'date': '2012-11-26', 'type': 'review'}
{'votes': {'funny': 5, 'useful': 6, 'cool': 4}, 'user_id': 'kffxYQVQsEpF1DVlQlcGCg', 'review_id': 'gOXDWQzhmhxIlxG5nu0ZZg', 'text': "This place is not too bad, plus they are always putting out coupons. \nIt is very close to my house as well, so that makes it even better.\nI am not sure if they deliver, but they probaly do.\nIt really took me a long time to try it. I just did not think it would be all that. \nBut, it is pretty good and with the coupon a great price.\nWe even got a side dish of meatballs to go and they were good as well.\nAs well as a few wings, awesome.\nWe got it to go so, I can't say much about the bathroom or inside dining.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2012-12-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ppk7I14BePxvoOGCz3VTng', 'review_id': 'EZEVUTfGFdVEHVJkKNAXmQ', 'text': "This place is outstanding. They have some of the best pizza in Tempe. Its always fresh, the prices are affordable, and if pizza isn't your thing, the menu has plenty of other things. Everytime I walk in I am greeted with a smile, and Everytime I have friends in from out town, Venezias is a must. If you haven't been here, make sure you try it some time. My favorites from here are the wings, sausage slices, and the greek salad. The only thing I have bad to say is that they charge for ranch, but even the ranch is worth it.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2013-01-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GwTb7Kiacz0jxqtiK8y09g', 'review_id': 'HLjEVAlXEtIUi9JYcfQRgw', 'text': 'Pizza was pretty good. The wings were undercooked, and uneatable.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2013-01-01', 'type': 'review'}
{'votes': {'funny': 10, 'useful': 17, 'cool': 15}, 'user_id': 'F6QsMoJdvtohlbnST-fDyQ', 'review_id': '_M1qji15Yz9jDA1jxUyz6g', 'text': "This is my 400th review, so I chose a good one.\nI keep getting coupons for this place. People I know(friends) say yeah, it is OK. Nothing great. It is alright.\nSo one day it was raining and cold. I was out running errands and did not want to mess up the house cooking when I got home.\n\nSo I had a coupon so I came here to Venezia's!\nFirst I called on the phone to order a large Pizza and some wings.I have been craving Wings,soooo.\nAnyway, I got there a little early. Parking for pick up right in front,very nice.\nAs I sat inside looking around it was clean and well maintained.\nCounter for napkins, condiments and such, clean and well stocked. \nThey were busy pick up orders, people coming in to get a slice, etc.\nThey handle it very well. Everyone is calm and it runs very smoothly.\n\nOne girl that was cutting Pizza and boxing every thing up made it all look so easy.\nShe was wearing a hat and had tattoos,I say that because, I do not know her name.\nBut, she was getting those orders out so quickly and efficiently/ I was amazed how she made it all look so easy. Bravo to her, she rocks.\nThe smell inside was really good. Italian Food on a cold day smells fantastico!\n\nWhen We sat down to eat at home. It was fantastic! I love their Pizza. Their wings were meaty and spicy! This is it , I have found my new Pizza Heaven!\nI am so excited.\n\nAlso I read the menu and took a to go menu home, I can't wait to try all the other items, I am sure they are just as wonderful!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2013-01-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LXOhR4ZUULSbBNztxYZ2dQ', 'review_id': 'hTyjzgN0IT_oWHnB7FL2ZA', 'text': "Mmm yummy yum! I love the special C the slice with boneless wings and a drink! Great value. One time I got sick from the wings, but I decided to be brave and try them again. I haven't had any problems since but...that's my only complaint. Love that its relatively fast.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2013-01-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'R9gRdyGVLPSF34oQ1oDgug', 'review_id': 'GalR4HrBTTEQDQU23ERS2w', 'text': 'good pizza but they dont honor the yelp check in offer of 15% offer', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2013-02-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': '8qe2c5uRlAkvNFvDriBm1Q', 'review_id': 'aCqrSOKyWYJ33EkllKMAxQ', 'text': "Ordered 2 dozen wings online on the way out of work...\n\nHit the front door at exactly 25 minutes, the estimated time the order would be ready.\n\nWings were hot and the seasoning, while I would prefer hotter, came in as a 100% buffalo wing sauce with appropriate heat.\n\nThe order was  respectably heavy for the number of wings ordered...the price for 2 dozen wings at $20 is a bit more than I am used to spending.\n\nThe snips of celery and carrot are barely recognized...c'mon, folks...the veggies are cheap.  As for the dressing, 2 ounces...really?\n\nYou are the closest location to home.  You are not, however, the least expensive of my options within a reasonable (1.5 mile) radius.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2013-02-27', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'TJRBA15ziLkf5chQrCrzHA', 'review_id': '1Cc4ngyTwMDy4-6luk4hEg', 'text': 'I learned about Venezia\'s when they started following me on Twitter.  I finally took the time to stop and I\'m glad I did.  The atmosphere was great, the pizza even better.  \n\nI must say that wings were also good, but they do need to provide some "wet naps" to clean your hands with when you are done with them.\n\nWe\'ll be going back and enjoying more of their pizza\'s and maybe even taking the "Party Pizza Challenge"', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2013-02-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '_9JLuIB0QtpGxNwAW2uWsA', 'review_id': 'COS0q3k9QtGuoi656HzQYg', 'text': 'Good pizza.  Full set of spices, etc. on every table - I really like that in a pizza place. Friendly staff.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2013-03-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'P9x_Yx9E6wYGzqtUGfSIMA', 'review_id': 'S70EyVNQQm-K_u6Gw749cA', 'text': "So far, I've had the pizza, wings, meatball sub, and antipasto salad and a high recommendation for all of them.  Love the antipasto!  Wings are pretty good for a pizza place and the sub was quite yummy.  Pizza is perfect classic pizza.  Delivery, pickup, or dine-in- I've done all three.  Oh yeah, and their chocolate cannoli are AWESOME!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2013-04-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DrWLhrK8WMZf7Jb-Oqc7ww', 'review_id': '_YtJbBTzV1NtCVXLjOdiSg', 'text': 'Tried the online ordering system for a pick-up and it was pretty successful. The chicken parmesan hero I purchased was great with the bread large enough to safely hold many cutlets inside. Cheese and sauce also were on spot and for $8, it was a nice filling meal. I added an order of fries for $1.25 which they forgot, but I caught the mistake before I left the lot. The fries were thin and unsusual as they were bendable, but still well cooked. Pizza looked much better today and will be tried next time.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2013-04-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Zw1VPA7oNo0DoSsO37JuHg', 'review_id': 'pCClfPav2N1-uIToToZpeg', 'text': "This place simply kills it.  They do some heavy business out of the Tempe location, and for good reason.  Their food is consistently high quality and they always have enough staff on hand to make sure you order and eat quickly in a clean environment.  The prices are very reasonable and there is rarely, if ever, a reason to gripe.  Big slice and a salad for $6.50?  Okay!  Another place that I eat at on a regular basis because they've proven that they deserve my business.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2013-04-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'uMHGvNLvC1WL4OVOi5hCDQ', 'review_id': 'rKO0bcxxtW5B_deEYvB2Eg', 'text': 'Love this place for pizza! Usually come for lunch since they have great lunch specials. The slices are a decent size and tastes delicious!', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2013-05-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0U6YfdxR2aw-_4vctk9eKA', 'review_id': 'eJIw7cPWRxF2VhvACsi0bg', 'text': 'This is the best god damn pizza that will ever grace your taste buds. Whether I stop in for a slice when I have the muchies (under $3 for a HUGE slice) or order my stand by Empire state Pizza. I noticed its no longer on the website but I continue to order it and it continues to come. I would recommend asking for it. The Empire State is a speciality pizza that has TEN toppings, yes I said TEN! I love that they will put ricotta on pizza cause, well cheese makes everything better. Ive had their wings a few times and they are very good. They also have great coupons available. Anyone who hates chains and loves good, fresh food will love Venezias.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2013-05-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'LDreqHkIUcAaa_Km8z-j4A', 'review_id': 'C-5tvCm69ThrEJG9JpQESA', 'text': "Some of the tastiest pizza I ever had and they rock for delivery.  I've ordered from them probably a dozen times now and have tried just about everything on their menu and have not been disappointed.  They use fresh, wholesome ingredients and their mozzarella cheese is nice and gooey and creamy.  No fake stuff here.  Their wings are super killer too.  I love the Honey BBQ.  Their homemade sauce is really good and you can buy it in jars now.  I have yet to eat at their place because their delivery has been spot on.For NY Style pizza, Venezia's is where it is at.  Don't make me call the super!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2013-06-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Cz10T2F0AaRN9jHStlucAA', 'review_id': '6DPSqKGHvzRb682zfV8qPA', 'text': 'ok...i only go here for lunch, and it is usually busy. I must say they move you through pretty fast. I always order the Caesar salad with chicken, and most always it is really good. I would recommend, but be leary of chicken pieces with grissel. For some reason they must have been low on da good stuff. They must have been short on dressing as well.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2013-06-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': 'uOJD5oycDJgIs8gk_G9yMw', 'review_id': 'KYQStQfAkL3Mc5iT7hCjpA', 'text': "IF I rate it 5 Estrellas, Don't Even Question it! If you know me you KNOW I Love Pizza!!! Especially NYC Style!! YummmmDelishhh, so basically this is NYGood it comes very close to the NY Taste, it's the sauce..Im telling you....Go Try a slice! Andale!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2013-07-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '4977ZUZkp5WJhPhgVuVFDg', 'review_id': '5kl-8_Fj4ZgnV398K-dhBA', 'text': 'Great pizza really flavorful first time wish I lived here I would hit them up all the time', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2013-07-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'IREe6WtAGrjfrMGd1iJ1mw', 'review_id': 'uOTzVAnXU-q2QXKStvCn2Q', 'text': 'Soggy crust, unimpressive quality of toppings, WAYYYYYyyyyyyyyyyyyyYYYYYYYYYYYyyyyyyyyyyyyyyyyyyyyyyyyyyy too many onions & bell peppers & olives, so not enough meatage (no homo), heavily overpriced ($15 for a small pizza whaaaaaat??) = I. AM. DISAPPOINT.\n\nAnd still hungry.  For less-sucky pizza, that is.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 2, 'date': '2013-07-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'eBFXojgTo2SWLtzv7jJlxQ', 'review_id': 'oFdkWLeK_aBB2cM2XSeFKg', 'text': 'Ugh! I took a friends recommendation, unfortunately. This is NOT good pizza, I have no clue how this has 4 stars on yelp. I am assuming cause it is in Tempe (a college town). \nWe ordered a 16" half pizza blanco - half supreme. \nFirst, the Pizza Blanco - It was bland and they said it was fresh cheese, well, I don\'t know how. There was nothing to it, I had to add every spice at the table to get anything out of it and didn\'t eat a whole piece.\nThen, the supreme - This was slightly more edible, but I promise you, if I closed my eyes, I would think I was eating a supreme pizza from Costco. Again, the cheese was NOT fresh or at least not fresh and of quality.\nThen the crust, I didn\'t eat it, I ate the toppings of the supreme only, because it was flavorless had no depth or crunch at all. And I only ate it because i was hungry.\nThe service is sub par and don\'t expect them to go out of your way or seem happy to serve you. \nNow, if you are like a lot of these reviewers, you might like it. But if you like quality good food with flavor and depth, and don\'t eat pizza and empty calories without thinking about it, you will thank me that you skipped this place. \nThis is simply not good food, not good quality and not a true representation of good New York style pizza.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 1, 'date': '2013-07-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'WMIt4RWYPeqm9KBU4ZueFQ', 'review_id': 'MdMWVz8bo1hFmGLS1_8Vog', 'text': "Solid NYC style pizza.  Not the best I've had but good for a lunch stop. Plus the prices are reasonable.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2013-08-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'wUEp87FqOB9ew27Iz6zk_w', 'review_id': 'gmkupC6L7pgYSOqEiLgpDQ', 'text': "not a bad place to get pizza, but not great. my problem with the pizza is that there is too much bread/crust and not enough cheese/toppings. however, their Greek salad is good for a salad you would get at a pizza place. I'd come here again, but for the price I much prefer NYPD or even Papa John's!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2013-08-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hTkkYkHxDo2YJ03TkykNQA', 'review_id': 'ufFqwwswU7zZP7L5xXK9ag', 'text': "I knocked off a star, because I felt so upset last time I was at Venezia's, which was a couple of weeks ago. I am vegetarian, and I asked for the veggie pizza. I paid, got my drink, sat down, and took a bite out of my pizza only to find out I bit into a pepperoni slice. There were pepperonies underneath the cheese, so I didn't see it. I love Venezia's, but they need to do something to solve this problem, so they will not repeat it.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2013-09-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HZ3ItZ23xZHqjUjRIdPi7Q', 'review_id': 'bsY8aTSzhbdz6rSQwaGumw', 'text': 'By far my favorite thin-crust takeout pizza available in the area, and an overall good value. The quality cheese and crust make the pizza!', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2013-09-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5iVA1e-VmIDhFKW_afXCVA', 'review_id': 'lxOwVysyRap5kuc5cbEUwA', 'text': 'While the pizza was most definitely delicious, the process of trying to order cheeseless pizza was so clunky that even though the cashier and the manager confirmed the order, the cook still put mozzarella on it. Still four stars, however, since once this was brought to their attention they gave us another pizza, free of charge.\n\nIt was also very clean and had some awesome menu choices. Definitely planning on eating there again.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2013-09-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0EgiHCjfGKwIH7tOlLYrzA', 'review_id': 'kHuEwbcCzznUwAPiS6CJeA', 'text': "Great pizza joint.  We had the bbq chicken and supreme and I loved the bbq chicken.  It's a casual joint and the pizza is super tasty.  The hot wings were alright, a bit too hot.  I don't know what made this pizza tasty but the owners did a great job.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2013-10-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'vG4gHg0xkzcg7MVCwmokFA', 'review_id': 'X0DOqt-mzU1kcJxRtJOBMQ', 'text': 'I thought this place was okay...I had the pesto slice...wouldnt get it again...Now the wings are another story! They were amazing! And the salad was really good too!', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2013-10-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'F16mzug4XEe6dBZZl4y33g', 'review_id': 'aaWs36k-aeLWAU1ifeePvQ', 'text': "Ohhhhhh how I love this place. I'm trying to be good and not order as often as I used to, but it's hard. Their pizza is so good! I was ordering once a week, and have cut back a little bit, but I'm craving it again. Everything I have had there is fantastic. I normally order either a cheese and mushroom pizza, or mushroom, italian sausage (theirs is AMAZING), and ricotta. Best. Pizza. Ever.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2013-10-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'C3GyFbd68m8CZ6h1PxOIwQ', 'review_id': 'mnrjv3oBHWhknGQuLT98QQ', 'text': 'I have a pizza problem...at least for this place. We order delivery once a week. Not a huge fan of the delivery charge or hour delivery time but once the pizza shows up all that goes out the window. Good sauce, crust and fresh toppings. My personal favorite is black olives, mushrooms and pepperoni.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2013-11-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'E3wi6Z6_3yfozaFrpOL9xg', 'review_id': 'xQj2_MFZHaNLEYv1nflc0g', 'text': "I love Venezia's & have been eating their food for over 6 years now.  Whether I get the pizza or a calzone, a salad or wings...I'm never disappointed.  Their prices are reasonable & their food is great!  The greek salad with chicken, amazing!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2013-11-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KewS5pH815dz_NKrA6Kj1w', 'review_id': 'HBId6fMKxUoPYEGqessWPg', 'text': 'My husband ordered from Venezia\'s tonight to my surprise, and I arrived home to a meal of build -your-own pizza, hot wings, and antipasto salad. Now, I am super picky about my pizza, as I have formerly worked at 5 pizza places and I am just sick of pizza in general, so pizza has to be stellar for me to eat it at all. Also, I LOVE wings and love hot/spicy food. And I love vegetables! So, I skeptically opened the pizza to see, and it looked pretty good actually. Wow. It really was amazing! Lots of toppings, and extra cheesy! Then I tried the hot wings and they were really yummy, too. I felt some heat, so I decided to try the salad to cool things down, and I gotta say the salad was a perfect salad: super fresh and crisp ingredients, the perfect amount of toppings. I was very impressed! Obviously this restaurant uses high quality ingredients and cares about the quality of the food.\n\nAnyhow, even after I ate the salad, I wanted another wing...mind you only the second one.  After eating it, wow!!!...my mouth was on FIRE!! Now I like hot food, but holy moly these wings were HOT!  I drank milk, ate bread, and held and ice pack to my lips for 15 min before my mouth started to cool down! LITERALLY. So, what I am trying to say is, please understand that  "hot wings" means "hot-as-hell" wings...just sayin...I\'m just trying to protect you.\n\nI will definitely order from this place again.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2013-11-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0U6YfdxR2aw-_4vctk9eKA', 'review_id': 'ifFtM70WyGuqQT9Ohw-ZZA', 'text': 'I was very disappointed today to find out Venezias no longer serve the Empire State Pizza. I have been a regular customer for 4 years and that was my go to order. I always bragged and recommended Venezias to friends and family. Without the 10 topping Empire State its just another neighborhood joint.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 1, 'date': '2013-11-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'j4uCpIpMwtgmLfXigau5xw', 'review_id': 'kPorbkGGgvt673mjnDOMng', 'text': "This is by far my favorite pizza place in arizona. It is inexpensive and the slices are huge and delicious! Can't get any better.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2013-12-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1VmSTWWO6WJZimcuDifQEA', 'review_id': 'XxIxzfcY3lOIBsrxQT8H8g', 'text': "I have been frequenting this place for about three years now.  They have fantastic daily slice specials.  I think the pizza is better ordered off the menu, but you can't go wrong with the slice specials.  Some of my favorites are the BBQ chicken pizza, pizza bianco, and Italian Stallion.  The calzones are good and always on special on Saturdays.  I haven't tried all the sandwiches, but the ones i have had have been pretty good.  The pasta was decent as well.  If the pasta offerings interest you, the kid's meal size is pretty good if you don't want to gorge yourself.  They have lots of beverage choices at the fountain.  The staff is always friendly, and the dining room is clean.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2013-12-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6ws6UtB_Co8ruJHwvc5xtQ', 'review_id': '79kn1Ef6gnCij3ZgXkxI1w', 'text': 'Excellent food, great service. Dependable and does not disappoint. Still the best New York style pizza you will find in Arizona.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2013-12-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PksDvR2ZGlKl4WlRzyoJAA', 'review_id': 'WKZe-f2C0mB_wF3-MrMNFw', 'text': 'This is my favorite pizza place in all of Phoenix. I have tried a few others and none are comparable. The pizza is delicious and the wings are just as good. Super affordable. This Tempe location is my favorite!', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2014-01-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4e0a_CL-C75mH1Xzb_2gbw', 'review_id': '9gqRXkxG9nLXlWiRUZ0_cA', 'text': "This is, without any doubt whatsoever, this absolute worst pizza I have ever eaten in 65 years on Planet Earth. On a 14 inch pizza, the ingredients extend perhaps 7 to 8 inches from the center. The rest is crust, and tough, tasteless crust, to boot.\nLike eating an inner tube. Caveat emptor. I can't believe they find enough people\nwithout any taste to keep them in business. YUCK!!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 1, 'date': '2014-01-02', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 3}, 'user_id': 'DrWLhrK8WMZf7Jb-Oqc7ww', 'review_id': 'J3ZibFpFYfBvPrc_OJdHiQ', 'text': 'Still a solid place for Italian. Returned after 6 months and again was served a solid chicken parmesan sub at $7.,99. Just mnake sure you ask for the sandwich special which gets you a drink for that price as well. Finally tried a slice of the pizza, but the BBQ chicken specialty slice of the day was only average. The BBQ sauce was too sweet for a pizza and there were no red onions on this version of the BBQ chicken pizza. Those are standard usually. Will stick to pasta and subs here for now.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2014-01-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XK59nX71cV0ym6r4Q7thKA', 'review_id': 'e6vg-WnbeRGQ5W-ch56DrQ', 'text': 'For New York style pizza this is one of the best in the Valley. I like the fact that I can get pizza by the slice, order a pie w/ the old lady or if having  a party can get the huge pizza. Always a go to spot at work w/ fellow co workers. Wings good as well as salads. Def recommend and will continue to go to get my pizza fill.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2014-01-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '4NPYysAblB-e08I_1pfHxw', 'review_id': '6I1Dd89WnHF8qi_H_iFzYw', 'text': 'Pizza is amazing, wings delicious big cooked crispy lots of sauce, got the veggie plate yum!! Parmesan peppercorn dressing is delicious. Fast delivery too', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2014-01-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'K_gNqlirV0kppqCGnfGiOQ', 'review_id': 'i6W5PGGxGDE7FfosnGATMA', 'text': "I've given up finding the best pizza in town because, quite frankly, sometimes I'm in the mood for fold-it-in-half NY style pizza and other times I crave something more refined. Venezia's does NY style right, with a consistency that has yet to disappoint.\n\nThe menu offers a nice variety, touting the usual toppings and pizza variations (calzones, stromboli, etc.). Add to that tasty salads, wings, and sandwiches made with Boarshead meats.\n\nTheir combo specials make Venezia's an affordable lunch option. For the carnivores, go on Wednesdays to try out my personal favorite, the Italian Stallion. Otherwise, the Greek salad is also delicious. \n\nThe fountain and tea offerings are abundant. TVs are tuned in to sports channels. The staff is friendly and the seating is generous:  booths and tables with a handful of larger booths for parties of 4+. Lunch is busy, but I've never found myself without a place to sit. Venezia's is situated in a strip mall with limited seating outside and plenty of parking.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2014-02-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'TG1ph6yWOTBWk2ZOjJyuAQ', 'review_id': '5fM6Q51ltkhZVHEkCf0wqg', 'text': 'The measure of a pizza place is can you eat there everyday and not get tired? Thankfully the answer is yes if you are headed to venezias. They have decent lunch specials that make eating there affordable as well.\n\nI will say that you can definitely think that there are distinct pizza chefs there, as the doughs and sauce ranges vary from day to day.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2014-02-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 3}, 'user_id': 'KjKNhfC0kQwsHFYpLlxVNw', 'review_id': 'j8k1O3R0_U8PIfkBRtPb5g', 'text': "I've been going to this place for years and expect what i pay for.Quality food with superior service. I ordered last night with the tv on and music blaring on top of changing my orders to accommodate my guests. Throughout the call, Jaqueline remained professional and i didn't catch a hint of frustration. To tell you the truth, I would have accidentally disconnected the call had the tables been turned. This only solidifies me as a repeat customer. Thanks for the respect and amazing customer service. \nIf you're a newbie, the pesto pizza will turn you into a fan and the Italian sausage could possibly change the heart of a vegan.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2014-02-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GaEgffsHIfYkO621i0MMDQ', 'review_id': 'pHdkg9O9pYjlNbmU1wmGWQ', 'text': "Love, love, love this place. \n\nTheir pizzas are amazing! They offer gluten-free, which is nice, and they have tons of other menu options, too. \n\nPersonally, I want to do their meal challenge where you have to eat one of their GIANT pizzas in a certain amount of time, but I'm trying to keep my svelte figure...by eating only slightly unhealthy amounts of pizza. \n\nBecause I eat a lot of Venezia's...a lot.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2014-02-21', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 0, 'cool': 0}, 'user_id': 'JJrKAUIZe_Xl4H-Lim7ubA', 'review_id': 'b4Ru9LVUwtuhddz9MlplFA', 'text': "I was surprised at how bad the pizza was. I've seen yelp give good reviews to pizza places before that I wasn't wild about but those places weren't bad they just weren't great. This one is an exception. I went in for 2 slices. The first being a white sauce slice...now I'm not exaggerating, I literally had to smell my shirt and arm to make sure I wasn't losing my sense of smell. I couldn't really taste anything I mean it had sliced tomatoes on it and I couldn't real even taste them. It was mega bland, like a white rice and unflavored chicken kinda bland. But I was like well maybe white sauce just isn't their thing.\n\nSo I bite my pepperoni slice and I'm like ah I didn't lose my sense of smell. The second slice was like flavor country after such a bland slice. But then I was like man this is kinda dry, the cheese also does not have much flavor, pepperonis are kinda meh. Does this even have pizza sauce? \n\nI went to this place starving it should have been great, even with a heightened sense of smell and taste it was bland and dry. I don't even want to imagine what it's like in a semi fed state. \n\nLittle Cesar's is average to me. This isn't even as good as that. Why spend 5 bucks on this when I can get a whole pizza for the same price that actually tastes better? Can't speak for the rest of the menu but the pizza is really sub par. Can't understand the high marks it has. Maybe it's better as a fresh whole pizza? Maybe?", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 2, 'date': '2014-03-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SEs6ys3-8bU9Y5I54QytEw', 'review_id': 'lVKOEbrkRR0w-nqaVWdtSA', 'text': "Love it! \nWe had our favorite pizza place then we moved to tempe and had to find a new one. Venezia's is perfect, we ordered it based on other reviews and fell in love. \nIt's always delivered on time and piping hot! It has the perfect ratio of cheese, sauce and crust. In short we are now lifetime Venezia's fans!!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2014-03-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'opuK8bxb5Ty4EA5hGUFrpg', 'review_id': 'yZjj2KSe2V21IkK1mTYMew', 'text': 'really good crust on the pizza and delivery within the hour online ordering system is easy will definitely order from them again', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2014-03-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'FNAQNtLBuSuFcfYhzPsGsw', 'review_id': 'r3ckcxJMjEf5aHUjlAmLHw', 'text': "There was a hair in my first slice that was long and dark (not my hair). The cheese is like rubber, not cheese-y. I'd rather spend my money at clockwork pizza or big boys pizza; they are comparable in price but exponentially better in quality and taste", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 1, 'date': '2014-03-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lrNkkOV6nVLZRzTQo7ZMGQ', 'review_id': 'BLOKOJPJ6z8FNxjmRKn4VA', 'text': "Fantastic place to get a few slices and wings. Great selection of slices available pretty much throughout the day and the wings are fantastic. The only reason they don't get a full five stars is if you get a whole pie it's usually very well done (raw) and no beer.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2014-03-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'ziCy0V2N3tSh4KXu_LmU3Q', 'review_id': 'jtXnsMmCZDARhsvs8z5ndQ', 'text': "This is one of my favorite places to get some legit pizza! In a world being destroyed by hot and readys and 5 buck pizzzas these guys stay true to good ingredients and phenomenal taste! Also with the quantity and quality it's a super good deal! I love it try it out you'll see!!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2014-04-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'nzQdKOdJbPaGSFrh-3d5hQ', 'review_id': '4RUF0x7jqayIhKJ6F8rsoA', 'text': 'Delicious. We shared the large pie with all the toppings. The sauce was tasty, and there were plenty of the different toppings. We will definitely be back!', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2014-04-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Kle9Pr1sCJXWt_jheWSSUQ', 'review_id': 'cQoqimVQ2ojzigOVJgMg9A', 'text': "The food is alright but the service is horrible. Trying to get someone's attention to ask a question is next to impossible. Ordered wings and bread- had to wait almost 25 minutes to get them. In the end I had to get someone's attention for help and found out the food had been ready for a while they just forgot to call my name. By the time I got to eat the food was barely warm. My suggestion- try barros instead.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 2, 'date': '2014-04-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'Ej2fkoMzE78cwdh-HlAaUw', 'review_id': 's9XGmXDUvGf_t4_WmND-UQ', 'text': "I've been here a few times as well as ordered out and it's been good all around. Wings and pizza are their specialty and I stick to both. Always good.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2014-04-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kOZkIuBLyFE4i2rBawCKdA', 'review_id': 'argVSTdrBL809L-pNvW3Tg', 'text': 'Great wings and pizza. But don\'t waste your time with their "deals." I bought ten of their slice specials and was supposed to get one free, I ended up paying the most for that meal than ever before. You can\'t get wings with your reward "slice special" and you can only get like a plain cheese piece. I might as well have just bought another damn slice special to get what I really wanted and save $2 than to have taken them up on their BS offer.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2014-04-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dTAfTGtvgY10JR-Fda8m_w', 'review_id': 'tXcNUpgemQknWQx9DyGbGg', 'text': 'Best pizza in Tempe. My favorite slice the Italian Stallion I wish they had everyday but is only available on Mondays and Wednesdays. I will go out of my way just to get their pizza.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2014-04-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '458bvbL7S9CrhyCM-JxaYA', 'review_id': 'dti7ITkKExloWQSg_Bydxw', 'text': "Pizza NY style which can be hard to find here in the desert. Order at the counter and they'll call your name or if a full pie they'll bring it to your table. Drinks you fill yourself but you can refill as many times as you want. Slices are large which you can just fold to eat like a good New Yorker. Garlic, oregano, red pepper, and grated cheese are on the tables ready for you to top your slices.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2014-04-24', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 1, 'cool': 0}, 'user_id': 'FUMdzARf71drXyDZ7lkpWw', 'review_id': 'xPIexh_K1EHXlvrlHqNu8w', 'text': "Why So smoky? It's like cheech and fucking chongs house in here. Visible plumes of smoke bellowing from ac vents directly above the line of people. Pregnant women and their children inhaling the noxious fumes. Not to mention subjecting your employees to that for hours at a time. \n\nTurkey sandwich, flavorless. Something is wrong here.. I'm completely stoned and it still tastes bland. The smoked mtn dew was good.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 1, 'date': '2014-04-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': 'n4SiDQvwfeLOuxoLEV1xZw', 'review_id': 'lrjjxH5DuUpCvOk4zDDQQg', 'text': 'Delivered by Anthony in a super timely fashion I must say! We ordered a small pepperoni pie and a large Cesar salad! Had the pie cooked well done and double cut. Gotta have that crispy crust!!! The salad was actually very good size and the dressing was good. Shaved parm and a hefty amount of croutons. Our delivery driver, Anthony, was very happy and had a smile on his face when we opened up the heated carrier. Friendly and warm he also sprinted back to his car to get the shredded parm and hot peppers. Good dude!!! Will order again soon', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2014-05-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'E2DYTWOVSptFJqM7jckPpg', 'review_id': 'oUiRKMPiVvDWO1F5fqt7hw', 'text': 'This pizza is pretty good, but definitely not the best around by any stretch of the imagination.  All the food I ordered was pretty decent quality though.  I will go back when I am in Tempe.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2014-05-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rpawHnKqHtBsM-ychsYzqA', 'review_id': 'Q7OkVichCkYXH2XhhYufbQ', 'text': 'My favorite straight-up NY style pepperoni pizza in town.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2014-05-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rQ4o_oRTLiWE6Tb1OV19KA', 'review_id': 'PeNQ3u3zFWdWe-iRbpe7og', 'text': "This place has the best pizza I've ever tasted I would highly recommend going there you won't be disappointed. Wings are awesome too.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2014-05-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'KPfcgOxFwP6atMOsDdJ3OQ', 'review_id': 'qNX4NZd27sifMbXhlw5Bmg', 'text': "Want pizza and wings but tired of Domino's, Pizza hut, and Papa John's, but still want the average taste of average pizza? Give this place a shot.\n\nWings are great. Pizza's nice, too. Nothing fancy, but they do have this extra large pizza that is so big I had to put it in the trunk of my sedan, so there's that, if you like a bit of novelty. All in all, an average pizza place. The staff is either helpful and friendly or eternally cursed to never feel happiness again. I think you get a 50/50 chance of either.\n\nI'd recommend this place for take out more than dining in.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2014-05-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wc9MU65uNPYgWHc1HJ_TWA', 'review_id': 'goJng9squ34qU4qVmM1b2w', 'text': "We really enjoyed our pizza from Venezia's last night. Ordering online was pretty easy, though I couldn't see any way to add toppings on only one side of the pizza. Used a coupon code for a discount which I found on their website. Went to pick up and it was ready on time, 25 mins after ordering. Pizza was very tasty (vegetarian specialty pizza) and flavorful. Generous toppings and cheese. Or only minor complaints were that the pie was a little soggy in the center -but this is frequently an issue with vege pizzas since the ingredients are more watery. The cheese bread sticks were supposed to come with marinara sauce I think, but there wasn't any in our package.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2014-05-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nUMM0EVlmdCLAA3mqQoUmQ', 'review_id': 'c6irr1TOqyGz0eKIiFbEbA', 'text': 'I went in to Venezia\'s because I had a nail appt down the way. Trying to be "healthy", I ordered the Chicken Cesar salad. I got to my pedicure appt and began to chow down (I am on my lunch break, hence the multi-tasking) I noticed after one or two bites my chicken didn\'t taste right. So disappointed because I have minimal time, I called them back just to give them a heads up about their chicken and potentially save someone else from food poisoning ... The gentlemen told me how they prep the chicken so it couldn\'t be it that it was under cooked. He went on to look up the order, provided me a  full refund me and asked what I would like instead. I told him, one slice of pizza would suffice. Instead, he assured me he would fill my To-go order with food to equate to what I originally spent despite him comp-ing it. He asked how long I\'d be and he would have it waiting for me. In today\'s society we hustle and bustle all day... Multitask and we are on our way... Although, it is customer service stories like these that make you take a moment and realize how rare they occur. I work out at LA fitness regularly but have never stopped in Venezia\'s until today... After a small gesture that truly goes a long way... I will always think of Venezia\'s for my pizza needs!', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2014-05-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LFGQ3BnaFMZltslz0oLn3A', 'review_id': 'TtJCtTwJkd4NrF4TrAqHqw', 'text': "Great Pizza at a great price! Two slices and a pop for less than $7. I'll be driving there for a pick up order soon! Good job!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2014-05-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'F9hl4Dn1Ube3A6NShgfXmw', 'review_id': 'SeiQlpqgqfEC1Yn3CoMOjw', 'text': 'It\'s okay pizza. The sizes are kinda off, as both times I got an X-Large (16") they\'ve been kinda small. Like another reviewer said, it\'s your average NY style pizza. \n\nI don\'t really like when restaurants have to incessantly reference some TV show they\'ve been on (in this case Breaking Bad and some Food Network show or something); it\'s tacky. Venezia\'s does this with all the style of a brat who just won the spelling bee. Once again, it\'s pretty simple pizza, not some place you really need to visit for its gourmet fare or its ability to make you be able to manufacture meth.\n\nTheir slices are a nice size and look pretty good for 2.50 a pop, though I\'m not sure if that\'s just cheese or the ones they have featured in the display case up front.\n\nCustomer service seems okay. Check this place out if you want NY-style pizza, I reckon.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2014-05-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'IIRBF6_xbWYPbP_mjGI8RA', 'review_id': 'vzzYgOfXI597fI9Ge1BAAQ', 'text': "I love Venezia's so much. Two slice special with a drink was my bread and butter back in the day. Even though I moved awhile back, I still crave venezia's.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2014-06-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2rwojpqMSQQb83r7IICwOQ', 'review_id': 'bjrPTtFRPOVu9R05v_FZLQ', 'text': "Great pizza, great price.  I get 1 slice, wings and a drink for under $8.  Very happy when I'm there.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2014-06-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': '4bfNeKKTJvKV8StFZ01rsw', 'review_id': 'sGDowsawn38sTRNuX1g4wA', 'text': "It's good pizza, not the greatest by any means but I was very satisfied. I had pepperoni, sausage, black olive and mushrooms and an order of medium chicken wings. Service was great, atmosphere is nice and they seem to be popular because the place got busy real quick while I was here. I will go back for sure next time I'm in my second home city of Phoenix.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2014-06-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oORHh30ptSk_5v7UBBWzwA', 'review_id': 'C2iyQAAsuw0kBxVhU-LClA', 'text': "went in for spaghetti with marinara.  plain tomato sauce, no flavor.  I said to the girl taking my order that I guess I should get some garlic bread to go with that.  instead of telling me that it comes with it I got home and way too much.  way to upsell.  arizonies don't know good Italian anyway.  I swear you could put tomato sauce on a dead cat and people here would love it.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 2, 'date': '2014-06-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xsq2uST0rhcCz30k94bCaw', 'review_id': 'xbBBdAkHNmqvPGbJHgkRbA', 'text': 'Best pizza In Tempe. Been coming here for years always always a delicious pizza. Give this place a try !!', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2014-06-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'z_7bnSWglHebz9dMS5X43g', 'review_id': '3CKlL_5rHoAqEduUypGqkg', 'text': "It doesn't get better at Venezia's. Pizza dough is moist, the cheese/sauce ratio is correct and you get a decent (not healthy) lunch for under 5 bucks. Also, their pesto pizza is a the bomb!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2014-07-15', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': 'VuEz4exG3lBmVmkPvw2eag', 'review_id': 'p6b4iINGHSg2nPT7oqnmHA', 'text': "Delivery-- \n\nIt'll be an hour even if you're across the street; then again, you're lazy, so can you really complain? They're bringing you food.\n\nThen, the food--\n\nIt's thin crust pizza. It's not remarkable. It's edible and tasty, but nothing special. A-OK.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2014-07-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_csencETgrP6HyHnhjc7Gg', 'review_id': 'X-qC8S1rRISK-CSRXaO03Q', 'text': "Been going here for years, by far my favorite quick pizza and wing stop! It's been a lot nicer to dine in after the remodel a number of years ago. Keep up the great work!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2014-07-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8KmHPVzyBW45_tXX8zU5mA', 'review_id': 'kplKdiMvN3sCQUt-FQuuSQ', 'text': "The pizza that made Walter White's roof famous. Easy ordering online or by mobile phone! Check the coupons for codes to enter at checkout. The delivery guy arrived at the Arizona Grand Resort within the 50 minute time limit stated on the website. Food was hot, bubbly, and delicious. I liked the crust even though it got a little soggy in the middle underneath all of the toppings. The cheese coagulates a little too quickly, but if you eat it while it's hot, it's pretty terrific. The thing about this pizza that had me sailing over the edge was the pizza sauce. It was ABSOLUTELY AMAZING! Garlicky, tomato basil - perfectly seasoned - I couldn't get enough. I over ordered and we didn't have a fridge so by the end of the night I was just peeling the cold cheese off and eating the crust with the sauce. They didn't provide any utensils, paper plates, napkins, or Parmesan cheese/crushed red peppers. I'm guessing I should have asked, but Stumpy's up near the Hilton Squaw Peak totally anticipated our needs when delivering to the hotel - I guess I just assumed Venezia's would too? Either way, I'd totally eat here again! And if you're staying at the Arizona Grand, ordering in is way tastier and cheaper than going the room service route.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2014-08-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'TYA0wvtOFDM-Ng6zXx3lvA', 'review_id': 'S6Czwt7KOiI_kVYR0smXeA', 'text': "I've ordered take out from this place a couple of times. Mainly I just stick to their pizzas, which are pretty good. However the other night I was craving some wings and decided to try theirs. It was a huge disappointment. The sauce was very flavor full, but the wings were lacking. In fact, it was like they gave me just the bones. So sadly, I would recommenced staying away from the wings. \nI do like their pizza. Its tasty and they have some interesting ideas. I had the Greek Salad pizza which was pretty good. \n\nThe pizza is worth getting, but not sure about the wings or other items (I haven't tried anything else). I do like how they have online ordering which is always a plus!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2014-08-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'B6cV7ghvEtyDPMhzd73m-A', 'review_id': 'GoK4kWrsKFpesg8B41EpSA', 'text': "I don't get the hype. \n\nEveryone told me how this was the best pizza and I don't see it. I take a bite and I end up with all the cheese and I'm holding a piece of sauced bread in my hand. And that's even after it cools down. \n\nI'll eat it though. It's close and they have GF options for my man. \n\nBest thing are their wings.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 2, 'date': '2014-08-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ya1123yY6PHEKw8pipRmVw', 'review_id': 'jdmp2gPqaBsFAvjkPh3dvg', 'text': "Thought we'd try something new other than Papa Johns. I'm very pleased to say we will be ordering from here in the future. \n\nWe were pretty skeptical whether or not we needed a large or extra large so we went to the XL Venezia supreme and hot wings. \n\nThe tasting of the pizza and wings were exquisite! Not too much marinara and just enough cheese. Our order was expected 45 to an hour wait but we ended up waiting about 40 minutes. \n\nVery satisfied with our first experience.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2014-08-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'YGE3-Iyifex1DZna-v86Ig', 'review_id': 'Jb5xXxtg-jzDjNvohoTm6A', 'text': "Best slices in town, in my opinion. Lots of variety of slices with toppings and they don't just throw toppings on top as they reheat the slice. The pizzas are made with the toppings on them, unlike some other slices places. Great lunch specials for huge slices with salad or wings to mix it up. The wings are hotter than normal. If you normally get medium, get mild, if you normally get hot you may want to get medium, if you don't want tingling lips after lunch. I wish they had coke products but other than that this is a perfect spot for lunch any day of the week. It does get busy at lunch time but they're used to it and orders come out pretty quickly. If you order anything hot that isn't pizza be prepared to wait a little bit longer, they even have a sign that says so. Tvs to watch sports are nice too.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2014-08-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'nL4QufiB7bmRrP-oV14L4Q', 'review_id': 'WyEkMvzHenfTcpqXbJK7Cg', 'text': "When I was first introduced to the place a couple years ago, I thought this place was fantastic.  The slices were huge, there was always a huge selection of pizzas on display, and the wings were great.  But after about a year of going there, I kid you not, weekly, I started to see a drop in standard.  The pizzas weren't always warm, if you asked for say a mushroom slice, be prepared to get canned mushroom thrown on a reheated cheese slice.  The wings weren't always warm either, and sometimes lacked the sauce that once made these wings great.  Recently, I've noticed that they've gotten rid of the punch cards (I guess not many people were using them anyway), and my favorite honey-hot wings.  Instead, I was told that I could get honey-mild wings, or get hot wings and pay for a side of honey.  I'm going to stop myself here before I go on a rant, but that drove me over the edge and well, the only reason I'll be stopping by in the future, is out of nostalgia of the place this used to be.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 2, 'date': '2014-08-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '132m3lRoO1tw3rdlGvYF4A', 'review_id': '5_KmVOxiM_nBSUHWRQJNNA', 'text': 'The pizza is always tasty and hot. Very good combo choices and they have quick service.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2014-09-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'n-2gSytw4x3Q_rbweZnfuQ', 'review_id': 'em8ugPN6GY9IuSuzX8iajA', 'text': "I love Venezia's, or as I call it, Breaking Bad Pizza, due to it's numerous appearances on the show. The slices are enormous and loaded with flavor. And their 2 slices, one drink lunch special for $6 and some change is a bargain!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2014-09-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uZKRVzJDk2rIwrYaqtf2nw', 'review_id': 'NMk4M27zYee5Hm5SJ3Y59A', 'text': "Easily one of favorite go-to pizza places in the Tempe area. \n\nI've never been there when it's too busy, and the pizza always satisfies. There's a decent selection of styles that you can choose from, and they always have specialty pizzas in case you're like me and enjoy trying something new. The slices are huge and the price reflects that, but I've never walked away regretting spending money at Venezia's.\n\nIt's not going to be the most amazing slice you've ever had, but I'd gladly take Venezia's over any other large pizza chain.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2014-09-14', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 1}, 'user_id': 'OMLwWAhcYDlhEdyx3dBNCg', 'review_id': 'zXc0fUqgLOwron0XAXYmYQ', 'text': 'My gf is suffering through "shark week" and wanted pizza. I did take out and the pizza was ready when I got there letting me hurry home to the sea of hormones my bedroom was becoming. The pizza was shaped like the circle on a pentagram but still helped me keep the possibility of needing to perform an exorcism at bay. She was happy and sated, another night I keep all body parts and have a warm bed to sleep in.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2014-09-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'O-kxtlYudDG587E4sSoZNw', 'review_id': 'cpJh__s0aCLeS_GftlHNXA', 'text': "As a fan of pizza!! I could say that this place have the best pizza I've ever tasted before.\nYou can imagine that you are in New York.\nFeel sorry for dominos and Pizza Hut now:((\nI highly recommend it also they have a delivery service though. Enjoy guys!!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2014-09-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'NqQp5T9tlBQ7R7_fS6UO6Q', 'review_id': 'WBtsVST4JvBH4NsEw34Ydg', 'text': "So good! I love pizza and this place is great. Sweet thin crust and lots of cheese and toppings. We got the Hawaiian and the pineapple was so juicy with lots of big pieces of ham. We also got the antipasto salad- huge rolls of salami and TONS of banana peppers. This was the best pizza I've had in a long time. And the price was great for what we got. Extra large specialty pizza, salad, and a 2 liter for around 30 bucks. I'll definitely be ordering from here again!!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2014-10-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6-6Ta9zxbxo65nIMpEQcoA', 'review_id': 'dCf2TbRqBalzlWd3P5ejuA', 'text': 'I sure miss living in an area where Dominic has set up shop. This Pizza is fantastic..!!!', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2014-10-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VZgiPC4aOJG61XdZroLuJA', 'review_id': 'BIKxqhKz9r9o83uh00jw-g', 'text': 'This was for carry out.  The women up front were quite nice, and the garbage was cooked within 15 minutes.  \n\nWell, you get what you pay for, I suppose.  The cheese is like rubber, but the crust is chewy.  Would I pay $18 out the door for a 16 inch "specialty" pie from them again?  Mmmmm, perhaps for my kids or someone who doesn\'t know that cheese comes in something other than velveeta.  5 year old  kids pool party, or food for the already inebriated...all else, you not go back more than once.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 2, 'date': '2014-10-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uCNi59FyaByk6lBbHO_yzg', 'review_id': 'JwdpjZcTamIvzsURDNkVqQ', 'text': "We order form this place regularly, and I love it! Good sauce, very cheesy, plenty of quality toppings, and the price is pretty darn good. They deliver fast, and it's always hot, but I think the delivery charge is a little high, so we usually pick the pizza up. They are the pizza Walter White threw on the roof of his house, being a Breaking Bad fan, this makes me like this place even more.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2014-10-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'sg5lqdk6z2iH-OLkgy4yxw', 'review_id': 'uQXDsDO26EIg87rFrGOfkw', 'text': "I love Venezia's! They have some of the best pizza I've ever tasted. They have the perfect amount of toppings and aren't super greasy. The pizza always has lots of flavor. Every time I've ordered everyone has been super nice. The food comes quickly if you order in, although whatever time you have to wait will be worth it. Trust me! \n\nThe hot wings are always cooked well. They are just enough crispy enough and the hot sauce is amazingly tasty. You might not be a fan if you don't like vinegar, though. I tend to get the chocolate cannoli a couple times a month because it's just sinfully good. I had never seen a chocolate covered cannoli before, but they sold me on it. I would buy from them on the cannolis alone.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2014-10-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'SfRdpIiortseC_VfDBe7hA', 'review_id': '92G6PtgvEBbniLMPhlBnHg', 'text': 'got the 24" meat lovers, oh yeah. nice food and folk. wish you were 24 hrs', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2014-10-27', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 2}, 'user_id': 'eryLfrk7fabe8G1HPBkNAg', 'review_id': 'OA9mXBSRs3MJvdiz9WjzKg', 'text': "First let me start with telling you I am a metro area native New Yorker.  My bar for what  I consider a good pizza is HIGH!\n\nToday I got the lunch combo with wings and a slice.\n\nA real NY joint would serve their wings with blue cheese dressing and NOT ranch.  LOL\n\nThe pizza in my opinion falls short of a good NYC pie like you find at Grimaldi's.  \n\n\nHowever,  based on the numerous great reviews I would suggest trying this place to form your own opinion.  I will likely return but I will try a hero or sub.  (Sub, like hoagie is a NJ term.  Most NYers might say Grinder or Wedge)", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2014-11-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'OMC3DRyGrDbq-oMtdRAH8Q', 'review_id': '1l2YpTp0jtin3tIQwpCaXg', 'text': "Have to up this to 4, we eat there too much.  The best pizza ever?  Certainly not.  Do I like the conveyor belt instead of the pizza oven?  No sir.  But when we need a quick slice this is where we go.  \n\nIf it is time to get a full pie, that is what Spinato's is for.  But for a quick slice?  This can't be beat.  Tried hitting up a few places in Mesa to find them a complete dud.  I always leave full and satisfied here.  Always quick to take the order and get you the food.  Place is always PACKED.  \n\nAfter another 20-30 visits I may swallow my NJ pride and give this place 5 stars.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2014-11-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mH5XqWxpoGmhebrSLyK6bg', 'review_id': '7pTirza21HI6mXMWPPxt7w', 'text': "This place is all around great! Great food, great prices, huge portions, and good service! You can't beat their slice, 6 wings, and a drink combo! I have yet to try the challenge they have but if you have a huge appetite it's worth a shot!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2014-12-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BJ_SCzxtw5_ipApqccBZKQ', 'review_id': '8sG0JRluGVY453WRfHdUZA', 'text': 'Do not order delivery from this place. They took down the wrong address and came VERY late. The food was ok.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 1, 'date': '2014-12-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Wacqmo6aSZHzjI9UofPdsw', 'review_id': 'pIkNNh5nY135Qs3bvI2cEA', 'text': "After finding a coupon for Venzia's and hearing great things we decided to get takeout a Friday night. We ordered over the phone a large pizza and wings. When we went into the restaurant to pickup our food the cashier said that she could not find it in the system. She apologized and told us she would grab the manager. The manager came over apologized and put our order back in. He also gave us a discount and still honored our coupon. I was so impressed how this situation was handled. Both the manager and cashier were so great. I work in the restaurant business and understand mistakes happen. I felt this situation was handled perfectly! When we got back home we ate the pizza and loved it! I was impressed at the service and food at Venezia's. We will be back and have recommended it to other friends!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2014-12-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BQ7g1DJA3p0vHNihtHzeLQ', 'review_id': 'FTeRQ0Yj0wwpuQx_5HIvbQ', 'text': "Not THE best pizza I've ever had but the best pizza in the area :) Try the pesto pizza! For about $7 you can get 2 slices and a drink.  Not that bad.  Whole pies are a bit pricier than the corporate go to's but this place is way better and the pizzas are HUGE (as well as the slices)! They're deserts are really good too and they have a really large selection of drinks.  Yummmmmyyyy!!!!!!!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2014-12-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Tm5xXZXMSZJQFucC7NIaHg', 'review_id': 'bQzI8GIKOEp3IQOMN_P2LQ', 'text': "oh my god worst pizza I've ever had. Tasted worse than school cafeteria pizza. Ordered a small at 2 bites and immediately stopped eating. DISGUSTING", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 1, 'date': '2014-12-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 2}, 'user_id': 'eiA073MhHpCdwBq8u_luZA', 'review_id': 'j_iChrWFQuYxZxMdTI6xzQ', 'text': "Place is still excellent three years later. \n2 item combos for under 8 bucks and I've never had a bad wing at this location. (Also has amazing ranch)\n\nI see people kvetching that the pizza isn't as amazing or as NY authentic as the one at Grimaldi's.... Puzzles me why your comparing a eat-in coal fired pizza in Scottsdale with a more casual slice place like Venezias. The two serve completely different categories in my opinion. A more fair comparison would be the nearby Slice's or Sal's pizza which Venezia's blows away.\n\nA lunchtime/gameday staple", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2015-01-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SUKkZw5S8awRbDwO025RkQ', 'review_id': 'Ebd20K1CW-ECSvsMfknO7A', 'text': 'Awesome lunch combos and large portions. Their pizza never disappoints, tasty sauce and toppings. The ranch is good, not watery or sour tasting like most pizza places. You can also buy their sauces. Everything here is good and they offer coupons and daily deals!', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2015-01-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Q-jRp2ZUhyQR5T7nDbV1IA', 'review_id': 'h8yro0wWbcSheYEAxOfIVA', 'text': "This is our go to pizza bevsuse its close and we're never disappointed. The lunch special is great & cheap. 2 of my favorite things. The staff is courteous & quick. Why not 5 stars? Because all pizza is compared to Mama Mia's.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2015-01-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JvoU2TiSt-X5ECtSgK0k6Q', 'review_id': 'q3_Sn1regMN8WxikwEXG1w', 'text': 'Great atmosphere for a good times with friends. Counter service by very helpful team. Pizza by the slice. Any toppings. The crust has just the right amount of chewy and tear. The mix of sauces cheese and topping have a full flavor in every bite. The calzone has good flavor. The mix of cheese in the calzone could use more ricotta. \nOverall a great place with good flavors.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2015-01-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1uhipArheEVbwWyoAbKAGg', 'review_id': 'L6fSGOFznrIM0uLUEl1EQA', 'text': "Got a pizza tonight because I've been craving one for weeks. Thought I would check this place out since they had pretty good reviews and were close by. Pizza is pretty decent. I can't say it's great and I'm not sure if I would be back but there's nothing bad about it either. Give it a shot if you want a pizza and you're in a hurry. As busy as they were they had mine ready in about 15 from an online order.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2015-01-23', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 1}, 'user_id': 'YNGetE-_zW5_aToTDH3Uyg', 'review_id': 'tvaQ4Y3XFHM1ZIAtt5wcmA', 'text': 'I\'m parking this review under the Tempe location, but it\'s about the entire Venezia chain. It\'s about time a real New Yorker like me stood up and informed everyone in the valley that this is NOT what pizza is like in New York. I think any pizza that isn\'t Chicago deep dish is called "New York Style" in the valley and I will deal with Gus\' Pizza falsely claiming to be NY Style in a separate review. Venezia\'s pizza does have a very pleasant sauce and good tasting ingredients, but let\'s face it...it is RUBBERY like Domino\'s Pizza, even if the ingredients are a notch up. A New Yorker never eats pizza at a chain restaurant and would NEVER put up with the size and price scheme that Venezia is running. Let it be known that what Venezia calls an XL (EXTRA LARGE) pie is slightly smaller in diameter than the normal standard size pizza in NYC.  Their so-called "Large" pie is an insult to consumers. That is what NYC pizzeria\'s call either a "small pie," "bar pie," or "personal pie." I once asked for a little extra cup of sauce on the side and they wanted to charge me for it. That\'s the kind of utilitarian drain-every-nickel corporate chain attitude that you would NEVER see in a NYC pizzeria. Venezia\'s is NOT authentic Italian.\n\nWith everything I\'ve just said, Venezia\'s is still probably the best pizza in the valley...THE TALLEST MIDGET IN THE ROOM in the valley of fake inauthentic overpriced ethnic food! (and by the way, it\'s been about 5 years since one esoteric episode of the TV show Breaking Bad used a Venezia\'s pizza box as a prop. With every year that passes, fewer people will remember it or care. Enough already! )', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 2, 'date': '2015-01-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'rC4rpCn9mv3l-01tk1uclA', 'review_id': 'Vet7DJ5ya4eAfcXd4V4ZTg', 'text': "The ranch is crack and so is the pizza, if you get the dough crispy. Honestly, delivery is always quicker than quoted and they are on grubhub.com- how much more convenient is that. The pizza is always good for leftovers and is always a crowdpleaser. I've tried some other pizza places and this is my go-to for delivery. Every. Time.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2015-02-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'U0fAAKKJ-KCF0ponTJobFA', 'review_id': 'weWHcQvqCtI_c8loEUYuGA', 'text': 'I catered this pizza in for an office function a week or so ago without trying it.  i did not get to try it at the work function, but employees could not say enough great things about it, it was obviously a huge hit at the office.  so, yesterday i decided to give it a try...it was really good and the salad i had too was great.  i will certainly be back, maybe for lunch during the work week.  it is very affordable and a really nice atmosphere in the restaurant.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2015-02-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ar7DM2UX6e7LPsNfZlhJfA', 'review_id': 'Scx0J8Om3EMcaQCREgTYZw', 'text': "I love this place.  They're pizza is so good.  Needed a quick bite the other night and it took less than 5 minutes to get a slice to go.  Very happy with everything.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2015-02-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'c-rzOKiCrjhZZZMvR6Tyrg', 'review_id': 'mQ-QXXJ4UxMIGlPFn8Dcfg', 'text': "Stopped by here for the first time today after the gym (it's next door). I always see people going in a lot, so I figured I would try it out. And I'm glad I did. \n\nI'll start with the service. Most places I go, the service is mediocre to horrible and I have come to expect that from most places in Phoenix. However, the woman who helped me was very friendly and provided excellent service. And the wait time was reasonable for how busy it was. \n\nAs for the food, the pizza was amazing- I ordered the Italian Stallion. My first bite was in the car, and I had to rush home to finish eating it! Definitely the best pizza I've had since I've lived in Phoenix. I plan on recommending the pizza to have catered at work. \n\nThe wings on the other hand, nothing I would order again. They were soggy and not anything impressive. Maybe it's my fault for ordering boneless? \n\nIf you want some awesome pizza though, definitely eat here!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2015-02-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 0}, 'user_id': 'Kr7sjA-96615H_t33bSkjg', 'review_id': 'dKoyJR7me4efJSbmqrxJCg', 'text': 'I ordered a medium size so i could take some home for leftovers. She said "I\'m just going to order it in the box-so you\'ll have it". She took my NAME since I was eating there-not a pick-up. \n\nI saw people after me come and go, so went up to counter after 20 minutes & inquired. "It\'s coming...we\'ll call your name", she said.\n\nWaited another 15 minutes, then went up again. Now my lunch time is over, and I don\'t even have my pizza.\n\n"Hmmm...let me check"... she walked off.\n\nIt had been done 14 people ago (I looked at the number the box had on it, and the last number called. Since it was PUT IN A BOX, they figured it was take-out, and waited for someone to show up and ASK for it!\n\nNow, after all that, the pizza was very...ordinary. Sauce (what little there was) was bland-like just tomato paste or something. Ingredients (which I ordered extra of-and PAID extra) were so sparse I though they\'d left off the mushrooms...until I saw one on a slice. Yes. ONE.\n\nPeople, if you think this is good pizza, go to Spinato\'s. Tempe or Ahwatukee. You will be AMAZED at what  a really tasty pie tastes like. \n\nI will NEVER go to this  brand again.  Overall BAD.\n\n(I didn\'t even bother with a picture, and threw 3/4 of it in trash)', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 1, 'date': '2015-03-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5521URxUBUGMv7c_e8DXwA', 'review_id': 'ovxgujUqvLN2tYi3ooFi5Q', 'text': 'Super cheap and delicious pizza! Their slices are huge; I usually order pepperoni or chicken pesto. Their Caesar salad is pretty good, too. Nothing extraordinary about it -- just good pizza and low prices.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2015-03-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wRKuku5Xvez9lTqLtXj2wA', 'review_id': 'm-QtCNVqxnTicPzQLK6IUA', 'text': 'I go here on a weekly basis and am never disappointed with the food or the service.  The pizza is by far my favorite in Tempe with the crust always being crispy and the pasta is cooked perfectly. Clean place and quick service.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2015-03-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XuqrEe4yfgHXiyTybr8AQQ', 'review_id': 'WzvuAyVfuxsi257AWy0caw', 'text': 'I snicker a little as I read these reviews about the pizza not being "authentic New York" Pizza(doesn\'t just about every pizza parlor add "new york" to the mix?).. well, let me welcome you to Arizona =) I live right across the street from this place and never noticed it. Decided to give it shot and this place has become a weekly ritual. The pizza bianco(white sauce) is my personal favorite =D', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2015-03-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lpyN2FydeLSpENyU1klW0g', 'review_id': 'BMXx4ghvoK6pLAAYpwD1bg', 'text': "I was craving pizza so I hopped onto Yelp to see what pizza places were highly rated and close to my home in Tempe. Venezia's caught my eye as I had driven by it many times and it had good reviews on yelp. Hopped in the car and headed there. It had a pretty steady crowd which was a good sign. I thought I would order a whole pizza, but then while in online I got into a dilemma. Should I order a whole pie or get slices and try several different types of pizzas. Since I couldn't decide on one pizza I went with 3 slices and even those were hard to decide on since they had so many choices. I had to get a plain cheese slice as you can never go wrong with the classic. I also chose a spicy pepperoni slice and a pesto slice. The slices were great and quite big. I think 2 slices would have been enough, but I chose the third one cause I had to try more. The place was nice and big enough for groups. It also was lined with TVs in case you wanted to watch a sports event so that was cool.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2015-03-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'h7-lk_BmctsFjcO79G7jWg', 'review_id': '2sfEV_Qb7Sxh4tQR45PQHw', 'text': 'Wow?  So many people say its such good pizza?  I assume these are locals, born and raise, for every good review that is a local - i can\'t imagine anyone from Chicago or NYC loving this garbage (thats French)...  I\'m from the East Coast and THIS IS NOT PIZZA!   I went in today to just get a slice.   I ordered 1 slice with ground beef & spinach - what i received was rabbit pellets and Basil.   Now don\'t get me wrong, I am a huge fan of Basil, but #1 it wasn\'t what I ordered, #2 it was all brown and wilted Basil - NOT FRESH AT ALL!!!!!   Plus the ground Beef looked like rabbit pellets.    As I asked for my money back a Manager got envolved.   As he was asking me if I wanted them to make it again and I was adamantly refusing... I humbly asked:  "Would you eat this??"  His punk arrogant response was "Yes, if the items I ordered were on there.."  Not acknowledging the fact the the rabbit pellets they called ground beef were just piled on there - it looked as if someone just grabbed a handful of pellets and laid them on the slice.  I saw virtually NO SAUCE - hence the ability of the rabbit pellets to freely roll about the surface of the slice and cardboard box at will.    They call this "New York style pizza?" - its obvious these fucks have never eaten Pizza in NYC, nor do they care to... they are satisfied with allowing sheeple to keep buying that waste garbage like its worthy.  Do yourself a favor and order Chinese...', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 1, 'date': '2015-03-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'aThkIdpPnim8OLES1WVvgA', 'review_id': 'rFD0nYOqx55ptCJND83YfQ', 'text': "Venezia's is one of only a handful of places in Phoenix that I would go to for pizza. I always enjoy coming here for pizza at lunch, there is one very close to my office on Mill. This is a casual pizzeria, perfect for a quick bite. They have a decent variety of slices and a great meal combo at lunch. They have a decent regular slice and this is how I always judge the pizza place!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2015-04-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'B8Vs_iNpPrCJkvHHOOLVxQ', 'review_id': '5O6Dh7RqBy4M4SBy-ahWcg', 'text': "This was our first time trying this pizza place and it was great that they also delivered to the Resort. Unfortunately on this day the freeway had a shut down and it took about 90 minutes to get our pizza and it was definitely cold . The driver was nice and I know it wasn't his fault so still tipped well. He also called when he was 10 min away. Didn't bring plates or cheese, Peppers.  I would give them another try , Pizza was good but could have been great if hot !", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2015-04-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'gGnT8NMhhRsZDb0lhCkaTA', 'review_id': 'fjwu_YHCvv5DF0a6xlPmYA', 'text': 'Messed up my order. Had a bunch of the people working there walk by me while i was waiting for help. The ones that helped me were jerks. I asked for some ranches after i bought a 15$ pizza they said it would be a dollar after handing one to somebody for free right in front of me.  If your a hipster mill jerk you will fit right in. Never again. NEVER.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 1, 'date': '2015-04-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Q6G-h33BWe1h0SwUmzP4qA', 'review_id': 'dsEyzznwjantAEXFhVkovw', 'text': 'Great pizza with nice variety!  Check their websites for coupons as they are on the pricey side but amazing pizza!', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2015-04-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZK3MeiykL64jiOyuV0C5Mw', 'review_id': 'vxsknUebljmF7U3BFrWDaA', 'text': "My family has liked Venezias for years. So much that my son wanted to work there. He was so happy when he got a job as a delivery driver for them. But when they called him in using the WRONG NUMBER, they blamed him and fired him. Employers need to learn that people matter. We won't be back.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 1, 'date': '2015-04-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ooQwIbDICQ_gofHXhfBbUQ', 'review_id': 'neAj4eMeefhrVsDCcvO2xg', 'text': 'Such a Tempe treasure! My boyfriend and I have ordered take out from here a few times and have tried quite a few things. I would say there calzones are my favorite but their pizza is good too! They also have a good variety of appetizers and slices all day. \n\nOnline ordering site is easy to use too.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2015-05-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uXVXAMEsGsHbWakhK133qA', 'review_id': 'tSZ5UUmJ-VS6VB9BP6mLJg', 'text': 'Seriously the best pizza ever! \nThis is our Friday afternoon treats. \nThey have gluten free pizza as well', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2015-05-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dt82kYhVNItfU4iex3Wv7Q', 'review_id': 'S5LHkigL4y2y-nhngjd9sw', 'text': "Are you gluten free?  Good news is, there is a good gluten free pizza in town. Good not fantastic. 10 inch for 13 bucks. Yeah. We're use to paying thru the nose for GF aren't we?  Take it home and dress it up more with your own toppings , what the heck! \nBefore I acquired my allergy to wheat I would order the usual pepperoni pie. Really wonderful hot. Key word is HOT.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2015-05-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'J9SO_VIDniyHHk59H_TSZw', 'review_id': '6gTwj9hVwAGgCJF-FbR9ng', 'text': "I got a pizza craving tonight and I usually order from Papa John's when I get such cravings but I wanted to try some place different. I saw a 4 star rating on Yelp and being only a mile away I went with Venezia's. Oh Boy! I'll never order pizza from here again. I got a large pizza with green pepper, jalapeno, pineapple and mushroom and it was not good. \n\n1. The pizza crust is really, really salty. Very much like a pizza dough you'd buy from a grocery store. \n\n2. There is so little sauce on the pizza that you can't even taste the sauce. It makes the pizza real dry. \n\n3. The toppings are not all equal quantity. I order pineapple on all my pizzas because it adds sweetness. I like the contrast between the salt from the cheese and the sweet pineapple. There was so little pineapple on my pizza I could barely taste it. \n\n4. The jalapeno's are not fresh; they are marinated or pickled. They are extremely briny it just added to the saltiness of the crust which nullified any sweetness I could have gotten from the tiny bit of pineapple there was.\n\nI do not recommend this pizza place. If you want to spend $17+ for a salty pizza with sparse toppings go right ahead otherwise go elsewhere.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 2, 'date': '2015-05-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vVixKdPpDw9MJa3PwZtetw', 'review_id': 'zB6bsb2eboi_kkEDu2TlsA', 'text': 'I had the big New York  size Hawaiian as well as the buffalo chicken pizza. Damn good pizza. Bought the house made ranch dressing which added to the bliss we experienced. Wings were solid and tasty. This is my spot here now.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2015-05-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'zz4iaqRAIT-wju1J8wicgA', 'review_id': 'oSHgTSaJe8y8w7dByX1axg', 'text': "This pizza will change your life. I got some sun-dried tomato pesto deliciousness, as well as a slice of cheese pizza and I could barely finish one of them. I can't even imagine buying a whole pizza from here, The boxes are huge. The people behind the counter super nice. Who wouldn't love a super smoking deal on a slice of pizza?\n\nMaybe people with a gluten allergy.....so, there's that.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2015-06-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Xz1w0h7wDI22IZKi-CnrHA', 'review_id': 'i48ljw4s2GeJVialAPbRLQ', 'text': "Enjoy Venezias very much! Maybe too much After a few visits I realized that their pizza either was very greasy to begin with, or something changed with the recipe?? Not sure. Nonetheless, I like their pizza a lot, especially the by the slice deal. Maybe now it's not that greasy, but haven't been since it was way too greasy after three consecutive visits. Wings are delicious!! GET THEIR WINGS!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2015-06-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JRjyyXHPrcaNGStw3Qg7iw', 'review_id': 'IGIozV-ucfpHyoY8kxI9KQ', 'text': 'Worst pizza both my husband and I felt sick after eating it!! All the toppings fell off and it arrived cold!  We called for them to come an pick it back up and the manager wanted to give us another crappy pizza!  Never order from them!!  Tasted rancid!!  I wish their were a negative rating. And by the way word of mouth is everything!', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 1, 'date': '2015-06-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'o9IyWBd81w_l2-jNcKrNOg', 'review_id': '6oopB5IAjr4XCAvkBEOUYg', 'text': "Used to be my goto spot for great pizza back about 10 years ago. Was great pizza back then.. now the pizza is stale and they don't put any cheese on it anymore.  Past few times I get crust with thin sheet of sauce and dry skimpy cheese. You can see the red sauce where there is no cheese... where is the cheese?  I stopped coming here months ago.. no cheese!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 1, 'date': '2015-06-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'RlkX7bgqg_q8aSOCVtNcJw', 'review_id': 'eif6524cpNaiHPQkUnApjA', 'text': "Very tasty pesto grilled chicken and Hawaiian pizza. And I'm not even a fan of pizza! The size of their slices is even bigger than my face. They also serve awesome garlic bread and wings.\n\nDelicious food. Quick service. Great price. Clean place. You can't go wrong if even Heisenberg himself, loves their food ;)", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2015-06-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'hs8t_DMnNNpf_wXtFE2xpw', 'review_id': 'bZv_cYv-MnUPMNBWUnJ3MA', 'text': "I had never even heard of this place...especially since I'm a West Sider! However, some friends were in town for the night and found it on Yelp.  Glad they did.  Made the trek and ended up having some really tasty pizza.  Perfect sauce/cheese ratio and the crust was PERFECT! Can't wait to go back and try it again!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2015-06-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WNbR-Otm3G-hcVnDU-o83A', 'review_id': 'QgA3m-bOIWkI4JogoId_0A', 'text': "This will be the last time I order from here. It's one thing for a restaurant  to be hit and miss, but this is ridiculous. What was delivered  tonight was just grotesque. We order a pizza with extra cheese, extra pepperoni, what was delivered  was a spotty mess, a few random blobs of cheese here and there, huge gaps of just sauce, and the total thing undercooked. Is leaving something in the oven a little longer so terribly hard? Is an even coating of cheese really perplexing? Luckily, there are many other pizza joints to choose from.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 1, 'date': '2015-06-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'eXQEGZNXmMlsWcUx4l0zzg', 'review_id': 'GlZLSgu6jsrOjvX9I1zOlA', 'text': "I don't care if pizza is NY style (my favorite), Chicago etc...I just like pizza. I ordered delivery from here yesterday because had work done on the house so was stuck at home, and have been wanting to try it. I ordered a XL pepperoni pizza, antipasto salad and boneless wings. The wing flavor was ok, but the wings were really, really soggy - expected with delivery to a certain degree but not that much.  HIGHLY recommend ordering regular wings if you are getting take-out/delivery. The pizza was disappointing, I thought it had NOOO flavor and was light on the cheese. I am not rushing to eat the leftovers and that's not like me. The antipasto salad was decent, but I've had better. I definitely don't get the hype for this place. I would head to Rosati's (their antipasto salad is awesome) or Buono's if I was craving the same style pizza. I won't choose to order from here again.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 2, 'date': '2015-06-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Hf0dGp1eM94UCPYma-fEOw', 'review_id': 'AhLCygBatuDEjd693m_IBA', 'text': 'I LOVE THERE PIZZA! and the Honey BBQ Wings are amazing! I love the sauce! frequent visitor! Even their gluten free pizza is good!!!', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2015-06-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zBDjAgfRtrC9OtezqPz70g', 'review_id': 'osKlKK6xBZH3GWEB9qCQMQ', 'text': 'I go to Venezias almost weekly because I love their under 10.00 daily specials. Last Sunday I ordered an online special for take out and I accidentally over ordered two dozen wings. The manager, (I think his name is Jerome)was so kind, patient  and professional. He is a true gentleman! The rest of the staff and pizza & wings were great as usual.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2015-06-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'o9IyWBd81w_l2-jNcKrNOg', 'review_id': 'ungprQAjIA34DzbxKZxy1A', 'text': "Haven't been here for awhile. . Stopped by during rush lunch hour... alot better...got sausage with a good amount of cheese.. another slice of pepperoni. . Was ok on pep.. but alot better than what u used to get.. \nThey got alot of staff running around... but alot of dirty tables.. .. i see the girl with a cleanliness check sheet doing an inspection. . Seems a bit half hearted in her job.. never checked dining tables.. with this lunch volume they need someone constantly cleaning tables.. but everyone super friendly. .. happy I stopped by.. missed the taste of the pizza.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2015-07-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'F3h39i2sgpCuo7LcN1nDMg', 'review_id': 'X2cl5qYUMoHUpJ5kFVgMYw', 'text': "I went to this restaurant today for pizza.  When I went to order, the pizza that they wanted me to order looked like it had been sitting out for hours.  When someone order's a slice, they run it through the heat and it still looks horrible.  I had a Margarita Pizza Slice today that they gal was upset that she had to make a new one.  Then when the slice came to the table, it was cold.  The wing sauce was good but the wings were not hot.  I will not be going back to this restaurant for pizza or anything.  Further the staff is horrible - Monday, July 6, 2015.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 2, 'date': '2015-07-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CvCW1UsbL78zeuu4eY9TcQ', 'review_id': 'AUX5amVGcQg2YRsivtxzHg', 'text': 'My favorite pizza place in the valley. The party pizza is the best. Not a fan of the savage here but everything else is great. Thin crust, light sauce and great cheese.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2015-07-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JoohRtbarBSCRof52bP0gQ', 'review_id': 'AbSf129qBI6XHFGm5HYNHg', 'text': "We came in for lunch today and had the pizza Bianco special. Delicious! My 16 month old devoured his portion. The crust was perfectly cooked, the white sauce was balanced perfectly by the spinach. The restaurant was busy but service was fast and had my lunch in about 7 minutes. We love Venezia's.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2015-07-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9JQDID-X7pBxUSfjTx8sog', 'review_id': 'FHYxWlFADHUT93AFhZvHbA', 'text': 'Great food!!! Love this place and the diverse pizza choices!! they also have sandwiches, pasta and wings. If your really looking for large pizza for parties or school events they have a huge size pizza that is perfect for that! They also have a garage door that opens up in cooler weather. Will be going back soon.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2015-07-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7lbcfuoR5IQY_eMZJ41ozA', 'review_id': 'WUxRrbAjRBYOD2d6nxLgVA', 'text': "Seems like they switched up on the pizza dough chewy with a hint of sweet taste in it the kind you would get from Domino's, Pizza Hut & Papa John's. New York style pizza it's not! Seems like they went commercial on ingredients no more Home-made dough. Hey still a good place to come for average pizza  bring the family feed the kids!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2015-07-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KLb3HxV9TFmi7xc6BqQrsw', 'review_id': 'D8S_aJq7Y1sOxQB4l9t6gQ', 'text': "The best pizza I've had since I moved out here from Philly. Huge slices and so many options!! I am dying to try their Mac and cheese bites but I am always so full on pizza!! Their deals and service are really fantastic. Highly recommend! My favorite lunch!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2015-08-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xxNaX75j5GOfbyoSJSaAuA', 'review_id': 'XE5E21hXBIWfrWSeSmSQmg', 'text': 'Good wings, good pizza. I was really impressed with how fast they get through their orders on a busy Friday. The only thing that they are missing is beer. I know I am completely bias on this issue but pizza and beer just make the meal perfect. Overall, great food.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2015-08-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'elqNlaZM4SNZz67LneepnA', 'review_id': 'dIdAjqjhImUdbgUWP-AQIg', 'text': "This place is delicious and meets my expectations every single time I come here. The staff is down to earth and helpful. I've never experienced a problem from day 1 of coming here. Plus you can't beat their slice special prices.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2015-08-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lrQfSNnNMw3C90WowGVUnQ', 'review_id': 'vlRMQAwYSqYrSNjv9W4grA', 'text': "I had Venezia's deliver a pizza to my hotel room and it was a very good NY style pizza. Lots of cheese...which is a requirement. Good pepperoni. Deliver took a while, but it was a busy evening. I would highly recommend for delivery.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2015-08-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cFZBVHchqzAtsCl2cHFB2A', 'review_id': 'i2swYTy0dl5Q0t8vryISgA', 'text': "Great food when it's served to you . We ordered 2 salads , a calzone and a slice of pizza . We get the slice and calzone and was asked if I received all of my food . I grabbed the food and one of the workers said oh sorry someone else will make it . We're done with the shared slice and calzone and I go up and ask about the salads that are still not served . Mind you the workers are now talking among themselves since no other customers are in line for  food . Finally the salads come over in a all bowls that take less time to make then the slice and calzone together . I wanted to bring to the lack of attention that not only happens to your place and also other places that I don't spend money at anymore for the above reasons", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 2, 'date': '2015-08-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'RfxgpLlDwKFpX-PfBLlgMg', 'review_id': 'cEhj8EEg-2U-bNLJStHeBw', 'text': "Simply yummy pizza, every time. Prefer this pizza to the nearby pizza place. I came for the Thursday special, which was the spicy chicken slice - (with added red onions as a topping and a side of ranch)- and it was so tasty! I am going to start visiting regularly on Thursdays on top of my other weekday visits! Speedy service, pleasant staff. Love their buffalo wings too. Even a plain cheese slice is a winner - the slices are huge! How the hell does a small person like me always manage to finish one of these? Oh yeah, it's because they are so bloody delicious that I will ignore my bodily protests and stuff myself into a stupor.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2015-08-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'M5654oz7KI1dRdI6og6flA', 'review_id': 'ucsj2q5FLZtMwlM8SzCafw', 'text': "Pizza is good when its good but it is not consistent enough so it is hit or miss. I don't like rolling the dice or flipping a coin on whether or not my pizza will be good this time. I stopped getting there pizza and go to Clockwork because they are more likely to deliver the goods right nearly every time.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2015-08-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'onWHId2QaCtmqgPK9Gz0sA', 'review_id': 'uCrkzvuRpxxUbkCGhpRjgA', 'text': 'Very good food. An accuired taste for sure. A lot of variety and very delicious. 4 stars', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2015-09-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GeGlgalC7Eu2Q01kZDltcQ', 'review_id': 'czK2zI0VshoWar5QY51PDw', 'text': "Haven't had pizza this good since I visited Rome. Great pizza and great service. I went there last night with a buddy and got a caprese salad and a large pizza. It was too much food for two people but we managed to eat all of it anyways.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2015-09-05', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': 'fLseWa4jvzCMaTEUpseGNw', 'review_id': 'LelBW-PzkC_cAakRcWJg_w', 'text': 'I was first introduced to Venezia\'s years ago when I started working at a new job in Tempe. It was the team\'s every-Friday lunch destination and it was kind of a big deal *every* Friday.\n\nHaving grown up in New Jersey, I was skeptical at first. I\'ve yet to find a pizzeria that truly matches the "New York style" they claim to live up to, and I\'ve been looking!\n\nThe minute I walked through the front door, I knew that Venezia\'s was going to get me very close to that holy grail I\'d been searching for.\n\nThey had pizza-by-the-slice, the slices were obnoxiously large, thin-crusted, and soggy with grease. This was about all I needed to see. The first bite confirmed my hopes.\n\nVenezia\'s has been my #1 go-to for pizza ever since. Unfortunately, there must be something wrong with my body, because I feel sick after eating here *every* time.\n\n**To put the quality of Venezia\'s pizza into perspective for you, though, I make the conscious decision to order here even *knowing* that it will make me feel unwell!\n\nAny other business would lose a star for "making me feel sick afterward", but not Venezia\'s. I don\'t blame them, and it doesn\'t stop me from eating here.\n\nIf you haven\'t been, GO! It\'s the closest you\'ll get to an authentic NY-style pizza this far south and west. Careful, though - portions are much larger than you might expect!  ;)', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2015-09-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tYXy7RtEFwgFPKESoJ4nFg', 'review_id': '91yTyMqHK-WCtgNSayaUqA', 'text': "I recently just moved to Scottsdale and have been searching for good reviews on a big slice of cheesy pizza, this place is so good, I came at lunch as did everyone else, but it was so fast and efficient it. The staff is really nice, the young lady at the register helped me pick a special, I came on a Friday, had the meat lovers slice with their 5pc hot wings. I'm stuffed with happiness. Not only is is super delicious, it's very cheap. My son ate an entire slice, and these slices are HUGE! We will be coming back.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2015-09-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'eyk_XU4ZsayAnr4eUtPtEQ', 'review_id': 'DRqI4WR7z-dE4FVsX-Fsow', 'text': "The best pizza in Tempe!  I highly suggest the chicken pesto pizza, and don't forget some wings and ranch!  We usually get it delivered, which takes 45-60 minutes.  If delivery were faster I would rate 5 stars.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2015-09-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'RQNhRHUF2-HcD8DNoIXd5Q', 'review_id': '8GoLRZDR4R2C07IUUUSP3g', 'text': 'Very good food I have had many different items here and no complaints at all.  Calzones are my fav- the salads are great. Cant wait to go again.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2015-09-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DriGauETXw1mlup1WE8ZZA', 'review_id': 'fiHoN6T-fX7sZ7dvl3kcXw', 'text': "Oh man if you want good pizza come here! I've been here twice and im never disappointed. The pizza is amazing if you want a more expensive pizza (been eating $5 pizza forever forgot what real pizza taste like )other than pizza hut or domino pizza. The sauce is so good i dont know if it's homemade tomato sauce but it's perfect. The cheese,and meats are also very good. I've eaten once inside the restaurant and it was chill. Theres tv with sporta playing and it was clean. Love this place and any time I'm gonna spend money on a expensive pizza i will come here! And i only say expensive because im a college student.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2015-09-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'Up0CmYDykW9QvgtBN4erkA', 'review_id': 'jyOuHx3z1FAdkZq6CAwARg', 'text': 'Based on the reviews here and having lived in NJ I really thought this place would be a true NY style pizza...As soon as I saw the oven I knew this would not be the case.  They use a Middleby Marshall oven (same type used by Dominos where the pies are cooked on a conveyor).  The real pizza joints in NJ / NY will generally use a Bakers Pride where they drop the pizza, close the oven door in and turn it occasionally with a pizza peal.  At the risk of sounding like a pizza nerd, I think the crispiness and flavor of a pizza cooked in the Bakers Pride is superior with the Middleby giving a rubbery texture.  The pizza here was somewhat akin to a Dominos pizza.  Now they did give me a lot of cheese and were generous with the toppings but for me the crust is crucial...and this crust was just ok.  Sorry Phoenix but Venezia is nothing like you get in NY', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 2, 'date': '2015-09-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JNVAMv2GGsCsyXeV0mhYfg', 'review_id': 'IRXVNSLYr0Kb_JH0CJ_ZPw', 'text': 'I am pleasantly surprised by their customer service after messing up my delivery.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2015-09-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '7lbcfuoR5IQY_eMZJ41ozA', 'review_id': 'kDg7EZb-pMmDi994zMbBOQ', 'text': "Doing my up date second time went back order take out was much more happy with the taste of my pizza this time around! Did not taste commercial like or salty in anyway and was please with the ingredients of flavor. I will be back for number 3 Review because I'm a true believer what makes any restaurant or eatery is the consistency of there food.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2015-10-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4J5kJXNy5A9eGDVNK3mvDg', 'review_id': '7WRkBulBF3QGGvosIHzHEA', 'text': 'The pizza here is very well made and is tasty. I have tried the margherita with my choice of toppings. \n\nStaff was friendly and helpful in helping me choose when I went there the first time.\n\nDefinitely a go to place if you are looking for something a little late in the evening in this area.', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2015-10-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'OVGO05KW6lYazMK3azvOoA', 'review_id': 'hmsK1JxQy_cFizNEEN4aVQ', 'text': 'This is one of the best pizza places I have had in Phoenix! I am so happy to have a pizza place that is just consistently good and has fair prices. I have tried their cheese and combo slices. They also have very delicious wings, but the hot is not even spicy enough for me. Their service is ALWAYS fast. I am surprised they are not busier than they are! My boyfriend and I frequent here regularly.  I would definitely recommend this place!', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2015-10-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ip-Vw1rRkelZiMvXBQXs-g', 'review_id': 'LOhGSCxiegT_C90Ddkqc1g', 'text': "I absolutely love the pizza, and the price is the best part. They have the best deals on slices in all of the valley, you just can't beat it. The slices are delicious and good sized. The atmosphere is pretty relaxed and comfortable. I love the pizza but do yourself a favor and pass on the boneless wings, I haven't tried bone in so give those a shot! 5 star pizza, 5 atmosphere, 5 star service, and some decent wings!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2015-10-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9OQQxVvN0on8yFx38TpUUA', 'review_id': 'EzVmFEB6Cd-PVKLgN5Wt3w', 'text': "I bought this pizza for my workers as a thank you for completing a special project that took 2-weeks, so we were all hungry! I was told by one of my guys that I must had ordered a speciality pizza, because it was not great, not bad, but not great. Next time I'll stick to the popular choices and have a better experience.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2015-10-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Riv0urWKy4Y0UlZrHy7KtQ', 'review_id': 'BIUI5efvnUGpAcJSv34o_Q', 'text': "Thank you Venezia's for the best pizza in Tempe. Been coming here for past year and never had a bad experience. In fact, yesterday(10/11/15) I ended up ordering 8 party size pizzas for a group and to be honest I was quite apprehensive. But in the end all the pizzas tasted just the way it has always been. Perfect!\nAlways has been a pleasant experience. Quick service and nice atmosphere to sit and dine. The wings are bomb too!\nI will keep recommending Venezia's to others and keep visiting.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2015-10-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3FnoVPOa9pLRQnogGdzlIg', 'review_id': 'CXsYeCC5zWKDCqYyVXWnBw', 'text': "The pizza here is consistently good.  Admittedly, it may not be comparable to east coast pizza places, but is definitely one of the best places in the valley for New York style pizza.  In my experience, the staff has always been pleasant and it's always busy with both carry out and dine-in customers.  Really great by the slice options at a great price!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2015-10-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9cvyja_xwfhSpnikk_uDIQ', 'review_id': 'Tyro3emVLOdUvZwo0iqGJQ', 'text': "The pizza is so yummy and the slices are giant! They should invest in satellite radio,  however.  The last two times I was in there,  there were radio ads for Domino's pizza,  and more commercials than music.  Of course I don't eat there for the music,  but radio commercials suck.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2015-10-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'f1okD8vrP1dwGNdQEzIG8Q', 'review_id': 'hA_Bcz2NYBhJNtd3Toruig', 'text': 'We ordered a 14" and a single order of wings at 5:34pm online for delivery. By 6:50pm we still hadn\'t received our order. I called to see if maybe the online order didn\'t send. I spoke to a gentlemen who informed me that they were low on drivers and that a manager had picked up my order 10min\'s ago to deliver it herself. 15 min after I spoke to him the person delivering the pizza called and explained she was lost. We had ordered from Venenzia\'s for delivery before with the previous drivers having no problem finding our home. I gave her directions and about 5 min later she showed up. Even with the late delivery I left a standard tip for her and brought the pizza inside. It\'s 7:10pm by this point and my boys were so excited it finally arrived. We open the pizza box and it was clear the pizza had been sitting out for quite awhile. The pizza was cold and the wings were room temp. The condensation from the packaging had left them soggy and inedible. Frustrated after waiting close to 2hrs for a medium pizza and single order of wings I call to speak to management. I was placed on hold and eventually was disconnected. I decided to drive the order back and ask for a refund. The gentlemen at the counter was apologetic and offered to remake the order ensuring it would take 10-15 min. 20min\'s later our order was called. The counter lady didn\'t stay long enough for me to tell her we were missing half our order, the wings. After ignoring us for awhile she came back long enough for me to tell her we did not receive the wings with the pizza order. She asked us to give them 5 more min to get them out...  by 8:15 we finally left with our correct order. The pizza and wings were tasty but absolutely not worth waiting well over 2 1/2 hrs for. I rated them two stars, one for taste and the other for the gentlemen at the counter being the only one in the building caring about rectifying the poor service. Note to self and to anyone reading this... Do not order from Venezia\'s during peak hours, ever!', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 2, 'date': '2015-10-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'sjdCDdr03i7bRp4WDLNdWw', 'review_id': '3GAlOrSZGyjQow97pYAkng', 'text': "I ordered a large pizza, an order of wings and a 2 liter. Price was $25 or $30 total with tip for delivery. (Used a coupon code on their website for this deal)\n\nThe pizza took 50 minutes to arrive. They estimated an hour so no issues here.\n\nThe pizza was okay. They were very light on the toppings and they weren't spread out properly. A few slices barely had any toppings at all. - see the attached photos. Besides the shortage of toppings the ingredients were good. The crust was a 7/10. Overall taste was acceptable though - we enjoyed it. \n\nThe wings were sad. Ultimately the reason for my poor review. I'm a buffalo native so I will say, I'm a bit picky with my wings. These came soggy. Not crispy at all. The sauce was good but they were just cooked incorrectly. So bad that they found the garbage. :/\n\nI'm not too sure we'll be ordering from here again.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 2, 'date': '2015-11-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'n-2gSytw4x3Q_rbweZnfuQ', 'review_id': 'NU16hahH2jp2OX8aHnSshA', 'text': "Venezia's was my #1 pizza joint in the valley, but after my last few visits, it's dropped a few notches for a few reasons. \n1. The customer service hasn't been that great. Honestly, it's been borderline snotty lately.\n2. The last three slices I've ordered haven't been up to their normal standard. The pepperonis a little burned, and very little cheese/somewhat bare on half of the slice. I had to order ranch to enhance the flavor some, which brings up...\n3. Charging 50 cents for a small side of ranch. Just doesn't sit right. Seems a small cup of ranch with a $3.50 slice of pizza should be complimentary.\n\nI was a regular here, and yet I feel like I'm a stranger everytime to the staff. I suppose I probably won't be as regular anymore.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2015-11-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CxtHWjILiSeNIvR6UEZSiw', 'review_id': 'b9VrmWSb7s6jdR5JGrxj8A', 'text': "I've been getting Venezia's pizza since I moved out to Tempe for ASU and have loved that it's so close to my place and usually pretty quick for delivery time. \n\nHowever, this time I got my delivery and was not too impressed. I ordered a salad, which was opened and spilled in the bag it came in and didn't come with the dressing. Everything else was pretty good and the food tastes very good!! \n\nI was just taken back by the person who delivered my food. The issue was he couldn't find my apartment so I answered his phone call and tried to direct him in the right direction. I decided to step outside to see where he was. Well he was right in front of my place so I went and got my food from him. He was very rude and argued with me on why I wasn't more clear of where I live. I guess I should have been, but the directions I gave were pretty descriptive. \n\nAll in all, I was just very disappointed in the service. I guess next time I'll be picking up the food instead of getting delivery.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 3, 'date': '2015-11-02', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'sjdCDdr03i7bRp4WDLNdWw', 'review_id': 'q9NiUFE6ObEGcxuf3Ty16A', 'text': "Updated Review:\n\nNight and day from my first order. After posting my last review ownership and management reached out to me to give Venezia's another shot. I was happy to accept. \n\nI placed the same order as last time but this time over phone instead of online. I experienced extremely polite staff and a quick and easy ordering process. The food was delivered in 30 minutes. \n\nSee attached photos. The pizza was hot and delicious and the crust truly reminds you of a good NY slice. This time there was plenty of toppings and they were evenly spread so every slice was covered. \n\nThe wings were the main reason for my poor review last time, this time they won me over. Ownership recommended that I order the wings with the sauce on the side so they remain crispy during delivery. Well I took is advice and sure enough, they came crispy. They were pretty damn good too. Word to wise - Order your wings with the sauce on the side - especially during peek busy hours. \n\nVenezia's won us back as customers. Way better than the PH and PJ chains. Check them out and let me know how it goes!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 4, 'date': '2015-11-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uj2fHfOZ8_tR5kFGl9sV0Q', 'review_id': 'CygKZbLHBLx9tu5v9LBEIA', 'text': "The closest I've gotten to New York style pizza since I moved to Phoenix 5 years ago. Recommended by a coworker who is not from New York. I couldn't stop thanking her for the pick. The dough was just the right amount of chewiness, and the sauce had that nice zing with the right amount of flavor. I look forward to another visit.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2015-11-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nJvXjAqyz0piJw-i0VPS6Q', 'review_id': 'fMg7ayUnWo16lhKZTxUjXQ', 'text': "Had a brief miscommunication regarding the food and its initial condition upon delivery. Venezia's went above and beyond to make up for it. Their food is awesome and I will be a repeat customer no matter what. Props to the management, great food and awesome folks behind the scenes. \n\nGreat food, great people. Love this place!", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2015-11-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'B_uUNNKODnDiOGwq4FtQhA', 'review_id': 'WlPF-LC9oCVUM-VGkh3Kpg', 'text': "I've ordered delivery from this location many times and it is hands down my favorite pizza place. The pizzas are amazing the the prices are fair. Whenever I have friends over and they want to order pizza I always suggest this place and they're easily impressed. Their online order form is easy to use and they offer plenty of coupons. I had a bad experience one time and their customer service was phenomenal and did everything they could to remedy the issue. I've considered other pizza places but given this level of customer service and quality of pizza, I'm happy to stick with Venezia's pizza.", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2015-11-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'T-fK5i0gBAJQjkjivkVL6w', 'review_id': '07h-YF5g-ubEmsFq-Y_TWA', 'text': 'I\'ve been ordering from Venezia\'s for years. To me, it\'s the best pizza in the area. It\'s so good I just order plain cheese most of the time because it doesn\'t even need extras, in my opinion, which says a lot. I\'m usually a "supreme" kind of gal. After suggesting to my boss at work to give them a try, now any time they order pizza for us, it\'s got to be Venezia\'s huge party pizzas! The sauce is not too sweet, not too acidic, and the cheese has a really good flavor that goes with the yummy crust. The crust is tasty too! For desert I love their cheesecake with added strawberries. The salads are fresh and interesting. I\'m not much of a sald eater but their salads aren\'t boring.Try their fried zucchini with honey mustard!\nThe one thing I\'m not a fan of is their spaghetti... but they are my default pizza place for sure!', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2015-11-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'o9IyWBd81w_l2-jNcKrNOg', 'review_id': 'acgqGT4JQuyZ8bsccza1tA', 'text': "Drove 8 miles to try the pizza again. . Always a hit and miss it seems.. or maybe just bad luck on my part.. ordered 2 slice peperoni special. ... came out burnt... sent it back.. Second order...hardly any cheese.. One slice had 3 inch circle of bare bread.. no cheese or sauce.... other had dollar size areas of no cheese.. .. you can clearly see this.. sent it back again.. .. I feel bad.. and don't want to complain this many times to them.. not sure what to think.. was told they need to make a whole new pizza and had to wait..\nIn the end.. finally got a great slice.. \n\nWish they would clean tables though..", 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 2, 'date': '2015-11-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'QAE7xl98L1bfG_-j_vKIrg', 'review_id': '7j4NnZdCTwA8esGqk6eweg', 'text': 'Seriously the best pizza in the area. Always have deals and coupons. Love this place!', 'business_id': '9IbQxDmWBG2t8w9nw9VgEA', 'stars': 5, 'date': '2015-12-11', 'type': 'review'}
