{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': '2BS05HwuXcnFL-YqlyhtnQ', 'review_id': '74yqOq7ILW6CmIfC3dvpwg', 'text': u'Amazing sandwiches! Glad they are in the neighborhood! Gotta do Dutch crunch and dirty sauce. I had the Elvis Keith added jalape\xf1o, super good. Onion rings are really tasty but not that big of an order for sharing. So come eat here!  Very friendly guy at the counter from the San Francisco location.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-02-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 4, 'cool': 0}, 'user_id': '4kOq3GgHEm867mE0F0Xa_Q', 'review_id': 'g6-_9Iif3P08qfZPYCGo0A', 'text': "I am from Phoenix, moved to the Bay Area 7 years ago... I have only been to Ike's in California, but I am sooooo excited they opened one in my home state. They're sharing the love!  \nThe sandwiches are incredible. The selection is extensive and they can make things vegetarian/vegan style if you request. You even get a caramel apple lollipop in your meal (I hope they do this in AZ). \nDon't hesitate - RUN to Ike's and get the best sandwich of yo' life!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-02-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'gftLXpsza8na-DXHI29Sjg', 'review_id': 'M_4RxNe1eyN8c-9NTaODlQ', 'text': "Just traveling through on our vacation (SF Giants Spring Training) and spotted Ike's.  I know Ike's from the Bay Area, and this did not disappoint.  I got the Vegetarian and my husband got the Menage a Trois with Halal Chicken. Both sandwiches knocked our socks off!  Seriously, how good can a sandwich be?  So good!  Totally recommend.  They obviously take their sandwiches very seriously!  I will always go here when I visit Scottsdale!  (Go Giants!)", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-02-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'YKT1b17r_kdW7ZJSkY__cQ', 'review_id': 'OHgB5Cg_qX0p6dfFFYhRxw', 'text': "I'm originally from the bay area and there was an Ike's 15 mins away from me that I religiously went to. So when I saw an Ike open in Mesa I was unbeliveably excited! I got my usual, the Menage a Trois and it definitely tasted like home. Each sandwich is made with some type of crack sauce because it all becomes very addicting. Fortunately they said delivery might not be too far off in the feature!\n\nWhat set this Ike's apart was definitely the service though. The manager was amazing, considerate and very helpful. We ordered 8 sandwiches and she packaged each one seperately for us, put in individual reciepts and even labeled each one with hearts. She made the whole experience enjoyable and easy. I am definitely going back again!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-02-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': '7bz7S7nQU9kMenVcPsCC_w', 'review_id': '4tx-pIUOV58aHYrJianKqQ', 'text': "I had he misfortune of living in the Bay Area for 6 years. Ike's at Stanford was one of the only good things about it. \n\nFrom what I understand, Ike's has developed thousands of sand which combinations over the years. My personal favorites are the Damon Bruce and the Reggie Jackson (you'll notice that the sandwiches are typically named after someone, lots of sf giants players on the menu). \n\nThis place just opened in an odd corner of Mesa on valentines day. The best thing about it is there was no line and no San Francisco people that you had to deal with in order to get a great sandwich.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-02-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'WoYFryeOWKz-fp0Kz-z7Pg', 'review_id': 'N8uYNaXXNZtGms4hGe4ekw', 'text': "I love a good sandwich and this place has stolen my heart. I can't say enough about how amazing their sandwiches are. I had the Bill Walsh (former 49 ers coach) but I think they should change it to the Joe Walsh because this sandwich rocked! I know that sounds cheesy but it's true. The menu is huge so there is something for everyone including vegans. In my opinion a great sandwich starts with great bread and there's is right in the money! And they used this amazing garlic aioli that smells like what I imagine heaven smells like. Damn it was good! A perfect mix of turkey, cheese, avocado and the heavenly sauce. Mmm Mmm good! It's been 36 hours since I've eaten there and I think I will go back there tomorrow for lunch.\nI'm a little surprised about their choice for the first location in AZ. It's across the street from Fiesta Mall which is quickly closing stores. And many nearby restaurants have gone out if business. I would think that they would have chosen a spot with mire traffic. So fingers crossed that they get tons of business because if they close I'm going to have to move to California to get my fix.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-02-27', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 1}, 'user_id': 'WoYFryeOWKz-fp0Kz-z7Pg', 'review_id': 'LwxMYWFojJxXG63DHsRNkQ', 'text': "Second visit in a week. I can't think of eating anywhere else! I think they put an addictive chemical in their delicious sandwiches that makes me crave it nightly! This time I tried the Tony Soprano and it did not disappoint. Again amazing bread and great deli meats. Great blend of flavors from the meat, Italian dressing and dirty sauce. I also tried the Funky Fusion chips and they were amazing! I have no idea what the flavor is, maybe BBQ and vinegar? They are so good an extremely addictive. Funky Fusion is a perfect name. \nI can't wait to eat there again!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-03-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'LKe0OdXQv54wynXcXaoj0A', 'review_id': 'YaLyNTdtB7PYPKnHopDEPw', 'text': 'Not sure I have ever been a fan of a place as fast as I became a fan of Ike\'s Place.\n\nThey opened their first location in AZ and after hearing a lot of hype, decided to check it out. The menu is a bit intimidating at first, but I eventually settled on the Bella.\n\nThe staff here was extremely friendly and the vibe of the restaurant has that neighborhood sandwich place kind of feel. It was not very busy and had little wait for our food. Oh and there were some cops eating there too, so that tells you the food is good right there.\n\nOnce I tried the first bite of that sandwich, after taking pictures of it for Yelp of course, I was immediately a fan. Everything about this sandwich was great, the bread, the meat, the toppings, couldn\'t think of a single complaint about it. It even came with a lollipop!! Everyone I was with was saying the same thing about their orders as well. In fact, it was so goodI actually ordered a sandwich "To Go" to eat later. \n\nI can\'t wait for the next time I find myself at Ike\'s and have told everyone I have come into contact with since my last visit about it. \n\nMaybe I should buy me some Ike\'s Place schwag!!', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-03-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'KSBFytcdjPKZgXKQnYQdkA', 'review_id': '8huOtTBbXPLmaLtyj7C4RQ', 'text': "Although not the least expensive sandwich on the planet.. Ik'e s is up there with best I have ever had.. The bread is fantastic, and the combination of ingredients are ingenious.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-03-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oWoVwc3P_sOOj001kKGVTQ', 'review_id': '59Idsp6IdMWrB6Z3z0i-8A', 'text': 'This place rocks! a friend told me about it and she wasn\'t joking. it\'s Cheba Hut on steroids and I don\'t feel like a bad uncle bringing my niece in.  Try the "going home for thanksgiving."  Its awesome', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-03-03', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 0}, 'user_id': 'OA30cYBjuziFxMJqyyNt3w', 'review_id': 'IC2gfG_RvHPyNd9YoiproA', 'text': "I usually don't do reviews unless places piss me off, but Ike's is an exception. They have the best sandwiches I have ever had. I live within walking distance of Ike's, which is a huge plus for me. I plan on going there regularly. I also really enjoy the music, from what I've heard, everything is from the 90's.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-03-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'I8bAJmAXfbhtrwAlQs9HVw', 'review_id': 'XFUMbADJMmCceybIIPMRRg', 'text': "Found this place after a recommendation from a friend and it was definitely worth the trip. So many great sandwiches to choose from. I ended up going with the Bella on Dutch Crunch bread, but be sure to order it with bacon. It's so good. I really like that all of the sandwiches come with a Carmel Apple lollipop too. It's a little off the beaten path, but definitely worth the trip!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-03-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 2}, 'user_id': '-goOa9inzBffqzNL2A0BiQ', 'review_id': 'pPPt35TOUijgxk4nh8HXxA', 'text': "Blew my mind! Just landed from SF and was looking for a local place instead of a chain and I wanted something vegetarian. Happened to stumble in here and was blown away by an entire row of the craziest veggie sandwiches I've seen. And Jessie, the girl helping me, was so damn passionate. The energy added a ton. After taking about 10 minutes to get out of massive decision fatigue, I went with the 'Sometimes I'm a Vegetarian' with the works on their homemade Dutch crunch roll. Wow. Can't wait to try the original in San Francisco!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-03-12', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 7, 'cool': 3}, 'user_id': 'OI1iNMzrKaFkX1ZSqGsFAA', 'review_id': '4aZbP5bQKXTThj9jwJhIFA', 'text': u"Delicious! This place certainly knows how to make a tasty sandwich. The bread is soft but crunchy and didn't get soggy! That's a big deal for me. Nobody likes the gross soggy party at the end...looking at you Subway. Not to mention they use fresh veggies and delicious sauces. Lets not forget the awesome jalape\xf1o poppers that you can get in your sandwich was well! Also, I'm super impressed with the fact that there are so many different sandwich options and they have many vegetarian and vegan choices.These sandwiches are huge as expected for the prices! Almost wish they had a smaller size option as well. Oh well, just save some for later!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-03-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'o8sVoIGN0f2TIbV2MNoGWQ', 'review_id': 'DTDVCnRlEQ2hoZe-bi8UeQ', 'text': "This is by far the best sandwich I have ever had.  My mother was with me and she felt the same way.   I would rate it a 10 on the 5 star scale, and I can't think of another that I would even rate a 5. People were friendly, too.  In my opinion, the location is bad because you almost have to know its there to find it; but its not bad in any other way.  I hope they open other stores that are closer to my daily life, but in the mean time I will be driving to Mesa regularly to get a sandwich from Ikes. YUMMY!!!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-03-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'hyye_vlvL0EggbCZgUA6xQ', 'review_id': 'UKU3SfG5D2LWBAParLiaEA', 'text': 'This place is absolutely amazing! I discovered the one in San Fran from a friend and loved it. The cashier told me there would be one opening in Mesa and I had to try it. Must say it is AWESOME. I had the vegan Tom Brady and the vegan Bud Bundy (on the San Fran menu - not this one, but they will make almost anything on the online menu for you), then I had the vegan Handsome Owl (my new favorite). The vegan Brutus is okay but nothing to write home about, but this place has hands down the best vegan sandwiches I have ever eaten... EVER. Oh yeah Ike was at the restaurant when me and my dad went.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-03-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 4}, 'user_id': 'riDw3AC-vZCPOpTlX_jdAw', 'review_id': 'GRscP7IHs05EED1bGV3lBw', 'text': u'Are you kidding me? This place is real? \nOf course it has a million reviews and 5 stars. There is something for every single person on this planet to enjoy. When the worker found out I had never been there, she mentioned that they make over 400 sandwiches. Four. Hundred. Holy. Crap. \nThey have tons of vegetarian options, plenty of unique combos and then the basic stuff as well. If theres one thing (okay, theres many) that Adam Richman has taught me, its that the basic dish is the best way to judge a restaurant. Yes, I went with the boring turkey avocado. \nThe lady working there recommended a crunchy bread and had my sandwich out to me in less than 3 minutes. First... it was the size of my head. Massive amounts of food is a big plus in my book. \nThe sandwich itself was great. Perfect ratio of meat, bread and lettuce. And the avocado was fresh. None of that crazy bottled crap. \nMy only regret is that I didn\'t get it "dirty". They\'ll put mozzarella sticks and jalape\xf1o poppers on it. Oh. My. Heck.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-03-19', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'Ar7Bvjhk_o5LxiZUhe5LGg', 'review_id': 'dDfScgF3MHVACTxaTyFW6Q', 'text': 'I have tried multiple sandwiches here.  The Jay mee sirewich is amazing with avacado.  The staff is great.  If your adventurous try the bear hug amazing.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-03-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'tXf85OJWm4HWIKl1J2gRLw', 'review_id': 'StvtU9K-lNoCr_25yE-yuw', 'text': "Ike's is finally in AZ and it was worth the wait. For those of us with celiac or gluten intolerances, Ike's is a fantastic option. They use sandwich rolls from Gluten Free Creations (which is just as good as the Mariposa rolls they use in the Bay Area) and use exclusive GF areas to prepare sandwiches. \n\nThe wait time for making sandwiches, however, is a bit long. They are newly opened though and perfection can't be rushed. You'll definitely want to make time to come check out Ike's!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-03-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'dANY9kWm6GYdrWgLwiBd1A', 'review_id': '9p8QcfvqdqUzdV8k6Ox2vA', 'text': 'Best Sandwhich I have EVER eaten!!!! Seriously!!!!\nAnd, I am a foodie. Soooo glad they are in AZ now.\nNot the greatest location, but it is worth the drive and the staff is super awesome!\nPlus, you can pick sandwiches from the San Francisco location that is not on the menu here. And an added bonus is that they have a ton of vegetarian and gluten-free options for all of my friends.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-03-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'iZtveTtgf6ZMd6Ym2HK8Ig', 'review_id': 'aBn4E8Om5WRIh5AKliQasQ', 'text': "Holy sandwich menu, Batman!! That was the best meatball sub EVER (called the Micheal Jordan for a good reason)!! The Boy got the Handsome Owl and it was a delicious vegetarian sandwich I'd consider getting my meat-loving self if I weren't worried about missing out on the meatballs!! The Dutch Crunch bread our sandwiches came on was super tasty with plenty of crunch AND soft chewiness. They even let me put the fried zucchini ON my sandwich instead of on the side!! These are the kind of sandwiches that are so tasty, you feel like you have to eat every bite - even if there's no room in your stomach.  The staff was extremely friendly and helpful when choosing from the huge list of choices. It was a fun place to be and their Happy Hour special for people eating there was a free drink and chips with your sandwich!! Even the music playing was great (old school R&B/rap...the fun stuff everyone loves to sing along with)! I can't wait till one opens in Phoenix. Hey Ike!! There's an old JB's that's closed on the corner of 32nd St. and Indian School - how about opening up shop there?!?!? I promise to bring all my friends!!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-03-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '3qdAv5B0rwemM9wsT5p7fw', 'review_id': '58mUXULU8ag3nATywhUnOg', 'text': "A coworker and I decided to try Ike's for lunch for the the first time on Monday. The sandwiches we delicious. She tried the Barry B and I had the Your favorite Sesame Street character. We both loved our sandwiches. Our only compliant is we wish they had an option for a smaller sandwich. I don't think sandwiches keep well as leftovers, and tried to eat the whole thing so it wouldn't go to waste. I couldn't quite finish and I was still stuffed. I will try to get someone in the office to split one with me next time we order. Staff was also super friendly.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2014-03-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': 'E_YQqn2dvjkf9kEQ_5Ui8A', 'review_id': 'SfXWtqQd7G-nI9r3r7Begw', 'text': 'My favorite place now to get a sandwich. Very friendly staff and great atmosphere. I thought the price was high for a sandwich, until the sandwich came out and it was big! I was completely stuffed. \nThe place is very unique and the menu names for the sandwiches are hilarious.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-03-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'IODaFywdVYc5Zeaqrl2SeA', 'review_id': 'qajFxNtyer6VReqeM0qBDA', 'text': "Tried  Ike's today for dinner and it was fabulous. Had the Tony Soprano and it was great. So many other sandwiches that I want to try, will definitely be back.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-03-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': 'vhh8GBi6R2zutd1DS3IucQ', 'review_id': 'zRG9jRkmkIZ5tNt5NPrvNA', 'text': 'Eating a "Sometimes I\'m Vegetarian" sandwich. AMAZING! I have found my new go-to sandwich shop. Such a wide array of things to choose from, no matter if you\'re a meat-eater, vegetarian, vegan, or gluten-free. I little pricey with sandwiches around $8-10. But worth it!', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-03-30', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 3, 'cool': 2}, 'user_id': 'o2CGc1kQHEFkYOECM3NFdg', 'review_id': 'nEcHRDFwGoyGG98cmq7yGg', 'text': "When I saw Ike's had opened up in Mesa, I couldn't believe it. Did my beloved sandwich shop from San Francisco that's always a must-visit actually makes it way to Mesa? Once I verified that this was the real-deal Ike's, I started texting friends and family who share my love of Ike's with the good news.\n\nI must confess that I haven't been to this location yet, but it's only because it's so close to my husband's work so he picks up our order. My guy says this is the best gluten free bread he's ever had. He almost sent back his sandwich the first time he ordered it because he thought they put it on regular bread. He's also a fan of the vegan cheese and dirty sauce since dairy doesn't agree with him either.\n\nBeing a vegetarian, Ike's is like heaven to me. Whenever there is more than two veggie options on a menu, I start to seize up with indecision (in the best way possible). Their fake breaded chicken is so good. It reminds me of the patty used in McDonald's spicy chicken sandwich (again, in the best way possible). The vegan bacon isn't as gross as it sounds although the fake fat stripes are silly looking. I added it to the Reading Rainbow, and it was delicious.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-03-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'tnhdHLQZqlbRRI2y2DGseQ', 'review_id': '7-UHK0_TqLQSoWYfWNnQhA', 'text': "My favorite sandwich shop from San Francisco has made it's way to AZ! Had it for the first time at the new location today and was amazing as usual. The dirty sauce and Dutch crunch bread are a must.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-04-02', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'Fgpm_uoRYBi3lg6OLRM4gw', 'review_id': 's89xM_v6zd7fJAl1-ddNGA', 'text': 'I don\'t have a clue where to even start with Ike\'s. Maybe I could start with the crispy yet warm and chewy Dutch Crunch bread or I could possibly begin with the Dirty Sauce. Either way, this place is out of this world. \n\nI had the opportunity to hear Ike\'s story and not only does he care about his food, this dude really cares about creating a good environment. There\'s this blonde girl who is ALWAYS there at this location and she told me she actually transferred out here to help open the store and she\'s the most friendly person and always greets me like we are best friends. I\'ll call her "The Director of First Impressions". She is a G.\n\nAnyways, do not hesitate to go even out of your way to go to Ike\'s. The location is not my fave but I can promise you it\'s worth it!', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-04-03', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 3}, 'user_id': 'IOilEVNJH1mqfhsCdIuSZg', 'review_id': 'DPrCFjuQ0PV4sV33czY2YQ', 'text': "The first time I had Ikes was in downtown Oakland about a year ago. I have to say it was one of the most memorable sandwiches I ever had. I told everyone about the place as if I was the owner. I was working at a clinic about 5 miles away a few days ago, but had no idea that there was an Ikes Sandwich Shop in town. I'm never in this area because its been dead for years, but now I have reason to go there. I was planning on meeting my girlfriend at Chipotle for lunch. I pulled into the parking lot and saw Ikes off to the side. I was hyped!!! I immediately called her and told her to scratch Chipotle and do Ikes instead. We both got sandwiches and traded halves after I sampled hers. She ordered the gluten free bread and I have to say its the best I've had. The staff was excellent and made great recommendations. I will be back for sure.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-04-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7GnnoBI3mse6vo2ZdKibIg', 'review_id': 'OGU3bG-kHVn4baHBXag7EQ', 'text': u'Visiting from out of town and decided to check this place out. My family and I were very happy with this place. A list of sandwiches we had: The Ted Danson, The Thunderbird, The Reggie Jackson, The Pat Tillman and the M\xe9nage a trois. All were great sanwiches! I see why this place has high ratings from others customers. They have many varieties of sandwiches available. The staff was very helpful in providing suggestions on what to order. Definitely recommend this place if you ever pass by one.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-04-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'YC8Lp5Luwy83QGBjkW7gpA', 'review_id': 'i70FUB8fLaXbu7zrMgm9vQ', 'text': "Wow, . Eat one of the tastiest sandwiches I've ever had on that price level. The average sandwich which is huge costs between seven dollars and $10.  You walk in and there is a very very large board on the wall of every type of sandwich you can think of even vegetarian. If you don't see anything you want, they can make you what you want. The service staff are friendly and helpful and actually funny. The restaurant is clean and attractive and definitely for groups and families. But here's the deal the sandwiches are delicious the bread they use is different and they're very filling.  Ikes is located on the east side Alma School, south of Southern, across from Fiesta Mall. You will not be disappointed.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-04-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'PLy8ZOKOKnI89SwPKiiMCQ', 'review_id': 'EAKQKSmeGvKQxCCxN4sB8Q', 'text': 'Really good choice for Gluten Ftee.  DELICIOUS bread.  Lots of choices for fixins.  Just as delicious as when we visited Ikes in San Francisco.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-04-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DXbprw3A83w_WCylMIgUag', 'review_id': 'yQADRXGPA44_LYkI0WCWFQ', 'text': "I came in based on the 5 star reviews. .. waiting for my sandwich now.. I have little doubt it will be great. BUT... it is 1:30 , after the lunch rush.. 2 other people eating here right now. The big bummer is that every empty table is dirty. I am currently sitting at a table with someone else's crumbs and lettuce... The best choice table. Just got my sandwich.. it looks great!\n\n\n\nOk finished my sandwich.. Def 5 star worthy. No one did any table cleaning while I ate there for 10 or 15 minutes :(  Other customers had to sit at dirtier tables than mine as they came in.\n\n\n\nCome on guys ... gotta keep the tables, floors, soda area all clean too. I'll have to give you the benefit of the doubt on the restrooms since I did not use them.\n\nWill Def be back for the sandwiches. Maybe upgrade my review if the place is tidy.\n\nI grew up in the restaurant business... cleanliness is a big factor.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 3, 'date': '2014-04-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'VVsuTB3VNL9j-8PEp7s6EA', 'review_id': 'bP0OPZYwc37sL35TSLedxA', 'text': u'Very rarely do I give out 5 stars. Today is that day. I already have a favorite sandwich place that I eat at in Vegas and none has topped it in the many years that I have frequented that place. Today is the day that the crown is placed on another. There were so many different delicious sounding sandwiches to choose from that I kept ordering then changing my mind  and choosing a different one. I wish I had 5 extra stomaches. I finally decided to order the Adam Richman sandwich because we follow him on Man Vs Food. Let me tell you , the moment I but into it, rockets flared, music played and a beautiful butterfly metamorphosized. It was like I was eating the equivalent of Beyonc\xe9 mixed with Angelina Jolie\'s "talents". Today the food gods  shined upon me and I smiled back as I took another bite into what life is about....ECSTASY', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-04-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'adcl2Z9yjoGfTRaWriae5w', 'review_id': '6Mz8DDXykZf9y0drZXP-OQ', 'text': "I was so excited when I found out Ike's has an Arizona location and it's only a few miles down the street from my house. I am Gluten Intolerant and this is the best sandwich shop hands down in the valley.... that I can eat at. They even ask what your gluten sensitivity level is and make adjustments in the kitchen specifically for you. \n\nBomb sandwiches, get one.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-04-10', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'ZOnLR65d70nfb93FBjhmQQ', 'review_id': '3lfnYbqefowlkLZ6V0BZBQ', 'text': "If u want to experience a sub shop built in heaven you must come here and arrive hungry menu is so large they can't fit it on the wall,  over 400 sandwiches so u will have to devote a full year of your life to experience it, \n\nOrdered\n201 Adam Richmond - the avocado in the sandwich made it really good\n444 bear hug - the jalenopenos made the sandwich\n\nI got 398 more subs to try I'm coming back", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2014-04-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QgvP6X-X9i9Qe-LrgNznag', 'review_id': 'ZlZOdx2YSojb7dmqbn7oZA', 'text': "Whaaaaaaat this place is amazing! We drove by several times wondering what it was, and after seeing the Yelp reviews decided to try it out. We split the vegetarian meatball sub and it was CRAZY. It tasted better than any other real meatball sub I've had. Everyone was very helpful and nice. Just plan on spending some time looking at the menu because there a lot of choices. Excited to go back!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-04-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'l42kfKs28IfDbmLm9I-WLQ', 'review_id': 'aGpyqYGClaE8XLyLu5GF0w', 'text': "I tried the tony soprano sub which of coarse is there Italian.  It is one of the best I've had in town.   Great job Ike's!!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-04-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Cyl355kdo4n7u86RhGUl2g', 'review_id': 'qM5wdnlBJl1lCf9XJS2fSA', 'text': "Great sandwiches and great people! The staff is really nice and helpful. The sandwiches are around 10 bucks which is a little pricey but worth it ! It's super tasty and a good chill atmosphere .", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-04-12', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 1}, 'user_id': 'TDyeDeY_wPcCG5pzjxmH9A', 'review_id': 'hgAFfzZQPBeKkGydfGV2iQ', 'text': "Yo straight up shits a dime boi, tastes great, atmosphere is great, and they got bathrooms son. Don't be afraid to try something new and don't complain about the price. The Sammie's are large enough that Steven Tyler can't even swallow it in one go... Validation that this place can't be beat.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-04-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-EsSwGi8ZgnRkbDSRmUDQg', 'review_id': 'aXVB_a0wC4gSJi9KEZheiw', 'text': "Super bomb sandwichs. Great selection. Get the Shawn Michaels add Thunderbird sauce, it's not on the menu but trust me on this. Thank me later.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-04-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'OxvnYH2G4tmea-qCfDMs5A', 'review_id': '5M6NKmgEykbU0y5ghijD-Q', 'text': "Absolutely the longest I've ever waited for a sandwich.  Not worth it. Skip this place. Its seriously like they start planting the grain when you order the bread.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 1, 'date': '2014-04-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'nrfK8v-hcbZyiz6aPr6STA', 'review_id': 'RcefBSBUTguM1jo4yH0tdw', 'text': "Ahhhhhhhhhmazing! Headed to the fams for Easter and thought hmmmm a sandwich sounds good. Thanks to yelp we found Ike's !!!! Their signature bread is so delicious as is their special sauce. Tried a roast beef salami one and the deep fried chicken with their BBQ honey sauce. Please start one in Washington. Also the workers were so happy and helpful! Can't wait to come back to Mesa!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-04-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'C1rHp3dmepNea7XiouwB6Q', 'review_id': '2QcCr8MH69n9-Nyjpv__Xg', 'text': "Sandwiches are messy deliciousness. They have a happy hour special everyday from 4-7 when you eat in store, get a free bag I chips & drink. They have about 45 sandwich options, most are Halal chicken, steak or veggie. Four bread choices and several additional add ins available. Everyone in store is super friendly and ready to recommend their fav sandwich. My favorite so far is the Mozzarella's Big Cheese. It's chicken, honey, honey mustard, havarta, & provolone cheese.\nThe onion rings are the only downside I've tried so far. Kinda limp and soggy, I guess their made more to go in the sandwiches rather then as a side.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2014-04-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 1}, 'user_id': 'DrWLhrK8WMZf7Jb-Oqc7ww', 'review_id': 'tReGGMdXwutk_WWa1YSPBA', 'text': "Obviously a huge menu with alot of choices, but probably not enough of the turkey variety. I can't remember the name of the sandwich I ordered, but they are all served hot. Mine had turkey, homemade poppy seed coleslaw, provolone and french dressing. It also had that garlic aioli which is present on every sandwich, but mine did not need that overload. You got the french dressing mostly and then a late garlic after taste. They need to clean the tables off better and put salt and pepper shakers on the table, but otherwise a pretty huge sandwich for about 9 bucks. Chips are extra and there is no combo available. They must have an exclusive contract with Dirty Chips because those are the only ones available.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2014-04-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': 'ihiOEfBPiUegNbFvGzx6iw', 'review_id': 'Xr7tDNscDxiK0wP2g5dXRA', 'text': 'The best Sandwich(es) ever..... . This is a rare Vegetarian\'s Paradise as well. After settling for lettuce, spinach, bell peppers and tomatoes on a roll with deli mustard or a not so nice tasting "veggie burger" countless times in this century- here comes Ike\'s to save the day and keep Veggie and Vegan hope alive, well and coming back for more. At the grand opening party on Friday 4/18, their amazing employee Rachel asked for my preference and had the #61 called the " Sometimes I\'m a Vegetarian" specially prepared for me. First bite and I was hooked: Grilled Mushrooms,Marinated Arichoke Hearts, Pesto and Provolone on their delicious Dutch Crunch Bread. I have been back 4 times since and also ordered  #73, the " Lynda Carter" with Breaded Eggplant, French Dressing, Avocado and Gouda on that very same Dutch Crunch bread - wow! just crazy good. Next on my list is #70 " Meatless Mike" and my fantastic journey through the100 different veggie sandwiches. Love the awesome, fresh and hot sandwiches, love the atmosphere and vibe and especially love the energy and attitude of all of their employees. Customer for life here who is bringing 12 of his dear friends to this gem this weekend. Thanks Ike', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-04-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'aDB-o5Rfg3bK-nuLzsqxEg', 'review_id': 'CWm3G04b4MfwKSL8DcJvLA', 'text': "I tried Ike's for the first time today and they got my order wrong. I figured, it happens, right? We all have THOSE days. So I called figuring they'd give me a credit or something. NO! They drove a fresh sandwich to me! The sandwich was supersonic delicious and it was one of the BEST customer service experiences I've ever had in my life! Thank you Tucker, Gregory and the rest of the gang at the Mesa, AZ location. You ROCK! I'll be back and I'll bring friends! :)", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-04-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Vt0HRGXps7Xc0qMpC96qrw', 'review_id': 'l6uPc3_zpqJJHqFRx4wL6A', 'text': 'Amazing sandwiches! The Dutch crunch bread is fantastic and the dirty sauce is too die for!! The halal chicken has great flavor! I tried the #98 with fried chicken and BBQ sauce and it was soooo good!!', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-04-30', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 5, 'cool': 4}, 'user_id': '-kIvLyWpY17aRa0vPp-RmA', 'review_id': 'y2lyOue_SpJmB4fMFZ6cjQ', 'text': "Wow!  That is all that came to my mind when I saw that Ike's had finally came to AZ!  Like a lot of reviews here I've been to the original Ike's in the Castro in SF many times.  I travel to SF several times a year and always make a point to visit Ike's.  I truly think that it is the best sandwich I've ever had.  \n\nSo big question...was this Ike's as good as the one in San Francisco??  Well, I'm glad to report that it is!  Man I'm so happy.\n\nI was with a buddy of mine and we ended up ordering the Kryptonite,  This sandwich is no joke.  It's $26 but for two sandwiches.  I knew how big Ike's sandwiches are and I knew that I wouldn't probably even make it through one.  \n\nThe Kryptonite had everything in it.  Cheese sticks, onion rings, pesto, turkey, roast beef, ham, pastrami, bacon, stuffed jalapenos.  I mean just about everything!  It was amazing, and yes I had it on the Dutch crunch roll.\n\nThere are so many sandwiches to choose from at Ike's.  All of the favorites are there and they even offer vegan sandwiches too.  I doubt that I will get close to even trying half of the sandwiches, but I have my favorite.  The 98. Jaymee Sirewich is probably my personal favorite, but when I go back Im going to try something different.  \n\nThe best thing about Ike's here in Mesa is tables to sit and eat your sandwich!  If you have ever been to the original location you would appreciate how good that is!  Also, they are opening a location on Mill ave in Tempe!  I hope they end up expanding to all sides of the valley, especially the NW valley!\n\nLastly, we ordered during happy hour.  No booze here, but we did get a free chips and drink if you ordered it to eat at the restaurant.  It's every day from 4-7 so check it out!!!!\n\nDo yourself a favor, go try Ike's.  Just be warned that it just takes one time and you will be hooked!!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-05-01', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'ryuCNF5w8l_J8U4PYO6sPA', 'review_id': '_nhijsgs-V2VvnxQ_6-zSg', 'text': 'This place is great for vegetarians/vegans - lots of tasty options.  I had the Lynda Carter - it was this amazing eggplant creation!  The sandwich is enormous - I could only eat half - but I was dying to gobble the whole thing.  Great staff, clean and bright restaurant, good menu, love it!   I WANT ONE IN DALLAS/FT WORTH - YOU HEAR ME IKE?', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-05-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 2}, 'user_id': '29qRAO5Edn0YtuizLWZR4g', 'review_id': 'ioFt2ice28fEwzt3bIseyg', 'text': "I truly could eat here every freaking day! No joke. \n\nIt's about a 45 min drive each way for me but I would drive that way multiple times a day if it meant I could get another sandwich!  This place is truly amazing & I've already been there 2 times this week.\n\nVisiting the first time I was really overwhelmed with all of the choices but the guy behind the counter kinda walked us through everything & helped us pick the perfect sandwich.  The workers talked to us like we were old friends.  I ordered The Change which was sliced ribeye, BBQ sauce, onion rings & gouda cheese.  I can honestly say it was one of the most amazing sandwiches I've ever had.  Ever.  They are pretty pricy but worth every penny. LOVE all the different choices they have, you can go the healthy route or you can just go crazy (like I did) & even add mozzarella cheese sticks to a sandwich!  \n\nPLEASE OPEN ONE CLOSER TO ME! :(", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-05-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'ax8B8zD3BcM0fADyw62AUg', 'review_id': 'dMMVJOSMmraHnHaz3C_5DA', 'text': 'Three of us from work went to Ikes today for lunch.   It was the first time there for all of us.  The number of sandwiches is overwhelming.  I had the Lynda Carter which is breaded eggplant,  avocado,  gouda and French dressing.  It was delicious.  My co-workers also loved their sandwiches.  The staff is very helpful and friendly and it is a fun place to eat.  Will definitely be back.  Yum!', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-05-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'smeyvZJSSEfAOHzUiPwmWQ', 'review_id': 'HV-w2xjAYlswvrTXgqMjKg', 'text': "5 stars because it is the only sandwich shop worth revisiting. All the other major chain sandwich shops are the same, nothing special. I can make those sandwiches in my own kitchen (probably better ones). Not Ike's though, his sandwiches are one of a kind.\n\nThis location is relatively new and the service was a liiiiitle slow but the food was worth the wait! I ordered the bbq roast beef sandwich and it was oh so good. Generous portion of meat, appropriate portions of all the toppings and the secret sauce mixed with bbq sauce? yes please!!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-05-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '0Jon_qQzlxee51B5v6_cFg', 'review_id': 'Ztk42rxzOestpzJkHw5buA', 'text': 'Awesome place!!  Just went for the first time and I was amazed by all if the choices especially being a vegan!  Bread was fan-freakin-tastic.  I don\'t feel it was too expensive but we did come during happy hour so we got free chips and drink... What?!  Soo good!!  I got the vegan pee wee and it was Delish! Hubs got the pilgrim and he dia and I quote "probably the best sandwich I ever ate".  And he is NOT easily impressed by a long shot so this says a lot!  Daughter got the Vegan Meatless Mike and loved it.    Thanks for giving the vegans all these options!!!!!  Will be back!!  Namaste', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-05-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7GQWU8QqLVo-9oKE2XNX3g', 'review_id': 'uTNAemGc7aFRc_-cEFS_DQ', 'text': "Vegetarian paradise! So many choices. So delicious! I love this place and will certainly return. It's a new favorite :)", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-05-10', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'TZbyfvyV1Bx9H48pwVLaJw', 'review_id': 'i7s1SYkSVzQ1LdTEVq3APw', 'text': "Yumalisciousness! I'm not even a big sandwich person, but Ike's definitely has my love. The Dutch Crunch bread is the bomb and the dirty sauce is just garlicky goodness! Staff is fun and friendly and the menu offers one-of-a-kind exciting combinations! All sandwiches are hot and made to order and customized to your level of awesomeness. This place is always packed at lunch time so plan accordingly.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-05-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'rixhxHOKxelohYbi9OukxQ', 'review_id': 'YowfztVFkA1NrZzNAHwLxQ', 'text': "Believe the hype. Flat out fantastic sandwiches available at Ike's Love & Sandwiches. While not every single sandwich is as stellar as some reviewers would have you believe, even their average eats are better than most other chain sandwich shops.  Unfortunately, there is only 1 location in Arizona and it is way out in Mesa! We can't wait for their new location opening in Downtown Tempe at the Brickyard on Mill - Fall of 2014!  The only bad thing about these sandwiches?... They end!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-05-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'EwjrdCb6RyQHEssx-l-DCg', 'review_id': 'CcXM2xNisQFN1ecLnqdRPQ', 'text': "Yum yum yum yum. Holy crap. Yum. Amazing choices! I had something with thin sliced rib eye, provolone, steak sauce, onion rings, and their crazy good garlic aioli. The menu is epic. The dude who took my order was friendly and fun. Dutch crunch bread to die for. Sandwiches were gigantic! I'm hooked.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-05-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': 'SEs6ys3-8bU9Y5I54QytEw', 'review_id': '4nN50q5YcqjrQspHyChyww', 'text': "I can't tell you how excited I am to have an Ike's in AZ! As a San Francisco native I crave good quality sandwiches on our famous Dutch Crunch bread. \n\nMy husband and I ventured in today for the ultimate sandwich experience and Ike's, as usual did not disappoint. My hubster had the Barry B Turkey, Bacon, Swiss with dirty sauce on Dutch Crunch and I had my usual the Tony Soprano with turkey, salami, ham and provolone with Italian dressing and dirty sauce on Dutch Crunch. \nI've always loved how Ike's serves their sandwiches warm, do not confuse this with other sandwich shops version's of toasted. Ike's lightly warms their bread allowing the ingredients of the sandwich to come together! \n\nWe will be back, and often. Thank you Ike's for showing AZ how a sandwich should be!!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-05-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BqruIysrgGuo7WjRWIN4vg', 'review_id': 'bMwQIil3alVXZSUheYrGhg', 'text': u'"Best sandwich I\'ve ever had in my life!"  Those were the words of my wonderful fianc\xe9.  I have to say, I echo those EXACT same sentiments.  Ike\'s lived up to it\'s reputation, and the hype!  GIANT sandwiches!!!  Super friendly service, could not have been more welcoming and accommodating.  Go to Ike\'s, in fact go right now!  You will not be disappointed!!', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-05-17', 'type': 'review'}
{'votes': {'funny': 7, 'useful': 10, 'cool': 10}, 'user_id': 'diDUDx82VePOC1hObkHwMw', 'review_id': 'gJ5fd6LJTGsdvoN_AWqoGw', 'text': "Just happened to be driving down the street and saw the goofy advertising of the Mr. Ike dude with his fancy smile and hairdo. Thought I was looking at an old TV commercial of Mr. Clean as a kid. Definitely got my attention and did a quick bookmark for this place.\n\nI'm going to start right off with the fact that these guys make some really good sandwiches. They even make a great Gluten Free version for those who are on a special diet. This is a big reason for me rounding up and going Ape Woohoo on this here review.\n\nInside is charming with a simple pick what you want and we will make it to your specifications. They have a gigantic menu with a large majority of the sandwiches named after famous celebrities or TV characters. You can even order by number to keep things real.\n\nService is friendly and very helpful when it comes time to making your selection. On my first visit I felt overwhelmed by the menu and was ask a few question to narrow down my choices. Nice!\n\nOrdered the Adam Richman on Dutch Crumble Bread for my first experience. That Man vs Food fool is crazy. The sandwich was delicious and came with Avocado, Fried Chicken, Ham, Pesto, Real Honey and Swiss. Next visit tried out the Pat Tillman which is Beer Battered Mozzarella Sticks, Mushrooms and Roast Beef.\n\nMy co-worker went with the Gluten Free version of the Spiffy Tiffy. It comes with Avocado, Halal Chicken, Mushrooms, Pepper Jack, Pesto, and Provolone. She said it was spectacular and the first sandwich she has been able to eat in a long time. Regular bread makes her feel poorly and she could not stop talking about how good it tasted.\n\nThey also have some crazy BIG sandwiches like the Kryptonite. That one comes with Avocado, Bacon, Beer Battered Onion Rings, EXTRA Pepper Jack, Ham, Mozzarella Sticks, Pastrami, Pesto, Roast Beef, Salami, Stuffed Jalapeno Poppers and Turkey.\n\nToo many choices to list them all. Check out their website and give them a visit. The prices are a little higher than your typical sandwich places but well worth it. You will definitely notice the difference in the higher quality of ingredients as well as the freshness of the product. SHOW ME THE LOVE!\n\n5 STARS", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-05-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '1H2EoisjocvvLSoKy8xUeA', 'review_id': '1pWH9oA8XE_jIgBr9EUyPA', 'text': "I used to go to Ike's all the time back in California, definitely a top pick and I recommend it to everyone. This location does not disappoint. Same great quality and menu, staff is very friendly and upbeat, service is fast. If you want an awesome sandwich, this is the place to go.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-05-18', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 6, 'cool': 5}, 'user_id': 'uZbTb-u-GVjTa2gtQfry5g', 'review_id': 'D7bjFXTfuTQcSA0yyJOGdw', 'text': "Sandwich perfection! Enjoy a little slice of San Francisco at Ike's. With so many options, chances are you'll be able to find something pleasing to your palate.\n\nThe first time I came here, I browsed through the vegetarian menu before the employee recommended his favorite, the Captain Kirk (An item from their San Francisco menu, but they will make any SF item for you that they don't have in the Mesa menu). It was heavenly. The bread was the right amount of chewiness and crispness, paired with the perfectly crispy breaded faux chicken, cool avocado, orange glaze, and lightly spicy pepper jack cheese. The crispy lettuce and tomato that came with it also added some texture and temperature difference to complete the loveliness of the sandwich. \n\nWhile other sandwiches I've had here have been good (The Pilgrim, Handsome Owl), the Captain Kirk is still the best one I've had. That isn't saying too much though, since there are quite a few other menu items to go through before I proclaim one sandwich my #1 pick!\n\nService has always been cheerful and friendly, and with a new location opening up in Tempe soon, it will be tempting to go there all the time for my sandwich fix!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-05-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GL2zD5pt8hhV1vjCCPfsGw', 'review_id': 'WjbuJjmj_okvzXLoI1eqMQ', 'text': "So good.  I was craving a true deli sandwich this past weekend for my cheat day and had to try Ikes considering I'm from San Francisco.  My dad and I tried the sf cheesesteak on yummy sourdough and the Matt Cain on the Infamous dutch crunch.  Mmmm. Whatever that sauce is it's bomb. My dad says there's less meat on the sandwich compared to the original Delis in the bay area but they're still delicious.  Way better than typical chains around the valley. Pricey but worth it in my opinion.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-05-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'eiA073MhHpCdwBq8u_luZA', 'review_id': '0iM__6ghvLUXiINTZxF5jA', 'text': "Been pretty busy lately so when a friend hit me up to go for sandwiches I took the 10 min drive from Tempe to Ike's in Mesa\n\nA sandwich shop with NorCal Dutch Crunch - OH BABY \nSandwiches are pretty pricey but just having that elusive Dutch Crunch bread makes this sandwich worth it. Having the option to create anything you want here is an added plus. I don't remember what I ordered but it came with mozzarella sticks and roast beef and I was pleased.\n\nSorta sad after talking with the staff that they were supposed to have a location on Mill but it fell through :'( I guess the fine people of Mesa can enjoy this sandwich shop while we settle for the like's of Jimmy John's\n\nNow I can finally say my favorite line from Super Smash Brother's Brawl ~ We Like Ike ('s)\n\n*Edit looks like they are having a location on Mill after all~ Yay!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2014-05-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'IjafRfMSAQpInLlw-Vi0Cg', 'review_id': 'srH4cK7ZYZENW2rNNDP5_w', 'text': "I've heard about Ike's and my family from SF raved about it. Yeah..they hyped it up too much for me. The crunch bread thing was good. It wasn't to die for or worth swearing by. There are a lot of sandwiches to choose from on their menu and online. It's cool they will make a sandwich from any other Ike's store in country.\n\nThis would have received 3 stars but they gave us a lot of samples of their sandiwches, so here is another for giving me more food... (yeah, i am easily pleased)", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2014-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SBu3-9BT4w1slZ50nVvFtg', 'review_id': 's5fuLw4kaw5toSHrPlgNew', 'text': 'Fun, friendly, delicious! Very impressed.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Zm08wcep2F-nRTHRyR8mpw', 'review_id': 'wmX05rUmJTaj093X0Dm9Ww', 'text': 'Fantastic sandwiches, especially if you go with the legendary Dutch Crunch bread. They also have authentic SF sourdough which is very good. Sandwiches are huge, though quite pricey. Service can be a bit slow if there\'s anyone in line ahead of you. Be aware that all sandwiches are hot "unless otherwise noted". Found out the hard way when ordering a ham & swiss by phone that I wanted cold - wasn\'t asked which way I wanted it, so hot it was. Also had more stuff on it than I asked for. Still quite tasty though.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2014-05-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'hn9YAMer6l5E4GFQKjTm2A', 'review_id': 'zmk0u6BgYUQBv-xeW8mNmw', 'text': "Stopped in here based on nearby restaurants on my yelp app. The 5 stars is no lie, the service we recieved from the cashier was beyond expectations for a sandwich shop. This guy knew everything about every sandwich and was extremely helpful! As if the menu posted in the wall isn't enough there are 400 options online.  WTH. No idea how the can keep all that straight but anyway the sandwiches are really good! We ordeted a meatball sub (Michael Jordan) a pat Tillman and a bear hug. I could only eat half cuz my sub was sooo big. New favorite spot! Ps.. hapoy hour from 4-7 dine in free drink and chips with your sub.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-05-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'gGlCaAm6QbdwSPxtrr-HRA', 'review_id': 'UZtZLQ6k8K95EOqxpnQ0uQ', 'text': 'This place is really good, like, really good. So I\'ve been here about 3 times now, each trying a different sandwich to see if they can keep a consistent "good" with me. They do not disappoint.\n\nWhen you first walk in, odds are you are going to be greeted with 90\'s or early 2000\'s music, which gives it a nice vibe. On the walls is the menu, which doesn\'t even have every sandwich they can make which you can find online, just tell them the sandwich and they can probably make it. The nice thing about this place is that they have multiple types of bread to choose from. They also have their special "Dutch Crunch" that I highly recommend.\n\nThe first sandwich I tried was the "Adam Richman". The second sandwich I tried was the "Nacho Boy" and the third sandwich I tried was the "Kryptonite". The main thing these three sandwiches have in common is that all the ingredients work well together, everything blended perfectly!\nThe Adam Richman had Avocado, Fried Chicken, Ham, Pesto, Swiss, and Honey. Yes, Honey. The honey worked amazingly with the sandwich, adding a nice sweet tinge to a normally salty sandwich, making the salty sweet combo work well.\nThe Nacho Boy had Avocado, Mushrooms, Roast Beef, and Swiss. This one was a little more basic, however the simplicity worked well and the creaminess of the avocado made this sandwich a lot more savory.\nFinally, however not last, is the Kryptonite. This sandwich was really big. A $26 sandwich containing practically all of their meats and toppings and appetizers jam packed into a sandwich. It was so big they had to give me two full sandwiches stuffed with the stuff. Normally, jamming everything into one sandwich doesn\'t spell success, but this place did it well. Everything down to the sauce worked together to make something delicious. I\'ll probably get another one pretty soon!\n\nTry this place out, you won\'t regret it.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-05-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 3}, 'user_id': 'VexAJmqOClKzm8KbY7xs5g', 'review_id': '0lqNJaueC5htWFJSMUOl6w', 'text': "My friend eats here like almost everyday. Got me to eat some sandwiches here too and I gotta say, it's delicious. I think a lot of people think it's delicious too since this place has a 5 STAR rating. haha.\n\nWhen I was there last time, there were about 20-30 people waiting in line to order sandwiches. And they were willing to wait too. I don't know but the flavor, sauce and texture of the sandwiches are just so GOOD. The sandwiches are huge too! It's probably going to cost you a little more than sandwiches from Subway, PotBelly, Capriotti's, etc.\n\nThere's a whole lot of different sandwiches you can order (even vegetarian and gluten free) written on the chalkboard but make sure you get the Dutch Crunch bread. It's really good with a certain crunch to it. I guess you can visit their website for every item on the menu. Oh they give you a caramel apple lollipop too with your sandwich to cleanse your palette. :)\n\nUsually, if you come during non-rush hour times, you don't have to wait in line!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-06-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'Ar11HtuIPY4Un3iHbVLMEQ', 'review_id': 'C3D-EVNmxC3ThZ4S49xoIg', 'text': "Get ready to go to sandwich heaven. It doesn't bother me at all to say that The best sandwich I've ever eaten in my 29 years was at Ike's. With endless combinations, pre recommended Sammie's, and veggie sandwiches you're sure to find something you'll love. The Dutch crunch bread was outstanding, it almost makes the sandwich. I would highly recommend this to any veteran sandwich connoisseur or anybody just looking for good eats, you will not be disappointed.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-06-01', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'RFWYbYr0YCc9S80hivuODw', 'review_id': 'ogZxItPio2TI6cuTTJQsnw', 'text': 'Someone just brought in a tray of sandwiches from ike\'s and I\'m in love! The bread looked heavenly but I skipped the bread and ate the insides of what I believe were the "sometimes I\'m a vegetarian" & "Reggie Jackson" & I\'m definitely adding this spot to my regular lunch list!', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-06-02', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'tZqJoyI0dQoQCn_oRmhPrA', 'review_id': '2MDGzRk8ReJJFd5RgYUM5Q', 'text': 'Been here twice. The sandwiches are nice. Dutch Crunch is my new vice. You get a lot for a decent price.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-06-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'm8kaHU2-IpjH3E9nKRi3jA', 'review_id': 'Av0oW_tjmCdkpXNpNGBvFg', 'text': u"Oh Ike, \n\nCan't believe I just found that place.\n\nSeriously, just fell in love!\n\nBoyfriend and I went during happy hour, 4-7 everyday. Includes free chips and drink with sandwich order. Probably won't go at any other time, the deal makes it that much better. \n\nThe lady at the register helped break down the menu for us, I decided on the 111 m\xe9nage a trois. Love, love, love! Definitely a must try if you like a sweet kick to your sandwiches!  \n\nThe boyfriend got the bear hug.  That sandwich is seriously genius. The jalape\xf1o poppers inside are so delicious. \n\nCan't wait to go back and try the different options! \n\nI probably won't be stepping inside of a subway ever again!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-06-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DCAzfS4XQsyuLP8f7Drq5w', 'review_id': 'wEAVGd1q7GK3u8XJ6fceTw', 'text': 'After reading the reviews online and gasp- seeing good vegan sandwiches- I knew I had to check this place out. They make it super convenient for you to order online or by phone. I tried the "Sometimes I\'m a Vegan" gluten-free sandwich. DELICIOUS. Can\'t wait to go back. I\'m going to try and make this a once-a-week thing. I definitely recommend it. Very laid-back atmosphere and friendly, accommodating staff. Plenty of options for everyone too. Highly recommend!', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-06-05', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 3}, 'user_id': '0V7H2CMFTxsUNdYc_h2JXQ', 'review_id': 'qcgEeh_7P9qEpNAd28ifOQ', 'text': "The best sandwich shop I have ever been to! I look forward to coming to Mesa not because of the weather or the joy of the satellite office, but because of Ike's. I've tried the Thanksgiving, the Menage a Trois and the Spiffy Tiffy or something. Everything has been straight up delicious but the Menage a Trois definitely takes the cake. As if the sandwiches weren't good enough, the staff is SO friendly and they play 90s and early 00s tracks for a nostalgic trip down memory lane. WIN. WIN. WIN.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-06-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'laqYZNOlAaMLuIPWhPDDPQ', 'review_id': 'p9rg57ntWTERD-bMI8K3-A', 'text': 'Best sandwhich place I have been to in a long time!! Everything is always fresh and their menu is unbeatable. The best part is they have vegetarian sandwhich options. I suggest the Jessica rabbit sandwhich and the meatless mike. Tried a new pesto sandwhich today!!', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-06-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'fOFSjqlS34HBukd_HjlI5g', 'review_id': 'FcNYZp2E1n8DZK59NcxgiA', 'text': "Decided to visit this place because my wife and I heard it practically had a cult following. \n\nWith a 5 star average review it has to be good. I ended up getting the Tony Soprano and my wife grabbed the Bella. First off the online photos do not due justice to the size of this sandwich. It may be 8 inches but it's practically 4 inches across. We both could have done with sharing one sandwich. They both were delicious. \n\nWe also had their fries of which we were much less impressed. There wasn't really any seasoning...healthy though since they're baked. \n\nWell definitely visit again but recommend skipping the fries.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2014-06-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 3}, 'user_id': 'RiOXLgH3uRGoOD6MNC2k3A', 'review_id': 'yRLt480lxz3qMpqP047ZPA', 'text': "I went right after the lunch rush. The staff was friendly and helped me with my order. \n\nI had the Shawn Michaels and it was probably the best sandwich I've had in years. It was a combination of steak, bacon, and mozzarella sticks on sourdough bread. I inhaled my sandwich, it was that good.\n\nI spoke to Chase, one of the managers, for a few minutes and I told him how impressed I was with the food and service. \n\nIf you're in the Phoenix area for a vacation or you're a local, make sure you schedule a stop here.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-06-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Y1u87_WNmyCT5KH5Qma6Rw', 'review_id': 'v1HrGemSxexzVwZQ_uYqCg', 'text': u"Got the Adam Richman on Sourdough, it was so good! I could'nt even finish the whole thing it is so big. My hubby got the Shawn Michael with jalape\xf1o poppers and he enjoyed that, but said he liked mine more. The staff is extremely polite here and very enthusiastic....and we got to jam to music we grew up on in the 90s early 00s. \nOverall we will be back!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-06-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 't5EStHZ9ckQfXAgJdu5CMw', 'review_id': '4Ms5fKk3_yfLZ6EKzQIkeg', 'text': u'I  got to know that this sandwich shop originally hailed from SF - and the only location so far is out in Mesa.\n\nHave to say - the size of these sandwiches were monstrous! Putting two halves together is a size I can\'t fathom! $10 for a sandwich that big - seriously?!?! Awesome deal I think.\n\nThe sandwich itself? Quite good! The sandwich bread was "Dutch" so quite crunchy but tasty at the same time. Vegetarians - there is a whole section devoted for us on the menu!! \n\nThe bear hug was supposed to have vegan breaded chicken as the patty but since they were out of stock, ended up getting vegan turkey. I didn\'t really mind if it was chicken or turkey because at the end the soy products end up tasting the same. Have nothing to compare it to!\n\nNone the less, the sandwich was delicious and I loved the touch of stuffed jalape\xf1o poppers in the bear hug sandwich! Wow!\n\nTo finish every sandwich meal, they throw in a caramel apple lollipop - sweet end to a large meal!', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-06-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wiALs-wgIipaJbpLPiurdA', 'review_id': 'EkBEn7LpHkzgdTX4L0cEZA', 'text': 'Super friendly staff, good atmosphere and a good change from the other places around here. The sandwich was really fu@$#ng good. I am going to try them all.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-06-19', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'ndPxSoaIw7vMKG7cPZ_66A', 'review_id': 'yvTjsVKkx535cxKkBa2xyw', 'text': 'There is a reason why this sandwich place has 5 stars. There are a ton of original sandwich creations to save you from submarine boredom. The bread is "par" baked (as in partially) and then finished baking to order so it comes out fresh and fabulous. There are a ton of vegetarian and vegan options if that floats your boat, and their website makes it easy to find them with their search filter. The staff was almost frighteningly friendly--not as intrusive as Dutch bros, but still oddly happy to see you, and chomping at the bit to walk you through the menu. During "happy hour" kettle chips and a drink are free if you eat in...it\'s not alcohol but it\'s a nice perk. It may come on the cheap to them because they have their own brand of soda pop instead of being slaves to Coca-Cola or appearing cheap with Pepsi, but their brand was sufficient to my taste buds. Don\'t feed the subway monster, check out Ike\'s--they really do love their sandwiches!', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-06-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '7rPOo_xMdAs8EyUjk0QUiw', 'review_id': 'iaDAHDoh88r97lD-HQ36Eg', 'text': "I really can't add more than what others have said. My daugher suggested this place and swore it was great- and it was! Super delicious! I had a Kevin Bacon (BLT and pepper jack cheese) I added jalapenos and it was Wonderful!  I wasn't crazy about their fried zucchini- but everyone else liked it, so it must be me and I don't want to knock them on my taste preferences. We also got a drink and chips included in happy hour. Are they a little bit more for a sandwhich? Maybe a little but we would spend the same amount at Firehouse with chips and drinks, so its not outrageous. I would suggest going to the website first to browse the menu- there are a ton of sandwhiches and it could take awhile to decide.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-06-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '8C-2oT1Tjiv6ewIUCksRpA', 'review_id': '9t4Jk5EDSmFmpU2c9TTH4A', 'text': 'We tried Ike\'s for the first time yesterday. The menu is kind of overwhelming for first-time visitors, but once we looked it over, we were able to find something we liked. I had the Bear Hug on Dutch Crunch bread. \n\nI liked the "Happy Hour" special where you get free chips and a drink from 4-7.\n\nIt\'s kind of hidden in a shopping center near Fiesta Mall, where some of the businesses have closed. We\'ll definitely go back if we\'re in the area.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2014-06-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lNq-YPqF8VXVkVM40BsWYQ', 'review_id': '7c32cI6P-NKRsbELR1qtnQ', 'text': "I live in Tucson, but every time I come to Phoenix I make sure to eat at Ike's. The first thing I noticed during my first visit was how extraordinary the service as (and this isn't even a dine-in place). The guy behind the counter greeted us genuinely and everyone else working seemed happy to be there. After we put in our order, we ended up talking to the cashier for like 30 more minutes! Every interaction is genuine and enthusiastic, which is really something unique. \n\nAnd goodness...the sandwiches. I was so impressed with how many options there were for people of all different diets. Halal chicken, vegetarian, vegan, and plenty for meat lovers. The options are literally endless. The sandwiches are HUGE and make my heart happy. And to top it off, they give you free caramel apple lollipops! What an awesome little perk.\n\nOverall, if you live in the Phoenix area you MUST try eating here.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-06-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'jWpbwcHxQtggzIISVmDGvg', 'review_id': 'AdNaPrcxd-GQQivPaPPLjg', 'text': "Great sandwiches...make sure you get their dutch crunch bread because it's awesome. They lose a star because the three times I've been, it's been impossible to find a clean table. And they never responded to my request for nutrition info :(", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2014-06-26', 'type': 'review'}
{'votes': {'funny': 10, 'useful': 18, 'cool': 12}, 'user_id': '4ozupHULqGyO42s3zNUzOQ', 'review_id': 'XVnwdHZdmtGqSxldTtO9rw', 'text': "I don't throw the following sentence out very often but when I do, I mean business so here it goes...I had the best sandwich I've ever eaten here. I am not exaggerating. So if you stop reading this review right this second, at least you know and now you can you get into the car, make your way to Mesa and try one for yourself. \n\nSo on to the rest of the review. I've been lucky enough to have an Ike's sandwich in SF and couldn't believe my eyes when I found out they were moving to Arizona. Their location is a bit of a drive for me, but the sandwich truly makes it worth it. \n\nHere's how the experience works. This is a casual sandwich eatery where you can come in solo, order and take it to go, or dine in with a couple friends. Anything goes at Ike's. Now, when you walk in, you'll immediately be overwhelmed by a board listing off a variety of every sandwich combo imaginable and it's not your run of the mill sandwich combo. No way. It's a combo of everything good in life that's put in between two slices of bread and served either hot or cold, depending on your sandwich. I suggest looking at Yelp reviews, pictures and the menu before you arrive to avoid major menu anxiety like I experienced. Also, note that every sandwich has a hilariously funky name so you might get lost in translation just simply reading the names! \n\nOnce you've made your sandwich selection, you'll order at the counter from one of the incredibly friendly staff and they are truly genuinely friendly! It was such a breath of fresh air to experience a sandwich at Ike's. The decor is just as fun and funky as the staff and sandwich choices and be sure to look on your napkin holder because it will tell you something pretty about you! \n\nNow on to the best part, the sandwich. I don't even know where to begin. First, they serve this special bread that typically can only be found in N. Cal and it's amazing. Cheese is baked into the bread. I tried the Bella which is their most popular and I'm not surprised. It's a combo of chicken that has been slow-cooked for several hours and then tossed in this delicious honey mustard. Then they top it with cheese, avocado and this special mayo spread. I suggest adding some hot sauce to it. It's served hot and it is large and in charge, so unless you're ready for a last supper meal you will probably have some left-overs or your might want to share. It's worth every single calorie consumed and then some. \n\nNow, although this is about a 15-20 minute drive from my house, I will absolutely be visiting on a regular basis and can't wait for them to open additional locations!\n\nPS - if you get lost, it's across the street from the mall!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-06-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': 'U77393fobZIh4BWe0VkkWg', 'review_id': 'AhJae-GY6RkUiEK2YaXSjg', 'text': "Wonderful place.  So many items to choose from.   Even their vegetarian menu is extensive.   Hundreds of different sandwiches.  Their Dutch crunch bread is the Bomb.  A go to place if you are in Mesa.  I'll be sure return.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-06-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'B6cV7ghvEtyDPMhzd73m-A', 'review_id': 'rK9pNwwMTSGmUlviF3la8w', 'text': "Wow! The sandwiches at Ike's are amazing. When I heard about this place, I was intrigued. When I found out they had vegan cheese (hooray for the lactose intolerant crowd!), I was even more excited to try it. \n\nWalking in, it's a little overwhelming. The menu board has tons of options and that isn't all of the possibilities. \n\nThe biggest complaint I hear about this place is the price. But the sandwiches are so delicious - you get what you pay for. Or go during Happy Hour. You get chips and a drink for free when you eat at the restaurant.\n\nHonestly, one of the best sandwiches I've ever had. I cannot recommend this place enough. Got a food allergy? No problem. You're going to leave this place stuffed and happy.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-06-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'R6FgPxbC7sfKVEA6Bhn_OA', 'review_id': 'Qj_FdJI8g6SWex_ItBFDww', 'text': "This place is worth the drive if you're not that close to the Fiesta Mall area. Just had the Bear Hug and it was amazing. Jalepeno poppers on a sandwhich might sound weird but it just works the way they do it.. so good. Kind of a lot of bread but the sourdough is as good as any I've had. The whole sandwhich is huge, could prob split with somone. I'll definitely be going back, and I've already FB'd it. :)", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-06-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'JnW97XbEiSCIx8guiys24g', 'review_id': '7fTvOjrxvvnS24KJD6CvQQ', 'text': "I always love a place where the employees look like they're having a good time, and Ike's had it! Rachel was the best - not only really enthusiastic and attentive, but also a lot of fun.\n\nWe got the Bear Hug and the Spiffy Tiffy . Both were fantastic and the dutch crumble bread tasted like a buttery biscuit. All the ingredients tasted fresh and high-quality, especially the pesto. Large portions, though, so we got a dinner out of it, too.\n\nA little pricey, but definitely worth it, especially because we happened to get there during happy hour (4pm-7pm, I think) so we got a free drink and chips. They also give a caramel apple pop with the sandwich.\n\nCan't wait for the new location opening soon on Mill Ave!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-06-30', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'xFfA5iSDqyAGqiRxfaOE-g', 'review_id': 'Ax5cOf0ZXX_tfe86tuuraQ', 'text': "Having read many great reviews, my wife and I were excited to try Ike's but we were seriously disappointed. The sandwiches, a Matt Cain and a Meatless Mike, were just OK. And,  the price was simply too high for what you get.  Two sandwiches, a side of Jalepeno poppers and one drink was $25. Setting cost aside, the sauces overwhelmed the rest of the sandwich. The bread is better than average, however, not stellar. While we would not say this is a place to avoid, many seem to like it, we would not put Ike's on our recommended list.  The local grown Sacks Art of Sandwicherie would have to be our pick to click in the greater Phoenix area.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 3, 'date': '2014-07-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '7tZrk2JTi5I-tqvU4nVt0Q', 'review_id': 'dM0GApt2jopprrlLXFeAZQ', 'text': "Just moved into a new neighborhood and used Yelp to find nearby restaurants. Ike's has 5 stars so I decided to try. \nI ordered the bear claw which sofa king yummy. Yummy yummy yummy. Staff was friendly and place was clean. Stoked it's so close to me, I'll definitely be going back for more!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2014-07-06', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': '1UXOwFKujaGNCNCijrdbsA', 'review_id': 'CffIzMKj2JEKrrGD_NOQ5A', 'text': "These sandwiches are pure genius. I have never seen so many unique combinations between two pieces of bread. I have always wanted to try Ike's place, since I heard so much about it from SF people, that when they opened up only 2 miles from my house, the expectations were set so high. I ordered off the menu from a SF staple, If I were Cute, which has chicken, pesto, bacon, cheddar, and mozz sticks! Of course on dutch crunch with dirty sauce. It was pure heaven. I haven't tried any of their other sandwiches because the continued orgasm from this sandwich still get me. Maybe I'll venture out in the future but for now I have found my love. The staff is beyond awesome. Everyone has a super chipper, positive attitude that you can't just help but let it rub off on you. Now all they need to do is open one in the Chicagoland area!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-07-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'INx1bHMZUH2wzZRVCZLnbA', 'review_id': '3Lo8wI--VyW36RBS-ITyXA', 'text': "I love Ike's! They prepare a whole new level of sandwich. My husband and I enjoy eating here. It is a  nice place, happy atmosphere, and friendly crew:-) My favorite is called the Bear Hug!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-07-11', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'i80z0PigG-KSNKtIWXfW_Q', 'review_id': '-p4DJ5zXn_H0oeXAzqoX4Q', 'text': 'Checked this place out over the weekend. I had noticed it a few days ago and decided to check out a menu online and I was amazed at all of their vegan options. I went in without a clue in the world on what to eat. The staff was extremely helpful and patient with my inability to make up my mind on which sandwich I wanted. I got the vegan meatball sandwich and it was delicious! They were out of Daiya cheese but the sandwich was great without it! I have to say I am blown away by how great the customer service was. This place is AWESOME! I really hope that this place sticks around because almost everything around them has closed down. Great food, great service!', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-07-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'xiE3zWbKYloWPCWtGZg0sQ', 'review_id': 'H4PwkKDwQOiEmBC_r6SKvQ', 'text': "The variety of sandwiches here will spin your head, but over the course of several meals I have discovered you can't really go wrong with any of them. Fresh ingredients and thoughtful combinations create some amazing flavor profiles.  Anything with their mayo based dirty sauce and dutch crunch bread is a dinner in my books. The sandwiches are pricier than you have come to expect from places like jimmy johns, but they are massive portions worth every penny. Highly recommended.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-07-16', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 4}, 'user_id': 'E2DYTWOVSptFJqM7jckPpg', 'review_id': '5bwFhYW6R-BZWnZ9XdPyOA', 'text': "This is an excellent sandwich and I have had some of the most amazing sandwiches on the planet on a regular basis (look up Bay Cities Italian Deli in Santa Monica & do yourself a favor, don't miss it if you are ever in the area!).  I have been searching for something to live up to Bay Cities ever since I moved here and all have failed miserably until now.  \n\nI totally forgot the name of the sandwich I had, there are a lot of different funky names, it can get overwhelming when you first dine here.  But, it had chicken & avocado and was delicious.\n\nNext time I'm going for the Roast Beef.  The only thing they are missing is Parma Prosciutto.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-07-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 3}, 'user_id': 'R5Vzwte2Dufb6UpDnMK4hw', 'review_id': '6p-7LnR_5Q861hnALanTfQ', 'text': 'Amazing. Wish it was closer to my house!\nGET DUTCH BREAD!\nThe soda is from who knows what company, and they don\'t have the popular "lays, doritos" chips. But they do have really good "Voodoo" chips\nAnyways...EAT THERE ITS SO AMAZING!\nGreat now i\'m hungry just thinking about it lol\nThe only problem going there was choosing what sandwhich to get because there is such a variety.\nDon\'t worry though your not alone. I went today for lunch and 2 other people were standing next to me looking at their huge menu.\nThey give you a caremel apple lolipop for dessert. YOU WILL LOVE IT\nYUM YUM YUM', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-07-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 3}, 'user_id': 'kMdsxNQ0r1YEvQY1dFTbxw', 'review_id': 'jvZRBsuJTQ3ToidkaYcdAg', 'text': "They're 5 stars for a reason - great energetic atmosphere, best sandwich in a long, long time! Me and the Mrs.  Paid $4 more for our total meal over what a plain Jane Subw@y meal would have cost - for sandwiches that have FLAVOR and from people that CARE! \n\nProbably 80 sandwiches to choose from, gluten free if you want, vegan if you want, carnivore if you want. Crunchy Dutch roll-only ones outside of San Francisco  to have them. \n\nEAT HERE! You won't be disappointed.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-07-25', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 4}, 'user_id': 'iy-lnju3UY_eap5oztdkhg', 'review_id': 'VpGpO0r_M7vfQ-FAVvo4Og', 'text': "THANK YOU CHASE for introducing me to Ike's sandwiches!!! This place is seriously amazing! I don't even know the words to describe it's awesomeness. I'm sorry to say that it took me a good couple of months to finally go try a sandwich here once Chase suggested that I try it. I figured it was just another regular sandwich place like Subway, Quiznos or Jimmy John's... however, this is anything but like those places! There are hundreds of different sandwiches to choose from, it's almost overwhelming to take in. \n\nIt was seriously SO AMAZING, that I went twice in one day!\n\nI don't know how else to say this, but Ike's sandwiches surpass any sandwich I've ever had. When you go, you NEED to try the Menage a Trois sandwich. The description didn't blow me away... but once you taste it, oh.my.goodness!!! AMAZING! Thanks again Chase, Ike's is now a favorite! I can't wait for the Tempe location to open! :D:D", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-07-28', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 2}, 'user_id': 'baVvyJ9EvmjXpdX10gLJoA', 'review_id': 'czxqoGanHwdhC8HNnWRpLQ', 'text': 'OUTSTANDING!  Ike knows how to make the perfect sandwich!  He also knows how to provide an outstanding experience to customers.  We went right before catching a show not far from here at the Mesa Amphitheater.  A big thank you to fellow yelpers for being so honest about just how AWESOME the food is.  We happen to go during happy hour and were surprised to find they do chips and drink as the "happy hour."  Very clever idea.  The menu is extensive so anyone you bring will be happy because it\'s a sure bet they will find something they enjoy.  Even if it isn\'t posted up on the menu (like what I said I wanted) they are sure to have it, and have a fun name for it.  They were quick with taking our order but the staff was friendly and unlike other places you may stop to grab a quick sandwich you could tell they actually ENJOYED being there.  I can\'t say how much it changes the experience when you go to a place like this when the people working there make you feel like they actually are happy to be there.  \n\nThe very best part was the advertisement for the happy hour had the coolest photo!  A funky feline helped sell the meal to us!  (See Photos) \n\nThank you Ike\'s for not only an exceptional meal but an awesome experience!', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-07-28', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': 'b5NysWHPHvhd0EA6-yCRCQ', 'review_id': 'aD0iowx-uIa_rYrNi2-uQg', 'text': 'Every sandwich is better than the next. Never order the samething twice and there are over 500 types of sandwiches. The dirty sauce and make variation that much better. Every experience has been great and the people that work there are very helpful. Everyone should check this place out. Best sandwiches in AZ', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-07-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '1cxSdZtQq-YacmXJZBn6gQ', 'review_id': 'cQqGBGHyc7WlJshi-nEtyg', 'text': "Excellent! 3rd Ike's location I have been to and this one was up to par with the San Francisco location. I ordered the Bella and it was great! Staff was very friendly and the place was clean. I would highly recommend it to anyone looking for a bomb sandwich!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-07-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'OpN1MhESDpc4_mPpx2Pd9Q', 'review_id': 'mWkV0J40xyQsM6dWUMlD_A', 'text': "I can be pretty picky when it comes to sub shops, but I really liked Ike's! I was looking for places good vegan options besides just a vegetable sandwich. The service was good, and they have tons of options!\n\nI was debating whether to get the Vegan Pilgrim or the Vegan Reuben, but went for the Pilgrim on gluten-free bread. It was definitely an interesting and enjoyable sandwich! Though I would want to try the Reuben next time. We went during the happy hour, so we got free chips and a drink. The chips were very delicious. Also a caramel apple pop with every sandwich? Nostalgia! Yes please!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2014-07-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 3}, 'user_id': 'GoDjpEPTyUQoQVRwPljIgw', 'review_id': 'c798-85JrROyPRKkizJGYg', 'text': "So this is my new favorite sandwich place in AZ.  I had heard about it a few times, so it was on my radar, but I didn't realize how freaking good it would be.  I love all the kitschy names for the sandwiches... although you won't find me ordering one named after a SF Giants player! ;)  I ordered the Tony Soprano; turkey, ham, salami, Italian dressing and provolone.  All their sandwiches come with dirty sauce.  My mom ordered the Paul Ruebens and she wasn't sure how the dirty sauce would taste on it, but she loved it.  The moral of the story is- Always get the dirty sauce!  \nThe service was fantastic.  The girl that brought out our to go order was so friendly and invited us back again.  I loved the classic 90's music playing in the restaurant too.  It's always fun to rock out to New Kids on the Block which waiting for your yummy sandwich.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-07-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4D6fUykocgc99jXPKyYzTA', 'review_id': 'S-XtEwbko2uurkVu8-2ZGw', 'text': "AMAZING!! What an excellent selection of sandwiches. Finding a variety of vegan offerings in one place is difficult and Ike's delivers.  Sandwiches are large fresh and delicious.  Air baked fries are an awesome side.  This will definitely become our go to sandwich location.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-08-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vLBjITr0D4q3BNKO46Ix8w', 'review_id': 'ncjEdjxsA5tkgi6484uIbg', 'text': 'I tried this place on a whim and some Yelp help. Absolutely happy I did!\n\nThe sandwiches are phenomenal. They have the best warm sandwiches I have ever had in the valley. I am partial to anything with pastrami so I find myself ordering the Paul Reuben or the Thunderbird. Their steak and chicken sandwiches are great as well. Even a carnivore like me found myself ordering a veggie sandwich just for kicks... And I loved it!\n\nDon\'t be fazed by their menu. Take a few minutes or browse online before going. They have a lot to offer and I find myself wanting to try new types of sandwiches. The fries are great and there\'s enough for about 2-3 people per order. \n\nNow... Their bread is a whole other story. I am a fan of SF sourdough (is their any other type? Lol) and this place will not disappoint. They have what they call "Dutch Crunch." It\'s basically a white type of bread with an awesome crispy crunch. I really can\'t find words for it but it is awesome. The texture and flavor will have you craving more. \n\nService is very friendly and FAST. And you get one of my favorite treats for dessert, a caramel-apple pop! \n\nThe only con I found with this place is the amount of seats. There\'s about 8-9 booths and 3-4 indoor tables and they always seem to be packed (a good sign!).', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-08-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'skR7pPLBIgIab7EEdUCUHg', 'review_id': '0FLF-hTA0Wi3CxATrFEesw', 'text': "This place puts any of those big name sandwich places to shame! So many choices and the overall tongue n cheek humor of the place will keep you coming back every time you're close and sometimes when you're not! Don't let any of the kitsch fool you though this is a gourmet level of sandwich artisans putting together your meal here!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-08-03', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'DXbprw3A83w_WCylMIgUag', 'review_id': 'm4Z4wEC9Wqm4zoDP5wgqGw', 'text': "Arrghh... here again.. it's 3:15 in the afternoon. 2 customers in here and every table is dirty...again!!\n\nCmon guys get with it. Even through your sandwiches are awesome people are going to get tired of the grossness!\n\n Where's the management? \n\nFood is 5 star,  cleanliness is 0\n\nThis is about my 10th visit here since they opened. When I'm working In the area I stop in for an amazing sandwich. I can't remember if I've ever been impressed by the cleanliness. \n\nAnyone who has eaten here knows the sandwiches are big and kind of messy  ( in a good way ).. so when I say dirty tables and floors it's not just just a few crumbs  on the table... it's literally gross,  tables, floors, drink area, grime on the booths that are more than just from the lunch rush.  \nThere is a general laziness if you watch the employees when they do give a table a quick wipe. I hope the kitchen does not show the same lack of cleanliness :(\n\nIke...Bring in some employees who genuinely care about your brand and making your restaurant as awesome as It should be... All around.\n\n Best of luck to you, you have an amazing concept. \n\nI'll be glad to edit my review at a later time.\n\nIf anyone else notices the same thing, help Ike out and put the word out. We love eating here and should feel like it's a clean and safe establishment.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 1, 'date': '2014-08-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VqIE3CttlahYZEj1pRAWoA', 'review_id': 'noGZDwxNUaRvXw8LN7gESQ', 'text': "Easily the best sandwich I've ever had.  At first I felt it was a bit pricey for a sandwich.  My coworker said that if I didn't enjoy the sandwich he would personally give me my money back. So I said what the hell. Its also next door to my work.  I tried the mozzarella sandwich, I forgot the name of it. It was the most rich and delicious sandwich I have ever had.  In fact so rich that you could be pleased by only eating half and saving the other for later, considering they so conveniently cut it in half. Diagonally,  by the way, the best way to cut a sandwich.  This place rocks. Everyone should go, it's worth every penny.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-08-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'FyY_lBFItdSHgRagaTVu5Q', 'review_id': 'ISKSJxmTgJptaa_5xaW49Q', 'text': "Hell yes! I love this place. First tried it in SF and was ecstatic to learn they were opening a location in Mesa (and very soon in Tempe!) The menu is giant! Look online before you go. I get the Barry B, my gf likes the Spiffy Tiffy. Don't skip the dirty sauce and although they're famous for the Dutch crunch bread, I opt for the Sourdough because it's phenomenal.\n\nFries are great, onion rings tasted great but I made the mistake of taking them home and they ended up a bit soggy. Obviously not their fault but just a warning to those who want to take out onion rings.\n\nI can't tell if they moved I to a struggling shopping center or if all the restaurants around them closed because Ike's is so awesome.\n\nI have been here 4 times now and will continue to drive 15 minutes for my new favorite sandwich shop!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-08-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hr7JnYlf72VY9FeuPZj7aw', 'review_id': 'P3QjNRe8hgKTYETm_36FDg', 'text': 'Some of the best sandwiches you can get in Phoenix. Soo many diverse flavors between two pieces of bread.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-08-10', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': '5idoq1CUfo_Ch5oWwkmbTw', 'review_id': '82xjj65IBTAAbXLFfgI19A', 'text': "I moved to AZ 2 years ago from the Bay Area, and every time I went back I made sure to hit up Ike's at least once. When I found out they were opening a place here I was ecstatic. Best sandwiches ever, you can't go wrong on the huge menu.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-08-11', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '21BCkGjM5rtGgAB7JLttCw', 'review_id': 'DILBFXW_K5l5FlevshkHQQ', 'text': "I can't get enough of this place! This food is the bomb! I would drive 100 miles to eat here! Well worth the time to come here, especially during happy hour from 4-7 everyday.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-08-11', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 1}, 'user_id': 'i-8jVgyJUkP6eolJJk7GtQ', 'review_id': 'j6Yc1tJpKGgP5T2QYRErfA', 'text': "BEST SANDWICH PLACE EVER!!!!!! idk what they do but it's amazing! I had a fried chicken sandwich that came with pesto and honey and it was the best sandwich I have ever eaten. I love how they make unique sandwiches that you would never think of but it actually works great. So many selections and the staff is so awesome they basically become your friends! Don't worry about ordering mozzarella sticks or chips or whatver on the side because you don't need it and it's not that good anyways. Just order a sandwich and you will be stuffed out of your mind. Keep opening more locations Ike's!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-08-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ts_GFS91jpYXWllQiN8UGg', 'review_id': 'r7X3gaqKNfgyTEY8S_-IMA', 'text': "Impressive.  I must say I have tried over 5 different sandwiches and they are were great!  My favorite is the Bear Hug, Spiffy Iffy, and Adam Richman.  I understand they are a little pricey but worth the money.  You won't realize how good they are until the next day when you are craving a sandwich and Jimmy Johns, subway, etc just wont do.  Highly recommend them.  Give it a try!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-08-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ew_fDXg9aPmXU67aq_wYGg', 'review_id': 'YeuzMuki_E6XTQ_3qXrNKw', 'text': 'We tried this based on a Yelp experience and we have gone back multiple times. Great food, great people, very fun experience and did I mention good food? Huge selection ams they have all been good so far! Does not disappoint.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-08-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'lp-_Jo5IR9ZO7878rpwNDA', 'review_id': 'j0LALeEqTwSaLQUti8gj4w', 'text': 'Ok. This is why I LOVE Yelp. This place as awesome. Great atmosphere, not too loud. The dreamy smell of fresh bread and sauces fills the space. There are a ton of options to choose from but we got great recommendations with the Paul Reuben and Hollwoods SF Cheesecake. They even had Gluten Free Bread and it was fantastic. Need it bagged up, they kindly take it and do it for you!!  Love love love this place.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-08-15', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '3bM9i4N48xXMLrLRq8ld3Q', 'review_id': 'RRbJmtrK251NneSa4YFAjA', 'text': u"Amazing sandwiches! So many options and there's even more online! The sandwiches are HUGE! My fianc\xe9 and I both ended up only eating half and he can eat, so I would recommend sharing a sandwich if you don't like leftovers. Great music as well.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-08-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'FvtPughae10_YeNVisMEuQ', 'review_id': 'CKdcT21TNbSX2oSEyMUq2w', 'text': "I don't understand all the 5 star reviews. \nThis place has a huge menu and prices that match.\nAfter making a choice I waited and waited and waited for someone to take my order which I could have understood if I wasn't the only person in the joint. \nI then waited and waited and waited for my to go order while all of the staff was in the back. I finally got my meal, made my way home and bit into a Sandwhich was that over dressed and falling apart. \nThe flavors were ok but a Sandwhich that messy with all of the other issues I had means I won't be going back anytime soon.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 3, 'date': '2014-08-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uQhFPUYfoljQykVEycgYBA', 'review_id': 'JwxodIZfWhfgCRsRK8uQhQ', 'text': 'The Dutch crunch bread was incredible. The portions were large enough for two light lunches. Best when eaten right away; hot & fresh. The staff was fun and energized.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-08-23', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 2}, 'user_id': 'qaxSFbY4CJ0nmDVjOqsFrA', 'review_id': '6f_zBTNogIylM6unCsvIzA', 'text': "Not sure why all of the 5 Star ratings. Food was just average at best and with price considered it's less then average. Fries were meeh, sandwiches the same and service slow. The only saving grace was the pleasant young man who took the order was both knowledgable and courteous. Too much money and slow delivery, not a good combination.\n\nRemoved from my bookmarks, won't be going back.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 2, 'date': '2014-08-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': 'l9GGMi-zf2ZTbHbW8wrkTw', 'review_id': '8ugPblhrU3Vp6RSOAGqQZQ', 'text': 'The line was huge but all the employees were still very friendly. I was pleasantly surprised to find a seat since they were so swamped. My seat was outside but that was fine with me since it\'s not a super hot day. \n\nI had the #1. Chicken with teriyaki, wasabi mayo and provolone (I changed it from the offered Swiss). Dirty sauce is a garlic sauce. I had it on the side and am glad I did. It would\'ve overwhelmed the chicken. I was a little disappointed that the wasabi mayo was so mild. It was a hint of wasabi at best. Chicken was decent. I was told the Dutch Crunch bread was "a must". Not sure what the hype is. I removed most of it so I could taste the fillings. The people behind me in line were raving about the Monte Cristo and a Thanksgiving one. Maybe I should\'ve tried that? \n\nAt $11 for a sandwich and small drink, it\'s a bit steep to me. It was good but nothing of run back for.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 3, 'date': '2014-08-28', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'fFzmJeDxH6a8T0pfLAdmJA', 'review_id': '5Hf5vlwaxOrNb1yCLaSJvQ', 'text': 'Hold the dirty sauce & the sourdough. Okay, let me explain. So I went with the wife and we got two different sandwiches. I got the Bear Hug on sourdough and she got the Thunderbird on the dutch-crunch. The Thunderbird comes with thunderbird sauce. It is so good, you could taste all the parts; pastrami, gouda, & thunderbird sauce. The thunderbird sauce has a little kick to it, which is why I prefer it. And now let us discuss the dutch-crunch bread, it is a little sweet so the thunderbird sauce goes on that sandwich in perfect harmony. \n\nThen we get to my sandwich. :-( The sourdough was great and I am sure the dirry-sauce is good (I had already got blown away by the thunderbird sauce) but the sandwich has way to much going on in it. Roast beef, jalapeno poppers, lettuce, & some other yummy stuff in there I can\'t even remember. \n\nBecause they will pretty much make any kind of sandwich you want, I want to try meatball, gouda, lettuce, with thunderbird sauce on dutch-crunch bread. I believe it will be "out of this world". In fact Ike, here\'s a new sandwich and title for you.\n\nOne sandwich can pretty much fill two normal appetites up. Unless you are like me, a ravenous creature. Get one and share ot get one for two-three meals. \n\nThis place is overwhelming, but a must. The staff is great two. Be patient when ordering, certain orders require them to go in the back and yell an order to a cook. Remeber hundreds have survived this, there is no reason why you can\'t.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-08-28', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': 'sm_gQdh-gDn2E6mzbPY1Ew', 'review_id': '16YIxTnZ7ZtXAgQgKdnqXw', 'text': "Sandwiches over priced and what sandwich place doesn't have mayo only something called dirty sauce.  Waste of time and money.....", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 1, 'date': '2014-09-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'd8uqmGEmKvnm9R6b8WKZ7w', 'review_id': 'A451XST5eobSZBpx20NxkQ', 'text': "I've tried many sandwiches and never been disappointed. The sandwiches are huge and very involved! Must have the Dutch crunch bread!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-09-01', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 1}, 'user_id': 'XE_mTf090IfnKbftagiMfA', 'review_id': 'NR-wRPQAS7HiSaLex2WwaQ', 'text': "I am a vegetarian, so I have typically never been a big sandwich eater mainly because of options that are offered at sandwich shops. Usually, I have a choice between cheese, lettuce, black olives, peppers and tomatoes. Pretty boring.\nIke's is awesome! It has a huge selection for vegetarian and vegan, with a variety of combinations. I had the Dream of Jeannie which was like a BLT, but with veggie bacon. The sauce was spicy, which made the sandwich yummy. The prices are a bit high, but the sandwiches are so big, I took half home to eat for another meal. Definitely recommend!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-09-02', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'rUzAKhegdXz1eq56c--mxg', 'review_id': 'Kft5Glb_zNAis-E8HX4yzw', 'text': "I go to this place once in a while near my work. Can't go wrong with the menu.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-09-05', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': 'XsUrnV-KjYquFyD0VG2Akg', 'review_id': '0r0OZkVF4sNvlqltC3Aa1w', 'text': "OMIGOSH!!  Nothing but love for these sandwiches!  I had the most amazing sandwich - Desperate Housewives - on dutch crunch.  It would be what I would consider the gateway 'drug' into the Ike's Love & Sandwich world!  That halal chicken is OFF THE HOOK, perfectly paired with buffalo sauce, provolone cheese and bacon - how's a girl supposed to eat her way through all 400+?  Your staff was nothing but helpful, enthusiastic and excited to 'share the love'!  I live in Denver, but come down quarterly for business - and will be sure this is added to my 'mandatory store visits'.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-09-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Pgkrz8zoY6zHm6v6iGv-yA', 'review_id': 'D4lZfzH-ijwV1seovcvkhA', 'text': "Nom Nom Nom Nom!  Everything I have tried here has been delicious so you can't really go wrong with any selection.  \n\nI suggest the Dutch crunch bread. I think it really makes the sandwiches something different. My favorite is the Count of Monte Chase-O.\n\nIf you are going during lunch time allot extra time in your schedule.  It gets packed and it will take you forever to get your order.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-09-10', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'XppUO5DnmrGBkwfMh5IoZA', 'review_id': 'vV222vNuHtxM8sDehMACog', 'text': u'The service was amazing from the second we walked in the door. The cashier was a sweet blonde girl who helped us with the daunting menu (there are just so many choices). I only eat gluten-free so it was nice to find a sandwich shop that had that option. The GF bread was one of the best I have had. It was also the same size as the regular sandwich which is not normally the case (most times it is much smaller). My sandwich was delicious (spiffy tiffy) and my fianc\xe9 loved his. They were very accommodating to food allergies and preferences allowing us to change or remove anything we wanted from the sandwiches on the menu. \n\nWe stayed and are there in the fun atmosphere they created. The kitchen crew cheers for orders which was really fun. Then the tables were all brightly colored and each napkin holder had a different handwritten message on it. If you stay to eat in you get a free chips and drink as well. \n\nOverall this was a very good choice for dinner and I would definitely return.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-09-16', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 1, 'cool': 1}, 'user_id': 'LhmB-GJqZfAu7Qou0gMnCA', 'review_id': 'cFr3yYULfMuxJz1FSa_MpQ', 'text': "I saw all the raves on here and I was like gotta try this place. It didn't do it for me. I think there was to much pesto on my sandwich. Plus it fell apart halfway through.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 2, 'date': '2014-09-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '31HE8Q2YNO6PklOVAXb-hg', 'review_id': 'y5meScpuZRTx01HLk3NNdw', 'text': "Great sandwiches and gluten free!   They are great with allergies and have a fun vibe!\n\nThe sandwhich was are delicious and the gluten free bread is thick and sturdy- hoagie style.  No crumbly udi's here!  \n\nOrder with their online app if you are in a hurry.  \n\nWe love it here!   My favorites are the monte chase o and coming home for thanksgiving!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-09-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uaLKzVZZY8B6_u_yfER3nw', 'review_id': 'IGkHxwl35Oa9dBJVUSCZIA', 'text': "I have had this placed bookmarked for a few months and finally stopped in today, I was very excited. The place is nice and clean and is in that area of mesa that underwent the huge revitalization so there is an array of biz's around. Service was acceptable and food came out quick as there weren't more than a few customers. The food was pretty good, I got the big cheese, but by the 2nd half of the sandwich I was kind of over it and took the rest home.\n\nFor the price, like $11 for a sandwich, I would assume hit up Steve's or Neds. Now I can understand where they are coming from with the price, there is a lot that go into their sandwiches, but, you are a sandwich shop and patrons are looking for sandwich shop prices. But, I will be back as so many of their sandwiches look very good and would be happy to bump up to 4-5 stars if the sandwich rocks my world. Me thinks next time I will give the hollywood something or other a whirl.  \n\nPlease note, I would recommend that any and all come in and give em a try.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 3, 'date': '2014-09-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'srDq_YORSSzM6D34CZT7Tw', 'review_id': 'lVBfG4HybKPYLW88nSMAsQ', 'text': "This is my favorite lunch place by far! The sandwiches are creative, full of flavor, and variety, and on top of all that, when I asked for a lettuce wrap...they wrapped the exact same sandwich with lettuce as thick as the bread would have been. They are so friendly and nice. They even stayed late to serve me when I brought my family in one night after going to SunSplash...we were tired and hungry, and the whole staff made it a fun place to be for all of us. We didn't even know we made them stay overtime, until we were leaving. What great people, and amazing food!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-09-24', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 4, 'cool': 4}, 'user_id': 'RlAAn9opjQww-rLW_HSXOw', 'review_id': 'Lhk_KFW6H-8rEOYCeCPWpQ', 'text': 'I\'ve just recently learned of the fabulousness that is Ike\'s Love & Sandwiches, and I am a big fan!  \n\nThis was my first time at the Mesa location. I ordered the Vegan Pilgrim (vegan turkey, cranberry sauce, Sriracha, vegan dirty sauce + lettuce [I omitted the vegan cheese]) on their french roll/bread. I know, I know. That combination makes no sense, right? Wrong! I\'ve learned to leave my inhibitions down the street and around the corner, and to just trust Ike\'s on whatever his board says. It. Was. So. Good!  (1/2 of this sandwich never made it out of my parking space!) Cranberry sauce + Sriracha on a "turkey" sandwich? Who\'d a "thunk"?!\n\nThat\'s mostly what you\'ll find here. An amazing concoction of drool & moan-worthy creations (Meg Ryan/Sally, you ain\'t ready, girl!), surrounded by delicious, homemade bread. Their Dutch Crunch bread is a must try!  They also have a few simple sandwiches, for you retired daredevils. \n\nSupposedly, there are 100 veggie sandwich options, most of which can be veganized. So for all of my fellow vegans, just be sure to tell them to make it vegan. Here\'s a vegan breakdown:\nThey use Daiya for the cheeses, Tofurkey for the vegan turkey, and Gardein for the vegan chicken and meatballs. \nAll of their breads are vegan except for the wheat (it\'s honey wheat). \nThe wasabi mayo is automatically vegan, so no need to request a vegan version. \nThe "Air" fries and tater tots are vegan (and they are baked, not fried).\nTheir Dirty Sauce is not vegan, but they offer a vegan version (it\'s delicious!)\nTheir purple coleslaw is vegan.\nThere\'s a vegan french dressing and BBQ sauce.\n\nNot vegan: \nTheir pesto, honey mustard sauce, the fried foods, like onion rings & beer battered zucchini (egg based batter), and the obvious (meats and non-vegan cheeses). \nSun-Devil sauce is NOT vegan & there is no vegan version.\n\nVeggie bacon is vegetarian; not vegan.\n\nThey have gluten-free options. \n\nThe girl helping me out was super nice and knowledgeable about their vegan menu. I had a question about the french dressing, and she had a handy-dandy cheat sheet which she used to confirm that it is vegan (or they have a vegan option; I didn\'t clarify).\n\nMost of the sandwiches are @ $10, but they are big enough to either share or save 1/2 for another day. They offer chips (most of which are vegan too; just avoid the Salt & Vinegar and the BBQ Ranch), bottled and fountain drinks. Nice sized location with plenty of tables and booths inside. There are only a couple of tables outside. It shares a big parking lot with other establishments, so there is plenty of parking.  Located about 3 lights north of US 60, off of the Alma School exit, on the east side of the street (opposite side of the street from the Fiesta Mall). \n\nIke\'s is like the Lady Gaga of sandwiches: extravagant, daring, and shockingly good. I can\'t wait to go back.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-09-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'H2m6hhaHzeOBowwMVFwsCA', 'review_id': '9b2UQ634zmb6tocDF5SEHQ', 'text': 'Amazing food! The subs are huge and very tasty. The atmosphere is cool and the employees are very friendly. I will definitely come back but I will definitely will have to share the sub next time.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-09-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'EA5JiRv7RocRiKFTaCUHCw', 'review_id': 'a4gNUgYaOZhjoOhiyk3RQw', 'text': 'Overrated. I had been told these sandwiches were "heaven in food form." Not the case.. Don\'t get me wrong, they\'re pretty good, but I was severely disappointed. The menage a toi Ike\'s is famous for was drenched in sauce and just messy. I\'m glad I went alone cuz I guarantee that I wasn\'t pretty eating it lol. Also, kind of weird how narcissistic this Ike man is. Trying to make a brand for himself with his face plastered on the wall, but it is all a little much and the whole rags to riches thing is irrelevant.. I\'m here for a sandwich, not your life story and an unmade bow tie, so random. Service was great tho! I really liked everyone working there.\n\nTAKEAWAY: I am definitely going to go back and try something new, but as for now, this place is def overrated and overpriced.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2014-10-01', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'OImSGW63iMcuZVvsVV1t6A', 'review_id': 'GaLnoXXcExYftblAVJ7bKA', 'text': "For the price of the sandwich, where's the beef? I'm being freakin serious here!  All bread, toppings and minimum amount of protein. I made a better sandwich when I was 12 . Unacceptable!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 2, 'date': '2014-10-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uaLKzVZZY8B6_u_yfER3nw', 'review_id': 'RvzU-ttWImQGj7VdO1v5pw', 'text': "Alright so I went back for round two and I'm holding strong at 3 stars. The place really is a 4 star experience, but given all the hype, it only registers as 3 stars grading on the curve. I tried the Spiffy Tiffy and again, I was over it before I was finished with the first half. And it's not one of those cases where it's just soooo filling, because when that's the case, you feel stuffed and I'm done with the sandwich and not at all stuffed. I will be back because both sandwiches had the chicken and I want to try one with another kind of meat. I will update once again at that point.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 3, 'date': '2014-10-02', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'fKkwVusPmVSjFTZoQ_3MhQ', 'review_id': 'wV2Z7FwsLLdSTc8H2Fs4AA', 'text': 'Huge selection something for everyone. Honestly best sandwich I have ever had. Slightly expensive but worth\nIt!!', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-10-06', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'dGabYPnZ-iDaxPy0vnvL6A', 'review_id': 'VcPzz-W_1MlGEAH3xiEdZg', 'text': "These guys have got to get it together.   Called in my order around 11:10 was told to be there by 11:35.  I showed up at about 11:30.  The staff had zero idea what was going on.  I saw this poor staff member visit this lady and 4 kids at least a handful of times.  Apparently, they gave my sandwiches or something.. I was confused myself watching this all go down.  \n\nFinally, at 12:00 I got my sandwiches mind you it was myself, one other take out order and the lady with the 4 kids in the restaurant.  I got a Bella on dutch bread, it was pretty good.  But, like other reviewers said the filling to bread ratio was off.  Sandwiches were large but mostly bread so I'm not understanding why these sandwich costs so much.  I am always turned off by restaurants that have overcomplicated menus and found the descriptions a little vague for first timers.  I do like the unusual selection.  Maybe I'll try another location until these guys can get it together... or skip it all together and hit up Capriottis.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 2, 'date': '2014-10-09', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 3, 'cool': 2}, 'user_id': 'VoZuLghidkh0LFHgvBMVDg', 'review_id': 'x5kJ208M3RCnutSMq3IQJg', 'text': 'Holy cow...if anyone likes a good Sandwhich def come to this joint....great selection with a different special every week, great slection of chips and amazing service...after about 10 min of deciding, I went with the "Vernon Davis" while my friend went with "The Bella" ...went 1/2 and 1/2...they were UNREAL...prices nothing crazy but definitely not cheap...regardless some of the best sammies I\'ve ever had !!', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-10-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ILp4fcWjdOV38qPCvOpybw', 'review_id': 'gJgbiDyZmL7YZ0jTp0IfAg', 'text': 'Great Sandwich. First time visit and it was worth the drive. If you want a great tasting sandwich make the trip you will not be sorry.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2014-10-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'iWS1RgAsXBYEOV_0Gtkf6w', 'review_id': 'yehhUKDDGmqF17tGupoBeg', 'text': "The food is good. However, the service is super slow. they lose a lot of business because they can't  manage the lunch rush.  I  have visited several times and every time its the same thing.  Expect your order to take forever I can't say it enough.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 1, 'date': '2014-10-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'uaLKzVZZY8B6_u_yfER3nw', 'review_id': 'XzqsJy8bXbi0qCd1z4_HAw', 'text': 'Alright, my final verdict is in after my third visit here. I remain at three stars and here is why:\n(1) The food has left a funky after taste each time I have been here and a somewhat funky feeling in my stomach. Now I\'m not claiming it has made me sick, just feeling a little weird, like I ate some of Aunt Carrol\'s Christmas surprise casserole and just knew I felt different afterwards.\n(2) 12 doll hairs for one sandwich, no chips, no drink, just the sandwich. 12 doll hairs is good for a decent steak, two sides, bread and peanuts at Texas Roadhouse.  \n(3) This doesn\'t really equate in the rating but I sure notice it each time  and that is the most absurd logo I have ever seen, to the point of annoyance. Some fat bald head with this shitty grin and sole patch to boot, starring at you, I would have hired an actual professional when conceptualizing that one. I can totally picture the formation of the idea..."I want my giant grill to be plastered all over to be associated for the good of sandwich kind every where..."\n(4) The chips are nasty\n(5) The dutch crunch bread is kind of odd, I will try another bread if I ever come back, not all its cracked up to be\n\nThe latest sandwich I had was the Pat Tillman and I would certainly prefer it over the other two I have had. I also tried out the dirty sauce this time and while it seemed pleasant enough, I believe it compounded the a fore mentioned funky after taste quite a bit.     \n\nAll in all, not a bad sandwich (minus the after taste) but I can\'t really see myself coming here on a regular basis. However, I would not hesitate to bring someone here that may be visiting and has never had it before so the can experience the fat bald head for themselves oh and the sandwiches.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 3, 'date': '2014-10-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'jHrsgGL5hLfO2kxvMbEicA', 'review_id': '_sMUdUYU595Gnz1qwcpE3w', 'text': u'Great friendly service and delicious sandwiches . Jalape\xf1o poppers was really good as well. We will come back. :)', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-10-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LI17PZdJ67frvVdCNJkvYQ', 'review_id': 'AD55k4HQn_aE9-OBae5R_A', 'text': 'I desperately wish that I could like Ike\'s, I mean it looks amazing right? (I still think everything here looks amazing) \n\nI came here on a weekday night and basically spent a good 8 minutes looking at the menu (although I already spent almost a half hour at home looking at it), and finally decided to go with the a special of the day. I can\'t specifically remember the name but it was something like " Holly would I don\'t" I believe and had steak, mozzarella sticks, dirty sauce, and a plethora of other miscellaneous ingredients. I got it on Dutch crunch bread as others had suggested and got it with their chips. This is where it went a little downhill, it might have been my fault because I waited until I got home to eat it, but I thought the bread was just awful. It was weirdly doughy an nearly inedible (again, if might have been my fault), and I was still greatly looking forward to the inside until I realized that the ingredients themselves all sounded and were delicious, but as a whole, the sandwich was just, awkward I guess. It just tasted like I was eating a steak and a mozzarella stick. That is not something I want to pay $15 for. \n\nIt might have been because I made a poor choice of sandwich, but I\'m not yet sold on Ike\'s. \n\nPros\n- amazing service, the guy working was super amicable and fun to talk to while I was waiting for my sandwich\n- great chips (they make their own)\n- fun and relaxed ambience\n- giant sandwiches\n- lots of variety \n\nCons\n- expensive\n- bread was awful\n- lots of variety (quantity over quality seems pretty appropriate here)', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 3, 'date': '2014-10-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'hXA-SSp0qMdohIKl8dUuWQ', 'review_id': 'HwRXj8CNNj4Q8TJc3N7nTw', 'text': "I love food. I really love sandwiches. I  have lived in some great places with exceptional food and I  can honestly say that the Pilgrim might just be the best sandwich I've ever eaten. That's a pretty bold claim to make considering I've eaten at some legendary sandwich institutions throughout the U.S. But I feel comfortable saying it.\n\nIt's that friggin good.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-10-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': 'yulij51YrVbH07--dF-ZCQ', 'review_id': 'kjQ_Q4sTzDt4jp497m6-vA', 'text': "Found this place for lunch, and the name doesn't lie, I am in LOVE!\n\nThe sandwiches are giant - I could only eat half! so many different varieties and options, and tons of gluten free or vegan options as well. \n\nI had the Barry Bonds and then suped it up with the smoked Gouda, avocado, lettuce, red onion, and Dijon mustard. Delicious.\n\nOnly thing I would change is to have more seating in the restaurant - the kitchen to seating ratio is like 4 to 1... kind of ridiculous. But I will definitely be back!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-10-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oAXcmwT2guuyNE9mDOsI7Q', 'review_id': '_i84Bsk5qa4C2XGcD7hSCw', 'text': 'The sandwiches are delicious from here, good decent size, but they are overpriced and there are not any gluten free options. \n\n$18 for 2 sandwiches with no side or beverage is a little much...\n\nI did however like how you can customize your sandwich and the cashier rolls through every option possible on it. \n\n3 stars. But definitely no more.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 3, 'date': '2014-11-06', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 0, 'cool': 0}, 'user_id': 'HooHqXan0HTzUzG7rfDswQ', 'review_id': 'pwa7bimLMG8cZgmVxllBBA', 'text': "We used to go to Ike's alllllll the time when we lived in San Jose, and so when my boyfriend and I found this place here in Mesa, we were beyond excited.\n\nBut these sandwiches were DISGUSTING!\n\nYour Dutch Crunch tasted stale and chalky. \nYour meats were dry and pastey.\nAnd your condiments and sauce--which had made you taste so heavenly--were not even in our sandwiches!\n\nWe were soooo disappointed and felt soooo ripped off after eating here. Sorry Ike, we will never eat with you again, the love is gone :(", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 1, 'date': '2014-11-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7FhH6XuNmMS8YD6eBuUVRw', 'review_id': 'CsLnr-aEj0uVbSlXBJ5THw', 'text': "I have eaten here once. Had great  customer service, endless options and food was SOOOOO good but WAY overpriced. 2 sandwiches for over $20 without a drink or side. No thanks. Probably won't come here again for a while which is a shame.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 3, 'date': '2014-11-10', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'Ko3ghn8FUhGuBvzLOQe3HA', 'review_id': 'FmT-WkGL_5kAp57zVhzLnw', 'text': "Put the Matt Cain in your mouth. Dutch crunch bread. Trust me.  Put the thunderbird in your mouth. Dutch crunch bread. Listen to me. I love Ike's. I love that love and sandwiches from the bay have made it to Arizona. The service is always good. You could easily share a sandwich with someone because they're big. But why would you want to? When you can save the other half for later? They can be a bit messy to eat. But that's what napkins and washing your hands are for. So good. Also, you get a Carmel apple sucker with your meal. Delightful. Ooooh, and try the voodoo chips. Put Ike's in your mouth.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-11-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': 'Eo4glRILa41mOYt4guDbsg', 'review_id': 'yU0UJVcs7aA2kEw8kRxhYA', 'text': "Customer service is on point. Best Damn gluten free sub bread I've ever put in my mouth. First time here... definitely coming back and bringing the family with.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-11-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'AfOK2cpS34jil4MARjLijw', 'review_id': 'RkIngwQjUmhsaB-GLhHS2A', 'text': "My husband and I went here for lunch one Saturday.  He kept going on about how good it was and I was skeptical at best because I'm not a sandwich person. \n\nBoy, was I wrong. \n\nThis place is amazing. I'm a picky eater and had a lot of questions. The staff answered them eagerly and happily. I got the number 11 and it was the best sandwich I've ever had. Good food. Place was clean and welcoming. Staff was very helpful and even bagged my stuff up for me when I asked for a box. \n\nTwo thumbs up, will definitely be coming here again!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-11-22', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'xWdYIUGlQqmJPGq1ahwHmA', 'review_id': 'Psi5o8iaCjOVQXU8H6mtRg', 'text': "First of all, idk how I didn't know about this place until now, the sandwiches are AMAZING! I absolutely enjoy the food here and not to mention getting full of eating only half of a sandwich and always take the other half and eat it later. The dirty mayo based sauce they have on their sandwiches is so good I even ask them to give me some in a little container to add to the sandwiches I make at home, the staff are nice and friendly and good service :) and all chicken is halal which is a plus ;)", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-11-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'w2Y8-Qb5PaMKPmKmBO2r7A', 'review_id': 'ObSd8CVs379dvwrzXhEzpg', 'text': "Really large menu and amazing yummy large sandwiches - wish I could eat these every day! You should definitely try it if you're reading this and on the fence - worth your time!!!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-12-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'gzsU6Co1FmjuSpWF6svzaQ', 'review_id': 'SgVuLb8FWaj5JGXCPFl2uw', 'text': 'I chose this location based on previous yelp reviews on a trip to Phoenix.\n\nOverall I think it was okay.  Lots of hype about the Dutch crunch bread - tasted like crunchy stale bread to me...not a fan.  \n\nAlthough the redeeming quality of the place was definitely the uniqueness of sandwich options as well as the ingredients in the sandwich. I thought the dirty sauce was quite delicious.  I had the "Adam Richman" sandwich which included chicken, ham, honey, pesto, avocado and Swiss cheese.  I was a little apprehensive at first but based on the employee\'s suggestion I went with it and was pleasantly surprised.  \n\nI also thought the service was excellent!', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2014-12-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Zni2fOUdef2NmqodjPkN9A', 'review_id': 'oiNuSYLzy9zzbaCSjuZxZA', 'text': "Ike's Place- Out of this world sandwiches! They have over 1000 sandwiches and so it is a bit overwhelming. However, you literally cant go wrong with any of them! My buddy Keith recommended this place to us and we thought it was only in San Fran. Come to find out it is in our backyard and we could never be more happy!\n\n- Bear Hug: Bacon, extra dirty sauce, Mushrooms, Stuffed Jalapeno Poppers, Thinly Sliced Rib Eye Steak \n***It has a little bit of spice, tons of flavor. Not my favorite but certainly worth the try. You love it!***\n\n- The Count of Monte Chase-o: Ham, Strawberry Preserves, Swiss, Turkey . ***Okay this one might be my favorite!! It's a little less calories then most and the flavors are unreal! The preserves absolutely makes this sandwich!!! THIS IS A MUST!! My new favorite!!!\n\n- Tony Soprano- Ham, Italian Dressing, Provolone, Salami, Turkey ***This one is okay to me. Now when I say okay, I mean it's better than most Italian sandwiches and so if you like Italian than you will love this. Make sure to get the crunch roll :) ***\n\nAdam Richman- Avocado, Fried Chicken, Ham, Pesto, Real Honey, Swiss ***Okay my wife dreams about two things, ME and this sandwich. It's unreal!! All the flavors compliment each other and it's so amazing!  This is a MUST and we recommend you get this out of them all. It will not disappoint! Get this on their crunch roll***", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-12-11', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'KUHG6oDAI0oiep1-Sc5PHw', 'review_id': 'hKwrdDtRFqwG_eXY6hwY0A', 'text': "This is quite possibly my new favorite sandwich shop. We were recommended here by my brother in law and we were not disappointed! Their menu took up one wall, with so many choices we didn't know where to start. One of the guys working there could see we were struggling so he came right over and gave us some recommendations. I had the bella and it was absolutely amazing! The chips were delicious, some odd flavors but very good. Between the friendly service, crazy amount of options, and delicious food we will definately be back!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-12-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'Y_nk4KhoHlkd1WRKCfIhuA', 'review_id': '0B6Jx3K6-rigOf2llzSBgg', 'text': 'In Mesa today shopping for Christmas present. Lunch time. Made a call to my son. He does a lot of driving and knows a lot of good places to eat in this area. \nMy wife and I got sandwiches and enjoyed them. Very friendly staff.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2014-12-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'jbUWb4oTAQDqDaMk28BFZw', 'review_id': 'BjKUuuNkjCQKiiqoSVbRyQ', 'text': "Food is awesome, one the best sandwiches I've ever had. The service is awesome as well. Why four stars you ask. The music. It's too loud, and it's unedited (which is mildly unprofessional, because who wants to hear f-bombs while they're eating WITH THEIR KIDS) Other than that it's amazing, just think twice about bringing the kids with. Worth a shot.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2014-12-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cQFTsron5jajmDfSApCaHQ', 'review_id': 'w5nwDANd9-kuc_Z-iA6Wxg', 'text': 'Deffinetly Love BEFORE sandwiches! The staff was awesome,the food was on point and I will be returning. Also has an amazing vegetarian menu. Make sure to have some time on your hands because the menu is quite lenghthy but A LOT of great choices.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2014-12-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'HzUuqEoC5H5SkRZud0WeSA', 'review_id': 'gBY8uqze7gQuN5-2TBOjlw', 'text': "Pretty tasty! Sandwiches are huge! Can be easily spilt. The pricing is ridiculously high for sandwiches so I'm giving it a 4.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2014-12-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LI17PZdJ67frvVdCNJkvYQ', 'review_id': 'sgC1zVu8OaXs-97AkPl9BA', 'text': "I came here again hoping for a better experience than before and was sadly mistaken. I made the mistake of ordering the dutch crunch bread which both my sister and I agreed was not good. It is very doughy (almost floury) and has no flavor. The sandwich I got had salami, turkey, dirty sauce, cheese, and roast beef in it and my sisters had mushrooms, steak, and cheese.it looked delicious, but the same as before, the flavors just weren't right. The ingredients themselves are fresh and delicious but the flavors don't meld together correctly. \n\nThe voodoo chips were also a let down. I expected them to have very robust vinegar and barbecue flavors but there was not. \n\nI want to like this place but it is overrated and overpriced. The three stars are for service and that my sister seemed to like her sandwich", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 3, 'date': '2014-12-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'EPRsyblhYfDZW6FlCRrUbw', 'review_id': 'IyGr0j3R77C43MVHNfghjw', 'text': 'I passed three sub shops to try Ike\'s out.  I was excited to try a local small shop sub.  Sadly I feel let down.  \n\nThe counter girl was very friendly.  A large selection of subs.  I got the Pee Wee..  Vegetarian turkey, coleslaw etc..  on their signature bread.  The sandwhich cost 9.50.  I thought, "this is going to be great!"  Umm. I wasn\'t  a fan of the bread.  Kinda day oldish to me.  I could have got over that, but the fact that my sandwitch tasted like lettuce, bread and a bit of a tang that reminded me of garlic.  I got one stinkin peice of faux turkey for over 9 bucks!?!  It could have been omitted and I wouldn\'t have noticed.  I was expecting more of a California club, or something along that line.  The sandwich is big.  I ate 1/2, but if it were good, I would have scarfed it all.  Sad...\n\nI gave them a 3 cause the girl was so friendly.  \nA 2 on the sub due to my value perception.\nI actually thought as I was eating that maybe I got the wrong sub?\n\nHmmm. Update...  I think it was the wrong sub.  I didn\'t have any cheese on it.  The Pee Wee has Swiss...??    Epic Fail...', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 3, 'date': '2014-12-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'TToLEHzLe4pGvzk7-K9bRg', 'review_id': 'raIXSFM_7YvxzwgbE2rmoA', 'text': "Amazing (as always). We were trilled to find an Ike's in AZ.  That said, it somewhat cheapens the experience when you don't wait in line for an hour and then hurriedly eat your sandwich on the sidewalk.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2014-12-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jWpbwcHxQtggzIISVmDGvg', 'review_id': 'aMpRwieMjZlC3F_m_y32mQ', 'text': "Hate to have to update my review like this, but the past TWO times I've eaten here, I've gotten violently ill immediately afterwards. Ikes hates me!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 1, 'date': '2015-01-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'jv3OLWZotGJt3__ABfhBkg', 'review_id': 'g6gKWE8D9FKKJtoddfnTYA', 'text': "I really need to try some other sandwiches that they offer but the Paul Reuben's is insanely good!!! Gotta have it on the Dutch Crunch bread.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-01-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '0IlHu_RTnT2OfEs1WSj66A', 'review_id': 'x3g8lDB3m2mdPt0AB4Mr3A', 'text': "What a great sandwich shop! I love the vibration and I love the menu, they have a ton of different options for meat eaters, vegetarians, and vegans alike.  The staff is super friendly and helpful.... I can't wait to come back and try a different sandwich option!!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-01-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ugCNsS4G4cUV9f1xc4sBuA', 'review_id': 'Qj3Irk-f68rSs7ItwgD3pQ', 'text': 'My friends and I drive all the way out from Glendale to gobble these sandwiches. Besides the superb flavor, the manager Tucker always provides unparalleled service. Highly recommended!', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-01-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QrdV9aHFvRAvVO8ut6n46A', 'review_id': 'TJaicBLlKTllVZvygmA6Pg', 'text': 'Very tasty sandwiches, but they are huge.  The service was great, the guy behind the counter helped guide me through the menu which is also huge.  I was impressed and will return', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2015-01-20', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 1}, 'user_id': 'KSTOdz0lSFCkqBSRNwjERA', 'review_id': 'F9ZsJCACBP4TM9txl6pRuA', 'text': "I've finally tried Ike's & I agree with the hype! I'm definitely a fan! \n\nI have been eyeing this place for quite a while but am 1) hardly in this area 2) if I am in this vicinity, it's hard to steer the BF away from Cheba Hut...but finally, I found myself driving up Alma School yesterday, BF-less, scoping out a place to grab lunch & decided on Ike's. \n\nUpon first glance, I was in a bit of sticker shock with their sandwiches in the $10 price range. But since I was already inside the store, they already had my complete buy in. The menu is very extensive which I liked because I love given variety. But since this is my first visit I thought I'd start with a simpler sandwich and opt to be daring on my next trip (if there is a next trip). I went with the Bella on Dutch Crunch Bread - Yelp's review highlights helped me decide. Although the gentlemen behind the register was very helpful with suggestions. \n\nWhile waiting, I heard a man at a nearby table ask one of the ladies to wrap up his other half of the sandwich to go because it was too large and he couldn't finish it. Okay, he was a pretty large fellow who I would assume could finish a whole sandwich for lunch (Yes, I totally judge him. Sorry, not sorry) so I began to wonder just how large these sandwiches really were. 5 minutes later, I received a brown bag to go with a ginormous sandwich! It was huge! Suitable for 2 people and totally justified the $10 price tag.\n\nI was only able to finish half. The bread was nice and toasty. The chicken was thinly sliced and lightly dressed with honey mustard. The creamy avocado went perfectly with it. I saved half for the BF and he ate it this morning - heated up in the toaster oven to get the bread crispy again. We both liked it a lot. He said it was really good and that he wouldn't turn down my suggestions for Ike's next time!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2015-01-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ssS0BitX8BP0PL-vYHStiw', 'review_id': 'HNbUtrnhsCtQl-K7xBsafw', 'text': 'So, so good! I crave it almost weekly. Great service and sandwiches. What more do you need?', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-01-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LeAc4oAr9l3cF42If1ZCZg', 'review_id': 'Hu9vV2BzxYocu2J58-tsWQ', 'text': 'A bit pricey for a sandwich but at the same time I had great service and the menu is HUGE. Staff was very friendly from the second I walked in and even helped me decide what to get. The onion rings were awesome.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2015-02-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'RL3iE-i6DYASMJl0SCGn4Q', 'review_id': 'd8aZA5s1SniE49ZjYBujwA', 'text': 'I\'ve been to this location half dozen times and no matter what I order it is great. It is clean and the employees are always nice. My favorite sandwich to order is the "Menajahtwa".', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-02-15', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 7, 'cool': 8}, 'user_id': 'wLuDGMXytNVTF8ZU2gwUEQ', 'review_id': 'kuTtTKJwV8aIMY3APx_eQw', 'text': u"Ok, not to sound clich\xe9, but Ike's really is the BOMB.COM\n\nThink of any other sandwich shop you've ever been to....ok, got it? Well, Ike's is NOTHING like whatever you're thinking right now...for realzzzz!!! This place will blow your mind. They literally have HUNDREDSof hot sandwiches to chose from (go online, you will see that each location will make a specific bunch of sandwiches, but each restaurant is ready to make whatever you want, from whatever other Ike's you might want) \n\nSo, not only do you have your pick of delicious hot sandwiches, but, you even get your pick of breads! They offer like 5 different options, including gluten free. Speaking of gluten free, if you are intolerant or celiac, they will ask you because they will arrange a special sandwich making station so that there is no cross-contamination. Very caring company! They even have dozens of vegetarian and vegan options...their vegan meatball is, hands down, better than the real thing. \n\nYou will never get board here, and these puppies will definitely fill you up! Whenever we go get one, this is all my husband and I will eat all day; so filling. I have officially kissed all other sandwich restaurants goodbye!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-02-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'WmldRvl1nKxuKM6weiO6fQ', 'review_id': 'EZBMBdZPaOYrhZP8dkmPXA', 'text': "We really love Ike's massive selection of sandwiches! They have more sandwiches than any five sandwich shops combined and if you don't see what you want then just ask, chances are that they can make it for you. Be sure to try your sandwich on their Dutch Crunch bread, it's wonderfully different.\n\nI personally am fond of the Count of Monte Chase-o nomnomnom.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2015-02-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ByvUBt6XfjeAt-hCYXhO3A', 'review_id': 'aldmonXUr1t3nwPNaah-CQ', 'text': "I had the Michael Jordan and Mozzarella sticks. The Michael Jordan (meatball sub) was very tasty! The Mozzarella sticks were also great but they were $4 for 4 sticks that weren't all that big. Overall very good meal.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-02-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'LwfP-eD5RvdxR2Upr6ReOw', 'review_id': 'VL17sJf2q3HKuGGRq48cwQ', 'text': "Was a regular when living in Mesa.  Best sandwiches ever.  Gluten free bread is amazing.  They also have vegan cheese.  The sandwiches do get a little greasy, at least the Tony Soprano that I usually get--could just be the dressing on that one.  I'm not a huge candy guy but the free caramel apple pop dessert is a nice touch too.  And nice to get a free bag of chips during 4-7pm happy hour--the onion ones are GF and delish.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-02-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 3}, 'user_id': 'n-2gSytw4x3Q_rbweZnfuQ', 'review_id': 'tWDY_nG5i_3tjI7vPGeQTg', 'text': "Ike's has like 200 different subs to choose from. And the prices range from $5 to $26. Honestly, this might be the best sandwich I've had. One of the store bosses, Chase, was kind enough to hook me up with a free sandwich for my first visit. I went with the Damon Bruce. I'm hooked. \n\nP.S. - They run a daily happy hour in which you get FREE chips and a drink with your sandwich.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-02-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'UC1DS4CUE-qkuwryyDP_Ug', 'review_id': 'iliGJv92YtEDu_jCe2iUBA', 'text': "The best sandwich shop around. I love a good sandwich and it does not get better than the Thunderbird with Dutch Crunch bread. If you like your food a lil spicy try it and you'll be plenty happy.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-02-19', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'UNIPxnKpzAbL4iSIXSQ31g', 'review_id': 'zM2_PgvJWHehjZTKOZ3LFQ', 'text': 'Been here twice now and I will be a regular for sure! Their sandwiches are huge and messy.  They have 50-some sandwiches on the menu here. (I am told there are over 400 sandwiches if you combine the menu from every location, and they will make any of these sandwiches on request.) A whole sandwich is too much food for one setting, but they taste so good you will eat it anyway! They play really cool 90s music and from 3-7 everyday you get a free combo meal for the price of your sandwich.  Hell yes!', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-02-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '5XsEhAUwjTvExnq3vB8bOQ', 'review_id': 'SSF6qfZw5HLQyJAuVGRViw', 'text': 'Amazing place with great vegan options as well as gluten free! I had the meatless mike with vegan meatballs - amazing !!!', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-02-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4BPzwhjg2tXLi_ZFCTEwCA', 'review_id': 'cwV7zNPWMxhTh-SGCYvdiA', 'text': "I'm in love with Adam Richman--The SANDWICH, I mean.  My wife and I have never had a bad experience here.  Their Gluten-Free Bread is probably the best I've had.  It would be nice if they had vegan chicken that was gluten free, but that's about it when it comes to downsides on this place.  If you're in the mood for a sandwich, go to Ike's.  They've got hundreds of options.  The staff is always fun, happy, and helpful.  The tables and booths are pretty clean.  The sandwiches are well worth the price you pay.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-02-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'gDeP97Byv5Jstac7ovMxAA', 'review_id': 'DXjQ0yuMftAI6pIp0Rghrg', 'text': '201. Adam Richman -  amazing sandwich. Fried chicken, ham, honey, pesto, avocado and Swiss. \n\nDefinitely will be back. Nice break from the other basic sandwich spots.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-02-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'FBFxnDCQ0IEKqARAtWFPFg', 'review_id': '5Iv_5pVtNe_d04WedIa6yw', 'text': "I know it's gonna be a great place when I'm waiting in line and enjoy one of the best playlists just bringing back memories. The atmosphere was just completely chilled out and happy. \n\nI ordered a Adam Richman sandwich and was overjoyed with flavor. Who knew the mixture of honey and pesto would make me elated to be eating there. I can't wait to go back.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-03-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'xqDN0Y96vyRHU1T_aZ-koQ', 'review_id': 'zu24eI-NT5TOtcqBPZ6J7Q', 'text': 'A lot of sandwich to choose. They taste pretty good. A bit too much on the sauce they use but still tasty.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2015-03-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'nOe79DtI-xnPrCSg_aUA1g', 'review_id': 'PXo368Gxr42_hCeyYEUQKA', 'text': '"AmazeBalls!" Extremely friendly staff, very unique sandwiches, both hot and cold, as well as vegetarian and nonvegetarian creations.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-03-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'mtahmh04TPRUNeRRGZJGAQ', 'review_id': 'eptp0-ISuAIL7IQoco8f_w', 'text': "Unique joint. Great food. Big portions. I hate writing reviews. Stop reading this and just eat here for crap's sake.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-03-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '9_qLgJg0DUqhctUwdK7vZA', 'review_id': '1fPzAjSZdHXYPaPpbKytow', 'text': "This place is among my favorites as far as sandwich places are concerned. They have about 30+ sandwiches to choose from but you're free to come up with your own combo as well. They have free chips and drinks during happy hour. The only reason I'm giving it a 4 out of 5 stars is because of the music choices, which is primarily rap and hip hop. I really hate to be narrow minded but I'm really not a fan of those genres. With that being said, the music won't deter me from sitting down and shoving a delicious sandwich in my face. My favorite one is the Paul Ruebens with lettuce, tomato and add provolone.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2015-03-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'ZaTgE6iSisWKUtTdAaET1w', 'review_id': 'cAKbP2xTaVrcB600rB35Zw', 'text': "As far as a sandwich shop this is probably the best I've ever had The staff is extremely friendly. The food was quick in arriving at our table.  We just tried it because it was close to our hotel. Make sure you come here if you ever get a chance.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-03-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'TBNwfMReiTZb_r1RV_Sxfw', 'review_id': 'QyIWYiRPzg3rXpBX7zonKw', 'text': u"BEST SANDWICH EVER! My Matt Cain with jalape\xf1os and banana peppers was delicious. I'll be sure to trek out here sometime for another meal, and I'll be sure to bring anyone I'm with.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-03-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 3}, 'user_id': 'Ty1kaetZdgTJHfgNCTic2g', 'review_id': 'Zn0A1dFphbzoGSclzUT4bQ', 'text': 'I was in the area and wanted to find a place to eat lunch that was quick. This was close to my hotel and had great reviews so thought I\'d check it out. IT"S SO GOOD!\nI love all the options and the dutch crunch bread is phenomenal.\nThe sandwiches are pretty big (I couldn\'t finish mine) but I thought it was cute to get a blow pop with it. I don\'t remember what sandwich I got (something with turkey) I got but they put the special sauce (sorry I don\'t remember what it\'s called exactly) on it and even though I\'m not big into sauces on my sandwiches this was really good. \n\nReasonable prices, friendly staff, and a good sandwich. I\'d definitely come here again if I was near one.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-04-02', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 1}, 'user_id': 'YZcxfBoPxaFyPsnjKEjXMg', 'review_id': 'tfHS5PvvlAvsZudP23cV0A', 'text': 'Hey guys. Today was my 3rd time in the shop. I\'m really bummed out. Every visit, I\'ve ordered the Barry B. with avocado. "We call it the 786..it\'s just the Barry B. with avocado. It saves you a couple cents" is what you all say. I appreciate you looking out for me, except for the fact that I\'ve received avocado on my sando 0/3x. I used to work at Bunk sandwiches in Oregon; I know what it\'s like to work at a sandwich shop, so regardless of service, I tip $2.00 per sandwich..so c\'mon. For the love of god, please put avocado on my fkn sandwich because I\'m paying for it :( :( :(   you\'re killing me.\n\nOther than that, this place is decent. Pricey, but understandable for a gourmet sandwich joint.\n\nIke\'s NO love and sandwiches :(', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 3, 'date': '2015-04-02', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'RuO9DesV-RqGIfohjXErrA', 'review_id': 'r_EiKUhCAGcoCU5cdzeG8w', 'text': 'This place continues to amaze me. Not your same ol sandwich shop. Packed with flavor! A little pricey but by far worth it.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-04-03', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'Azpjds8tdopH1kYoJWRjLQ', 'review_id': 'B_0eBc19UBgd6jDi5jDKYw', 'text': "This is the worst nasty expensive sandwich ever. \nI believe Ike's pay a service to give them a five star review when they open up at their stores. \nToo much dirty sauce on everything.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 1, 'date': '2015-04-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'rvp11R5CWg0ZKH3O2CiV7A', 'review_id': 'lZpTGUd_M_NzX59x3xJ26A', 'text': 'I always love Ikes and happen to be a veteran visiting from California. I must say, the staff is friendly and the music is great. Food is up to par with all other Ikes locations I\'ve been to (key to a good restaurant), and the spread of Ikes has just added guilty pleasure locations in all the right places.\n\nFor anyone who complains that there is too much dirty, are you amateur eaters? When ordering they ask "would you like dirty?" There are three ways to answer that:\n\n"Yes"\n"Yes, but not too much" ( they put half the normal amount."\n"No"\n\nIf that\'s too difficult for you, maybe you should let someone else order for you. Not fair to such an amazing place that people leave one star reviews for something that they can easily fix.\n\nNow all you had to do is figure out how to get Cake Monkey baked goods out to the AZ locations. :)', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-04-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'maUtMEgvC87VZvoUMbmDLQ', 'review_id': 'UHgZwBtOVdVtn7SCqPWFZQ', 'text': u"I've been a frequent customer at Ike's so I figured id write a review. This place is very solid for sandwiches, what makes this place unique is the different variety of sandwiches and topping on them. I have had probably. 5 to 6 different sandwiches and the bear hug being my favorite. The staff is nice and friendly and the place is nice and clean. The only drawback is the sandwiches are a little pricey. Now granted this place blows away jimmy johns, subway, or jersey mikes but it's about double the price! Overall if you want something different, try this place cause where else can you get jalape\xf1o poppers, chicken tenders, or mozzarella sticks on a sandwich!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2015-04-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FNAQNtLBuSuFcfYhzPsGsw', 'review_id': 'Wf8-LEvUqbdJK_IwzdQReA', 'text': 'Really good veggie sandwich selection.  Delicious and fresh.  Get the Dutch Crunch bread! Had the I Dream of Jeannie sandwich.  Was very spicy but I like spicy.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-04-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WGO00NiOVbGiCUj2RUi_dg', 'review_id': 'uqqlVo5EsmpoLg2-lEkYqQ', 'text': "Awesome menu! So many choices- and so many vegetarian choices! I almost gave it four stars-- the wait time always seems to be a bit long and it's kind of pricey for a sandwich, so definitely not an everyday place to go. But really good overall.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-04-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fvcJlgQctpZvslpjKYck4Q', 'review_id': 'HhNaCF6bRIc8M2TBh7Nc_A', 'text': "Love love love Ike's. Dutch crust is the best and  with so many different sandwich selection it's hard to choose just one have tried several and I do not have a favorites they were all yummy!!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-04-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'V7DpQeuPmDfX4EY8V8y34Q', 'review_id': 'kvzBUON0tPb-gRpaWWxMHA', 'text': "Thank you goes to two of my co-workers for recommending this hidden gem. I had Jake the snake with Dutch crunch roll bread. Amazingly good!! I can't wait to come back so many choices. I look forward to Ike's sandwiches- by far the best sandwich shop.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-05-06', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'R6OdqGQTtr2aDb-KWqHtxw', 'review_id': 'UIB7didzU1BAtRxCAbsp9Q', 'text': "Bay area based sandwich shop that has expanded into Arizona. I have NEVER been disappointed with anything I've ordered at Ike's Menage a Trois was the first sandwich I tried at the Oakland A's Spring training stadium, then the Damon Bruce, the Paul Reubens, and today's new adventure - the Blocked, with green pesto.\nService is always friendly. Sandwiches take a little while to make, not a quickie Subway sandwich here. The price is significantly higher than a Subway sandwich, but it's quite made up for in taste, size, and quality. The decor is kind of dated, but no biggie. The music is usually blaring 90s and early 2000s R&B...always throwback music that brings back good memories.\nDirty sauce and Dutch Crunch Roll, PHEN OM EN AL!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2015-05-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': '8KBmUXP4gUoGPxNKnHLpjw', 'review_id': '7s4KigFEAEt2vc-Z71t30A', 'text': "Wow! Has the chicken w provolone n honey mustard. Incredibly good. The menu is huge. Vegetarians n vegans will have plenty of choices too along with us carnivores.  S. F. restaurant w fresh baked bread. Can't wait to go back. The staff is very friendly.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-05-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': '1Am0pv3HWphO6QVycWHL1Q', 'review_id': '_LCcRpcwDVmhWXDXTT49AA', 'text': "I looooooove this place.  They have this one with honey and bbq sauce and chicken that is truly divine.  Skip the air fries, they're pale in comparison.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-05-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UGxtR5-KuGLMqoGI0ICxfQ', 'review_id': 'XzTSKDVp7mzBJwX4-eS2Bw', 'text': "I have fallen in love with the options this place has. Try their home made bread with anything and you will love it. Its messy so don't wear something formal!!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-05-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '_tqf06ubO-0TV8rejWV7xA', 'review_id': 'DR-2cHI6fPhH42KjHmm4RQ', 'text': u"I got the m\xe9nage \xe0 trois. It was really good! Didn't really like paying 11 bucks for it though. Place was really clean and staff was friendly. 4stars only because of the price.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2015-05-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Tmg4y_eMW1UzrrRShSLbkw', 'review_id': 'RLr0eJqZ8hNyD9j3RRw_dQ', 'text': "Just found this place. One in Tempe near Mill. One in Mesa near the fiesta Mall. \n\nFantastic!  I have only been twice--in the last two days.  They make their own bread (Dutch crunch).  There are about 500 options.  The onion rings are great. \n\nGood prices. About $10.  Great food.   And they top it off with a free Carmel covered apple sucker.  Nice!\n\nI will update with upcoming visits.  Can't wait!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-06-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'VWwzM35lj4fzPrqiuXGLUw', 'review_id': 'kOHHUK4WTAQccV5YVU75HA', 'text': "I love trying new veggie sandwiches and am always hoping the next one will top the last.  I decided to go with the Favorite Sesame Street Name, or #36.  It started off really good and tasty, but after a few bites, the dirty sauce got to be a bit much.  Overall, the sandwich wasn't bad and I'd probably return, but next time I'd love to try the hilal chicken.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 3, 'date': '2015-06-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'rmbK4XMwu1BMWxD9hLRfcw', 'review_id': 'h_RweyF9HdCSV80N_Hp4Iw', 'text': 'I give four stars only because i said specifically "no cheese" and when i was about half way done with the first half of my XXXtina the sammy fell apart and i realized it was cheesy.  i don\'t even want to attempt to finish the second half.  \n\nmy employer has ordered from here before and everything was delicious so i know they have amazing food.  i\'m just disappointed that my order wasn\'t made as i requested.  \n\ni\'ll give them another chance probably, once i get the slimy cheesy taste out of my mouth.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2015-06-12', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '-HsftTrCwXs3wWCJCm2VwA', 'review_id': 'c-pV9ysQuMGli-im2oUK_Q', 'text': "Was a little scared goin in... hard to choose from 900+ sandwiches and they're all VERY unique. I went with #2 hollywould's SF cheesesteak... man it is huge! Costs about  $10 but its worth it! Could probably feed 2... very flavorful! Not sure what that sauce is but it is good! Definitely gotta try a few more...", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2015-06-23', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 3}, 'user_id': 'XH1sxMHwAnlaJruzaKhpRw', 'review_id': 'w4fTHGc3Uawo6m4Q_5WglA', 'text': 'I would defiantly go here again. Service was great the girl working the counter was helpful and happy, she showed that she truly loved working there. We tried 4 different sandwiches all were tasty. The house "dirty sauce" was an aioli sauce that was do good.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2015-06-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dFt-GoWytqb9G5szuoHxOA', 'review_id': 'FJY_OSevjF8byBn-uwpS8w', 'text': "Paid $26 for two sandwiches and a coke. One for now, one for work. Been reccomended this place a few times. Got the Nacho Boy (roast beef, REAL avocado not some toxic green paste, mushroom and swiss) on sourdough with godfather sauce (closest thing they had to horseradish, according to the man behind the counter.) Sandwich was huge, and one of the messier things I have ever eaten. I have a full beard and already struggle with sandwiches without eating my moustache, and this didn't help. Like I need a shower. Absolutely delicious. I will be returning,  but take my food to go so I don't look like pizza the hut from spaceballs in public.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-06-27', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'u7AFND83xMf3go8FEkSzAQ', 'review_id': 'MGj9x26z3SCCmDOm4FgvNw', 'text': 'My usual sandwich shop was closed for the holiday so I searched for a new place and found this. I was pleasantly surprised. The sandwiches are very big (I got it on Dutch crunch bread) and super good!! I will def be back to try other combinations. I got the soprano with no ham extra salami. It was delicious!! Love finding good sub shops!! Service was great as well!', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-07-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JGCAc1ELELm_P_-FlgX3hA', 'review_id': '9xWeeoL7rI3wBTpblKd0YQ', 'text': u"Sandwiches are my favorite food. Why? Because there are so many possibilities! This place really takes that idea and runs with it.\n\nI arrived here with my family behind a group of about 10. I had read that it takes a long time to get your food here, and I was concerned that with that many people ahead of us, it would be an overly long wait. It actually worked in our favor, because it being our first time, we spend the entire time we were in line staring, gobsmacked, at the wall of options.\n\nI appreciated the friendliness of the employees and their patience as they walked me through half a dozen questions to order my sandwich.\n\nI went with the Dutch crunch, since everyone seems to rave about it. I liked that it kind of reminded me of a giraffe pattern, but I didn't really get the appeal. It was hard, and I ended up peeling half of it away. The halal chicken with a combination of sauces and cheese and onions and jalape\xf1os was still yummy, minus half the bread.\n\nThe great thing is, there are still about 100 more sandwiches to try, so even though I didn't find THE ONE this time, I can try again on another day.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 3, 'date': '2015-07-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'pTqJ1WjV_Fwfxz1fkga1Tw', 'review_id': 'GHMR35HT0AG-qeSQ_lHoEw', 'text': "Our first Ike'a experience was amazing!  I can't wait to go back.  We took the recommendations of the cashier and were super impressed.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-07-05', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 1}, 'user_id': '_wzHfAm3ubS7dSSNQI4srQ', 'review_id': 'L-Hrm8VpJjiNACAsNk1lnQ', 'text': "You are wasting your time reading this review. Your time would be much better spent eating at Ike's. Seriously. Stop reading this and go eat as many Ike's sandwiches as you can. You will not regret it. I have yet to find a less than amazing sandwich on the menu.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-07-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oTdIctmgzlOADJ-t__YswQ', 'review_id': 'EiS15hlvFHbvJdEEnU-fig', 'text': u"This place is the BEST! I was forced to go gluten free about 1 1/2 years ago due to a health condition and I had yet to find anywhere that I could get a good deli sandwich...Until now. Their gluten free bread was fresh, soft on the inside and had a chewy but slightly crusty outside. It had the consistency of good Italian bread. I got a turkey and ham with my favorite toppings and I have to say you would've never known it was gluten free. My husband, who is not gluten free, also ordered the gluten free bread and he got the Bear Hug sandwich and said it was one of the best sandwiches he's ever had. He's a Phoenix native and said the jalepenos were perfect. We also loved the d\xe9cor as we were both teenagers in the early 90's. I'm so glad I only have to drive across Mesa to find an excellent sub.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-07-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'aGZtL-WHR4p1N0WtAd2hPA', 'review_id': '-WbIwN5Nn9SHI6p-a3cqnA', 'text': "I ordered by phone ahead of time because I get a half hour lunch break. The person who took my order was fast, friendly, and knowledgeable. When I arrived, there was a line and I had to stand in it to pay for my sandwich which cost over $11. The line did not move fast and I felt frustrated that there were so few staff members to man the registers and take the orders during lunch rush. I was 15 minutes late coming back to work and was forced to take a 15 minute lunch the next day to make up the time. Needless to say, i won't return to Ike's for lunch during my work week. On the brighter side, the sandwich was a hefty helping and very tasty and satisfying, so it was worth the money; I just wish the service was more tailored to office folks like me.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 3, 'date': '2015-07-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7aUtJeVQ_8z3o5o4on_CdQ', 'review_id': 'dj8tPXehGJQthKlkWqmmKQ', 'text': u"Being from the Bay Area, it is SO hard to find a good sandwich even close to comparable in Arizona, but Ike's, being a San Francisco born company, really hits the mark. It's my little piece of home here and I love it. Their sandwiches are always fresh and always taste amazing. The bear hug is my personal favorite (it's those jalape\xf1o poppers!). Whatever sandwich you get, you must have it on Dutch crunch, and yes, I do mean MUST. The experience without it just isn't the same. I have never had a poor experience here and everyone I recommend to try it or bring here has had nothing but excitement and praise for the food. Way to make this Bay Area girl a little less homesick!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-07-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XRtAsrwaXkvP1J_NwaszOA', 'review_id': 'ad_gdE3aBKESRQXQMekx9Q', 'text': 'Returned again for lunch got same thing number 2 great again , had a friend mis order his food , manager took care of it and returned difference in price of what he ordered and wanted without asking !!!! Tucker is a good dude , try this place out great', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-07-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'mnyjYu0RmEY-GODOMi2dBA', 'review_id': 'l0KDoUHFkgIC0h468T9K7Q', 'text': "Beware the addicting sandwhich's.... But a word of warning go to the store, do not do delivery unless you want a $9 sandwhich to cost $20 with the fees. (And it is a 40 minute delivery wait im literally about .1 miles, so i should have walked there... But its hot)  \n\nSo but seriously their sandwhichs are amazing!!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-07-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Y173HskrGSqrOqHVGqN8ZA', 'review_id': 'oqwrcwwjODyL9fvf7bsVYw', 'text': "The MILF is amazing! Ike himself recommended it to me. If you like Frank's hot sauce and Jalepeno poppers that will be your go-to sandwich. I always add a side of dirty sauce. My hubby and I love Ikes! Good service and good food.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-08-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Mwg-SZMnrFHieSlmPkOdEg', 'review_id': 'qq2ryz3CKb7hk057DOnq9Q', 'text': "I love sandwiches...like LOVE them, so I was really excited to check this place out. I was born and raised in the S.F.bay area and had never heard of Ike's. Sadly I'm not sure what all the fuss is about. It looked and sounded amazing, but myself and my 2 sons were not impressed.  We drove 23 minutes each way, and 3 sandwiches were $32...no drinks or chips. I ordered the Nacho Boy, my oldest got the Adam Richman (I think that's the name), and my youngest got a peanut butter and nutella. None of us finished our food. I maybe ate half of one half before calling it quits. My youngest threw his out after 3 bites of  really hard bread and made himself a nutella and peanut butter on sliced bread, and my oldest who eats everything in sight barely finished half of his. Truly a disappointing lunch. I will say that the decor was fun, the restaurant clean,  and the menu extensive. If someone insisted on eating at Ike's, I might try something else, but I wouldn't go out of my way to eat there.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 2, 'date': '2015-08-02', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 5, 'cool': 3}, 'user_id': 'zbUChk1u3J2A3WPKti3aVg', 'review_id': '5k0OtsaQhGPUb178cnU9Vg', 'text': u'"\'This ain\'t your mamas sandwich", yup that\'s for sure. \nIke where have you Been all my life?!\n\nSub\'s are huge, unique fillings, fresh and delish. One sub can feed two people. \n\nI ordered the Bear Hug $12.31: Thin sliced steak, jalape\xf1o poppers, jalape\xf1o, mushrooms, bacon and dirty sauce, lettuce and tomatoes. \n\nSound expensive for a sub but when you see the size of this monster you will understand.  These flavors work well together. Best sub I\'ve  had. \n\nDaughter ordered Reggie Jackson $7.97.:     Ham, bacon, American, dirty sauce.  The sandwiches are toasted so they are warm and the cheese is nicely melted. \n\nWe arrived during happy hour.... What they have happy hour?! Yes they do!\n\n  Free, let me repeat that, Free bag of chips and drink! \n\nTotal awesomeness!', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-08-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JwTs9aVq8mIMB0UHfUX20Q', 'review_id': 'nWGeZTdwX5aN4V596JSQRg', 'text': 'Dutch Crunch haunts my dreams. Where to begin with Ike\'s Place, and can\'t even gather words to describe this place. The first time I stepped into this location was in the summer of 2013, they had just opened and dutch crunch was in the air. Upon recommendation I went for the "Adam Richmond". Those that know the sandwich will say honey and friend chicken don\'t go hand in hand. This is wrong, Ike was like the first Conquistador to extend his hand to the Aztecs. Just as the Spaniards opened the Aztecs eyes to a whole new world Ike has done the same for me through this sandwich. Madison Bumgarner is nothing short of amazing, the spiffy tiffy is pretty light for you crossfit types, the damon bruce is for the days where you feel adventurous, and I wish I was a little bit taller should be served in School cafeterias all across the Southwest. There is nothing more I can say just head into Ike\'s, since I moved out of state all I can think of is dutch crunch.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-08-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '4R4ZCsntrtiB1zT1NVI6rQ', 'review_id': 'HV0RB-8GSIyyW8__NkuNdQ', 'text': "Just had a meatless mike jolt red soda and sweet creole onion chips and I've never been more satisfied    Amaze", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-08-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'yccVPZiypx-UF7swSbjDHQ', 'review_id': 'C851NLw_xITU3cXRtZUr1w', 'text': u"I am staying at a hotel close by for a few weeks and tried to come by Ike's about a week ago near lunch time and the place was so busy I didn't have time to wait. \n\nI made a second attempt and came around 2:30pm and scored a big success. Having a large appetite I went for the Bear Hug. I was drawn to it because one of the ingredients was jalape\xf1o poppers which I am a huge fan of. I took the sandwich to go and ate it at the hotel. I was blow away by all of the amazing flavors and textures rolled into one. It is one of the best sandwiches I've ever had in my life. No joke.\n\nFantastic product!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-09-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'eZPCgBST_5RYXIboh-Azng', 'review_id': '5Ive6xbfy4F-EsrQquZlZQ', 'text': "Um my favorite sandwich shop EVER!! Staff is so friendly and the food is so so so so delicious!!! It's the perfect place to make your own, and theyve got so many things you can put on a sandwich... Just when you think you've come up with an original idea, guess again... there's probably a name for the sandwich you just came up with! I also love that they'll do most of the other sandwiches from different Ike's locations. Try them all!! My favorite is Jake the Snake or Menage-a-trois! Delicious!!!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-09-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': '_rg8SIAg4w2_CsVJNlm7Uw', 'review_id': '4HsSO9rAo9ZQm7I1LwEE7g', 'text': 'After sampling sandwiches at a yelp event I have been wanting to visit since then. We were finally in the area so we stopped by. There are several options to choose from on the menu including several vegetarian and vegan options. I went with the Pat Tillman which was roast beef, mushrooms and mozzarella sticks plus a bunch of other stuff like lettuce, tomato and the dirty sauce. This sandwich was very big and could easily be split between two people. My hubby had the Thunderbird and he really enjoyed it. In fact he said it was the best sandwich he has ever had. The prices are good for what you get but I think having a smaller less expensive size for lunch would be a plus. Would that stop me from returning? Heck no. That sandwich was amazing and the crunch bread-out of this world! Oh how I wish we had a location in the west valley!!', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-09-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-DLZvdwIXxpBKSV6YNsvdA', 'review_id': '-5tsYulS1odeIZ8z5AZmkQ', 'text': 'Four stars only because it is a little pricey (we paid $34 for two sandwiches, an order of 4 mozzarella sticks, and one fountain drink). The sandwiches are really big and filling, but I could have gone to a sit down restaurant for that price.\n\nThe dutch crunch bread is a must! I think the "thing" about the dutch crunch is that the cheese is baked into the crust? Honestly, I do not care what the "thing" is, it is unlike any other sandwich bread.\n\n I had the Menage a Trois and my hubby had the Bear Hug. Both were delicious. \n\nThe mozzarella sticks are not worth the $4 or $5 they are charging. \n\nYou may want to research the menu online before going in the first time so you are not completely overwhelmed.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2015-09-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'm10HUfbNuZ45D0wN130VVw', 'review_id': 'AXsPpXb0zls5Rv2CwtMNxg', 'text': u'First time here and really liked it. Very unique sandwiches I had the Bella and spouse had the a spicy jalape\xf1os sandwich.  Large sandwiches and kinda pricey but good!', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2015-09-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'o-6PlLWxkpK15j_8vQUXCg', 'review_id': 'RTIwt6p7GbpeL_yJPQoIsA', 'text': 'Good sized sandwich for a decent price.  I bought the Hollywood SF cheesesteak.  The bread was fresh and the flavors were yum.  The delivery took a little while but was worth the wait.  Will be adding them in to my lunch rotation.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2015-10-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'zssolmdLpaX1tpRRMDWYwg', 'review_id': 'Ade9IPPtkJcyOE3eytnP2w', 'text': 'Yummy!  Not your original sandwich shop. So many varieties & the dutch crunch french bread is delicious. \nMy son had the Pat Tillman, my husband had the Tony Soprano & I had the Steve Jobs....all were awesome! \n\nI also get a caramel apple lollipop!', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-10-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'gDjRuhMCStk5v1_1nZgNsg', 'review_id': 'Hn8SkMSsKzAk3QhWYScXyA', 'text': 'Best unique sandwich shop in AZ! The decor has a serious identity crisis and  needs makeover but who cares the product is awesome!  Don\'t let the huge menu be overwhelming as there is something for everyone. I get the Bella sandwich everytime, wonderful if you love honey mustard. My wife always gets the "going home for Thanksgiving", she loves the cranberry sriracha sauce. No matter what you have to try the dutch crunch bread... enjoy!', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-10-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 4, 'cool': 3}, 'user_id': 'k99cC9QpbUXlGRWwxEe93w', 'review_id': 'meXjeRHFOFidzxW7f1NLqA', 'text': "Really good. About 50 subs on the board. They're made fresh, so it took a few minutes but worth the wait. Nice clean space, friendly and about $9.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-10-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '7iqUjt7LBhVYlNujyOucIw', 'review_id': 's9_QD8rKRBUdU8Nq6dFRUA', 'text': "When was the last time you had a good sandwich? Better yet, if you're celiac how long has it been since you had a philly cheesesteak? They make gluten free buns and they do not disappoint. Unique sandwiches, great atmosphere and the ingredients taste like real food. Our friend ordered delivery and I had the home for thanksgiving sandwich.... You had me at sriracha with turkey and cranberry with a gorgeous havarti cheese. You're brilliant IKEs and I LOVE you right back.  Give this shop a try. \nSide note: fast, friendly, knowledgeable staff. Food was out in 5 min max. Free caramel apple lollipop with your order and the retro soda station are awesome.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-10-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'OwCDgPxV28YXwhKZk0Wukg', 'review_id': 'op-Ki3Gie7YuZ4LKCLdCCA', 'text': u'Cool sandwiches. Had the Bella and tiffy spiffy. Very filling. Request them to add sriracha on the sandwiches. \nJalape\xf1o poppers make a good side with the Sandwiches', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-10-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'xIGjh-alyjZg5qgd9er2cg', 'review_id': 'IgOtUYlW585ANyXY0a71qg', 'text': 'Went with a group of friends a little over a month ago.  There a lot of unique subs on offer, I tried one with a teriyaki kind of sauce to it.\n\nI compared notes with a few of my friends after, and we thought our sandwiches were just alright.  The main complaint is that the sauce drenched the bread and all of our sandwiches were soggy by about midway through eating it.\n\nI recommend (to the business) to provide the liquid sauces outside the sub so that this does not happen.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 3, 'date': '2015-10-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': '8T0evnkvRaTomru7ghPGeg', 'review_id': '3NZjrz_ou0ZZMsH-LKH8AA', 'text': "Another place I didn't really have high expectations for.\n\nOrdered the Paul Rubens (pastrami, coleslaw, cheese) on the dutch crunch roll (or whatever it was called).  Added a side of fried zucchini.\n\nWill start with the bad.  The zucchini was bleh (that's below meh).  The ranch that came with it was beyond cheap.  If you go to a grocery store and look in the salad dressing aisle half of what you'll see is ranch dressing.  So how this place could end up with an awful ranch dressing is beyond me.\n\nWith the above being said I didn't let the zucchini color my view of the place other than I'd never order it again.\n\nAs for the sandwich it was surprisingly good.  I added lettuce, tomatoes, pickles, onion and banana peppers so the sandwich was really stacked.  The bread (dutch crunch) was really good...perhaps the best at any sandwich place I've been to in quite a while.  Overall I'd order the sandwich again.\n\nMy only concern with the place is that the variety of sandwiches they serve is so large at some point I would be afraid they would lose quality. I'll have to order a few other things before I can make that call.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 4, 'date': '2015-10-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'xbgKs6A6OOB2LiJ5Nxt-kQ', 'review_id': 'vURIuEK7j1KkPTM5rGgnjw', 'text': '10/10 will come back. In town from Texas for a couple of days and was looking for a good veggie spot. Wait staff is fast, friendly, and very helpful. Sandwiches are pretty large in size and well worth the money. Try the Dutch-crunch bread!', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-10-30', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'Ab6iN1cT3mTHEafcAjizaw', 'review_id': 'StzgUyPkAKsvN4bMlXocLQ', 'text': "We have quickly become regulars here due to their wealth of delicious vegan/vegetarian sandwiches. These sandwiches are the bomb. The staff here is very friendly and I think the prices are reasonable considering you're getting something super tasty. \nTo people complaining about the prices: feel free to get your bland-a$$ 5 dollar foot long and leave all the tasty sandwiches for me:)", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-10-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '75kvf57ZiIOaykuZwCuivg', 'review_id': 'oYI3NRCxPjjS_4T1GlHz2w', 'text': 'I have to say this place surpassed my expectations.  I had the Nacho Boy sandwich and it was perfect.  I tried the Dutch crunch bread with the sandwich and was perfectly baked.  I will definitely be back! The service was excellent!', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-11-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 't-eIHqMQxtPVU6nzimbfXA', 'review_id': 'kJrt7s_KjxTQnj0bStdFGA', 'text': "By far the best sandwich shop ever. I keep thinking I have a favorite then I try something new. Right now I am stuck on the Mrs.Robinson on French. It's fried chicken, provolone, Frank's red hot and ranch. Lettuce, add red onion. It makes me cry a little thinking about it.:) The staff is amazing as well. Even if their slammed their is one girl who has taken my order several times, that always is smiley and super sweet. Ike's I don't know what you do your sandwiches, but Thank You for doing it!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-11-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'OdjIlCTnJrZfF97oRlDJWw', 'review_id': 'D_kasjtFFso1oUB_Jcdp_g', 'text': "This is the most I've ever paid for a lettuce wrapped sandwich. It is also the best lettuce wrapped sandwich I've ever had. I added steak to the Patino D, their daily special. This is one of those places where the special is the most expensive thing, and that's without the steak. 16 bucks later, my sandwich ruled all. Beat the heck out of a five dollar foot long.\n\nI can't get over the fact that I paid that much for a sandwich. I'd do it again though.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-11-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '47aHRV_Mm5OmGao1hCClkA', 'review_id': 'M_JUsKLY7dDVLmURXnEUwg', 'text': 'The service is great, the food is good. A little rich for an everyday lunch, but satisfying nonetheless.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 3, 'date': '2015-11-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UMkAY0Uo_x0WsBeiVhNBaQ', 'review_id': 'V2nmr4HTDuhqJvk6kKvKNg', 'text': "Oh my gosh. First time I went to this place and was a little wary because of all the options, most of which I had never heard of before. We were there during happy hour as well which I didn't know they even had so we got free chips and soda!! Amazingly delicious sandwich and such great service! Definitely coming back soon!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-11-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'x0m5-ZjQ8Nj_FW90P2PVeg', 'review_id': 'NqEp4j3cB-HgWPsomkzGOQ', 'text': 'The staff was great and they seemed genuinely excited that I was in there even though it was less than a half an hour before closing. The food was great and the sandwich while little pricey for a sandwich place delivered a generous portion worth the price paid . will definitely be going back.', 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-11-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8nMspVzVtmErWVtcJxkBAQ', 'review_id': 'bcktqA-ZNSSrUuaRbJYZlg', 'text': "My favorite sandwich place of all time! Pricey but who cares! Excellent. Their sandwiches are addicting. They have a dirty sauce that is amazing. I'm not even a huge fan of sandwiches. This place rocks. Even got my kids addicted ! Only thing is, it's gets really busy!!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-11-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3E3ViJHwRAmpI8U44giDAQ', 'review_id': 'z1rtLWnUl1c4U8dyfI0n0A', 'text': "Dirty Sauce is like a garlic Frat House party in your mouth and doesn't end up well.  ....for those that want to head back to the office to please your co-workers. Don't bring this food back to the office -- it'll piss off your co-workers.  Ranks up there with brocolli. Prices are a bit high too. $8-10 for a sandwich.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 3, 'date': '2015-12-07', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 3}, 'user_id': 'jD20vPRPHApRcKAFiqcIwg', 'review_id': '_Ubwrlg4D7a6kmJgNNsGaA', 'text': "Busy place, appears clean, staff friendly.  Asked for salt and was told I wouldn't need it and they had none, no pepper either.  I needed both it turns out.  Ordered 2 sandwiches and a side of fried onion rings.  The rings were too with breading and desperately needed salt but the ketchup had to do.  Had their Hollywoods SF Cheesesteak #2, the mushrooms were cold and tasteless, had tons of shredded lettuce, some tomato, lots of a mayo tasting sauce and I wasn't crazy about the dutch crunch bread, crunchy yes, flavor little and dry.  My wife said she liked the bread on her Bear Hug #444 (Bacon, extra dirty sauce, Mushrooms, Stuffed Jalapeno Poppers, Thinly Sliced Rib Eye Steak). She thought they deserved 3 stars and I thought 2 stars so I guess it will be 2 1/2 stars total.  I also thought it was too bad that they had no tea and their root beer was overly sweet.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 2, 'date': '2015-12-12', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'v1YYF7JKE_LBegO2ooE2hw', 'review_id': 'yHKPqzc_tvNbhE4bRVR-Xw', 'text': "Ike's is an amazing sandwich shop that could do a lot more business if more people knew about it. Their sandwiches are fresh and come in any style you can possibly imagine. They are also willing to customize the sandwich to make it the way you want it. Until I found Ike's, I had never known what the was like to have my entire family satisfied with a sandwich shop for a meal. I discovered Ike's on a business trip to San Jose, and I was elated when I found out they had a location in Mesa. The service was amazing, and the sandwiches were delicious. We will definitely be back!", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 5, 'date': '2015-12-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HTPtbgiv7wIUfV6kNol5AA', 'review_id': '9ifDlcrcfQFew7YME9gkDQ', 'text': "terrible dry sandwich , just a mess of bar b q sauce and stale bread. the stone cold onion rings still had onion skin on them so they were un edible.i rarely ever send back my food for a refund but i couldn't eat this , ummm 9 dollar sandwich that ended up costing twelve dollars because the happy hour deal was no charge ? lol i'd never go back. the cashier pushed a tip bucket towards me so i had to reach around it to pay by card, for the short time i was there it's an apparent job skill to beg for tips. pay her more or send her packing car sales is in her future.", 'business_id': 'BMl0s3R8_M7ux2TQgAqE_g', 'stars': 1, 'date': '2015-12-22', 'type': 'review'}
