{'votes': {'funny': 2, 'useful': 8, 'cool': 7}, 'user_id': '5kJYTUtFUJT24dWNs6eW8w', 'review_id': 'CAWodh_FdFZ-jvQBfcVrVg', 'text': 'Soft opening, so take it with a perfect grain of salt.\n\nAs much as it is a homecoming for Bianco, being back at T&C is also a re-awakening it seems. A sort of do-over. This is the stuff we always wanted to see Christopher do. As the Bianco Realm expands here and overseas, it\'s clear that he is energized, yet still as himself as ever.\n\nFOOD\nWe had...\n\nGrilled head-on white shrimp with white beans:  As good as it gets. Simple, delicious, layers of flavor, but you taste every bean. And suck those shrimp heads! They are awesome. For me, as basic as it was, this was the stand-out dish.\n\nFennel and orange salad: Refreshing and simple. But good contrast. Great bite between dishes to refresh. Keep one around.\n\nPork ragu over Fusilli: Hearty, carrot-sweet, firm noodles, rustic chunky pork gravy. This is so up my alley.\n\nBurnt-butter fried sage sauce spinach/ricotta ravioli: good lord.\n\nSeafood stew: these things almost alway look the same. And this is no exception in the looks department. The difference is, where you usually get the same old tomato broth with a bunch of chewy crustaceans and throw-away whitefish... here you get tender bits of delicious sea creatures, each with their own flavor. All in a broth that actually tastes like seafood, not just salty tomato soup. Only suggestion: a big chunk of rustic Marco Bianco bread on the side to sop up all the delicious broth!\n\nFlourless chocolate cake thing with lightly whipped cream: I\'m not a dessert guy, so my wife and I split one. We shouldn\'t have split just one.\n\nOVERALL\nFriendly, confident, competent, attentive service. Pretty easy to do on an early soft opening night. We\'ll see how they do when they\'re in the weeds. But this crew seems like they\'re on it, and ready.\n\nThe food is what you dream of having if a friend took you to a chef\'s house in the Italian countryside and said: "We\'re gonna eat what his family eats when they get together and cook simple, fresh, amazing real food." This is so welcome in Phoenix. And it would be welcome anywhere, if we lived there :-)\n\nAs the menu will keep changing, we\'re looking forward to exploring over the coming years. Bravo Christopher (and Erin and Stevey and Claudio and Marco and Sergio and Crew)!', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2012-01-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': 'oo1vkkPjNKdA7x39xqYHDQ', 'review_id': 'SSCbAunMLkYSQlc1e-H7wQ', 'text': 'Visited Italian Restaurant tonight, their third night open. Overall, I was very pleased with the food. I had an order of gnocchi and lamb ragu which tasted like something I had in Italy. The flavors were right on. Would have been even better with a shave of Parmesan over the top. My dinner partner had the meatballs and polenta. The meatballs were super moist and tender. Tasted like a wonderful Italian grandmother would have made them. We also shared an order of the bread which was served with a tiny dish of olive oil, which was definitely not enough oil for 4 large slices of bread. \n\nMy only complaint was the service....our waiter was fabulous, but I felt like we were rushed through our meal. As soon as we had just started into our bread appetizer, our main courses came. And I had three waiters try to clear my plate before I was finished. I am going to chalk it up to opening week jitters. But please, if we are going to stick with a theme of fresh, seasonal Italian cooking and getting back to Italian dining basics, let us eat like we would in Italy. Give me some time to finish my food and enjoy it without rushing me to finish. \n\nNow that I have that off my chest, I will most definitely be back. I am excited to see what kind of dishes end up on the permanent menu.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2012-01-19', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 4, 'cool': 2}, 'user_id': '8-VLDMz0nAV7dm4tFBSGTA', 'review_id': 'zHdmVv96lVXNYRoL56jAug', 'text': 'went there second night it was open.\nPlace was fairly empty. Hostess tried to seat us at a tiny table behind the Host podium.\nNOT!!! the next table was ok. chairs were very uncomfortable. Server was all about the wine. Food was just ok ...pricy for 4 slices of mozzarella. 3 bucks for 4 small slices of bread? entrees were ok. small portion of pasta. the pollenta served with the pork\nshank was critty ...like there were foreign particles in it...ugh. nasty . Very  pricey for\nthe quality, taste and lack of ambiance and fair service (took forever to even get the bread!!! 3 requests.  Put in a call to the place and two days later the "manager" called me. She wanted to hear NO part of this at all. her response "well,I guess this restaurant is just not for you". great response to customer feedback.NOT!!! I think they\nneed to consider the economy, location and huge variety of better restaurants at better prices in the area.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 1, 'date': '2012-01-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 5, 'cool': 2}, 'user_id': 'nxVAs0ivaOgupWvj9wJDOw', 'review_id': 'Sq4p30t08coZVN_DZemw3w', 'text': 'Given our tiny waistlines and the generally enormous servings at Italian restaurants, my two friends and I elected to split a pasta entree (butternut squash ravioli), an appetizer (a hard cheese and sour cherries dish) and bread.  Well, maybe that wasn\'t the best idea.  Portions here are much, much smaller than you\'d expect.  \n\nThe food was definitely high quality but, honestly, nothing to rave about.  The pasta was flavorless and the "special sour cherries" in the appetizer just tasted like cherry pie filling.  The bread was top notch though, especially dipped in the sauce from the pasta.  \n\nThe place has a lovely, warm ambiance and the open kitchen is awesome.  I would have loved to sit on their beautiful patio, but it wasn\'t open yet.  Service was impeccable and should be noted.  \n\nI would maybe come back for bread and wine.  I was just a little disappointed in the main event.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2012-01-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'p7dvahRPZIWL7T6pFA_0dg', 'review_id': 'kXBVwgZ4WBIKIvPw6dKi0Q', 'text': "The food is hand crafted and all good but in the end I left underwhelmed.\n\nThe appetizers are small so two people might try two. (think piece of toast size)\n\nWe tried the fennel orange salad with shrimp ($13)  and the cheese plate ($6) . The cheese plate was a high quality peppered eating cheese with what I think was Italian Imported Cherries and Marcona Almonds, bread was not included with the cheese plate so we ordered bread ($2) . The shrimp were well prepared and flavorful however the fennel salad was fresh but very bland and lacked the taste of fennel but did present  well with the use of blood oranges. \n\nThree tiny fried sage leaves adorned the 9 small butternut squash raviolis and they were in a browned butter ($14) . The raviolis were seasoned nice and prepared al dente . Potato gnocchi were very light and garnished with a small amount of the famous mozzarella ($15) Two regular size meatballs were added ($6) ((ouch!)) The meatballs were good but ..........\n\nI can't say anything was wrong with the food it was all good but left feeling like something was missing.\n\nCommunity tables are by the wall. One couple was at one and then another couple with two toddlers joined them.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2012-01-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'fJGWSgGsvb6leJzOuE2O3Q', 'review_id': 'xFs9FkTOIMrvShnnjPARvA', 'text': "I've been wanting to try this place since before it opened. Tonight I went with two girlfriends, and although we had a great time, I was completely unimpressed with the food.\n\nI would give it five stars for the ambiance and decor - it's a quaint, rustic place and I loved everything about how it looks!\n\nBe sure to dress warm though - they use the outside seating as the waiting area. There are a few heaters, but it's still chilly out! Thankfully, we only had to wait about 20 minutes.\n\nFor our starer, we ordered the salad with mozzarella, arugula and prosciutto and though the mozzarella was very good, the salad was somehow too salty. The bread and vinegar was delish. I believe my roommate said the vinegar was the best part of the meal - which I agree with. It was an extra $2, but if you're going to order bread, then it's worth it.\n\nI ordered the spaghetti and was disappointed. I prefer angel hair pasta and this was thick pasta with nothing special to the sauce or noodles. Thankfully, we ordered a side of meatballs - those were amazing and really helped the spaghetti. I also tried the gnocchi that my friend ordered and thought it was terrible - very bland. \n\nWe all split the flourless cake for dessert. It was okay - but tasted more like a brownie than a cake. It had a pure coco flavor just lightly sweetened, which was unexpected but good. However, it would have been better if were truly a cake.\n\nSince I live nearby and loved the atmosphere, I'll definitely be back, but hopefully will find something I like besides the meatballs, bread & vinegar.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2012-02-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6e7pZofhDuIlD_rX2oYirQ', 'review_id': '5vwOyAEPwbXTtmUoJthXgA', 'text': "Overall the food is really excellent and can only get better...  The only reason I didn't give five stars is because of service, and on this visit, the gnocchi was way over cooked and mushy, but the flavors on everything we got were so amazing it really made up for the kinks in service (which I imagine is related to how newly open they are) and the overcooked gnocchi. I could easily forgive those things because the food is just flat out AWESOME!  The best Italian food in Phoenix area by far, and I'm from the east coast, grew up in an Italian family, so I know good Italian food!  I have been trying to find a good Italian restaurant here in the Phoenix area since moving here 15 years ago, with no luck until now. I am sure the service will improve and we will definitely be back to find out!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2012-02-03', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 10, 'cool': 3}, 'user_id': 'Znu5KKqytHfmjbXfQo3f4Q', 'review_id': 'zaygTfr45RP5s4GWTSwZgw', 'text': "I struggled with this review, because there are several very different aspects to Chris Bianco's Italian Restaurant...\n\nTaste - Fantastic. You could drink the tomato sauce and be happy. It is some amazingly tasty stuff, and not a bite went back to the kitchen. Most of it was because of the taste, but even our really bland apple tart was entirely eaten because the...\n\nPortions - Really small. This was part of why no bite went uneaten. They definitely favor quality over quantity, and I'm usually the first person to champion that cause. I hate giant restaurant portions. But this was too far the other way.\n\nService - Not bad, when we could get their attention. There are several community tables and sometimes different servers seemed to have different stations at the same table. And as small as the place was, it was oddly difficult to get anyones attention to place our order, get a refill, or anything else.\n\nAmbiance - Love the look and feel, from the clean/industrial ceiling to the Bianco art on the wall. It was fun to just look around the place while we waited at our table (which we did a lot of)\n\nCost - The place isn't cheap. You get what you pay for in terms of quality, but I think they are really, really going for the high-end foodie with lots of disposable income. We left not really feeling full in spite of dropping a fairly sizable check on the table. \n\nI recommend giving it a try, especially if you are really a fan of fresh flavors. If you're looking for a really amazing overall meal at this price point, I think there are better options around.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2012-02-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'hwB4sfkn9oKhFcoIOj66Vg', 'review_id': 'JTz7btBabHWWUFHpDiOOYw', 'text': 'It has been a couple of weeks since we went here, but I still think fondly of our meal and the warmness and hospitality of Chris Bianco and his mother when we were there.\nMy husband and I arrived around 5pm on a Saturday and there was no wait. We were seated at a table for six and were told that they seated family-style. Usually, that is no problem as my husband and I don\'t mind chatting with people, but this was a rare "Date Night" for us and we wanted some alone time. My husband asked the server if we could sit at the two-top over by the window and she said "I will check." We never heard back from her. Other than that, we had no issues with this place during our visit, which was the first week it was open.\nWe selected a variety of items from the menu and ate them as they came out.  The house-made mozzarella and wild arugula was absolutely fantastic, and we ate up every creamy and spicy bite quickly. The butternut squash ravioli was tender and sweet...oh, and Francesca\'s meatballs with polenta were heavenly. Light and flavorful...not a heavy brick of meat you can sometimes find at Italian eateries. But the star of the evening...in my opinion...was the gnocchi. It was amazing. Light, fluffy clouds of pasta. I washed it down my meal with Prosecco wine...a flavorful, sparkling wine. Mmmmm. We didn\'t leave room for dessert, but I hope to try one of the dishes in our next visit. While we were eating, Mr. Bianco\'s mother stopped by our table to see how we were doing. She was so sweet and told us she took a lot of pride in the food. She also gave me a wonderful compliment about how I looked like a classic beauty. (Maybe that is why I gave this review 5 stars instead of 4? ;) \nSeriously, though...great place, no wait because we were there early, so that helped...and the food was light Italian...not heavy where you feel exhausted and tired after your meal and want to go straight to sleep. \nAs we were leaving, Chris Bianco chatted with my husband, who sees him at Lux a lot and he said he was also really excited about this new venture and if we had any ideas or suggestions, to let him know. I told him my fave italian meal was Broccoli Rabe with spicy Italian sausage. We\'ll see if it ever shows up on the menu!? \nWe will be back and can\'t wait!', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2012-02-04', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 6, 'cool': 2}, 'user_id': 'As9N51A__ZGQV2P_Dy7jIw', 'review_id': 'S5sBJZP8BME_dvAROOsYCw', 'text': 'I need to start with a warning... I have a love/hate relationship with Chris Bianco. I love his food, but hate his restaurants. This love/hate continues now with his new venture The Italian Restaurant.\n\nMy husband and I decided to try Italian Restaurant tonight. We arrived about 6:15, we knew from past experience with Bianco restaurants, go during the week and go early. \n\nNote: It is tucked away in the Town and Country shopping center. You will not see any signage until you walk towards the restaurant area of the shopping center.\n\nIt is a tiny place with not many tables. There is a communal table. I despise communal tables. If I wanted to eat with random people I will join a commune. Anyways, I digress. So we were seated a small table for two. Now this is where the hate comes in. Small table next to another small table. ughh!!!\n\nAlso, if you are looking to have a conversation with anyone in the restaurant, good luck with that. Not only was talking to my husband difficult, I could not hear anything the waiter was saying. I can just imagine if it was that hard to hear on a week night what a weekend would be.\n\nNext area of contention is the patio. Ahh this is what I love/hate of Mr. Bianco. Just like Pizzeria, there are seats on the patio but of course you can not order there. Just extra seats for waiting. Now this is genius from a noncomsumer side. Keep the customer comfortably seated while waiting, plus add some wine/beer to the mix. So even if the even customer ends up "peacing out" before dinner, you already made your money on the overly priced alcohol. GENIUS. (prime example Bar Bianco, next to Pizzeria Bianco). Now why I hate this. It could be used for more seating!!!!!! Less wait time. I dont know about you, but my time is just a precious as Chris Bianco\'s!!\n\nLast complaint, the server was extremely rude. Not sure if he was having a bad night, but anytime I would ask a question or make a clever joke (ok maybe corny joke) he would give me the worse look or answer my question like I was dumb. THe menu is small and many different dishes, so questions will be raised. He also rushed us. I understand that there is a wait and they need to turn over table, but I want to at least feel relaxed, especially when paying higher prices for meatballs.\n\nSo why am I giving the restaurant 3 stars?? THE FOOD! It was awesome. Just when I want to have a reason to dislike Bianco, his food reminds me of why I am there in the first place. All 3 stars go to food. The other faults just are too much to be ignored.\n\nWe started with the house bread and olive oil. Bread is AWESOME. Does he need to charge $2 for it, probably not, but he knows that more likely than not you are going to cough up $2 for bread. Again, GENIUS!\n\nI had the meatballs and polenta. It was delicious. Was it worth the price ($18) ehh not so much. But again, when in Bianco\'s restaurant expect to pay a little more\n\nOverall, I plan on returning sometime in the distant future, just not tomorrow.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2012-02-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'WBap8JonpZph4e2fTYjTjg', 'review_id': 'Gasv_xry9hCNuN7fCbxtRw', 'text': "I'm conflicted.  Overall, my impression is - can you spare it?  Food is good, portions are tiny.  I come from New Jersey where an Italian restaurant means you get delicious food and a lot of it.  Here, you have to keep ordering bread to fill yourself up so you can still leave feeling half-full after you're done.  Everyone in our party left the restaurant hungry after spending a huge amount of money and still not getting enough to eat.  Thankfully, there's a Blimpie's just around the corner (kidding).\n\nIs the point of this restaurant to act as a showcase rather than actually feed people?  It's absolutely delicious food, there's just not a whole lot of it.  And you don't even get your own table with the communal seating.  Acoustics are awful, fuggedabout trying to talk to one another.  A family sat down close by, looked at the menu, got up and left.  Obviously they thought they were in a normal Italian restaurant instead of some foo foo culinary experiment.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2012-02-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'uCfdp7AH45qanhjzWhYZsw', 'review_id': 'PmnN36Ll2_jwP2vtDME3NA', 'text': "I rarely write reviews but I have now eaten at Italian Restaurant a few times and, after reviewing some of the other Yelpers opinions, I felt like I had to write this because this place is great and deserves kudos. Wow, some of you yelpers are so picky about things that have so little to do with what a Chris Biano restaurant is known for- the food!\n\nEvery dish I have ordered so far has been delicious and satisfying. You can taste the freshness and quality in everything you order at Italian Restaurant. The talent in the kitchen is apparent in the complex flavors found in some of the simpler items found here such as the amazing cornmeal laden bread and the perfect meatballs. The portions are just right- just enough to satsify without sending you out the door overstuffed.\n\nThe dining is quaint and shabby chic. Some of the other reviewers have complained about the small chairs and tables or the large family style seating but to them I say- have you never been to a Chris Bianco restaurant before? If so you should already know what to expect. If you don't like it then don't go! The rest of us who know that you go to a Chris Bianco restaurant to enjoy the food will be happy to fill your empty spots. \n\nI am giving Italian Restaurant four stars for now because I think that they have a few new restaurant kinks to work out but have no doubt that once they get things running smoothly 5 stars will be my permanent rating. I will definitely be back- often!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2012-02-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '_GVAV2LjUWEs9fGjslex_A', 'review_id': 'PUga46YXlgWtlnr0x1dyDg', 'text': "Here's the deal... food is good, atmosphere is cool and the music selection was great (I heard two songs from Radiohead).  \n\nI kinda feel that I over paid for my meal but what the hell, it' Valentines Day. Pork Shank $23, Butternut Ravioli $14, minestrone soup $8, Salad $9, Chardonnay bottle $32, Lemon Cake $8.  It's a weird occurrence when my wife feels like she didn't eat enough so you know the portions here are smaller. \n\nThey have this communal dinning which is kinda like eating in an online chat room... yeah, not for me. So we decided to wait 45 minutes for a private table. \n\nI'm sure we'll be back some day but I kinda want to wait until I find a coupon.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2012-02-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'xXddQy6m2cLcz9tfQu5fyA', 'review_id': 'zhPteIoswH17fll8ulH4xw', 'text': "This was the first time in my life that I spent $125 on dinner and left hungry. The food is delicious but the portions are really small and expensive. I had a shaved fennel salad, butternut squash ravioli and lemon cake as well as a bottle of wine.\n\nWe waited an hour to be seated, but I didn't mind. We sat at a table outside near a heater and drank some wine. We could have been seated earlier, but we wanted a private table instead of a seat at the communal table. \n\nI was a bit disappointed that they charged for bread and oil/vinegar for dipping. I think  this should be provided at every Italian restaurant for free, especially considering the prices and small portions for the rest of the food.\n\nThe server was very nice and gave great recommendations regarding the food. When the bill came, we told her that the bottle of wine was missing on the bill, and she didn't even say thanks for letting her know, which I thought was strange, since it was an extra $40. \n\nAll in all, this place was ok, but I probably won't go back.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2012-02-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': '2BO2FuR_U0Jg_-3hDW2nUw', 'review_id': 'tQa5Gzppqi9AXBcApSjaSw', 'text': 'Upon my husband\'s and my arrival we were met with a hostess with an attitude.  We could sit outside immediately or wait for 25 min. to be seated inside. Which would have been fine but we asked about the empty table right behind her and she said, "oh, I didn\'t know it was available and showed us to the patio while we waited 10 min for the empty table inside. Why? it was already ready? After being seated we waited at least 10 min before we were acknowledged at our table.  Finally, we were asked what drinks we would like and that took another 10 min. And, then, my husband asked for bread and olive oil which also took another 10 min and had a "dollop" of olive oil. Our waitress never asked us if we had any questions re: the menu, once we ordered she never came back to ask if we needed anything else or if the food was to our liking.  \nFood is fresh and tastes good.  The portions are smaller than most restaurants but we did not find that a problem.  We shared the fennel salad, both had a main course, a glass of wine each and our bill was $70! Now that is expensive, especially when the restaurant\'s service is way below expectations for this chef\'s restaurant. The food is not worth the price, the service is awful and there too many other options in the valley to choose from. We won\'t be back and will not recommend it to anyone.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2012-02-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 6, 'cool': 3}, 'user_id': 'iT34uqPxJv4S4pfTzj3FtA', 'review_id': 'fz9HN2I7X5nzPalhlDDGSg', 'text': "I've given this restaurant two tries and will not return for a third. If you like scarcity in terms of decor and especially food, this is your place. If, however, you eat more than say a New York City runway model getting ready for Fashion week, then avoid attempting to eat here.\n\nThe first time I tried the Italian Restaurant (named with such apparent lack of energy it foreshadows the experience) I ordered a mozzarella and prosciutto sandwich, which was OK, but nothing fabulous. The portion was small, but not ridiculously so, and came with a small pile of plain, leafy greens tossed in olive oil. The sandwich consisted of a hard crusted bread, slice of mozzarella and paper thin slice of prosciutto - simple, plain and fairly bland.  I left unsatisfied, but not angry...\n\nNot a great first try, but I'm a fan of Italian food and so loved Spasso that occupied this location prior to the Italian Restaurant, I decided to give it another shot.  Thinking that maybe I should move to the pasta section of the one page menu, that this is where the Italian in the Restaurant would shine through, I ordered the ravioli special.  It was, simply put, underwhelming!  There were 6 (I counted) square ravioli that were no bigger than the width of a typical fork.  Looking at the meager portion I thought, wow these must be incredible - at $12 for the dish, $2 a ravioli should be amazing.  Surprisingly, and unfortunately, this was definitely not the case.  They were again bland and topped with a simple, bland tomato sauce.  The size of this lunch dish was about what I'd expect for a tapa or a small appetizer.  I'm a big fan of smaller portions and higher quality, but its really hard for me to believe this was a serious attempt at a lunch portion for anyone.\n\nBottom line, I left hungry, disappointed to the point of feeling angry at being ripped-off and determined never to return!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 2, 'date': '2012-02-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'HxMkDhc-nyZbt9KZHMZF9Q', 'review_id': 'QD9Ca3T0KEiJGf7ZGcXxkQ', 'text': "The food is amazing.  If you've eaten at another Bianco restaurant, imagine that.... only better, with more options.\n\nThe service is not great.  Slow, they forget things, etc.\n\nThe portions are SMALL.\n\nWe went on a Saturday night and had our choice of inside or outside table with no waiting... so I think that issue is sort of hit or miss.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2012-02-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'AJX3G9tGOvShz85EuDA_-A', 'review_id': '9GE2ofkbQi86FIU7oJm3tw', 'text': "The concept of a small, intimate, italian restaurant is realized. I've gone about 5 times now and every time it gets better.\n\nMeatballs and Polenta are to die for. \nThe Pasta and Anchovy sauce was crazy ridiculous.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2012-03-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 2}, 'user_id': 'sMgt2JAQ85nz59Woe0IAtw', 'review_id': '5BzMS3cy5n8NDpBmm8tYEA', 'text': "Chris Bianco is a god among men as far as I'm concerned.\n\nThat said, Italian Restaurant leaves me flat. The portions are miniscule, and it's pasta. Maybe it's just me, but I never feel right paying out the ass for pasta. What I had was terrific, but was it THAT much more terrific than what I could've made at home? Yes, probably, but if I'm going to splurge on a cuisine, it's going to be sushi or Indian. Or pizza, I suppose. That's what I loved about Pizzeria Bianco: you felt like you were getting the best pizza in the country for a song. Italian Restaurant is not like that at all.\n\nAlso, our service wasn't so hot. I'm talking 10 minute gaps between seating and drink orders and food orders. We'll be back, and maybe, like dave w.'s review below, it'll get better. I hope so.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2012-03-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'hGxsYwRMYOAgwJAfOnHEAw', 'review_id': 'msJT4elsLazATVRNQgNDHw', 'text': 'The food was perfect, we all agreed, that is, the tiny portions we received.  There were nine of us that went for lunch.  I\'d give the food five stars and the portions three or two.  Yes, the chef came out and greeted us and explained the products that went into the dishes, and, yes,  he explained they were "European" sizes, but when we received the dishes, we wondered what happened to the rest of the meal.  In fact, three of the women had to eat the bread, which cost extra, in order to have any semblance of being satisfied with having eaten lunch.   Would any of us go back?  If the prices and portions remain what they are, I don\'t think so.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2012-03-06', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 2}, 'user_id': '_9WdLStCJUKWiQhyCzckoA', 'review_id': 'hP-Gf18UpQ0iYqyCUR96Lw', 'text': "Dont  expect a salad or bread with your pasta.\nNot what I've seeen elsewhere.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 1, 'date': '2012-03-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': 'ptZHJS6B2bQBGadUbPpZVA', 'review_id': 'AHQgnY8L3yq1vbZcIXuj2g', 'text': "Been there twice both times Disappointed.  First visit I tired a sandwich Besides being well overpriced for what you get to begin with a friend with me asked for a little Balsamic vinegar however that would be an up charge.  Sodas come in bottles so if you drink more and one it of course cost you more.   The food was not bad but I would not describe it as great either the bead was hard to bite through tough and grilled hard on the outside.  Second time I was sort of dragged back in we a group was headed to another place when everyone besides me was all wanting to go try it.  So I go in with intentions of spending a bit more for a pasta dish remembering how I left hungry with a sandwich last time.  BAD IDEA I bought the Spaghetti very lack luster simple pasta and tomato sauce the noodles were cooked quite well but the sauce reminded me of that hunts canned sauce I use to by when I was on a tight budget fresh out of college.  Garlic bread.. oh wait I forgot no bread everything is up charged I didn't go past the 16 bucks I was already spending for the so so tiny portion of pasta I was already given and a soda. I figured I would be better off finding the vending machine in the office later for filler.\n\nBottom line for me Decent tasting food very small portions High prices will not return even if the group all decides that's where they are going again.  Why spend that much for lunch and still have to find something more to eat on the way back to the office?", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 2, 'date': '2012-03-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'vwtAuYXWIR9pC9wt0e4NJQ', 'review_id': 'JiABc7UHGXc1LV6cyTU0Dg', 'text': 'I went for a lunch dish in the last minute on a Sat. The head chef made our sandwich which was great, but I think 9 dollars is a bit much. I would come back to try dinner, but I was not real excited about the service. Server was not real informative about a business only being open 8 weeks. I had to ask all the questions about the food. They did not come off real friendly. I love the look and the food, but for the price and snob Scottsdale service... not sure.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2012-03-15', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 3}, 'user_id': 'EI6x6iQ5vnHIrTxgVDLVvg', 'review_id': 'W4QEhdcMMvqw66XT60BwNg', 'text': 'Ugh! I was so excited to try this place. I love Pane Bianco- the quality here was not at all comparable. Let\'s start with the service-some of the worst I\'ve had in Phoenix. It was empty and there were about six people standing around goofing off while we just sat there. The menus were completely wrong and after the staff had made "my order" which was pretty much whatever they felt like they asked me if it was ok. Service wise it got progressively worse from there. The food...let\'s start with the bread, it was so encrusted with cornmeal that it was extremely gritty as well as being overly salty. My pasta was bland and the sauce wasn\'t really a sauce at all but just butter with a few fried sage leaves. NEVER going back.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 1, 'date': '2012-04-07', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'AM6syblM2kjLRHHMZnoPsA', 'review_id': 'zU9NBs_g9hHv5EMhj8sdQA', 'text': "I was so excited about going to this restaurant but it turned out huge disappointment. My friend and I had 2 salads and 2 pasta dishes. 1 salad was from menu Caprese salad and it turned out they didn't have tomato. And waiter said chef will do something special so I put  an order. Then it came out with chopped romain lettuce. And my friend had special seafood pasta. It came out with way over cooked squid. Chris Bianco should have thought about not open that restaurant serving that quality and kind of food. One more thing, waiter brought a bread we didn't ask for and they charged me later.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 1, 'date': '2012-04-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'KkgaqRkIq_JQIkfgH4NRKA', 'review_id': 'RTNIsqCC6oFk6Bo_lMUNrA', 'text': "When I heard that this place was owned by Pizzeria Bianco, I was kind of excited, but two lunches later, I've filed this away as just a bad idea. The food - at least the two sandwiches I tried - were okay, but just not anything special. Perhaps my expectations were high, both because of the pedigree and the excellent place that occupied that location just before, and that made for greater disappointment. But nothing can change the fact that the lunch menu  is extremely restricted - 3 salads, 3 sandwiches and a couple of pastas, from what I recall. The sandwiches were served on crusty bread. Now I'm a huge fan of crusty bread (I mean I even nodded in agreement during the scene in Ratatouille where the chef says a good bread talks to you), but that's what I want for my bruschettam antipasti plate or with an olive oil and grated cheese dip - for sandwiches I expect something easier to bite into without the risk of taking out the eye of my dining companions, a focaccia or ciabatta perhaps. \nOne can guarantee that you will not be walking away over-full. A guarantee that you'll be satisfied or wish to return is as close to impossible as getting a side of balsamic vinegar with your sandwich there. The good news perhaps is that there still is an excellent lunch alternative in Cyprus Pita Grill next to it, and should you, like I and my friends, still have an empty feeling after lunch, there's Yogurtology just  down the line.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 2, 'date': '2012-04-22', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 0}, 'user_id': 'DMmskLAvRS4wZDQhXRL0Qg', 'review_id': 'aT3CxLvtslU3c7cSlLU54Q', 'text': "Food is good. Don't take kids though.\nKids pasta was $7 with no accompaniments.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2012-04-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pEVf8GRshP9HUkSpizc9LA', 'review_id': 'P6tqZ8o_A9RBOn81d4ACCA', 'text': 'Sad to see so many average reviews.  I was so excited to see Chris Bianco opening another restaurant in Phoenix, so had to check it out.  The atmosphere is country rustic, the service was friendly and the food was quite good.  The spinach and swiss chard ravioli in brown butter was quite tasty!  \n\nThis location has never seemed to do to well, but with the addition of Whole Foods that should help!', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2012-04-28', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 7, 'cool': 6}, 'user_id': '3dno9Y7mtvi2tq6IfMpDeA', 'review_id': 'KXVijQTGurMWHH2aRm2aHA', 'text': "A great thing happened when I went here...  \n\nI really wanted to like it, and I actually DID!  I loved it actually.  Seems to happen rarely lately with let downs more common than not.  Been twice now and both times was VERY happy with my meals and service.\n\nThe second time that I went was for lunch.  I got a seafood pasta with Mussels, Shrimp, white fish, and calamari.  It was $15 bucks and well worth every penny.  Great portion of each ingredient and the calamari was SO tender with a wonderfully mild flavor that I actually asked the waitress if it really was calamari.  WOW\n\nWe were a party of 4 and all of us loved our dishes and left full with no appetizers other than some bread and olive oil (which was delish, of course).  \n\nPeople complain about portion size and I am a BIG (usually over) eater.  I was happy.  Others complain about price.  Go to AJ's and get great pasta (not Barilla!), great San Marzan Tomatoes (not Hunts!) fresh basil and seafood so fresh its still wiggling and you'll see why you don't get a trough of pasta for $13 bucks.  Better yet, make it yourself, so you'll actually slow down and enjoy the differences of taste and texture.  Either develop your palate, or stay at Olive Garden and don't review this wonderful restaurant.\n\nI'm an avid cook (kind Wifey would say chef, but never any formal schooling for moi) and I've really been getting into authentic, rustic, Italian cooking.  Simple, fresh, phenomenal, ingredients put together with love and care.\n\nThe menu rotates so that he can serve only the freshest ingredients.\n\nBIANCO NAILS IT! \n\n I need to say it again...\n\nBIANCO NAILS IT!!!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2012-05-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '80PHOfM8KOBb7xEQN4C0lg', 'review_id': 'FWAyuZGsazHPs6yuDY1foQ', 'text': 'The food is very good, the atmosphere and interior are laid back, welcoming, and comfortable, and the service was excellent.  That extra something to make the place memorable was missing though.  \n\nThe GF and I were luckily able to get seated right away on Friday night by pretending to be senior citizens and eating pretty early.  I had read many reviews complaining that the portions were very small, so I suggested we get an appetizer to start.  We decided on the cheese plate, which ended up being the highlight of the night.  Goat, milk, and a dry/parmasean-esque varietals made the trio that featured a honey, mustard, grilled-onion topping bar in the center of the plate.  We would definitely go back for the cheese plate and apps and wine alone.\n\nFor entrees she ordered the spaghetti with the homemade sauce, and I had the chicken caccitorre.  We were both surprised by how large the portion sizes were, so maybe they have made adjustments to that because we both went home with leftovers.  Both entrees were very tasty, mine was fall off the bone tender and moist - cooked to perfection.  The french toast stick looking polenta side was fantastic.  It had a crisp outside with a cornmeal like texture, unique, and delicious.  The food was solid, but then again it should have been given the price ($14-20+) entrees, however it never delivered that, "I must come back and have that again."  \n\nService was excellent, highly attentive, polite, laid back, and relaxing.  Italian Restaurant made for a nice evening, but at $80 for the two of us, it won\'t be an evening we have too often.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2012-05-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '70zChgIIHgIj028iVPDmUw', 'review_id': 'BWAKnzOUM1YPPX22YA_V2g', 'text': u'That was then...this is NOW!\n\nWe\'re Chris Bianco fans...so I\'m not surprised we like this new place.  I\'d seen the mediocre reviews others have given and was surprised.  I\'d called Pane Bianco earlier today to see what their hours were now and asked about the poor reviews at Italian Restaurant and learned that the management team and chef had been turned over in the past weeks, so I thought this would be a good time to try it out.  Glad we did!\n\nFirst...the food was excellent.  People were complaining about small portions, but the two of us could barely finish the food we ordered.  The portions of the gnocchi and the Polpetone were huge!  Service was excellent too...we arrived early evening getting a table wasn\'t an issue.  I suspect that will change as people realize that they\'ve listened to the feedback and changed things for the better.\n\nFood.  We shared a nice peach, arugula, goat cheese and candied pecan salad...again, nice size with delicious and perfectly ripe peaches...tasty all around...not over-the-top, but very good.  We also shared two entrees - and these WERE over the top good!  Gnocchi that was large but very light and fluffy (best I\'ve had since Venice!)...saut\xe9ed to a little crispy edge...and served with roasted pork.  It was succulent and delicious...very juicy and flavorful.  The other entree was "polpetone" which I\'d never had before but it was a truly perfectly cooked light/softly roasted and slightly sweet meat loaf.  I make a kick-ass meat loaf and this rated right up there.  It was served with heavenly smoky-salty-tasty baked beans and saut\xe9ed escarole...the latter was a bit more "ok" but the rest of the dish rocked.  We ordered a side order of meatballs - I\'m not a meatball fan but my partner is.  I thought they were ok...he thought they were very good and liked that the tomato sauce tasted like tomato!.  They were good...but the polpetone really was heavenly.\n\nNo dessert...to much other food!  We had a glass of prosecco each and we spent about $35/person before the tip.  Maybe it\'s just us...but we definitely felt like we got our money\'s worth.  It was classic Bianco...delicious food expertly prepared and served.  Worth the trip!', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2012-05-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'k2n8CdqJhZqZT_w36rzang', 'review_id': 'IVsMG4wTXgT8HDtG04jBeg', 'text': "I was excited to hear Bianco opened a new restaurant at Town and Country. It was Monday and I didn't bring my lunch to work so I thought I'd treat myself and check it out right away! \n\nSort of disappointed. I was craving really good homemade pasta. I got the potato gnocchi and I thought was going to be a bolognese sauce but it was more of a chopped/shredded pork sauce (I wouldn't really call it sauce) with heavy citrus and parsley flavor (maybe I misread the menu). Anyways, it wasn't what I was hoping for - pretty heavy for a hot day in May!\n\nI ordered the bread/olive oil too.  And just water. With a tip it came to $20. \n\nJust a little more than I'd like to pay - even when I'm treating myself - but I'm willing to do it if it's good and I'm craving it! \n\nDon't think I'll be coming back anytime soon. And I'll definitely either wait until it is cooler and the heavy entrees are more appropriate or I'll order a salad!\n\nAlso the service could be a little better. It wasn't very crowded so I got a table right away but it did take awhile to place my order. I asked my waitress what were the best pastas and was hoping she would have explained them in some more detail. She just said the gnocchi was her favorite and I went with that. Next time I'll be asking more questions for sure! \n\nOn a positive note, I love the location, decor and atmosphere.\n\nJust wonder if it's a little too pricey/specialized for that location, considering what else is in that complex. The neighboring restaurants aren't really on the same level, attracting the same people. \n\nBut, I wish them luck and hope to find something to RAVE about next time I venture to try it again!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 2, 'date': '2012-05-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': 'GrSixRnGIxNUJ1Cn5DNX9A', 'review_id': 'ETWYduNTSc6YUn-8d1BVBw', 'text': 'Like I ever would have doubted a Chris Bianco inspired concept.  Evidently we ate at a different restaurant then the ones who have peppered Yelp with their 3-Star statements.  I found no tarnish on our five star experience. \n\n The ambiance is comfortable and cozy just like he envisioned.  You do feel like family, especially when Chris is personally visiting each table. Every dish sampled was simple yet elegant and flavorful.  Nothing pretentious, just flawlessly executed family staples.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2012-05-28', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'HvaVgP0S0dFaCbBDIQIkag', 'review_id': 'B2IEQmgIdGvX13A3rkbSuQ', 'text': "Beautiful meal. Lovely airy restaurant. The menu is small, in keeping with the Pane Bianco tradition of offering a few items done really right, rather than hundreds of items done just like everyone else does them. \n\nI am a sucker for fresh pasta. The fresh fettuccine with lemon, olive oil and kale was a winner, as were the baked corona beans. I don't know if the spaghetti pomodoro was fresh, but it was delicious. \n\nWe split the flourless chocolate cake for dessert. It was magical. I don't usually like chocolate, but this was like eating whipped rich chocolate air with a thin layer of delicate crust on the bottom. I would eat 5 more pieces of that cake if I could possibly fit any more food in me.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2012-06-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'LgrXP7bo-3u5xmPjCq7yyA', 'review_id': 'dZ7dGtFaE9Xp_miT4urErQ', 'text': "Another hit by Chris Bianco.  Restaurant has a great atmosphere.  Food was delicious.  From the awesome bread to the dessert.\n\nI had homemade fettuccine with Bolognese sauce.  Perfectly cooked pasta and very tasty.  Love scooping up that sauce with the bread.  My wife had the braciole.  Again, cooked to perfection and melts in your mouth.\n\nCan't wait to go back and try other items on the menu.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2012-06-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Mac3De6NAHvrkRY7FwKcxg', 'review_id': 'qFYM-LWmAmEHA1frmNYQjQ', 'text': 'Food was OK. Not too good a value. Nice, calm atmosphere though.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 2, 'date': '2012-06-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'ljR_XxzrJES4i4X5Mn-6Vw', 'review_id': 'N7a2sg0RJ8cSuig3YkZN-A', 'text': 'Excellent meal! Cheese plate was wonderful - mostarda, grilled dates and a perfect trio of cow, goat and sheep cheese selections.     \nGnocchi - Phenomenal, fluffy pillows of perfection in a beautiful pork Ragu. \nFettuccine with lemon, olive oil, Parmesan and kale - hello summer!\nAnd last but not least - lovely, melt in your mouth meatballs!\nLove it!', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2012-06-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'Wj0r9VOpoIyRpaa6y5XGmA', 'review_id': 'TEjSH-XhX9I7xQoP2PD5vw', 'text': "My gal pal and I had a phenomenal meal here.\nWe started with a peach, pecan, and blue cheese salad-AMAZING.\nMoved onto a eggplant pasta dish and a bolognese.  We were very happy with the portions of all for the prices.  Quality was great and we can't wait to go back.\nIt is now the go-to place for pasta in Phoenix-which isn't easy to find!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2012-07-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'SHi0ZKtsebge11hV5LfbQw', 'review_id': 'sopRnpjF6assic9El98XDQ', 'text': "Great Italian comfort food.  Terrific staff.   Friendly service.  Fun experience.\n\nLots of variety among experiences of fellow Yelpers regarding Italian Restaurant.   I have been a Bianco fan for decades and will continue enjoying Chris' restaurants if this one is any indication.\n\nThe friend I had dinner with is as picky an eater as I am, so we each had the same dish:  the eggplant spaetzle.   It was excellent.  Homey and well seasoned.   We confess to spying on other diners.  Not only did all of the other dishes look very nice, the comments we overheard were all enthusiastic.  \n\nThe atmosphere was busy, but well managed.   It is a fun, funky trattoria, the kind of place you would find in an Italian village.   Well, almost.   I was delighted that some of my favorite servers from Pizzeria Bianco were serving here as well.   Chris must be doing something right to maintain such a loyal and competent staff for so long.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2012-07-06', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': '3dno9Y7mtvi2tq6IfMpDeA', 'review_id': 'TlktOwre5IwWxT3lR5CiRw', 'text': "Went for lunch again. Impressed again with the food and the place was twice as busy as I've ever seen it and it was quite loud inside, which I'm ok with. Happy to see this but the service was unfortunately poor for the first time, but I'll give them a pass, this time since I come for the food and wasn't in a hurry. Nice girl but seemed to forget we were there. I don't think they were expecting the rush. I was with 4 others.\n\nI had the special of the day which were the gnocchi with a bolognese ragu. Melt in your mouth MMMMMMM I also got a side of meatballs. They come in 3's. Love em.\n\nSO FULL\n\nI'll update again on the service next time I'm back.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2012-07-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'p7dvahRPZIWL7T6pFA_0dg', 'review_id': '3JtAdrJBshKsNybEGSaG3Q', 'text': "Short Story\n\nTwo of the pastas we tried were very thick and heavy with a paste like texture and flavors were disappointing.\n\nLong story\n\nWe were excited to try this place again after reading all the great new reviews. We were welcomed nicely by the hostess and our servers were very cordial and efficient and we were surprised by a tasty amushe bouche of  olive oiled crustini with a light spreading of cheese.\n\nWe had a hard time deciding on what to order because really only one traditional type dinner plate was on the menu so we ordered a cheese plate while we took some time to decide. We received delicious crusty bread with high quality olive oil and the cheese plate adorned with very good accompaniments. \n\nWe had the pasta fagioli soup. This variation of soup was made with dark beans and seemed to not include the usual seasonings and vegetables such as tomato, celery and onion and the stock. The soup seemed extremely rustic and mostly was just  cooked beans. The pasta in it looked like rolled by hand orecchiette, each one was very heavy and thick regular flour pasta that had a paste like texture.\n\nThe peach and arugula salad was very good and large. \n\nWe ordered the one dinner plate of the evening that included roasted chicken legs and thighs, Shriner's sausage, cold potato salad and pickles. The chicken was OK, The sausage was a little over grilled. The potato salad wasn't delicious.\n\nWe also ordered the eggplant strozzapreti also know as priest choker pasta. Again just like the pasta from the soup this pasta was also a hand rolled regular flour pasta but the shape of strozzapreti is an elongated cavatelli shape. Each piece of pasta was approximately the size and heaviness and thickness as a solid green bean. After I ate one I really didn't feel up to any more. I did pick the vegetables out and ate them.\n\nI thought even with improvements this visit was a step down.\n\n If we made different selections we might have had a more positive experience.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 2, 'date': '2012-07-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '5RA1yMlY9ZpK3DXsW3nEMw', 'review_id': 'mA1km9oCjlzujylkarUfGw', 'text': 'Chef Bianco does it again! The homemade pasta is unreal. You can actually taste the freshness of all of the ingredients. The pasta is thick (like homemade pasta is supposed to be...) but not heavy at all. I also loved the casual vibe and the staff was very friendly and nice. You really feel like a guest sitting in the kitchen in a home somewhere in Italy.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2012-07-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '2hXL2ExBsgjJNpm6BJy0lg', 'review_id': 'y4bwIM40fHWpSJi8cL0UkA', 'text': 'Flavorful fresh ingredients! I came here on a double date after wanting to try it for a while. We started off with the grilled zucchini appetizer, I would come back for this alone! It was very well done, the combination of fried egg, lemon, mint and cheese was amazing, it worked really well together. I had the eggplant strozzapreti and my husband had the gnocchi, they portion size was large and the pasta was fresh and full of well put together flavors. We asked the server for a recommendation on wine as we like lighter reds and she suggested the pinot nero which was very good. Service was attentive as well. I will definitely come back here as now I want to try everything on the menu!', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2012-07-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hcctCQy3bdZMezrUKkZLtA', 'review_id': 'Fz57SqjMSemhCDnBwZlpng', 'text': 'Cute spot and convenient location. Love the style and decor just like their sister restaurants.  It was a great spot for lunch with coworkers and our tummies were all happy from our meals. Food was delicious and service was great.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2012-08-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'sLKOFR5xBHq81CFjSURrEg', 'review_id': 'z1ZZVrHnKSA28oH3m6QdXA', 'text': 'The positives:\nNice, clean location.  There is a definite charm to the place.\nThe staff was friendly and helpful.  \nThe appetizers we had were very good.  Some sort of olive maybe pollenta cake and the meatballs, both were very well done.  \nThe break and olive oil were good.\n\nThe majority of my table ordered the chicken.  When it arrived, it came with roasted potatos and stuffed tomoatos.  The potatos and tomoatos were both very good.  The problem was the chicken.  It was a very scrawny compilation of bones and some meat.  Seemed almost more like a pigeon, not piece of chicken.  It seemed everywhere you put your knife to cut it, there were bones.  So you turn it over to cut it thinking you must have the wrong side and there they are again, more bones.  As you look at the puzzle for a few moments you think, surely there must be meat here somewhere.  And there was, after some searching.  Usually meats cooked with the bone in are more tender.  This chicken was very very dry.  It reminded me of the roasted chickens you get at the supermarket, you know the ones where its 7:00 and you are looking to pick something up quickly for dinner and all you see under the heat lamp is a dired up roasted chicken that shows it came out at 11:00 am?  Thats what this chicken was like.  All of the moisture was literally sucked out of it, so much the meat actually drew in and made it hard to even cut or chew.  \n\nEveryone had the same experience with their chicken at my table, this was not a fluke plate.  I dont know if they were serving leftovers or what, but thats what the chicken tasted like.  The rest of the meal was great, to have their main dish fall off like it did was rather shocking to me.  We did have a Gnocci at our table as well, that was done fine.  \n\nStay away from the chicken, you should be ok.  If you do dare order it, make sure you get extra water, you will need it.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2012-08-06', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 1}, 'user_id': 'isw-lj9HVbXANPMVJgPbCQ', 'review_id': '1PRAGGdTsf80_fa4xBABLA', 'text': 'Hard to believe this is a Chris Bianco restaurant, at least tonight. I ate here a month ago and loved it and was so excited to come back tonight with friends for a belated birthday celebration. I am writing this from the parking lot -- that\'s how bad an experience it was.\n   The sausage pasta dish was nothing like the last time, when it was the hit of the night. . The texture was like paste. We sent it back and when the server returned with a new order she said: chef wants you to know we are experimenting with different wheats and it\'s all matter of personal taste and palates. In other words, if you don\'t like it you don\'t have good taste. We chewed through the toughness -again - because we were so hungry. The only good part was the sausage.\n  Service was a comedy of errors. We got our neighbors\' appetizers, much to their dismay.\n   It\'s 114 today and was over 90 degrees in the restaurant. The hostess just said she "thought" the AC was out. The people next to us were fanning themselves with their menu. Other people moved tables to try to get cooler but the hostess told us we had one of the best spots in the house.\n    Our waitress made no attempt to apologize for any of this mess and dropped the check off with no comment or even the slightest bit of recognition -or discount /free meal - for the troubles. Not even an acknowledgement that this place was firing on NO cylinders tonight.\n Absolutely stunning. It was like the whole place was in an alternate universe where everything was peachy keen tonight. There were some high Profile PHX area biz and foodie  diners there tonight whom I will not mention. We can only imagine what they thought, or maybe the kitchen was lavishing all of their attention on them.\n   I was embarrassed I suggested it for my birthday dinner with friends.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 2, 'date': '2012-08-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 5, 'cool': 3}, 'user_id': 'u3ZL6O-UDgoZFZr26XP_xg', 'review_id': 'tvqontaeAfBjRRqGbP4ZTw', 'text': "I'll start this off by saying I really wanted to like this restaurant. After hearing mixed reviews I kept an open mind, but unfortunately was dealt a mediocre experience. \n\nThe interior was cute, however you can tell that whoever chose the furniture didn't sit in each seat beforehand. We were at what could have been a cute little Italy type of table, but it was SO little that everyone's knees could not fit underneath it. Definitely more little kid than little Italy.  \n\nAnother atmosphere downer was how HOT it was inside. Granted it was 116 degrees outside but the open kitchen layout wasn't helping Bianco's case - nor was the server who kept opening the patio door. \n\nI will say the food was the best part of our experience, however it was mediocre Italian at best. The spaghetti...was spaghetti. I'd make it at home before coming back to order. The gnochhi was the best dish at the table and it was the corn that really made it. The cavatelli was decent (but I was glad I didn't order it) and our friend who ordered the pappardelle was apparently pleased because he ate it all.\n\nIf you're a Bianco fan, I'd say give it a go - maybe you'll get a better table, a less awkward server and food worth going back for; it just didn't happen on our visit.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 2, 'date': '2012-08-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': 'aIAjAU-6NH583EkQ6E9KRw', 'review_id': 'HBNfZtDj1Xa44ut1tnbNlQ', 'text': "Okay, regardless of the review mix I was all set to really like this place. I had a great experience at the place the owner used to own downtown and boy I was primed. I even took some friends and the father is Italian so I could make sure I had an even perspective but at the end it was sort of...eh, okay, but we've both had lots better.\n\nThe restaurant is right in the same shopping center as the Trader Joe's near Camelback avenue in North Phoenix, and that is a pretty cool place. The restaurant is set up as a sort of casual rustic italian sort of place, like the ones I've seen in Naples and that is a nice bit of Italian drama theater, though taking it to the point of serving the wine in small water glasses, a little too authentic. If I'm going to buy a decent bottle of wine, give me a real wine glass. Sorry if it blows the mood but its not the same without a decent wine glass.\n\nI started out with the watermelon and fennel salad, as it seemed it would be cool and refreshing for summer and while it was okay, a bit warm for my tastes, I would have liked it a bit more chilled...wait...sorry, review unfinished and that was a few weeks ago so.....lets just say, relative to the price, I didn't think it was all that great, nothing I had felt like this place was worth a second visit.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 2, 'date': '2012-08-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'HvaVgP0S0dFaCbBDIQIkag', 'review_id': 'ezuhtezkuZS4qignmPinIQ', 'text': "Another excellent meal. Word is getting out around town about this place...last time we went, it was early-ish on  Saturday and there were maybe two or three other couples there. Tonight, Saturday, we arrived at 5:45 and were told it would be over an hour without a reservation. Fortunately, there were two seats at the bar, so we didn't have to wait. \n\nThe food was, again, spot on and delicious. The service was great and gracious, and Bianco was greeting and thanking diners left and right. \n\nThe choices are limited (or possibly nonexistent) for strict vegans, but there's always something vegetarian on the menu if you don't mind being a little flexible on the cheese thing.\n\nWe shared the chickpea-flour crepe with olive, sage and red onion. This was fabulous, reminiscent of a potato pancake but more delicate. \n\nI ordered the Fresh pasta with eggplant ragu, which was velvety with deep, garlicky, parmesan, and husband had the gnocchi with fresh corn. Also terrific.\n\nThere's a rotating menu, but I think there's always some variation of a bean side dish. Get it. The two we've had have been excellent. Also, the flourless chocolate cake is a must, and I think they have it every night. \n\nReally, you can't go wrong with anything on the menu!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2012-08-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8UqdOM8fd-Z_0Ef0g4G7pQ', 'review_id': 'pmFn3ynTgierfKijgRiRxQ', 'text': "We went a couple nights ago and while it was easy to get a seat when we arrived around 6, it got crowded later and people were waiting. The service was inconsistent and we had too many different people bringing us food and drinks, which I found irritating. It took so long (half an hour or more maybe?) for my appetizer to come that it came minutes before the meals started coming, and everyone at the table had their meals arrive at a different time. To the servers credit, he did take my meal back to kitchen so I could eat the appetizer before my main dish. One of the meals was wrong and they replaced it as quickly as possible with the correct meal, which was appreciated. The food was fine, but nothing special. Mostly it seemed to lack flavor. The zucchini was recommended by one of our servers and it was interesting and I'm glad I got it. I didn't taste the mint until about a quarter of the way into it and that made a big difference in the taste of the dish, adding a level of complexity missing in the other dishes. Probably the biggest problem with the restaurant, however, was that it seemed to not have functioning air conditioning. It was ridiculously hot and stuffy and so uncomfortable to sit and eat, it would have been difficult to enjoy even the tastiest of meals. We all agreed that our experience was mediocre and would not make a special effort to return.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 2, 'date': '2012-08-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qlaKYuuE012SZ_isC7NCVg', 'review_id': 'hIySMRqo2YWYNXWWP7gUsA', 'text': 'It was my first time here and I am not surprised at how much I love this place.  I sat at the bar and was very well taken care of by Tom who made sure I had everything I could need or want. \nThe butternut squash ravioli with brown butter, parmesan and crispy fried sage leaves was plate licking good.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2012-09-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FEvBsBGJI-rvf9xwB23big', 'review_id': 'o7n7vrQIpH0uplizzlMI_A', 'text': "The food was very good , I was a disappointed there was no seafood pasta dishes on there menu, overall very good food and service, Got there around 7:30pm was able to get my table around 8:15pm. FRANCESCA'S MEATBALLS A MUST TRY & GRILLED ZUCCHINI VERY GOOD.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2012-09-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZzqJuInG9XvzF0EZHtu8bQ', 'review_id': 'z25Gd4NuqQCkJww3YGWyeg', 'text': "It took me awhile to finally eat at Italian Restaurant. I met the head chef on a plane from NY to Phoenix recently and told him I would definitely try it out soon so I moved it up on the list. We tried a number of dishes and sides and everything was good. We shared a salad with goat cheese, arugula and apples. It was wonderful.  All the pastas are made in-house. My wife had the cavatelli and she loved it. It had a cauliflower, fresh sausage and a great sauce. My gnocchi was not what I expected but I was not disappointed. The flavors were incredible. I'm used to gnocchi the way my grandmother made it but this was done in a pan in butter with sweet corn and pancetta. Wow. And the portion was big enough to take some home.   We had to try a few of the sides as well. I am pretty picky when it comes to meatballs and I rarely order them in a restaurant but I am always curious when they are on the menu as a side dish. I figure they must think their meatballs are pretty good. I was impressed. Best meatballs I've had in a long time. They also had a pork belly side dish. I liked it, my wife didn't. The flavors are very concentrated and strong.  We shared a rice pudding for dessert. Also the best I have had in a long time. I am usually disappointed when I order it (I keep trying though) but this one did not disappoint. We'll be back.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2012-09-08', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 4, 'cool': 5}, 'user_id': '5lq4LkrviYgQ4LJNsBYHcA', 'review_id': 'wAHJDp75s7fYqIitzq_SBQ', 'text': 'Unassumingly set in the back corner of the Town and Country Mall and demarcated by a sign simply reading "Italian Restaurant" I\'ll start out by saying that even if Bianco had chosen to put his name on the space it would have been tricky to find, but the fact that it goes under such a generic moniker almost seems to reinforce the fact that the chef isn\'t trying to rest on his name alone, but instead to focus on the food he holds dear.  With rustic signage and large glass windows looking into the open kitchen there is not a shred of evidence that this is a "celebrity chef" restaurant and, really, if one didn\'t know any better they could walk right by without paying the space a second thought.\n\nWith the time just before 2:00pm and lunch hours till 3:00 I walked through the doors to find the interior largely similar to the outdoors and with the kitchen behind a small bar to the right and three other couples seated amidst the ~40 unmatched chairs and old wooden tables to the left the feeling was instantly anything but that of another Arizona shopping center. Working on a small crew of three during the late lunch hours I stood for a moment at the hostess stand before being greeted by the Chef who introduced himself as Rob and suggested I take any seat I like, eventually settling on a cozy two-top beneath one of the ceiling fans as the room was a bit warmer than I\'d prefer.  Settled in and with my books in hand it would not be long before I was greeted by Hillary, the sole server for the afternoon, who presented the 13-item menu.\n\nWith a vibe that speaks to a sleepy Italian villa from the shabby chic seating to paintings straight out of the hands of Italian street artists I spent a few moments perusing the menu before Hillary returned and with iced water in hand and the chef agreeable to my gnocchi request it would not be long before a plate of Pane Bianco Bread with Olive Oil would arrive from the kitchen and after a short conversation with my server about what I was reading I turned my attention to the crusty yeasted roll that, while good on its own, was vastly improved by ample use of the grassy and slightly fruited oil.\n\nMoving next to my special request, I really did not know what to expect from the preparation as it was simply listed as "Potato Gnocchi with Arizona Sweet Corn and Zoe\'s Pancetta" but seeing as how I love all three ingredients I figured it would be good no matter what; little did I know that it would be the best gnocchi I\'ve had in my life.  Beginning first with the potato dumplings, each of the little balls was hand cut, light as a cloud, and literally melt in the mouth tender even after a quick sear in the pan but moving past the obvious pasta skills of the restaurant what truly put this dish over the top was the ragu-a sort of half roasted corn kernel/half creamed corn imbued with cream and smoky notes from the pork amalgam absolutely teaming with both sweet and savory notes. So simple, so rustic, and yet so perfect I simply cannot say enough about this dish-the one that finally unseeded Marc Vetri\'s 2 year stranglehold on the best version of my very favorite pasta.\n\nAs I swooned over each bite of the gnocchi Hillary kept my water filled and stopped by repeatedly to check in and find out when I was ready for my sandwich and although I was sad to see the gnocchi go I was happy to see the "House-Made Mozzarella with Prosciutto Di Parma" sandwich arrive in the same vivid glory as the one from a month prior at Pane.  Again focused on bucolic simplicity and flawless ingredients it would be hard to find fault in this sandwich or its accompanying fennel and lettuce salad in a light vinaigrette but as good as the Prosciutto was I couldn\'t help but think I liked the tomato slightly better...though I bet a version with all three would be stunning.\n\nAt this point quite full and with dinner plans that would turn out to be quite extensive Hillary stopped by and boxing up half of my sandwich asked if I\'d like dessert-a suggestion I nearly declined until her smiling description of the Asian Pear Crostata sold me that it was something I should probably just go with - and go with it I did, a bargain basement $5 for superlative poached pear served over a rustic butter pastry and topped with vanilla infused cream. Light, delicate, and much like the pasta and the sandwich a perfect evidence of what one should expect from all of Bianco\'s restaurants-perfect ingredients largely unmanipulated and prepared just enough to extract maximal flavor.  \n\nA charming space with lovely service and food that speaks to everything I love about Italian it would be hard for me to find a single bad thing to say about Italian Restaurant and with an offer to stay and study as long as I liked the only thing that kept me from lingering at 4743 N 20th St was the fact that it was a little too warm for such a full stomach-it made me feel like I needed a nap; yet another sign of a very successful meal.  I\'ll be back, no doubt.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2012-09-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'q9zdZyN95FNX9Q9vJK_jWg', 'review_id': 'Yiop7HETD5-QIuRyNihSdQ', 'text': 'What a great little place! it\'s tucked in the corner, small and very quaint. the decor is very trendy and homey at the same time. very romantic at night, but still gives a family setting.\n\nDinner was delicious!\nbread/butter - amazing\nappetizer - grilled zucchini, savory\nentree - it was a crepe type of dish with cheese and spinach in the center. the BEST fresh flavor.\nside of meatballs - cannot come to this place without having them!!! so tasty, lots of flavor.\n\nthe waitstaff was very attentive and one of the owners came to our table as well. she definitely gave us a "we\'re at home feeling" which had us feeling "we love you nonna!"\n\nfood was great + service was great = total experience was exceptional', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2012-09-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'zaMpyqjK3jFaYl9Sv-Q6yg', 'review_id': '9pJ194_tJM6tuEBL7DeIoA', 'text': "I first went to Italian restaurant before they had a license to sell any type of alcohol.  It was probably only open a week or 2, but I went with a group of six, and we felt that while the food was OK (3.5 stars at best), after ordering about 6 dishes, none of us were even close to full, and the prices were quite high.  I didn't go back for months because of this.\n\nRecently, a friend told me that the food had changed, and I had to go back and try it, especially for lunch.  I decided to go with a few co-workers, and all of us thought the food was excellent, and the value was apparent.  The 3 dishes ordered were the meatball sandwich, spaghetti with tomato sauce, and cavatelli with sausage and cauliflower.  Every dish was great, and the portions were huge.  It was served with great bread and olive oil, and the service was great.\n\nI went back for dinner a couple of weeks later with 3 of the 6 guests that were at our first foray to Italian Restaurant, and all 3 were skeptical about going.  However, once we got the food, all were very happy that I had convinced them to give it another shot.  We had the mixed grill, which had local sausage and roasted chicken with roasted veggies.  We also ordered 2 pastas, which was more than enough for the 4 of us.  At the end of dinner, the chef sent out a free dessert, which was a cake that was excellent.  \n\nSince I work close to Italian Restaurant, I will go back for lunch at least 2 times a month, which is how often I go to Pane Bianco, which has a couple of my favorite sandwiches in town.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2012-09-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'vi27yI3CBLeanxNGlk03-Q', 'review_id': 'bUE3XbOgrliPZsUG-3qOvg', 'text': "I'm a Jersey Girl used to red sauce (gravy) great pizza, and meatballs served by people with Italian accents, because they are from Italy.  This is one of the best Italian restaurants I have enjoyed.  The food is real Italian, focus on pasta and meat, not tons of mozz.  I had the Chicken with Peppers, lovely chicken falling off the bone.  My husband has Bolognese and it was the real thing with carrots as the base.   My father had the best sausage cauliflower cavatelli, homemade noodles.  I want to take this restaurant back home to show the mozz crowd what Italian food is.  They source from local farmers.  Five stars plus.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2012-10-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'qaqP9qx0Pe22vPXriPyT-Q', 'review_id': '2zN802V69j51zVBDtlqVag', 'text': "Had a very unsatisfying experience.  Service was very un-engaging and the food was mediocre...  The server forgot our cheese plate, even though she passed by us several times with out noticing or checking in us.  We ordered a bottle of a blended red wine from Rhone,  it was old and oxidized...  When server came by (25min) later to tell us our hot food was almost up, I then told her about forgetting the cheese plate.   Trying to sell me a dessert that I wasn't even contemplating at the time we just wanted our entrees.....  Few others to list, but overall very very disappointing.  Should of went to the parlor..    Good thing it wasn't my birthday........NOT!!! :(", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 1, 'date': '2012-10-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'd0wJVf7Gv7v1B-HHYhxZtQ', 'review_id': '2MXZkexAHiH8OEVmisvrlg', 'text': "The decor is great.  Very nice set up, its fun having a huge window where the kitchen is viewable from the mall side.\n\nThat said, the rest of it was not the best..  They give you a crostini appetizer/sample(?) with some kind of cheese on top.  It was super salty and not great... unsure what the point was..\n\nThey have Coke Light, I guess a naturally sweetened version of Diet Coke.  My friend ordered it and I was hemming and hawing and decided on the water.  He brought us 2 cokes anyway and charged for both.  I think part of the problem is there's no music, but the noise level is a bit high sometimes.  We had a hard time hearing half the things the waiter was saying and I'm sure it goes the other way as well.\n\nSo we tried the Cavatelli and the Gnocchi.  The cavatelli was not the best pasta, sausage pasta plate I've ever had.  The gnocchi got a bit old after a few bites.  Basically a bed of creamed corn, potato gnocchi and chunks of panchetta.  Not terrible, but gets old.\n\nAll in all, wouldn't go back.  The prices don't justify the lackluster pasta dishes.  They bring you 4 pieces of bread at a time (we had a table of 4 so we asked for like 2 refills).  The cheese plate is not very big, but tasty.  However, I thought they would bring us more bread for the cheese plate.. didn't happen, had to ask for it separately.  My friend's water glass didn't get filled all night, we tried moving it to the edge of the table too.  We had 4 different waiters and nobody can fill a water glass for over half the dinner?", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 2, 'date': '2012-10-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'sK0LOkEIibrdjl1ehYjnvg', 'review_id': 'azlVr-PzpmGj8rFLLdNWOw', 'text': 'I loved this place. Great Food, Great Service, Great Prices.\nGet the Zucchini app it is damn good.\nThanks for a good exp...', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2012-11-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3u3A_E9IseQv-AatiUFcpQ', 'review_id': 'NLhe5YcYIo0CjZbNDyhY-Q', 'text': 'Great hidden gem!  Went there last night for dinner and was very impressed!  The zucchini was egg was amazing as well as the sausage pasta with the cauliflower.  Sounds like a crazy combination but was amazing!  Go check it out!', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2012-11-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PQCXVC-8rfvcBhafRSjzfA', 'review_id': 'c1Pmt1U1myYtCdb4ONIpSQ', 'text': "I live in the neighborhood and walk by Italian Restaurant pretty much every day on my way to my yoga class. I first tried it shortly after it opened and found it OK. In those days they served wine in regular glasses, the way they would in simple eateries in Italy, and I thought it added an air of authenticity to the restaurant. The pasta dish I had that time was good, although not outstanding, but it tasted fresh and uncomplicated. The flourless chocolate cake and cappuccino were a disappointment, but overall I thought it was worth visiting again. After all, it's right in my neighborhood, and the ambiance is very nice.\n\nI made my second visit this evening. The first change I noticed was the wine was now served in wine glasses. Unfortunately, the elegant glass had taken all character out of the house wine, which tasted watery and flat. I was trying to decide between pasta with eggplant ragu and pasta bolognese. When i asked the waiter for advice, he recommended to go with bolognese, and so I did. Beef was the overwhelming ingredient in this dish, and it was very heavy and extremely salty. In fact, all I could taste was salt. I couldn't figure out what kind of pasta was used in the dish. I thought the menu said farfalle, but what I got on my plate were very wide and thick ribbons of pasta. When I finally managed to extract some from under the heavy beef sauce, it tasted very al dente, heavy... and tasteless. I went through about two-thirds of the dish - I was hungry - bur couldn't detect any taste other than salt. \n\nAnd yes, I got the weird crostini at the start of my meal and was unimpressed to say the least. I had come in fully expecting a nice meal and left totally disappointed and still hungry. A place called Italian Restaurant that can't prepare a decent pasta? We are fortunate in this neighborhood to have many good restaurants within a few blocks, and Italian Restaurant just doesn't measure up, not to mention being too pricey for what it serves. So I'll continue walking by on my way to my yoga class, but I have no plans to ever stop in again.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 2, 'date': '2012-11-20', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'pLMSnERm1FKC0hblPPoQ8g', 'review_id': 'r7BYpOSVuNwoZngBGxhIng', 'text': 'I found the food to be EXTREMELY crunchy but tasteful. I ordered a fish. An orange one. Also, there were a lot of ingredients, just too many. I did have a wonderful beverage though.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 2, 'date': '2012-11-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'e_raEH6Y6fdS20UWGpZ5Nw', 'review_id': 'EU9nizjH_BW9o2mC_xsDnA', 'text': 'This is classic Italian food and dining.  I felt like I was back in Italy!\n\nIt\'s not going to be what you really expect when you see "Italian Restaurant".  I was a little skeptical being someone who doesn\'t eat much pasta, but I survived and had an incredible meal.\n\nI know the menu changes pretty regularly, which is fine with me.  There\'s a few antipasti dishes, pasta, and proteins.  I wasn\'t amazed by the pasta (Italy still holds that crown) but was happy with the anitpasti and proteins that we ordered.  Additionally, the desserts were fantastic!  Bianco\'s mother was in town and had made a special galette that night.  It was magnificent.\nThe wine list is also pretty good.\n\nKeep in mind that it\'s a small place so it doesn\'t do a bunch and the restaurant is quite intimate.  That being said, it is the truest representation of classic Italian food and dining that I\'ve experienced in the Valley so that\'s why it has 5 stars from me.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2012-11-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'KL5y0_ithKeM-MmQ6hxMpA', 'review_id': 'ocMGzsJU3eCa_HCMPI_GgQ', 'text': 'Not a good meal.  Meatballs and chickpea crepes were too salty. Eggplant and spinach was an unappetizing greasy pile of slime and tasted oily.  The meatballs were accompanied by truly tasteless tomato sauce.  The pasta was nothing special.  Crispy Brussels sprouts were anything but..undercooked and chewy.   And three slices of bread was brought to the table with just enough olive oil for two slices.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 1, 'date': '2012-12-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'gyzJFtRuzprkbOzWWJEGzg', 'review_id': 'kzo0VPerQSROQ_RX1nGboA', 'text': 'My wife, my son and I had a FANTASTIC lunch today at Italian Restaurant.  My wife and I are Brooklyn born and raised and It DEFINITELY met our New York City expectations.  The prosciutto was EXCELLENT, the homemade mozzarella  was to die for, and the flour less chocolate cake was the best we had ever had.   The bread reminded me of what I used to eat at the famous Carolina Restaurant in Coney Island when I was a kid. I give this place 5 stars and highly recommend it!', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2012-12-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'p7dvahRPZIWL7T6pFA_0dg', 'review_id': 'NkrkU5XH_0g31TpC5DV_MA', 'text': 'I heard about the recent changes and I thought we should give this place another try. \n\nEverything we had THIS TIME was very well crafted and made with the finest local ingredients. The prices were also very reasonable for this kind of quality and the portions were more than we needed.\n\nThe pasta e fagioli was made with assorted heirloom beans including scarlet red runner beans and the pasta was well crafted and al dente. The soup was made really well.\n\nI had the chicken salad plate. The chicken salad was made with this really well developed dark meat chicken that was cooked so perfect it was a joy to eat. I think it had a little mustard and oil holding it together and it had tiny pieces of green apple and pecans though it making it tasty and delicious. I really enjoyed the vegetable salad on my plate. It was made with heirloom fancy red carrots and heirloom radishes , fresh crunchy cabbage , and parsnips. The vegetable salad seemed light and tasty. On the other end of my plate was fingerling potato salad. The potatoes were warm creamy texture and sort of mustardy. Overall I was very impressed with this $10.00 dish as it far exceeded my expectations.\n\nMy husband enjoyed the grilled mortadella and braised cabbage sandwich. The flavors went together well and this sandwich came with a salad. $9.50.\n\nI liked that they got rid of the community tables and made that area a bar.\n\nUnlike my other visits here Chef Bianco was in the house and everything prepared was perfect. I hope when he is not there that his place will run just the same.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2012-12-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TGHuWYufS_-GO0cENvUmJQ', 'review_id': 'Dc1xoFQCaIw1lwJcP9onKg', 'text': 'Delicious food crafted with love from ingredients grown , milled, and locally sourced by the chef/owner.  And we know this because we were told it by the unassuming , Chris Bianco, who walked around the dining room asking diners if their food was ok and then described the ancient grains in our farrow dish, the tomatoes he grows in California, and the Arizona wheat he mills for the flour used in the pasta dough.  And our amazing desert was homemade by his mother, who happened to be in the restaurant that night.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-01-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'ZmCfwDMuYkhpyr-hWKgiaw', 'review_id': 'LXEy7251P4n1f48-Qzh-rA', 'text': 'As is typical of the Bianco "family" of restaurants, it\'s delicious, fresh, locally grown or sourced, creative food served by needlessly condescending too-cool-for-school hostess and staff, and subject to a maddening string of nonsensical, rigid rules regarding any changes to fit tastes or dietary requirements. Nevertheless, Enjoy the excellent food and carefully curated wine list.  The stars are all of the homemade pasta dishes and the meatballs, which are light but not full of filler. Just perfectly done. They recently installed a wood burning oven and now offer pizza; I haven\'t tried it but my spies tell me it pales in comparison to the Pizzeria. Overall I recommend Italian Restaurant, even though it sometimes drives me crazy.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2013-01-18', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 4, 'cool': 3}, 'user_id': 'uZbTb-u-GVjTa2gtQfry5g', 'review_id': '1l9E7OLph-dCnGCfOIsR4A', 'text': '* * * * \nA bottle of white, a bottle of red\nPerhaps a bottle of rose instead\nWe got a table against the wall\nIt had an old familiar air\nMy friends and I, sitting chair to chair\n\nA bottle of red, a bottle of white\nIt all depended upon our appetite\nWe met for dinner, it was nonchalant\nIn Chris Bianco\'s Italian Restaurant.\n* * * * \n\nWithin the Town and Country shopping center lies Chris Bianco\'s Italian Restaurant, a nod to simple, unpretentious Italian-American cuisine.  There is an emphasis on home-made, fresh ingredients, as is evident in the hand-made pastas and slow-cooked meats.\n\nWe were first served some lovely crostini with a creamy cheese (Maybe ricotta?).  We also decided on getting the cheese platter appetizer, which consisted of Brie, sheep\'s milk cheese, and goat milk cheese with orange marmalade and candied pecans.  It was served with a basket of bread, and a single buttery looking crostini on the cheese plate.  The bread was a little too chewy for my tastes, but the cheeses were quite nice, especially with the marmalade and pecans.  \n\nFor main courses, I ordered the crespelle, and also tried the porchetta and papardelle.  The crespelle is like the Italian version of a savory crepe.  It had freshly made ricotta, spinach, and garlic, with a hearty, chunky tomato sauce.  The crespelle tasted decent, although there were large halved pieces of garlic in the filling that still had some "bite" to them because they weren\'t fully cooked.  The papardelle I tried had a nice meaty ragu to accompany the fresh pasta.  The porchetta was easily the best item out of all our meals.  The slow-roasted pork was very tender, and the sauce had a nice full flavor that matched well with the pork, black-eyed peas, and root vegetables.  \n\nI was kind of torn on what to give Italian Restaurant rating-wise, since the pasta dishes, although impressive that they were freshly made, just tasted OK to me (A 3 star for just the pasta).  However, the porchetta and friendly service helped tip the scales so I\'ll upgrade to a 4 star rating.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2013-01-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MCRGJLVlT6FkC8pC5GPFzQ', 'review_id': 'XgI1au6UzrAYBxvnf959iQ', 'text': 'I have had the pleasure of dining at this restaurant three times.  Each and every time the service and food was amazing.  The restaurant has a very home-like feel to it.  Every employee that I came in contact with was fabulous.  The two servers I have had are "Charlotte" and "Adam," and both were exceptional.  The price is very reasonable for what you get.  I have had the spaghetti and meatballs, pizza, salad...and it was all to die for!  I highly recommend this establishment,whether it is for a romantic evening or a fun night out with your friends.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-02-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oTMpHm1gpQVkUkGd0lDuDA', 'review_id': 'KaOUacnftqIvJULDIxL7JQ', 'text': "This place is great but don't tell too many people because I want to still go without having to wait for an hour!  The employees are all very nice & easy going. If you like good authentic Italian food you will love this place. \n\nI am not a foodie.  Just a regular gal who likes good food and good service. \n\nThe appetizer salad with brussel sprouts was delicious. We also had pasta, pizza, & desert. If you've had Cibo's homemade pasta it's on the same level.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-02-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'fUGKPnPd9fYOUgw722mSgg', 'review_id': '8hTKQvxUd6Ugo8JQV9QRmw', 'text': "Of all the Bianco restaurants, Italian restaurant is by far my favorite.  It is the best of all three worlds; pizza, pasta and sandwiches, all with the familiar Chris Bianco style of fresh, local ingredients and food made from beginning to end all in house.  \nI would definitely say the worst thing about the restaurant is trying to decide what you want to eat!  You could always do what I did though and go with people who love to share!  We had three things the day I went for lunch: Josh's foraging fowls chicken salad with fingerling potato salad, house made mozzarella and prosciutto de Parma, and a special which included fresh made orecchiette pasta with sausage.  This was definitely one of those meals where you did not know what to eat first, because you weren't sure which dish you wanted to last the longest!\nChef John Hall is also a great addition to the newest Bianco restaurant since his farm-to-table background is right in line with the restaurant's concept.  Hiring him was definitely a smart move on their behalf. \nSincerely looking forward to my next meal at one of my favorite Phoenix restaurants!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-02-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 't3CSBTuQcKOaIMB7U188rQ', 'review_id': 'G8_qxuhvaoEhuOyR7lcp6A', 'text': 'My mouth waters whenever I think about this place! I am not one to normally write a review, but I feel like this place is a hidden gem that needs to be experienced by all!  I can honestly say that no matter what item you choose to go with on the menu, you will not be disappointed. The food is incredible and the service is amazing. Every person working there is so welcoming and makes you feel like a long time friend. This is by far one of my favorite places to eat in Arizona.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-02-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CWMNjDCJKPsv0CAeDrxtew', 'review_id': 'jUsGaSRJktB0_3ENKFOo_Q', 'text': "Excellent food, amazing ambiance and very friendly staff.  It really doesn't get much better than that.  This will definitely be a restaurant that we frequent.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-02-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'lPiY8MrEogMXNSF7_RitTg', 'review_id': '-vc15bwkKrlh07FiD3ry9Q', 'text': 'Italian Restaurant is officially one of my favorite restaurants in town. After our third wonderful visit last night, it\'s become our "go to" when we want a great meal, great ambiance, at a really reasonable price.  Each time we\'ve gone, we\'ve tried something new on the menu, and each one is better than the next.  The pasta with lamb was out of this world, but most likely you won\'t see it again, as Chris changes the menu regularly, depending on what\'s in season, and the most fresh. However, if you get a chance, try one of their mainstays,  the meatballs, whether in the sandwich, or alone with the most delicious marinara sauce and some of his out of this world bread. In fact, it was so good, we bought an extra order to bring home with us, and I ate it for breakfast this morning! We usually get a table, but last night we elected to sit at the bar, and were so happy we did. Mike and Lisa made the experience that much better, by making us feel welcome, like we were sharing a meal with friends. Oh, and if you like Mojitos, the house Mojito is insanely good. Only trouble is, so good, they go down really quickly! If you\'ve been thinking about going, GO!!!  Do NOT wait!  Bravo Chris Bianco.  You\'ve done it again!', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-02-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-_vfaGjaCTgZX2fUl3YPrQ', 'review_id': 'gHYt4ozAE4dz2FyeG3-2sA', 'text': "It's hard to understand the negative reviews.  My wife and I have eaten at Italian Restaurant four times over the past six months.  The food and service here are excellent.  Everything that we have tried on the menu was very good.  The chef has a literally fresh approach to Italian cuisine.  If you want stereotyped plain old Italian food, this is not your place.  The atmosphere is simple but pleasant, with a view of the kitchen in the main room.  There is also seating outside, and they just expanded into an additional room.  Business must be good!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-03-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '62IOkVUNol46noDpBdGOzQ', 'review_id': 'GivfRLpzGiq1A9SvsswHUw', 'text': "Town & Country's Hidden Gem---great casual Italian fare--tip your cap to Bianco for returning to this small shopping center.  For some foodies the 2 hour wait at Pizzeria Bianco is part of the experience, but check out Italian Restaurant for the same great pizza without the wait.  Only 3 pizzas to choose from, but they are of the same quality.  The homemade pasta, local ingredients, and fresh baked bread are all amazing.  The culinary and front of house team provides friendly fast service in a nice relaxing atmosphere.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-04-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qxrwOv6pQ6rpP-zwshtEgA', 'review_id': 'KcMp-gQhLazDANYHLVkkgg', 'text': 'Not sure why my review for Italian Restaurant ended up under Pizzeria Bianco so I want to fix this. Love pizzeria Bianco but go for lunch. Dinner is way too busy.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-04-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'D30Zx1lFfgOPsFJDA5WgTA', 'review_id': 'SQETzNZxPx7huRhtILIXeA', 'text': "Upon arrival, I was pleasantly surprised to find that they expanded the restaurant. We were seated in the new room in the back; it was like being in a restored Tuscan farmhouse with all the candles, paintings, chandeliers, firewood, books and such. At our table, even though it was still light out (just after 5pm) they already had 2 candles lit, and along with fresh flowers and pepper grinder and salt, this shows how much pride the owner has in this restaurant. \n\nFOOD: I think I had the best dish at the table, the pappardelle with bolognese. I think they seriously improved this dish, as this is the most authentic, with rich sauce; the best I have had in a long time. I just loved the thin sheets of obviously homemade pasta. The lasagna verde was also very good, but I think they should have just eliminated the red sauce and done more of a bechamel. I didn't care so much for the chicken involtini; it was a little dry, dense and tough, as if it was precooked and then reheated.\n\nThere was also a new sign indicating Pizzeria Bianco, probably because they now have a wood-burning pizza oven. However, I hope this isn't the same pizza that people wait over an hour for at their sister restaurant because I wasn't too impressed with it. We tried the margherita: the crust wasn't that thin or crispy on the bottom; sauce was great but cheese was scant and not very bubbly hot. Having lived in Rome, Italy I guess I was expecting that type of pizza so maybe this is supposed to be more like what you would find in Florence. However, the homemade bread and olive, brought to the table at the very beginning, is just amazing.\n\nSERVICE: top notch, professional; our waiter was well-dressed (like all the other staff) and non-obtrusive. You can tell he timed everything accordingly, waiting for us to finish the appetizer, unlike other Phoenix restaurants where I have to wait to order my entree to avoid getting served too fast.\n\nHIGHLIGHTS: ambience, simple fresh and high-quality ingredients, service. I will be back to get the spaghetti with an order of meatballs. I eyed them at another table and they looked amazing even from 20 feet away!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2013-04-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9NyCrQI8gvY73gz7hSNY8g', 'review_id': 'YrZI3LPLmrLkTSL6s2P23w', 'text': 'Excellent fresh pasta dishes', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-04-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'P1G0pAMZTpUGTsV2ZvjLVA', 'review_id': 'jgkw0JG8igXmInbXwDANUA', 'text': "Best Italian restaurant I have been too hands down!\nThe food was impeccable, the scenery is gorgeous and my drink was fantastic! Don't forget to order the desert!!!! After you try the chocolate cake you wont want to order cake from another restaurant again! Service was amazing and they were packed!!!!! If you haven't tried Italian Restaurant, you need to!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-04-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'Phj1jHdpcPPBE1hNg9-Tqw', 'review_id': 'BU3lKUVHs2BvoGRZkPqSpA', 'text': 'I am NOT going to Review Pizzeria Bianco (which I finally got into, after four tries!)  as there is no way it could ever live up to the hype and it didn\'t for me.\n\nThat being said - DO NOT MISS THE BEST ITALIAN RESTAURANT IN PHOENIX, part of The Bianco Braintrust!\n\nThis is a remarkable Restaurant to say the least. Slow or busy, the staff is excellent, the place simply and nicely decorated and the food quality very consistent.  I have had or shared most of the menu items, including two of the three Pizza offerings (each was delicious, with thin crust) and they have been unanimously delicious. A relatively short menu, but here are my favorite standouts:\n\n             Crunchy Brussel Sprouts Salad - is to die for! DO NOT MISS IT!\n\n             Market Salad - is excellent, but I can\'t NOT order the Brussel Sprouts Salad\n\n             Francesca\'s Meatballs - Excellent, as is the Marinara Sauce\n\n            Cavatelli (which I love) - might be the best ever!\n\n            Tangelo Chicken Involtino -  is quite fabulous and I seldom order chicken\n\nThe bread is excellent and here is NOTHING not to like that I have ordered. A couple of dishes, although good, were not as unique, as flavorful and as sumptuous as the ones above (which raise the bar relatily high!), yet still VERY GOOD.\n\n             The Pasta Fagiola is a little thick for my taste,  but great flavor.\n\n             The Grilled Asparagus, while very nice, was NOT as unique as other dishes\n\nHad pretty much given up on excellent Italian Food in Phoenix, but this jewel has restored my "Italian Cravings!"', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-04-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'tBvrnSCLSpUdCDm5w5GPkg', 'review_id': 'jde0gX5r9dNmbpoPmyvIZQ', 'text': "I don't get the hype associated with Chris but I digress. ( I love the sandwiches at Panne though)  My dinner partner is Italian and what she ordered she said was very good. I myself did not think mine was to die for. I must be jinxed and order the wrong thing every time I eat at one of Chris' restaurant. I have to admit though his hand pressed mozzarella, tomatoes and Italian sausage are high quality for AZ standards. Maybe I can just eat apps here. lol \n   The service was fine, nothing to write home about but not bad either. The restaurant is small. I felt squished. However, I have heard they are expanding. I have also heard they are adding pizza and Pannes to the menu! Woot, woot! Well, I guess I will keep trying Chris. I am determined to get a good pizza from you at least one time. We are not done with each other yet. lol! \n   Good luck on the new venture. I like the open kitchen and changing menu concept too. Four stars and a return trip guaranteed because you are better than most so called Italian places in sadly lacking Az. Also,if my picky, NY, Italian, makes pasta and gravy from scratch friend VK likes you, there has to be something there that I am missing.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2013-04-28', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': '9UNGbiE9k0fvMpCMJp0Gww', 'review_id': 'DLucoAaJeI6XXD_uzg7fIg', 'text': "First to review!  I had to say it.  Everyone and their mom knows about this place.  Did you know there is now a 2nd location?  This one just recently opened its doors.\n\nI gotta say, if you haven't been able to get downtown to try this place out yet I would definitely check out this location.  We were seated immediately (on a Tuesday night).  When we left there was a line but regardless it is much less busy than the downtown location.  This location also takes reservations!  Keep that in mind for those busy Friday and Saturday nights.\n\nAlright, lets get down to the pizza.  I had the Wiseguy.  I always have the wiseguy.  It has a delicious smoky flavor to it that you cant get anywhere else.  I have tried about 3 of the pizzas here and have not had a bad one yet.  The prices are a little high (as in $18 for a personal pizza), but whats wrong with splurging every once in a while?\n\nThat being said, I have to compare this place to some of my other favorite spots in the area.  The other two juggernauts, The Parlor and LGO, are right around the corner.  The Parlor is still my #1 pizza joint around here.  You can't beat their meat & cheese plates.  I would say LGO and Bianco are tied for #2.  LGO has a great vibe and neighborhood location.  Also its closer to my house.  \n\nYou need to try all 3 places and judge for yourself.  They are now all relatively close to each other and are by far the best 3 pizza joints in Phoenix.  Its the only way to truly know!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-05-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'KK_2vxqNug1wQhVo22soQw', 'review_id': 'byZFXpjG3aWG2KNqDsq3IA', 'text': 'Welcome back, Chef Bianco to Town & Country.\n\nPizza stays incredible.  \n\nYes, I almost ate my entire Wise Guy for lunch yesterday. Thanks for the neighborhood location.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-05-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'cx905u1BBP5vU4PH2U-V3A', 'review_id': 'lYj8sRidKpKTOcLvTS9d9A', 'text': "Excellent pizza and service!  \n\nI am used to the three hour wait for pizza from Pizzeria Bianco, however after only 10 minutes we were able to get one of the best tables outside.  I'm sure this will change once word gets out on the new location, but for now it's easy to get in :) \n\nWe had the margarita, wiseguy and biancoverde pizzas and all were great!  My favorite is the margarita, it's very simple but the ingredients are amazing.  Second is the biancoverde (we were able to add the wood-roasted onions and it was awesome) and then the wiseguy...but I would highly recommend all three.  For dessert we had the chocolate cake and tiramisu with homemade cream.  Loved them both, can't go wrong with either.  \n\nOur waitress and both hostesses were great and I would go back again in a heartbeat!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-05-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1g8Crb6WGQUsA2l2X3yVGA', 'review_id': 'IUucUAdfbqM-Y4vkavbqlA', 'text': "Just got back from Italy and was looking for authentic Italian cuisine vs the American Italian cuisine/New York style etc etc. Have never been to a Chris Bianco restaurant because of the long waits and no reservation policy at the one downtown. When I called to get reservations for this one I was very pleased that they took reservations. Yes I do get the hype going with the simplicity of his cooking with the freshest ingredients available locally. That is simply what Italian food is about in Italy. Our son took us for Mothers Day and we all shared every course and had an exquisite 3 hour meal Italian style. Ordered each course as we went. Antipasti, a market Pizza that was heaven, Market salad, a fresh pasta dish, then the secondi, fab dessert w/coffee. The Chianti was excellent as well. This was the beginning of a new relationship with our palate and Chris Bianco's talents. Can't wait for our next rendezvous....", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-05-13', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 5, 'cool': 2}, 'user_id': 'h3WSnBJKQTndnejB4RrHrg', 'review_id': 'kwzQIRoct4NQRwOH__qhyA', 'text': "Mouth wateringly delicious! Can't wait to go back and try more items. So glad I switched gyms a while ago, because if I still worked out at LA Fitness (right next door) I'd probably pop in this wonderful place after every workout. :)", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-05-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mloCRGrVoHtGROMRz7X6Dg', 'review_id': '0hwZWClkaoabysV1ctTCUg', 'text': 'delicious. staff is excellent, food is excellent, what more could you ask for?', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-05-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'S7uzobRuAK5GoBmFHVeCCw', 'review_id': 'FRs4U7QMHOyX0qx0vPGEvg', 'text': "First time to Chris Bianco's pizza restaurants.\n\nWiseguy pizza was very tasty - pricey but very good $18\n\nMargherita pizza average at best. Nothing special, not very much flavor, very skimpy on the basil. Not worth $15\n\nThey do have a very good wine selection, average restaurant prices.\n\nOverall, the pizza was average.  \n\nFor better pizza, go to Federal Pizza or LGO.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2013-05-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '5lq4LkrviYgQ4LJNsBYHcA', 'review_id': 'obo6RvQkucudihrz1XSq0Q', 'text': "Visit 2, this time for dinner:\n\nCrostini with Garlic Goat's milk Butter\n\nPasta e Fagioli - Native Seed Search Beans, House Made Orchiette\n\nCheese Plate with candied nuts, fig orange marmalade, Pear- Red Barn Cheddar, Gorgonzola, 'Goat' Cheese\n\nRoasted Beets with Wild Greens, Warm Goat Cheese, Champagne Vinaigrette, Pistachio\n\nHouse Bread with Pac Sun Olive Oil\n\nAZ Sonoran White Wheat Crespelle with Escarole, Homemade Ricotta, Tomato Sauce\n\nFaella Spaghetti with Bianco Dinapoli Tomato, Basil\n\nCrispy Potato Gnocchi with Brown Butter, Sage, Parmesean Reggiano\n\nApple Crostata with Crema\n\nRice Pudding with Orange Fig Marmalade\n\nHaving since rebranded the restaurant to Trattoria Bianco after installing a stone oven to make his legendary pies the first meal I enjoyed with my family after driving back from Las Vegas was at Italian Restaurant.  Having already visited the Pizzeria, Pane, and Italian Restaurant for lunch myself this was my first dinner at a Bianco restaurant and arriving to find the space bustling we opted to sit outdoors in order to avoid the noise; a big mistake that instead led to both captain and a server named Adam largely ignoring us throughout the evening as water went unfilled, dishes were dropped off without description, ingredient questions required further investigation with the kitchen, and epic delays occurred between each course, plate pickup, and particularly drop-off and collection of desserts along with the check.\n\nMoving past service issues, the food was every bit as good as the first visit, the housemade pastas and bread clearly a strong point while fresh local produce shined in a salad with bright, bold vinaigrette and beets sweeter than almost any I'd previously encountered.  Unfortunately replacing my all-time favorite corn and pancetta gnocchi with a slightly more seasonal version featuring brown butter and sage the dumplings themselves once again melted in the mouth while the crespelle, a crepe stuffed to bursting with creamy cheese and bitter escarole, topped with Bianco's signature sauce was rustic, simple, and  perfect - just the way Italian food should be and just the way Chris and his team make it at each of their restaurants.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2013-05-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'sYidJ6jraZjE18eMi8ouNA', 'review_id': 'aYWPZ3CZjhy2qYQ9aU3rkA', 'text': 'Great natural ingredients, simple and wonderful.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2013-05-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'VZWOi9UAqveUbQxbapKB7g', 'review_id': 'xnvZ6L2vlztXUKXVZH2WCA', 'text': 'LOVE that this is close to my house and that the wait was only 20 min. Love both the verde and wiseguy pizza.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-06-01', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'MPRRpCrzvYA9jbNVEcMDDA', 'review_id': 'FJnx8xGMhs9h5U5HU8Hjfg', 'text': "Just like it's other location, this place is great. And because not everyone knows about it and they now serve lunch, there's not a wait.  (At least for me there was not). They even bring you out some warm olives to snack on as you wait for your food. I went with the Sonny Boy, and boy, it was heaven! Perfectly thin crust with delicious toppings.  My mouth is drooling thinking about it.  Next time in the valley, I will be back to try some of their other offerings.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-06-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'KK_2vxqNug1wQhVo22soQw', 'review_id': 'TZM9V4QiWxqHu2pz1VtMFw', 'text': 'We had an indulgent Friday and had appetizers with drinks at The Pizzeria (Trattoria) then moved on to a different restaurant for more grazing. This location may stay as a good lunch location as it was way too stiff and REALLY loud for a relaxing dinner.  Fried squash blossoms and bread were very good; martinis were yummy and nicely served. However, not until we settled in a similar reputable restaurant later, did we note the contrasts: staff here were quite tense (waiter had to yell over room noise) and there was no atmosphere to simply relax. To enjoy their food more regularly, the acoustics will need to be addressed in both rooms. Perhaps that may also put the wait staff a bit more at ease...', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2013-06-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '8UgwN_TM_1mw32nxR6Z3Yw', 'review_id': 'ybkYvYq5eZgaACBl4HLYYQ', 'text': "solid pizza, but to be honest it was oversold. the service was fine but i don't think i feel a need to come back here (though i wouldn't avoid it either). \n\nwe had the wiseguy because i'd seen it mentioned in so many other reviews. again, it was fine, i just wouldn't feel a need to have it again. i don't regret the decision at all, i just don't feel a need to try it again or to strongly recommend it to friends.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2013-06-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CY5lvNkNQR1TzIIGjx_2Nw', 'review_id': 'mmgjSgijikdUjCMxj9Y9VA', 'text': "Very disappointed. Had dinner there last night for the first time. Very limited menus. Don't understand why you can't order any pizza. Waitress great. Eggplant dish bland. Given the reputation I was really looking forward to a great meal. Three stars at best maybe two.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2013-06-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'v2L4GUj2klwCn4Ae9ztV9w', 'review_id': 'LAFbULLLIdN4EWkLpmw6uw', 'text': "Unfortunately, 3 stars is pushing it.  We had high hopes due to the several positive ratings from other users and word of mouth.   We started with the Local Greens salad, and it was just that - greens with with a light dressing and a few kalamata olives on the side.  We also ordered the margherita pizza with fresh basil, mozzarella and the fennel sausage.  The pizza came out of the brick oven crispy.... but black around the entire top crust, and the bottom was covered in black spots.  It had a distinct burnt aftertaste.  We started in on a piece, but soon notified the staff of the issue.  They were extremely understanding and promptly took the burnt pizza away.  They immediately put in an order for another one, and it came out very quickly.  Still a bit blackened on parts of the crust, but better than the first time around.  I will say the toppings were excellent - fresh mozzarella and leaves of fresh basil with very tasty fennel sausage. Overall, the atmosphere was very trendy and pleasant, but the food just didn't win us over, especially for the price tag.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2013-06-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4lgN4CaZzxUQG5kczc7fEA', 'review_id': '0CBamT9VGGDQW6PS-mZO_A', 'text': 'I had loved this place when they had the meatballs. They had pasta and everything but now they changed it and I was very disappointed they took it off the menu! This was what people talked about and now they have a weird menu. You just lost a fan Bianco.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 1, 'date': '2013-06-15', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 4, 'cool': 4}, 'user_id': 'XxA5k_iyzf9HdvPMp_J27w', 'review_id': 'sx1iM0U37WD0aFaqMJxj_g', 'text': "Nestled in the middle of the Town & Country shopping center is Pizzeria Bianco. There weren't any signs telling you that it was located there so I just happened upon it with some help from great Yelp friends. With all the word of mouth I'd. Heard about this place I was excited to try it.  \n\nWe met some friends there around six and didn't have a wait to be seated. Being seated at the only round white table there and the short chairs made me feel like I was eating at the little kids table at the family holiday dinners I had as a kid.  The place itself was a little small but they make good use of their space.  The place felt cozy and like it was your second home, with a few unknown strangers dining with you.   Our table though was located a little too close to the door and wood fired oven.  \n\nThe wait staff was very friendly and answered all questions promptly. She was even able to provide a recommendation on menu choices.  I really like it when the wait staff knows their menu. Although we had to request the bread and oil. The pizza was your typical thin crust fire baked pizza. I ordered the rosa pizza which had onions and pistachios. A very yummy and interesting combination.  The only downside to the evening was the menu itself. There are two pages devoted to wine beer and spirits but only one for food options. There were only 6 pizza options, 2 pasta choices and a few salad options.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2013-06-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 2}, 'user_id': 'W_7aQXf0uC4GKvte4tlewA', 'review_id': 'Uxq9RZOIF-7y2qQjB_lu-A', 'text': "I really don't think I'm the target audience for a place like this.  I understand what they're going for with these artisan pizzas but I really would just like a little sauce on my pizza.  Just a little...\n\nThe flavors are usually good but the lack of any sauce and more often than not over cooked dough make it hard for me to want to keep coming back to places like this.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 2, 'date': '2013-06-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'H__LUBdf7BWk-xBPIVtJ7Q', 'review_id': 'ZdWSWg9INfKVYv7ILgU6_Q', 'text': "Ok I guess I just don't get it.  I was really looking forward to a pizza extravaganza.  Afterall, how could Oprah, Martha Stewart, and my hero Rachel Ray be wrong about something as simple as a pizza???\nMy boyfriend and I happened to be off on a Monday afternoon and so we made the drive up here to check this spot out. \nThis location is hard to find.  We even looked it up beforehand and called for directions.  In the 110+ temperatures we were all but about to give up finding it and head over to Potbelly's (which would have been better in hindsight) when we finally came across what I had thought to be a pizza oasis.  It was a mirage.\nWe were seated promptly and given 4 small olives which were delicious, but it would be nice to have some bread and olive oil as well.  I mean, after all most people wait hours just to get in the door to this place.  I also thought the service was just OK.  No one went out of there way to recommend anything to us or even seem really friendly at all.\nThe food did come quickly though and the topping were really good.  The fennel sausage was flavorful, the mozzarella fresh, and the basil was very tasty as well.\nIt's the crust though that kills it for me.  Yes I am not an idiot and I know what brick oven crust tastes like.  It is typically charred and the crust is thin and chewy. Normally I really enjoy it, but here the middle was actually soggy.  It's a small pie, which is ok, but that crust was really bland and wet.  \nAlso again I would love to have the olive oil and Parmesan to dip the crunchy ends in. \nSorry guys I just don't get it.  I have had better brick oven pizza at dozens of places in Chicago and I hafta say to all my foodie heroes I have been let down.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2013-07-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ewnwxqKtpDv8erOIZkCpjA', 'review_id': 'Z2Z5emQG4uWRkXvaPgY1gA', 'text': "Pizzeria Bianco is widely acknowledged as some of the best Pizza (or The Best to some reivewers) in the nation. Not sure what I can add except to say it was terrific!  The Princess and I went to his second location in the Town and Country shopping center (Biltmore area) and walked right in at 5 PM.  The location is wonderful, setting is nice looking out onto the courtyard and it appears there are tables you can use if the weather is not 110 as it was during our visit.  We ordered a nice Italian red wine for The P and I had a negroni, both were fantastic.  The meal started with a small complimentary bowl of five small kalmata olives and  a few slices of their in-house bread with a bowl of olive oil, nice touch.  I ordered their famous wise guy and The P ordered the sonny boy. The wise guy is white sauced based with wonderful fennel sausage from Shrieners (local meat co.) fennel, roasted onions. Wood fired, the Pizza was excellent.  However, I actually enjoyed the sonny boy more.  It was red sauce based with soppresseta and it was, IMHO, one of the best pizzas I've ever had.  We finished the meal with flourless chocolate cake, very good with a vanilla sauce.  Service was delightful, server was attentive without being in our face.  Loved the small touches such as real silverware (Oneida).  Attention to detail has made Mr. Bianco a success and I'm humbled to be able to join the chorus of people who sing his and his restaurants praises!  Slainte!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-07-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': 'hn_DclKLzdxABRGGAuqKgg', 'review_id': 'skdTiXDTLcPBN8ZCyr-YHw', 'text': "I really, really want to give Pizzeria Bianco a better review and rating but I can't.\n\nAfter all the hype we've heard from people, we stopped in for dinner. We were promptly seated in a tastefully decorated restaurant. Our waiter took our drink order quickly, and we decided to try a margherita pizza. Someone gave us a beautiful little bowl of olives, and I watched our waiter (and other waiters) give various tables bread. I'm not sure if we ordered the wrong thing and it didn't come with bread, or if our waiter was careless, but we never got bread.\n\nOur pizza came out quickly enough but our server didn't give us any plates. After our pizza came out, I watched our waiter try to sell desserts to the table immediately next to us; he definitely saw that we received our food but we had to wait until I flagged down a busboy and asked him to get us some plates before we could eat. This took 3-4 minutes so our pizza was a lukewarm by the time we tried it.\n\nPizza was so delicious - crispy, thin, beautiful crust, fresh toppings (although I would have liked a few more basil leaves, but that's minor). After sitting around a few minutes longer and trying to catch our waiter's eye, he stopped by to sell us a dessert. We tried the tiramisu, which was excellent - best I've ever had. It came with a little fresh fruit and a beautiful whipped cream. I loved it.\n\nWe finally got our bill and left. I didn't like the poor service on part of the waiter, I did not like how cramped the seating is, and there was a gentlemen, perhaps the manager, who walked by a couple tables and loudly greeted regular customers. It's important to also greet new customers and ask how the service and food are; instead, he sat behind us at the bar area and loudly discussed scheduling for the employees. It just didn't make for a nice dinner atmosphere.\n\nI want to try the other location; perhaps the service is better. Overall, beautiful, wonderful food, but subpar service. It'll be awhile before I go back.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2013-07-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_sAwKVOz_mnYs5ru73HfVg', 'review_id': 'IaRtUZAPs1WPzgM6K0i57w', 'text': "It was too hot inside. The Decor left a lot to be desired. The wine was warm. And then came the pizza's (3 different pies) and nothing else mattered anymore. Best pizza in Arizona!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-07-26', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': '3gIfcQq5KxAegwCPXc83cQ', 'review_id': 'Gr9w1PkuGDLG1822I2mWZA', 'text': "One time I waited over 3 hours to eat at the Pizzeria Bianco downtown....well, thank god those days are over. This new location is nice because there isn't usually a wait and they have the same menu as the other location....plus it's right by my yoga studio (cuz after yoga, I need some pizza...duh!). I went with my mom and we shared their super simple salad, which was good, but plain with just a light vinaigrette, and we had a half bianco verde half rosa pizza. The pizza was soooo good. Better than I remember from the other location (the lack of the wait time may have helped too). I like that these pizzas are very different than others in Phoenix....local pistachios on a pizza? Come on! Is it the best pizza in town? No...but it's definitely worth a try!\n\n\nPS this may sound really dumb, but I had some leftovers and later that night I popped them in the micro in the plastic container and the container melted to the pizza...I was pretty devastated, so don't be dumb like me....safety first, use a plate :-P", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2013-08-04', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'NNdfPF-UhvLB8FxbsuSC5A', 'review_id': 'SMe0jmLni-LWig8Ni6USiw', 'text': "Heard about this place for a while and always wanted to go, but heard that there was only 1 location in Downtown Phoenix and the wait time is usually very very long, so I hadn't thought about it for a while.  Until I found out they opened up a new location at the Town and Country shopping center right between Baby Kay's and Trader Joe.\n\nI went in on an early Thursday afternoon, it was pretty empty as people are still working in the nearby businesses.  The restaurant only had a table occupied.  I was there with my g/f and we were seated by the windows by the patio.\n\nWe ordered a Rosa Pizza which has Red Onion , Parmesan Reggiano, Rosemary, and Pistachios.  We also ordered Pappardelle Paste that has Grass-Fed Beef Bolognese and Parmesan Reggiano.  Pizza was good, but the crust is too thin for my taste.  Pasta was good, but I think the price is way too high for such a small portion.\n\nOverall, I give a 3-star for good food and good location.  The price is whole other story.  I still want to check-out the original restaurant in Downtown Phoenix.  Maybe then I would come back again and do another review.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2013-08-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'C5hDZleIfHtcXS9p4ZYBuA', 'review_id': 'GO5y42cZipAVk4T5xxvlxw', 'text': "What a great new location.  No more waiting for hours.  The manager was AMAZING.  I was sad that my pizza didn't have their awesome tomato sauce on it, so she had them make me a new Wiseguy with the sauce.  Now that is some Great service.  The place is cute.  Easy to park.  We will be back!  The crust and tomato sauce it what makes the pizza so amazing.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-08-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': 'Pk3WMjNe130MURbkZ9ZCMg', 'review_id': '_Iv_8urAgySpurhk9aXehQ', 'text': "I've been coming to Phoenix several times a year for the past five years.  I have heard about Pizzeria Bianco incessently during that time but haven't been able to eat there because I am not willing to wait 2 + hours for pizza, no matter how good it is, unless my waitress is a bikini clad Mila Kunis (and maybe not even then).  However, when I learned they had opened another restaurant right around the corner from the office, I was there at 11:15 am the next day and was able to be seated immediately.\n\nMy review is pretty simple: this place totally lives up to the ridiculous hype.  The pizza (Sonny Boy) was amazing, as was the Market Salad (this one had arugula, peaches, walnuts, goat cheese).  Dying to come back and try everything else on the menu.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-08-14', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 6, 'cool': 6}, 'user_id': 'cRyNICH0mhjxagvSyVr60Q', 'review_id': 'skZG-OoEM9ZrWU6GuxIbdg', 'text': 'Bianco used to own the market on artisan pizza in Phoenix, and in some opinions, all of the USA. In the past few years a number of artisan pizza spots have opened which are bringing Pizzeria Bianco some competition. Still, few compare to what Pizzera Bianco keeps delivering to the table time and time again. \n\nI\'ve been told by more than one person the pizzas here are "Amazing", "spectacular", "the best anywhere", and so on. While I did enjoy the thin crust and the fresh, flavorful toppings and ingredients, I was not completely blown away by the pizza here. I think the trouble is that there is *s*o*  *m*u*c*h* hype around these pizzas, it\'s impossible to go into this expecting anything other than "the absolute, hands down, best meal you\'ve ever eaten". When you get to the other side of your dining experience, you find the meal just didn\'t quite live up to your expectations.\n\nWith that said, there\'s only one spot in Phoenix I like better than Bianco, and that\'s Federal. I\'m not going to tell you it\'s the most amazing meal you\'ll ever eat, but in the world of artisan pizza, it\'s seriously hard to beat. I\'d implore you to try Bianco for yourself, go in with appropriate expectations of a "really good pizza" and you won\'t be underwhelmed like I was. \n\nIf you feel like taking this Yelper\'s advice, stop in here for a pizza, go out and try the rest, then create your own informed, flavor filled opinion.\n\nHappy Yelping Phoenix! Go eat pizza :-)', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2013-08-19', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'ncFbDwW5V4RfoEkhcAPfBA', 'review_id': 'TcKRn7-d265dzLPWBNuYZQ', 'text': 'Well how do you like that this restaurant is listed three different ways on yelp and they are all awesome.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-09-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ncFbDwW5V4RfoEkhcAPfBA', 'review_id': 'JptPIXK1caKy8gqkAe__cA', 'text': "I'm happy to say this is our neighborhood Italian restaurant. This up town version of bianco is more relaxed and less trendy in my opinion. Trattoria has a totally different menu too...", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-09-02', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'bG-r4zndr1xuon0pHbUrcg', 'review_id': 'IKyliMfFB4q31mYn7RESsQ', 'text': "I had been wanting to try Italian Restaurant for a few months now and finally got to last Friday night.  Just as Pizzeria Bianco did not disappoint, neither did IR.  \n\nThe bread (crostini) brought out was delectable.  I literally savored every bite.  I wish I could've eaten a small plate's worth.  The cheese plate is a winning appetizer.  Various types of cheeses, marmalade (little too sweet for my liking, but definitely homemade) to pair with a glass of wine perhaps.\n\nI had the dish with short ribs.  Whew, some of the best, most tender I've ever had!  While I couldn't finish all of my risotto, I made sure not to leave one bite of meat!  Quite flavorful, even if the texture of the risotto was not my favorite.  I also tasted the fettuccine, which the next table over was raving about.  Definitely different with the lemon and not something I would think I would enjoy, but alas I was wrong.  \nThe dining room through the main room is simple yet charming with its mixed and matched chairs and asymmetrically placed light fixtures.\n\nService was top notch.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-09-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '_zYKr3KTPYTARWgzv6IYJQ', 'review_id': 'pzh3Ju8Bpl48fxcY1XGvAQ', 'text': 'AWFUL. This is my first Yelp - and I go to new places every day. I frequent places like Postino, the Parlor, St. Francis. Based on their website this looked like it fit into the same category. Nope! \n\nFirst off, I\'ll admit that on a rainy Monday I had a hankering for soup at Baby Kays. Didn\'t know they are gone, so I walked across and thought - why not try a new place. I was already disappointed so I\'ll give them that; maybe I\'m just over critical today. You be the judge. I arrived at 1pm and the place was very busy. The greeter was unkept with wet hair and seemed to have no clue. I just opted to sit at the bar. \n\nBar: Restaurant design 101 - SEATING! My pursehook (kudos for at least having this) was between the legs. Add that my knees still hit the wall and I\'m still a good foot away from my plate and I look like the hunchback of Notre Dame at a nice dining establishment. I\'m 5\'3". Imagine a taller person sitting there. Not only did I drop a bite - so did my spaghetti eating neighbor. I\'d be fairly interested to see how much food lands on the floor at that bar or how many more seats could they fit there if it weren\'t from men & women sitting spread eagle up to it.  Also, call me old fashioned, the bartender should always be behind the bar. Never was. I wasn\'t needing drinks; I just think someone should be there. Maybe they were severely understaffed at 1pm on a rainy Monday? \n\nMy water glass was never refilled; I sat right next to the \'water station\' at the bar, where the waitress repeatedly slammed it down next to me. Yet my glass remain empty. \n\nFood: First off, I am gluten-free (not by choice). The menu is absolutely the furthest place you\'d ever want to go for a gluten-free person. McDonalds has more options. Typically - Italian is not my forte with all the breads and pastas, but most all restaurants have enough options. Many Italian restaurants make their own gluten-free pastas and pizzas - Picazzo is a favorite. \n\nMy choice? The simple salad and their wood roasted mushroom side. What I got was a plate with a mound of oily leaves and 3 seeded olives. That\'s it. Oily lettuce. The mushrooms were a plate full of standard button mushrooms sauteed in...you guessed it...oil! I was imagining wood fired, wild mushrooms with a twist that only this chef could create. No flavor whatsoever. I tried to trick my tastebuds with salt and switching from one bite to the other (salad, mushroom), sans water. It was so disgusting. Being that I waited so long to eat I shoveled it in to satisfy my stomach, give my knees a break and got the heck out of there. \n\nAll for a staggering $23. Would you? Sorry Chef Bianco - one lunchtime midcentral foodie fail. I have no interest in returning to this restaurant, nor trying any of the sister restaurants and am now even more eager when the long time Phoenix staple Baby Kays returns at the old Richardsons location in November!', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 1, 'date': '2013-09-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '_zYKr3KTPYTARWgzv6IYJQ', 'review_id': 'BThbiGW1gK0zqgTubCR2sg', 'text': 'AWFUL. This is my first Yelp - and I go to new places every day. I frequent places like Postino, the Parlor, St. Francis. Based on their website this looks like it fits into the same category. Nope! \n\nFirst off, I\'ll admit that on a rainy Monday I had a hankering for soup at Baby Kays. Didn\'t know they are gone, so I walked across and thought - why not try a new place. I was already disappointed so I\'ll give them that; maybe I\'m just over critical today. You be the judge. I arrived at 1pm and the place was very busy. The greeter was unkept with wet hair and seemed to have no clue. I just opted to sit at the bar. \n\nBar: Restaurant design 101 - SEATING! My pursehook (kudos for at least having this) was between the legs. Add that my knees still hit the wall and I\'m still a good foot away from my plate and I look like the hunchback of Notre Dame at a nice dining establishment. I\'m 5\'3". Imagine a taller person sitting there. Not only did I drop a bite - so did my spaghetti eating neighbor. I\'d be fairly interested to see how much food lands on the floor at that bar or how many more seats could they fit there if it weren\'t from men & women sitting spread eagle up to it.  Also, call me old fashioned, the bartender should always be behind the bar. Never was one. I wasn\'t needing drinks; I just think someone should be there. Maybe they were severely understaffed at 1pm on a rainy Monday? \n\nMy water glass was never refilled; I sat right next to the \'water station\' at the bar, where the waitress repeatedly slammed it down next to me. Yet my glass remain empty. Perhaps if there were a bartender present?\n\nFood: First off, I am gluten-free (not by choice). The menu is absolutely the furthest place you\'d ever want to go for a gluten-free person. McDonalds has more options. Typically - Italian is not my forte with all the breads and pastas, but most all restaurants have enough options to keep a GF person happy. Many Italian restaurants make their own gluten-free pastas and pizzas - Picazzo is a favorite. \n\nMy choice? The simple salad and their wood roasted mushroom side. What I got was a plate with a mound of oily leaves and 3 seeded olives. That\'s it. Oily lettuce. No choice of dressing. The mushrooms were a plate full of standard button mushrooms sauteed in...you guessed it...oil! I was imagining wood fired, wild mushrooms with a twist that only this chef could create. No flavor whatsoever. I tried to trick my tastebuds with salt and switching from one bite to the other (salad, mushroom), sans water. It was so disgusting. Being that I waited so long to eat I shoveled it in to satisfy my stomach, give my knees a break and got the heck out of there. \n\nAll for a staggering $23. Would you? Sorry Chef Bianco - one lunchtime midcentral foodie fail. I have no interest in returning to this restaurant, nor trying any of the sister restaurants and am now even more eager when the long time Phoenix staple Baby Kays returns at the old Richardsons location in November!', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 1, 'date': '2013-09-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'zgKN0jcNaNaY46xsDaxYTw', 'review_id': 'kKdjRLFZL4aFxpa1jyC6TQ', 'text': 'The place was hard to find and the pizza sucked. They burned it the first time around but made another one right away. \n\nThe bread and olive oil and parking was primo!', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 2, 'date': '2013-09-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'gcyEUr4DXcbjnGRAWFtfAQ', 'review_id': 'DG4CC1si5rRPgCtAJme6Tw', 'text': "Awesome, Awesome, Awesome! I didn't even know this location existed! We came to eat at another place, but realized it was closed and stumbled upon PB. We sat on the patio, with the great fall weather we're getting right now. WE started with this great antipasto plate that came with some coppa, a few pieces of parm, this awesome eggplant ragu, roasted potatoes with parm, chanterelles with celery and a great warm broccoli salad. Easily the best antipasto I've EVER had. I ordered the Paperdelle bolognese and wifey had a pizza with parm and arugula. Both dishes were awesome. I will say the pasta wasn't quite pappardelle, more like half of a lasagna noodle and a bit thick for my liking, but the flavors in the bolognese were fantastic. the pizza was also just awesome. I'll for sure come back to eat some awesome PB food with NO WAIT!!!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-09-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'RxfFQxUtSIGYwTKU_rvAeg', 'review_id': 'WKjFkdEt-RlIH2Jk3BZnWA', 'text': "We came to this plaza to eat at Baby Kay's to find out they were no longer there. As we tried to figure out what next, we walked by Pizzeria Bianco and was like, is that what I think it is???? We had no idea they opened another location and were thrilled there was no line. The weather was nice so we sat outside. My husband and I each ordered a cocktail. Mine was the mojito which was just okay. The antipasti we ordered as an app was amazing. Then again, we had just come from the gym and were starving! I stand by the amazing, though, although it should have included more cheese. It had some parmesan, copa, brocolini, eggplant, Yukon gold potatoes, mushrooms, and beets. Delicious. I ordered the white pizza with arugula. I enjoyed but it tasted as though lemon was squeezed over it. Lemon is not a flavor I like on anything including seafood and water. I could have done without that but still liked. My husband had the papparadelle. The pasta was thick (think lasagna) but tasty. \n\nSo, for a kids milk, 2 cocktails, antipasti, a pizza, and the pasta, the bill was $76! Yikes! Not for the faint of heart....", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2013-09-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'vUBWg3dXVCDWvbGwWLrpbw', 'review_id': 'saMTSG4cIdAc-1seA4ct7A', 'text': "I just fell in love with this place.\n\nGreat staff, friendly and kind. Bianco was in da' house which added up extra kuddos to the place, specially because one would think that now that he's a rock star he would be arrogant but all the contrary, he was super pleasant and down to earth.\n\nI had the specials of the day which were delicious. Watermelon salad and gnocci with meat. \n\nThe gnocci were my very favorite, what a dish! \n\nThe desert was made by Bianco's mother herself, which was also superb! A banana tiramisu-like cake that was one of the best deserts I've had lately. \n\nApparently, Bianco's mother brings desert on Thursdays, keep that in mind.\n\nI tried the wise guy pizza which was also excellent.\n\nI'll be back within two weeks.\n\nIf that wasn't enough, the decor and charm of the place is outstanding. Rustic with a touch of elegant.\n\nIf I have to define Bianco's concepts I would say he trims the BS and focuses in food quality, which is pretty hard to find, specially in AZ.\n\nAn instant favorite for me, for sure.\n\nCheers!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-10-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'SXjlK7mtXuQiOpudJG3SMw', 'review_id': 'HmfwB0aSVD1RMNVN1xdVlg', 'text': 'Go eat here now!  Perfectly blended flavors from local, organic, personally grown ingredients.   We had a wonderful lunch, and then an amazing chat with the owner.\n\nMy husband and I wandered in for a later lunch yesterday, no idea that this was *the* Pizzeria Bianco.   And so close to the Trader Joe\'s and new Whole Foods that we frequent.  We sat outside, and the courtyard is lovely.\n\nA short but carefully chosen menu is all you need.  Since I was wary (I didn\'t know where I was!), I kept it safe with just a caprese salad (handmade mozzarella, tomato, basil and olive oil) with a glass of sparkling water.  My husband ordered the \'chicken salad\' with fingerling potatoes and Maya\'s vegetables.   This chicken salad will change your entire mind about what chicken salad should be.  Not a big gloppy mess of mayo and old chicken - the chicken was amazing real chicken, little cubes of apple, subtle herbs mixed in.  \n\nWhen we were sitting and chatting after dinner, just getting the bill, not anxious to leave after such a lovely lunch in a sun-dappled spot, the waiter was joking with us about whether we liked everything (since we cleaned our plates).  As we were raving about the food - he motioned at a chef in an apron and said, "this is Chris, it\'s his place."  That\'s Chris Bianco.\n\nI had heard about his pizza\'s.  And I had heard about Bianco\'s passion for perfect ingredients (on a tour we took of the Queen Creek Olive Mill where they described how he had only certain olives crushed to make his own olive oil for his restaurants).  But in person it was even more.\n\nChris Bianco is a man with a real passion for making wonderful honest food.  He knows where each of his ingredients are coming from, and is always looking to improve.  He shared the story of this location (a real place of the heart for him), and his efforts to get the best ingredients.  He refused to take the credit for the amazing chicken salad, saying that he just put ingredients together, the real star was this well fed / well grown chicken, and he put much of the credit for flavor on the chicken farmer (I\'m sorry I forgot the name! but just go here to eat, you\'ll get some!).   \n\nEvery restaurant wants to be able to tell you some story to impress you with their local this or specially-imported that, but every detail here that won\'t even show up on the menu is looked after.   To give you one example, we caught Mr. Bianco just after he\'d been having a long discussion about where to get salt - sea salt from Glendale AZ even.  But believe me, he can tell you why he gets the Prosciutto he gets from; where, why he\'s growing tomatoes in California and basil on the back porch of this very restaurant.\n\nThis location is where Chris Bianco comes to cook and create.  The dining room in the back is filled with personal items.  Many paintings on the wall are done by his father Leonard Bianco, the large table was specially made, and the rug under it came from his childhood home.  A real place of his heart.\n\nThe passion and heart shows in the food.\n\nI missed out on the wine this time, but I was told they were carefully picked and a good price for what you\'re getting.  I will definitely be having one next time.  And while the chicken salad is now on the must have list, I guess we will have to finally try one of those pizzas too! :)', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-10-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PGMpcJs5fib9pZ_kXfZxjQ', 'review_id': 'eRDsiuNEk94Si_0ORAEjxg', 'text': "Love the service, Love the staff but most of all the food was amazing! I was completely taken with this place from the minute I walked in the door, as I was eating I was thinking I can't imagine eating Italian anywhere else. I wish I could take this restaurant back to Seattle with me.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-10-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jwE5GVJbIDzTdo7Ab-2Jaw', 'review_id': 'M2Q45Y1c2tdD3k6htTAVVA', 'text': "My husband and I were visiting AZ with family and needed a place walking distance from our hotel in an unassuming mall. We wandered over near a Trader Joe's and stumbled into Bianco's pizzeria...with no idea about the reputation (until I spotted someone taking a photo with the chef, Chris Bianco).\n\n\nWe must say that eating at Bianco's we had one of those rare meals of pure artistry that lingers in the memory. \n\nI for one,  can still taste the pure flour and water paperthin crust (for those of you who have a thing for NYC handmade matza, you get the idea)..The tomato sauce on the margherita pizza  was perfect, perfect, perfect pure tomato sweetness with no sugary additions. As for the biancoverde white pizza ...the tang of the goat cheese, the subtle earthiness of the  olive oil,  the intense mineral green of the arugula...WOW! He has truly aimed for and hit that rare culinary sweet spot, where each ingredient can be identified for its individual quality, yet harmonizes in a complex wholeness. Pizza perfection! Definitely a 10!\n\n\nMr Bianco grows his own organic tomatoes, which are hand picked and steam peeled, He selects and mills his own wheat, and pulls his own mozzarella. He also is a wonderful down to earth Bronx boy who appears to love entertaining and educating his customers and staff.\n\nDo not miss eating here! HANDS DOWN the best pizza I have ever had in my life-(including NYC where I've eaten some of the best in the past decades...)", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-10-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hEvo83lrbOyvYyIg2fm44A', 'review_id': '8XvAd_j20oj4IkizLxLZUw', 'text': "This is the best pizza ever. We've tried many pizza restaurants and this place is without a doubt a 5 Star! The owner is compassionate about his establishment and that attitude shows up in service and quality of food. If you have had pizza in Italy, you'll see the same quality here at this restaurant. It's the real deal.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-10-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'R3HE-m6b61D4xI3EdZg3mA', 'review_id': 'Nm7gqklrxz5DbxdHwwzCwg', 'text': "Pizzeria Bianco has always lived up to it's reputation as one of the best pizzeria places in the America.  The problem was that the Central Phoenix location was always busy and it takes forever to get a bite to eat.  However, this new location is great!  The location has a good flow of business traffic but I believe many people haven't personally discovered or know that there is a second location aside from the Central Phoenix location.  Either way... the food is nothing short of excellent and the less people who know, the better my experience.  The Biancoverde is an excellent pizza choice.  ;)", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-10-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'vDGSIC6A2ax-ozeCV4lp8w', 'review_id': 'DsMsJd4bfVjw-8wJG-3Tiw', 'text': 'Had seen this place while going to Trader Joe\'s but the nondescript name didn\'t  scream out "eat here!" Then we saw on Yelp that it was a Bianco restaurant and had to check it out. We could not have been more pleased. \n\nAtmosphere: Show kitchen as you walk in, bar/lounge area in front, small patio to the left. Larger dining room in back w/ nice wallpaper & crown molding gives the place an older feel, which I like - not 2-year old strip mall motif.\n\nHad dinner at the bar served by Lisa, Saw a "Desert" Mule on the cocktail menu but was a little leery about a Mule w/ Bourbon instead of vodka and something called St. Germain. Boy was I wrong! Turns out to be a concoction invented by Lisa. St Germain is an elderflower liqueur I had never tried before and combined w/ the bourbon, ginger beer, orange, cherries and sprinkle of cinnamon...WOW! One of the best cocktails I\'ve ever had.\n\nThe food wowed as well. The olive oil that comes with the crusty bread is their own blend and is fabulous, light & nutty. Gnocchi and pork special was just that...special. And the pizza was what you would expect from (depending on the year), the owner of #1 to #3 pizza place in the country.\n\nNot cheap but pretty reasonable for what you get actually, Two cocktails, app, bottle of wine, two entrees, dessert, two porto\'s & two espresso\'s, about $150 pre-tip.\n\nI think I understand the brief name now. There must not have been enough room for DAMN GOOD ITALIAN RESTAURANT !', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-10-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lMqdVNL0X2uIfjkJpQZBtw', 'review_id': 'M2Mkwo_ia7U0Ep6AuhJ2LQ', 'text': 'The best pizza I have ever had, in the nine years of my life. After we ate we watched them making the wonderful, tasty food and the manager came out to take a picture  with our girls. He also said next time he would let them walk through the kitchen and meet everyone.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-10-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'j-kShDJgp5acGhqJAkJHnA', 'review_id': 'ynsvYvHl2mKI3tnYw8I9gg', 'text': 'Finally had a chance last night to check out this latest Chris Bianco restaurant and so happy I did not wait any longer.  \n\nAs we walked in the door past the open windows to the kitchen, Chris Bianco himself greeted us like we were long lost friends that he had not seen in awhile.  \n\nWe were seated immediately and presented menus.  The menu is simple and I like that.  Small Plates, a couple pasta dishes. beer, wine and of course the world famous Pizza.  \n\nWe started with prosciutto wrapped fontina, at $10 it was seriously delicious.  We then ordered the gnocchi, $18, which was one of the specials of the night.  I can say I have never eaten this dish better anywhere.  We finished with the Wise Guy Pizza $18, featuring Schreiners Fennel Sausage, roasted onion and mozzarella.  If this all sounds incredible, it really was.  \n\nThe wait staff was spot on, friendly and attentive as expected.  \n\nAs we left,  the entire kitchen staff gave us a friendly wave goodbye.    \n\nPizzeria Bianco, Highly Recomended...', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-11-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FFVzVjo248URkxKbgaDflw', 'review_id': 'sBbWXtyrOYoWQO4Z20TYKA', 'text': 'Hands down the best Pizza west of the Mississippi..The Bianco family are as welcoming a host as I have ever experienced.\nA mutual friend who spent many years on the Jersey shore recommended this place to me, and I am glad she had..\nThe kicker is, they are moving to my hometown of Tucson.. can not wait', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-11-04', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'CYHX8nnPoqclfWSsl1JWnA', 'review_id': 'gQEZWumZ8Fb7OcPB56g-Sw', 'text': "Dear Pizza Bianco\n\nWhere have you been all my life???? I've always been to the one down town. This is so much bettter. Yummmmm.\n\nYour favorite customer", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-11-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'gB5DUZRAAoiRRy9xxf0V4Q', 'review_id': 'w395CIvYcc9dBg5v9qhe0Q', 'text': "Loved the Caprese.....good pizza, I guess it's worth the price once in a while??", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2013-11-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '-j235MyR3UtGFN6UOHRPiQ', 'review_id': 'dTf4o5qWkMMYQeRZVmHFng', 'text': "Absolutely disappointed and no intention of trying again. Service was pathetic,  our server never checked on us. They were out of diet coke. The decor was urban shabby chic meets thift store. Pizza was tasteless hardly any cheese.  Don't waste your time and money,  there's plenty of other great places in Phoenix.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 1, 'date': '2013-12-08', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'l2zoX2M4OBuAE_q2A5qW8A', 'review_id': 'CHmS2yOkHvMjta_YgPL4eQ', 'text': 'while I have had worse pizza I really disliked my pizza. almost no cheese. the wood fired oven burns parts of the pizza.  good if you like extra crispy pizza. I do not. it was more like cardboard. and burning pizza doesnt help keeping it from tasting like cardboard.  I looked at the table next to us and the one behind and their pizza was burned also. then I remember seeing the place on the morning news and it coming out burned and I said remind me not to go there. so my mistake I went to try it.  why this place is on national best pizza lists confuses me. I have had pizza in ten places in nyc that are far better. I am guessing they use real moz.  but most of the pizza had no cheese. so yeah im very disapoointed. my budy warned me that it wasnt that great. and I posted this on facebook asking. no one I know likes this place. so do not be fooled by it making best of lists. and the service. never came back to ask how the food was. so I didnt bother telling them it burned.  they have soda bottles like mexico.and today out of diet coke. What kinda pizzeria doesnt have a soda fountain. the one meal that soda really is required along with mexican. and the old chair I was sitting in was rock hard. the problem was that it wobbled.  terrible restaunt. avoid it please. dont say I didnt warn you', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 1, 'date': '2013-12-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': '52CjhOZoofJkc9vl8-urpg', 'review_id': 'eUqf1XFCZ7DqnNIvg_v88w', 'text': 'After years of boycotting the downtown location because of the arrogant service and ludicrous lines,we finally tried the new location on Camelback.\nThe place looked like a hipster joint, with dim lighting and a long bar, where we waited about 5 minutes to be seated. We were led into the second room, which was completely different to the first room. It looked a Disney version of a French drawing room. Hardly what you would associate with a pizza joint. There was something lacking - the room was to big for the furniture, weirdly lit and just sort of ...empty.\n\nAnyway we were seated at a window looking out on to the empty storefront across from the restaurant. The service was okay and our waiter explained the very small menu adequately.\n\nI ordered a Margherita pizza with Fennel sausage added and my wife ordered he Biancoverde, a white pizza with several cheeses and some Arugula on top.\nOnce the food was delivered no-one approached us at all to inquire as to our satisfaction or concerns\n\nThe bottom line is that the PIzza was underwhelming. In the years since Bianco first came to national attention and was named the best pizza in Phoenix, some serious competition has arisen, not least of which is Pomo in Scottsdale (with a small downtown offshoot), Grazie in Old Town Scottsdale and Il Bosco in mid Scottsdale, all who make much better authentic Neapolitan style PIzza than PB, and at reasonable, appropriate pricing for dough, cheese and some toppings.\n\nWe left feeling like we had wasted a hour and spent more money than we received value for.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 2, 'date': '2013-12-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '-j235MyR3UtGFN6UOHRPiQ', 'review_id': '83W8pZiadRRHxW3O_Upapw', 'text': "After all the great press and awesome reviews ive heard I was looking forward to dining here.  My first thought was that the decor was urban shabby chic meets Goodwill garbage.  Sad but true!\n\nMy experience was absolutely disappointing and have no intention of trying it again. We were sat at a small uncomfortable table, with hard wobbly chairs.  Our server stopped by for drink orders however they were out of diet coke, because they only sell it in glass bottles, this was his explanation. Lame!   Once we ordered the pizza, we never saw our server make any other attempt to check on us. Our pizza was dropped off by another server,  and yet it was BURNT, looks and by taste. How do you bring this to the table! I posted a pic as well...This Pizza was tasteless, amd hardly any cheese yet the mushrooms were truly the only compliment i can give and the reason it deserves one star. I really don't understand the hype of this place.  I enjoy gourmet food but i assume alpo has more flavor then our pizza did.  Don't waste your time and money,  there's plenty of other tastey restaurants in that area to choose from.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 1, 'date': '2013-12-09', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 3, 'cool': 3}, 'user_id': 'ts5QpC5ymz1m1EeumIm7Hg', 'review_id': '3XhUvP6kv8eVz2g-UzjIXg', 'text': 'Part of me knew this before I took my first bite but, this just doesn\'t live up to the hype.  I mean, nothing really could live up to the hype built around this place! To be fair, it is great pizza.  I just isn\'t "the best pizza".  There are numerous places in San Francisco that would beat this one out.\n\nUpon entering the restaurant, at noonish on a Sunday, we were surprised to see it half empty.  I was also surprised to be cheerfully greeted by Chef Chris himself!  For how slow the restaurant was, our table service was also slow.  We did get some yummy olives to eat while we waited, nice touch.\n\nOur favorite pizzas were the sausage and the red onion/pistachio (I forget the names).  I would actually skip the famous margarita, I didn\'t think the flavor of the cheese or the sauce really shined through.\n\nI think if I went back I would try one of their pasta dishes.  They serve a small entree menu, in addition to the pizzas, at this location.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2013-12-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'I1Qj9NnnTEXQpEqQqGV6WA', 'review_id': 'tg1iOLuzVkJ1zqzPEepN0Q', 'text': 'Quaint old world charm. The atmosphere is that of family run restaraunt in an European village.\n\nThe chefs understanding of fruits, vegetables, legumes and cheese is outstanding.\n\nRich served with panache and excitement for the evenings selection.\n\nThe market salad and the antipasto was unique and inspiring.\n\nWe shared a half margarita, half wise guy pizza. With wood fired crust from another world. You could put anything on that stuff and it be delicious.\n\nWhat a great start to our evening!\nDefinitely a date night first stop!\n\nGratci!', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2013-12-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'jJY5CRu-yoU_wKm_Hn1KbA', 'review_id': 'waOOtp266qx3JcGBXKwsvg', 'text': "Pizzeria Bianco pizza is awesome!  Of the best places in the country to experience pizza.  I would rate Tony's Pizza Napoletana in San Francisco as number one, but Chris's pizza is truly unique and very close to the being the best pizza in the U.S.  His pizza has a thin crust Napoleana style.  His careful selection and combination of ingredients and the use of pecan and mesquite wood for cooking adds another dimension to the pizza.  Great pizza!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-12-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'wlYlPIwT6P8SC8xiLttCrw', 'review_id': 'Z_Q1nQpKg4mv8Tf_n_ljHg', 'text': "Nothing more to say about this place than it's a must try.  Amazing food, great food and great service. We ended up going here since the main location on Adams had a 2 hour wait. Lucky for us, the owner and chef, Chris, was at this location. He even came to greet us on his way out to head to the restaurant on Adams.\n\nGo try this place. You won't be disappointed.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2013-12-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'QdQrV3bOr0GEY9olNQk6cQ', 'review_id': 'pq83S8Z2wZvaK_32VCqaOw', 'text': 'We travel extensively, including to Italy, and hare happy to report that we have the best pizza in the world.  Thanks Chris.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2014-01-04', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 1}, 'user_id': '5jODkdonMV0HbIIPik1RuA', 'review_id': 'fM5ZI8BRI_fymFGboNl1Sg', 'text': 'This is obviously the best pizza ever. My choice of pizza is the Marinara (no cheese) with olives. It\'s BEYOND delicious. This is QUALITY pizza guys! I\'m seeing all these reviews with complaints that the pizza is "burnt." It\'s called an brick oven, take your business elsewhere if you\'re gonna cry over this.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2014-01-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'H1QO5i0JlxX13Z-EU0Q77g', 'review_id': 'dJgflbywBo7zonV1S9FqtA', 'text': "I hate not being able to give this place at least four stars, but there some issues.  Like others have mentioned there are some issues with service. I wouldn't say they are rude but definitely not friendly either. My friend and I were sharing a chocolate cake and a waiter( not even ours) came by and took the empty plate literally as soon as I put down my fork without even asking.  At first, I thought some random stranger took something off the table until the guy walked into the back.\n\nThe food has very high quality ingredients and you can really taste the quality. That being said, this is not regular pizza. It seems more like something you might eat in Italy. Some people might like Americanized pizza better. I do. \n\nFinally, the menu is small. Very small. Not many choices. The wine selection is much larger than their food menu.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2014-01-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': 'Q-e5Kriu18oFX5orJkoNhA', 'review_id': 'aT6urrWPZ7AGkNWrDRoOuw', 'text': "I've loved the downtown location for years so when the new location opened I was excited to try it. I have been to the new location a handful of times now and its amazing every time. I have had several pasta dishes, pizzas, salads, antipasto platter, and desserts, all of which were outstanding. \n\nOut of the 5 or so times I've been I've had one bad service experience and I don't blame he server, he was very overwhelmed after the restaurant received a random rush on a week night. Other than that it really seems like they are getting a hold on this place. I know it was a little off at first but it is definitely on point now. \n\nIf you have never tried the downtown location or are already a Bianco lover you have to try this location. I've never waited more than a half an hour for a table and the food is just...sigh...the best.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2014-01-12', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': 'L9-X4KASFfdhOeVeYSDgvA', 'review_id': 'AT1DVkB-ADZ-MHVWTwW_0A', 'text': "My pizza was excellent - the margherita with the addition of mushrooms had lovely sauce and an excellent crust - and only a little high in price for a medium pie (to be expected for the Bianco name).  My husband ordered the spaghetti with pomodoro sauce, and, though the sauce was delightful, the pasta was a little heavy.  Unfortunately, our friend's pizza was far from impressive - she order the Rosa, and it was dry, dense and almost pungent (maybe this is some kind of acquired taste?).  The server was pleasant, the bread was delcious and the atmosphere is cute.  However, I think we'll be visiting the Parlor next time - the pizza is better.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2014-01-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'I1Qj9NnnTEXQpEqQqGV6WA', 'review_id': '8v9IenhIEHq0xnjUx1x7LA', 'text': 'Service was 5 star! Ask for Dave.\n\nWe shared the evenings special, Braciole, flank steak from heaven, YUMM. This is worth the drive from anywhere.  I had the  PappaDelle, basically very meaty sauce with lasagna pasta. Nice.\n\nTo round out dinner we added a margarita pizza. Nothing better than wood fired pizza and thin crust.\n\nI gotta be honest, the focaccia bread was my favorite. I should have stooped there!\n\nAs the duke, I must recommend!', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2014-01-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 't2YBANsJYySOXvHyOjcZkQ', 'review_id': 'OMfUv777vqf8m2pOiFot9Q', 'text': 'We ended up at the Town & Country location after the downtown location had too long of a wait. It is just delish. We had the Sonny Boy, Wiseguy and Margherita enjoyed with Fourpeaks SunBru and Hop Knot. The pizza is great, especially the Wiseguy, caramelized onions, fennel sausage and smoked mozzarella - perfection. We ate outside on the patio, lovely. Waitstaff was attentive. Very nice experience.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2014-01-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'uLl--7BS9Cj6qOY2IqoyiA', 'review_id': 'cNZHL-Je4XqFKy0uIYf1HA', 'text': 'Chris Bianco opened this restaurant after the success of his downtown pizzeria. The menu here is expanded, and reservations are accepted.\n\nI arrived @ 7:00 with two companions and was seated immediately. The waiter was friendly, and had a good knowledge of the food and how it was prepared. We decided to order several entree\'s and share them so that everyone could taste.\n\nWe ordered the Papparadelle with Bolognese Sauce, Beef Braciole or Involtini if you are in Italy, and a Pizza Margherita.\n\nThe Papparadelle came with fluted edges, cooked reasonably al dente, with an excellent Bolognese sauce loaded with chunks of meat. I found it to be on par with any I have ever eaten, though on a personal note I prefer the pasta to be more rustic and hand cut or torn into uneven "rags".\n\nMy companions did not care for the Beef Braciole as much as I did, but allowing for different tastes as well as living in vastly different locations, I can accept that.  I found the meat to be beautifully cooked, nicely presented on a bed of cooked cauliflower, and served with some properly roasted onions.  Many people who make this dish tend to overpower it with lots of cheese and bread crumbs wrapped up in the beef.Unlike many variations on this recipe, this one was not overly salted or spiced, which I personally appreciated, as the flavor of the range fed beef came out nicely.\n\nMany reviewers have said that the pizza is the best in the United States. I would differ with that opinion. Certainly, the pizza is very good, but I\'ve eaten many a pizza that I felt was as good. The crust has a good flavor, is nicely thin with a nice edge, but the one we were served had an undercooked center that flopped down when picked up. The cheese is handmade on the premises, and is a real treat, melting into a lacy puddle swimming in a pool of an excellent sauce. \n\nMy biggest criticism was with the basil. This pizza is supposed to represent the Italian flag - 3 colors - red (sauce), white (cheese) and green (basil). The pizza was cut into 6 pieces and 5 leaves of basil were put on it. One person would not get a real piece of pizza margherita. Worse still, to me is that you only get a leaf of basil. Which bite do you eat it with? In my mind, the best pizza margherita I have ever eaten had a chiffonade of basil sprinkled all over it, so that you got some basil with each bite. My understanding is that that is how the pizza was supposed to be made originally. You wouldn\'t serve the queen one leaf of basil, now would you?\n\nI must make mention of the bread that came with the meal. I don\'t know if it is made on the premises or not, but it was wonderfully crusty, with a chewy interior and a superior texture. It was served with a little extra virgin olive oil, and was really excellent.\n\nOverall, the premises were clean, though a little noisy at times. I\'m hoping that Chris will put a whole lot more basil on his pizza\'s, as that is a basic part of the flavor of it.\n\n4 stars for excellent service, good food, and general cleanliness.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2014-01-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'D0xdeb8VTDCk2-S0XiZRZQ', 'review_id': 'qAIlKHBYTTQp_dzugLACCQ', 'text': "If you look up gourmet pizza in the dictionary, Pizzeria Bianco's pizza choices would be staring back at you.  This was some of the tastiest pizza of it's kind that I've had in some time.  As a native of Chicago, I am an open minded pizza lover (I mean I, of course, am a bit biased when it comes to deep dish pizza) but I LOVE pizza and especially love trying different types of toppings, crusts and sausage.  Pizzeria Bianco was all it was cracked up to be (however, I would NOT wait hours to be seated as I've heard is how things go at the downtown location...it's not THAT awesome, lol!)  The staff was friendly and the atmosphere is really casual and nice- especially on the patio on a nice 80 degree evening :-)  Will be visiting again and again!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2014-01-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jE5xVugujSaskAoh2DRx3Q', 'review_id': 'Aiy4y47575XWl5lEGm_jSA', 'text': "Pretty good pizza although there is a small selection. Small selection is the key description for this restaurant. It's got a neat look to it but it isn't much if anything special. \nI will stick with Humble Pie and Grimaldi's.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2014-01-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'udK1-SLvAIHFGES_xEhahw', 'review_id': 'RKkIuztzjo2WZIRa5HsIoQ', 'text': "I don't get this.  We had an absolutely wonderful time here, how can they only have 3.5 stars? The matriarch of the restaurant stopped by and chatted with us for quite a while.  She went on for a long time about all the rigors they go through to assure authentic ingredients.  \n\nSadly, my guess is too few people today value their efforts.  I'll be back on my next trip to Phoenix.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2014-02-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'OybOBgHC_TOnew15lMHfGg', 'review_id': 'KykwckVT2JsZJ-we9kczWA', 'text': "Been coming to Phoenix for the Phoenix Open for 20 years. Had tried a few times to go to Bianco but never wanted to wait 2 hours. The new location was wide open with no one there at 5 on a Monday evening. Quaint and clean setting with great servers. Started with a tray of olives in oil. Had never had this type and they were excellent. Field green salad was small, very fresh and a little light on the dressing. Margherita pizza was great. Perfect crust, the sauce was like the best crushed tomatoes and the cheese was rich and not too salty. If Dante hadn't opened in Omaha five years ago, I would have been floored.  However, I get great pizza all the time here.  I think Bianco was way ahead of the game and others are catching up.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2014-02-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rWVlUIa2PX9t7lBKtzq6Dg', 'review_id': 'GWOZaFGGq3gCDILcQuzU9Q', 'text': 'had the rosa, wiseguy and margherita pizzas!  all excellent!  Tried a local wine from cochise county and was pleasantly surprised.  Server was very good; however the hostess was hesitant to seat us.   We arrived on a saturday at 5:30 and they had reservations arriving at 7pm.   I had to promise we woukd have wine and pizza fast.  All ended up just fine.  Mangia!!', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2014-02-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DEdwb0aGQVlzlkm-zs4psg', 'review_id': 'oetVXNLGegJGaAA8n0k9uQ', 'text': 'Great pizza! Not the best in town but great. Service was slow in the beginning but picked up when we got our food. Also, loved that they serve local brews!', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2014-02-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Glz0DHwHPSFijJb1UBqfMw', 'review_id': 'ZiDIj3eY69F40eBhJl4L4Q', 'text': "We had dinner here last night as an extension of Valentine's Day--I had read lots of recommendations and was excited to try it (Chris Bianco won the James Beard Award for Best Chef: Southwest in 2003). We had a reservation for 7:30--which was essential on a Saturday night. The place was packed. My appetite was whetted when we walked by a window into the kitchen and watched the preparation of fresh mozzarella, tomatoes, and basil (Insalata Caprese). There was also a tray of lovely dried tomatoes bathed in olive oil sitting nearby, always a good sign. We had to wait for about twenty minutes, but there is a wine bar where you can get a glass of something to help pass the time. We were seated in the large room at the back--there are three spaces: a patio, a smaller dining room in the bar area, and the main room behind, all very noisy by the way--so if that bothers you, you won't be happy. Service was prompt, courteous, friendly, and very professional.They brought us a basked of pane with olive oil. The o.o. was light and grassy tasting, delicious, and the bread was artisanal and divine. Chris Bianco clearly knows what to do with flour and yeast.  I ordered a small plate of mozzarella with tomatoes and basil, followed by a pizza biancoverde--white pizza with mozzarella and topped with fresh local arugula. The mozzarella is home-made and delicious, the tomatoes were luscious. My pizza confirmed the restaurant's reputation as being the best pizzeria in Arizona. Great slightly charred crust, Naples style, beautiful combo of fresh cheese, herbs, and arugula. I loved it! My husband had the parpardelle with meat sauce, which was also excellent--but I'm glad I had pizza. One pizza probably wouldn't feed two people--as it was, I was able to share about a third of it with my husband and went home feeling very well fed (as did he). We will definitely be back. This restaurant is a national treasure!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2014-02-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '91flJaXtNKecLmfkCMB02w', 'review_id': 'qzVApZIHKrIL87UlwH6aMQ', 'text': 'We used to love this restaurant when it was called Italian restaurant.\nNot so any more. We called for a reservation, arrived on time but they had no record. Our only option was to sit outside on a COLD night BRRRR.\nThe salad was pricey and so so. To their credit the waiter modified a pasta dish for us and it was yummy. Only problem was they brought out our pizza at the same time. It was soggy and nothing like the pizza we had at there downtown location.\nPLEASE bring back your old format.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 1, 'date': '2014-02-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rPbnO4biL7K8kdKjz5o3xQ', 'review_id': 'Jv6e4DGtGoOjVNtONIO74A', 'text': "Some of the best pizza I have even had. The crust was crunchy  (with out being overly chewy), and yet light and delicious. Loved the sauce, fresh mozzarella and the bundle of basil. (I ordered the margarita pizza). \n\nBeautiful day so we sat on the patio. Friendly service, always had everything we needed. I have to agree with Gayle King (Oprah's best friend)this is some of the best pizza in the USA. Soooo good!!!!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2014-02-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'qlaKYuuE012SZ_isC7NCVg', 'review_id': '4UNciVVvAk-m4ARdOuZX5g', 'text': 'Normally love this place but when they would not accommodate my to go order, well it was surprising. Very disappointing.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2014-03-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4I20VXHPK2V3pY8yTYm6sA', 'review_id': 'QxKeVv0JqeqDZkURFKcOtw', 'text': "Unlike the 623 E Adams St location this place gets an extra star for taking reservations. Having the Wiseguy pizza here did not bring back the memory of the other location's greatness. Service was quick and friendly and they took us right on time for our reservation, which were also pluses yet...another downside was the acoustics of the room we were seated in. It was a large room and I do not think it was the people in it but something about the hard surfaces or shape made it one of the loudest dining experiences I have had in a long time. It was actually hard to have a conversation with the people sitting across from me.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2014-03-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ta_9BqNd4Vk8vPArSZHgig', 'review_id': 'Y3Wh0h1p0oETN6WbdFy-PA', 'text': "We have been wanting to try this place for a while and finally made our way there tonight. Unfortunately, it wasn't quite what we expected. The appetizer of fresh mozzarella and tomatoes was great but it went downhill from there. Not only did the waiter seem annoyed and uninterested but half of our order came out wrong. When we informed the staff that one of our pizzas was supposed to have mushrooms, they just brought out a side of mushrooms instead of remaking the pizza. Very strange to me. Overall, I think we were all glad we tried it but mostly because now we know we aren't missing much.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 2, 'date': '2014-03-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'g-5aOiGQbtlACKsWzb3-1g', 'review_id': 'Kl5aAxqlUbUbylKsD7OR5Q', 'text': "After having thoroughly enjoyed my experiences at the Pizzeria Bianco downtown along with Bar Bianco and Pane Bianco on prior trips to Phoenix, I had to try the Town & Country location of Pizzeria Bianco and was not disappointed at all.  I'll skip the downtown location from now on as the food here is just as good.\n\nWAIT: Rather than waiting for 3 hours, we walked in on a Friday evening for an early dinner (6:15pm) and were seated right away.  You really can't beat that!\n\nFOOD:  \n-- Hand made mozzarella, $12 - It's everything you expect from a good caprese - great cheese, flavorful tomatoes, fresh basil, and just the right amount of olive oil.  A solid, but not particularly exciting dish.\n-- Margherita pizza with wood wood roasted mushrooms, $16 (for CC); Margherita pizza with prosciutto, $19 (for AC) - Both of these pizzas lived up to our expectations.  The crust was amazing - super thin and chewy with a touch of char.  The cheese was equally good, as was the fresh basil.  There was just the right amount of sauce, which wasn't overly sweet.  The mushrooms were fantastic, cut in quarters rather than thin slices with earthy, woody flavors.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2014-03-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'C11ccgVaIa6Uk_BFzVc-GA', 'review_id': 'o6bc35onUB2Sj1yPiKsaIw', 'text': 'Horrible waitress, huge disappointment. We were in town for Spring Training and this place was recommended. It took over an hour to be seated (estimated 25 by hostess) and an addition 30 to get food. We thought \'this place must be good". Complimentary bread is served with plain olive oil - no flavor. We ordered the green salad, a side of mushrooms and two pizzas. The salad and pizzas were nothing special, not bad but not good. We had to stop someone to get the mushrooms we ordered as they were not brought, obviously forgotten. The guy who brought them apologized and did not charge them to us but they were dry and didn\'t have flavor. The worse part was our server. She never checked on us, wasn\'t apologetic about forgetting our mushrooms and we had to flag her down to get the check. Do not recommend!', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 1, 'date': '2014-03-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Xpg-v0vUg2vPNQqwStkGCQ', 'review_id': 'bZ6_Ah7FrtO8gkKkBx7q1g', 'text': 'This place is a little misleading.  About a year ago I had dinner at this exact same location and it was simply called "Italian Restaurant".  It was ok...nothing special.  A few weeks ago I notice that Pizzeria Bianco had moved in and I was super excited since I\'ve been to the downtown location and love their food.  I was surprised to see the menu looked pretty much the same as that of the former occupant "Italian Restaurant".  I think they just added pizza to the old menu and gave it a familiar name in hopes that it would be successful.  Lame.  The pizza we had was ok but not as good as the downtown location.  I wouldn\'t go back.  Also, the room they seated us in smelled like paint thinner and had a very odd decor.  Not appetizing.  Our waiter was slow and my napkin was soaking wet before I even touched it.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 2, 'date': '2014-03-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QdzPJC4kpqLxu_PKQPK2xg', 'review_id': 'QLelLSeA7bD7CM2AySe3lg', 'text': "Not the same wait as the downtown location.  But something just wasn't the same. I am writing this review after a third visit.  Best thing is they have options other than amazing pizza.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2014-03-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 5, 'cool': 0}, 'user_id': '6STpZ4eL0rzkTdz5v-ZnUA', 'review_id': 'YeFCtA_uHovYl9BOryuU_A', 'text': 'I went into Bianco on Saturday night with 2 friends. First of all, the waitress (named Maria) was not helpful at all. We asked her for wine recommendations and she recommended the most expensive bottles on the list, sorry but no. Then, when it came time to pay the waitress overcharged us (she rang in beer instead of espresso, really?) and then when we got the corrected bill, we all paid and went home. The next morning, I looked at my bank statement and realized I was over charged by THIRTY DOLLARS. I immediately went into the restaurant and the manager said he would void the charge and charge us the correct amount. Well, the sneaky guy decided to charge me $64.10 instead of $58.10. Even WITH the correct receipt he still managed to over charge me. What a f-ing joke. Learn some goddamn customer service. \n\nI will NEVER go to Bianco ever again.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 1, 'date': '2014-04-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FOdKaVUkLGobvueWyDcLJw', 'review_id': 'kyD6g9ujrywqwkm8hmLr0w', 'text': 'This place is delicious. Romantic yet comfortable atmosphere. Great service. Reasonable prices. Amazing food. I visited when it was the original "Italian Restaurant."  I like that they have expanded and now have a real bar! Absolutely recommend.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2014-04-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jpvELM1Diw-cxwJTFwhNUQ', 'review_id': '70bbxC3cPfgtXprUZAF-7Q', 'text': 'Great overall experience.  I thought the Antipasti could have been plated a little more nicely, and the kitchen could use a heavier hand with the salt, but there was salt on the table so not really an issue.. That said, all of the food was delicious and our service was good. We loved the pasta, entree and special options.  Would come back for sure.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2014-04-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'wUEp87FqOB9ew27Iz6zk_w', 'review_id': 'B5mST2q-geeQOIdrCdKvTg', 'text': 'I have always wanted to try Pizzeria Bianco, but I didn\'t want to wait hours in line. So I am so glad they opened this new location!  I came at 6 pm and there was no wait for a table of 4.  However, they don\'t seat incomplete parties and I had to wait for my dining companions.  When everyone finally arrived, the wait was about 20 minutes, but not terrible.\n\nThe inside of the restaurant is very eclectic.  Parts of it look like a grandma\'s living room, while other parts have modern light fixtures.  However, somehow it all works together.  I like the little tealight candles on each candle, makes the place feel very intimate and cozy.\n\nMy friend and I shared the mixed greens salad and the Sonny Boy pizza.  I really liked the salad!  It was just plain greens with a light dressing and a few olives.  Simple and delicious and healthy.\n\nThe Sonny Boy pizza came with a meat, mozzarella and olives.  It was good, but next time I think I would add some basil, as I felt like it needed a little something "sharp" in there to add some depth of flavor.\n\nOverall, this place lived up to my expectations and I will definitely return!', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2014-04-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 's6HC2kx5s_xRLhMPcm_7PQ', 'review_id': 'n-VEphEDlp5w7vjgDMExmA', 'text': 'Mama Mia.  I hate giving this kind of review  to a place I hold dear.  Obviously operations haven\'t been ironed out in the front of the house or the back of the house.\n\nI\'ve been a fan and patron of Bianco since \'06 when I was exiled here from San Francisco and Chicago.  I was living part time in both cities.  I got to know thin and deep dish crust pizzas.  I prefer thin. Unless it\'s Giordano\'s.  I digress.\n\nI came with my uncle. Assuring him it was awesome pizza even thin crusted.  \n\nWe ordered two mozzarella salads.  Good.  As I have always expected.  We arrived at 7pm.  Salads at 715.  Pizza, the "wise guy" fired at 727.  Didn\'t receive the pizza until 810.  \n\nMy uncle ordered iced tea.  He didn\'t receive a refill from our server.  He politely set his empty iced tea glass to the side.  And then we waited.  \n\nThis awesome waiter assistant/back waiter filled his iced tea.  \n\nThen our server came by.  Asking if we wanted any crushed pepper for our pizza and if we were excited.  :/. What?!  Obviously!  We had been waiting and she didn\'t even acknowledge our wait let alone fill one iced tea.\n\nThen I had to call anyone who would make eye contact with us over to see exactly what was happening with the pizza we ordered.  Was it given to another table?  Was the temperature in the wood fire burning oven too low?  Why aren\'t we enjoying Chris Bianco\'s pizza yet?  She explained that the order is fired after salads are FINISHED on the table.  Be warned.  I wasn\'t.\n\nLord almighty.  Back of house and front of house has some work to be done.  Fire entrees when salads arrive.  Not after one finishes their salad.\n\nI was given this explanation.  "The oven is backed up right now."  This came from the hostess I had to wave at.  Understand, it\'s very horrible and rude to have to wave at any restaurant staff.  They are thinking a million things a second if they really care about their job.  \n\nOur waitress was lackluster at best.  She ignored us.  She was either embarassed the kitchen is going through changes( and going down) with new blood or she just really doesn\'t know how to talk to a table regarding a long time ticket.  \n\nVery disappointed.  I\'ll take out from now on after calling ahead.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 1, 'date': '2014-04-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'b55NYJJavY4rXXx8V3HaFQ', 'review_id': 'CAzNSvTbkTtnFao0cbf0kw', 'text': "This was my first time at the new location and I was extremely pleased.  Four of us were able to walk up and be seated immediately...which I'm not used to with the original location!  To make matters better the restaurant is spacious, well decorated, and comfortable.  \n\nThe food is outstanding.  I feel like anyone rating it less than 4 stars is doing it because they feel the prices are high.  I feel the prices are fair.  You're getting top quality ingredients and excellent food.  A little bump in price is fair.  Our bill for a bottle of wine, an appetizer, and two pizzas was $88.  $22 apiece and we all left full and happy. \n\nIf you're in the Camelback area and want to experience the same great food as the original without the cramped atmosphere and two hour wait, this is for you!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2014-04-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'V4dRqmyUjLcLBqJ8E_1aew', 'review_id': 'Vcqf-OxEs5SNE24ldOCW3g', 'text': "Although this Pizzeria Bianco is much bigger than their original, it doesn't taste the same! :(\n\nI went with two friends and we ordered two pizzas, wine, coffee and dessert. \n\nThe pizzas:\nMargherita - This was good, it had fresh ingredients and was simple. To be honest, I think it's really difficult to mess up a Margherita pizza.\nSonny Boy - This was okay, but for the non-sauce pizzas, I definitely like the other 2 much better.\n\nThe wine and coffees were good and great for keeping conversation flowing. ;)\n\nWe also got a piece of cake. Personally, I don't like any fruit flavors with my chocolate (this one had an orange rind/flavor on top), but my friends liked it a lot.\n\nTo be honest, I wouldn't come back to this one. The original is much better. I can taste the difference in the crust and how it comes out. I was a little disappointed in the food, but the service was great and MUCH faster than their original location.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2014-04-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ipogAKEKMsZ-CsbQ7CGt5A', 'review_id': 'lFtuHuPqKHKV9_2jYN6hkQ', 'text': "Whoever put Yes in the 'Good for kids' category LIED!  Good pizza but I'm disappointed that I have to go elsewhere after eating to get my child something to eat.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2014-04-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'I8bAJmAXfbhtrwAlQs9HVw', 'review_id': 'jqPfhvddhIN6jeUWVFk_ng', 'text': 'Heard great things about this place, but it was a disappointment. The decor is great, but our service was terrible. Food was brought out at different times and it took a long time to get our waters too. My lasagna was a little bland. The best thing I ordered was the house red, and even that was just okay.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 2, 'date': '2014-04-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Fgpm_uoRYBi3lg6OLRM4gw', 'review_id': '_ZCEwdwmOzR7VyqeJVJ0uQ', 'text': "I've been to the OG Pizzeria Bianco and I have no idea what's wrong with this location. The other one was great! The food was pretty good but the service was horrid. Our waitress was mediocre at best and it was problem after problem with this place. I'll give Pizzeria Bianco one more try but never at this location.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 2, 'date': '2014-04-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VZmjh4DrycVfTw3WigMQaA', 'review_id': 'pjgY5jcA5cRf1iceL92TXw', 'text': 'I heard this place is great yet for some reason they find no need to take your order after ten or so minutes of waiting. Considering we were the ONLY table seated, we decided to leave and go next door. Our order was taken within a minute. Maybe next we will call in our order and then eat there.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 1, 'date': '2014-04-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fEaRrnOhI5ruSUvZpn993w', 'review_id': 'ybwDZBFtHzYaM_neVPvrTQ', 'text': "Checked this place out Sunday afternoon for lunch. It was quiet and not too busy inside- the outdoor seating was packed and the only table that was left was directly in the sun. We were a bit bummed about that as it was a nice afternoon. We were seated at a really small table in the back room. I don't understand why nice restaurants seat people at tables that barely hold any food. \nThe free and fresh bread that they give is really good. The texture and flavor is amazing. We ordered the mozzerella salad and the biancoverde pizza to share. The salad was fantastic. I liked the pizza but thought that it would have been better if the crust was a little more cooked in the middle of the pizza. Otherwise, it was quite good. \nThe server was nice and was attentive at first but we had to wait about 10 minutes to get her attention to get the check. \nOverall, we like it and will be back to try more items on the menu!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2014-04-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jBKERVLJailJYEPpOnBQJw', 'review_id': 'PgUKgpmMm9dact3VMQk5Ww', 'text': "So here's the thing, this place was amazing. Amazing food, great service and at an excellent location. However, they charged me $145.00 for a $45.00 bill so definitely going to need someone to contact me for a credit. Hopefully they read this because they don't answer their phone.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2014-04-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'u1fxUYcCZsiazNmczJh0hQ', 'review_id': 'VQgg4j-szTbKyx9EhkWVow', 'text': 'Ok I really don\'t get it ! Best Pizza in the what ??? I feel bad giving an A-ok because they deserve better than that , but I wasn\'t really a "Fan"/ The Bianco Verde Pizza was really good , but I think Cibo is way better . I assume Pizzera Bianco was one of the first gourmet pizza restaurants in Phoenix and that\'s when the hype started. There are so many just as great places in the valley and will cost you less than $20.00 a pizza.\nAnother Note :I was the only customer at the restaurant and the waiter disappeared for 25+ minutes after the food was served. I had my lil one with me and had to flag someone inside to get a box and check.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2014-05-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Twz957LGX71_U-qWXmZF7w', 'review_id': 'HpJRn5RVKD6IUgg2SYnwFA', 'text': "I like the ambiance a lot and the server was attentive, but I wasn't satisfied with the pizza. I ordered a wise guy, which is fennel sausage and onions and mozzarella. The crust was thin but every bite I took had like a charred taste and when you look underneath, there was burned spots. The onions were too big and the toppings were not evenly spaced out, so there were toppings sliding and falling. It just wasn't my favorite pizza.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2014-05-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'nR-ZeK6G4nI-cpzMgXxAgA', 'review_id': 'f3SEL9VqDs9SQRoefiwmRw', 'text': "Today started off like any other day, I wondered what I was going to consume to get proper morning nutrition. As with the last 5 days I've been in phx, I decided on a smoothies. God forbid my host doesn't have a vitamix, so I have to drive to random locations to get my fix. As per usual, I got my smoothie from whole foods and was satiated, as well as perplexed as to why I just bought a ten dollar smoothie and why I also got $180 worth of random items including bee pollen and nut cheese? Anyways, I walked to my car and noticed the sign for pizzeria bianco. I loaded my whole two bags into the trunk and went and found out its the same place as the original location that I heard people bang on about the whole time I was at ASU. I got the margherita, recommended by the friendly and accommodating Dave. After my first slice I was pleased that the pizza was not only tasty but didn't leave me feeling sick as would a slice from somewhere like hungry Howies or dominos. Hurray pizzeria bianco, you continue to please.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2014-05-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'GoDjpEPTyUQoQVRwPljIgw', 'review_id': 'BC2MCnDuCblygygEzuxtJA', 'text': 'I\'ve been wanting to see what all the hype about this place is for quite some time, but I am firmly against waiting for multiple hours to eat at a restaurant.  Now that this location exists and I don\'t have to venture to downtown PHX to eat there, we decided a visit was in order.  I was skeptical about PB\'s amazingness before eating here, so my expectations really weren\'t that high.  \n\nWe ordered the Wiseguy pizza and added mushrooms. The real star of the pie was the mushroom and also the fennel sausage.  It comes in slices instead of chunks on the pizza.  The wiseguy is a "white pizza" which normally doesn\'t thrill me, but I actually didn\'t miss the tomato sauce.  Would I go out of my  \nfor PB pizza?  Nope.  It was good, but nothing so special that I would absolutely have to have it again.  \n\nThe service at this location was good.  Our iced tea was constantly being filled and the server left us alone when we were deep in conversation. \n\nThe main reason that I just can\'t give PB another star is the sheer lack of variety on the menu.  We went to lunch, where there were 3 options for salads and two of the options really weren\'t salads at all.  There are only a few pasta options and a few pizza options.  My hubby wasn\'t all that thrilled with what he had to choose from.  Yelp doesn\'t believe in half stars, but if they did, I\'d give PB 3.5 stars.  (sorry, I don\'t usually round up).', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2014-05-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '9U6JZNB2XKRPtnwtmaMd6g', 'review_id': 'jkQDI8FweL1mbHrtVpUglQ', 'text': 'I don\'t get what all the buzz is about. \nPoor customer service right from the start when I went in to get a table. My family was  joining me for dinner and were arriving a few minutes later. The place was not busy and tables were available and the hostess told me I had to wait?  The hostess told me I had to wait until my full party arrived. \nShe proceeded to seat a couple after me even though their full party wasn\'t present and when I asked why they were seated I was told "they are investors in our company and eat here often". ?!?\nShe agreed to seat me after my inquiry and then I was ignored by the staff.  Not one server came by to ask if I would like to order a drink or an appetizer.  I finally had to go to the bar to order my own glass of wine.  The bartender was very accommodating and took care of me right away. \nWhen the rest of my family arrived, we still had to wait another 10 minutes for a server to come and take our order.  My husband asked for a glass of diet coke, the server said we are out of this item and offered up regular coca cola. My son asked for a lemonade and was told "we don\'t have any".   \nWe decided at that point it wasn\'t worth staying any longer other than to finish the glass of wine that I purchased.  \nThe server staff gathered at the bar and started staring at us because we hadn\'t left since we had already paid the bill. We saw the hostess mouth to the servers "I\'m sorry" and then looked at us.   \nWow- that\'s Pizza Bianco\'s type of customer service?  \nWith all the pizza locations that are within a 5 mile radius and they treat customers like this makes me wonder how long this place will be operating at this location.  \nZero stars from me along with a very disappointed customer.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 1, 'date': '2014-05-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KlFeveRTUtwt9UJYW6Y0Wg', 'review_id': '9dMDqNIzBq17TV31Vy8wFA', 'text': 'We ordered the antipasti with roasted vegies and chicken liver patte. It was fantastic. Our margherita pizza was good, not great. Pizza crust is delicious. Our service was great. It seemed the staff tried hard to give great service. Will come back for sure will try other items on the menu.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2014-05-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'P6tLuoPr2z82NyRKmkC5jA', 'review_id': '8NnCAH5g6zctHERImjUWzA', 'text': 'Pizza at this second location was very good.  Almost as good as downtown?  In a big shopping center so parking is easy.  Late Sat afternoon it was almost empty so no wait.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2014-05-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'R_ey5DrzcyDpbr_5Gf9fzg', 'review_id': 'j9beewdsS6a4PrVCw6ybKQ', 'text': u"It's interesting that the reviews are all over the map. Three of us ate here yesterday evening and had a very satisfactory experience. Service was efficient, although perhaps getting there at 5:30 and eating in the front room before the restaurant became super crowded helped. We shared a Biancoverde pizza, and each ordered an entr\xe9e -- lasagna, papardelle and gnocchi, all very good. Are the pizzas as good here as at the original location? I'm not sure, because we haven't been there for years; however, when we did try the original we didn't feel that we had had a life-changing experience. This is still one of my favorite restaurants in Phoenix.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2014-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2HBaogoNJB4RX3cozqBHUw', 'review_id': 'r3StXufPwgtvMWXGvt2EWQ', 'text': 'Wow, fantastic food and amazing service. I cannot wait till I go back. The pizza is great, the salads amazing and the sandwiches over the moon. Best place for a outside lunch when the weather is cooler here in Phoenix. But the Ac works inside. Be sure to try them out.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2014-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yZEz7ZHDt9MU7ehH9ecCQA', 'review_id': 'DpIvdtLHagrF8XivS3-kaw', 'text': "We went to the new location last night to celebrate my daughter's 16th Birthday.  We were met with very rude service from the hostess.  We were a party of 5 and were advised that we couldn't be seated until a majority of our party was there.  My daughter and I waited and when our 3rd person showed up we asked to be seated since a majority of our party was there.  The hostess told us that she needed at least one more person to arrive.  I explained that we were waiting for my elderly parents who are 81 and 89 to arrive and that they had gotten lost and would be there any moment.  We wanted to sit and order drinks while we waited.  It was a Monday night and the restaurant was less than half full.  She ignored my request.  My partner followed her and insisted that we be seated.  She finally agreed to seat us but gave us a an eye roll and dirty look.  Had it not been my daughter's birthday I would have left.  Our waiter was friendly and the food was good but not award winning good.  I like the atmosphere but honestly had a bad feeling after our encounter with the hostess.  I do not think I will return.  There are many great restaurants in Central Phoenix that are welcoming and friendly to return to one that doesn't care about their customers.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 1, 'date': '2014-06-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': '4pi5L3KDxNiYLMQG7rTkdw', 'review_id': 'DaxgGY8K53ox1YbBVkq4Ag', 'text': "WOW!\n\nThis restaurant has a well-earned reputation.  Having eaten pizza in some of the best restaurants in New York, Chicago (and God forbid California), I have to say that this restaurant does beat them all hands down.\n\nLet's get to the pizza.  Wood fired oven.  Great crust.  Fresh mozzarella.  Unbelievably flavorful tomato sauce.  Fresh basil.  Perfectly cooked.  Yes.  Absolutely.  Best.  Pizza.  Ever.\n\nAnd because we came on a Sunday, we got to have the Sunday Gravy.  This is a meat sauce made with the trimmings of sausage, brisket, meat.  It's a deep, dark tomato sauce, slow cooked, and just rich as all hell.  Over some fresh pasta.  Just an excellent pasta dish that we shared among all four of us.\n\nService was impeccable.  The environment was like a campagna according to the wife.  \n\nWish I could give this place 6 stars.  Maybe I'll dock a star off of all of my other ratings.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2014-06-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qoeSpwTjflaFQOdzsd7gWA', 'review_id': 'yvx_5608ZcoL266iPjMiaA', 'text': "This pizza was one of the best pizzas i've had. I had a wiseguy and it was amazing. Everyone else liked their meals as well. Locals beers on tap. Wanted to keep eating but knew i had to stop and took the rest home. Very eager to go back and if its as good mostly likely upgrade to 5 stars!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2014-06-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fdfax5deZnM-pmeiyhIJVw', 'review_id': 'DD9QJNUoYN6zKkJVKKFVzA', 'text': "On a whim on Saturday evening, my husband and I decided to try our luck at getting a table at Pizzeria Bianco. We didn't have reservations, we just walked in on a Saturday night at dinner time. We didn't think we would really be able to be sat without a very long wait. We were originally told a 20 minute wait, but then the host said that if we wanted to, we could just sit at the bar, as it is full service, so we did that. We couldn't believe that we were sat right away! \nThe female bartender that was taking care of us was absolutely wonderful. She was being bombarded with drink orders from the servers and patrons at the bar, but never seemed stressed at all, and checked on us at frequent intervals. \nOur pizzas were dropped off by the same guy that was at the host stand when we walked in, and he asked if we needed anything else, and within one minute, he brought us back the condiments we asked for, as well as a plate of bread and olive oil. The place was absolutely packed and crazy, but all of the staff maintained friendly attitudes and were very quick with everything. \nOf course, our food and drinks were excellent, and we left stuffed!\nI'm sure this review will get buried under the hundreds of other reviews for Pizzeria Bianco, but I was just so incredibly pleased with the level of service that I received this past weekend and I wanted to pass along the compliment!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2014-07-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hzzm8w6t4c4QvgTfDJe6qg', 'review_id': 'jgZWiXKzaYjEIWtKjhy3bA', 'text': 'I have wanted to try Pizzeria Bianco, any location, for a while.  I happened to be in the area at a dealership for service and thought I would finally stop in.  The service was good, and the recommendation from the waitress for the Margherita with Fennel Sausage, was spot on.  The bread with olive oil that is served free of charge, was good, if a bit lack-luster for exactly that, the lack of any herbs or spices for the oil for the bread; otherwise, my visit to Pizzeria Bianco was the silver lining to the terrible two days at the car dealership and car repair expenses.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2014-07-11', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 3}, 'user_id': 'U7PC8wYKmtplZu-oUGk8MQ', 'review_id': 'AmqiAMdpPnUhLrt80hrdDA', 'text': 'Took my significant other for a date night on his birthday and all the credit got back to me! And to Tyler Florence a bit! We LOVED it! We had the Spiedini for app, and then the pizza.. Oh the pizza! Crust - amazing, the crunch of the pistachios - also amazing, perfectly bake for a satisfying bite! Great selection of wines and also decent array of beers on tap. Ended it with a piece of chocolate cake and the night was just made more perfect...', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2014-07-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IxqDzUzOMI4Te0Af239ZDw', 'review_id': '6sbrEbvxgz9vLg_j8ke7OA', 'text': 'Not worth all the hype. Good customer service, but selection is minimal and just ok tasting. ..nothing to write home about.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 2, 'date': '2014-07-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'XqMkm-DD9VsdcKx2YVGhSA', 'review_id': 'hjfFtwaeH5NuN1bQvwx_Ow', 'text': "(Lyrics - Phil Collins - In The Air Tonight)\n\nI can taste it going to Bianco tonight, Bo Bites\nAnd I've been waiting for this location to open all my life, Bo Bites\nCan you taste going to Bianco tonight, Bo Bites, Bo Bites\n\nWell, if you told me you were hungry\nI would lend a hand\nI've seen your appetite before my friend\nBut I hope you know who I am\n\nWell, I was there and I saw what you did\nI saw it with my own two eyes\nSo you can wipe off your mouth\nI know what you've eaten\nIt's all been a plate of pies (pizza)\n\nCame here for a quick HH drinks with a buddy!\n\nHowever, when in Pizzeria Bianco you have to order a pizza!  It would be sacrilegious not to!  I'm not too fond of the draft selections since there were only 2, but I guess I shouldn't expect too much from a wine and pizza joint.  We ordered the Margarita Pizza.  Overall, it was pretty good - firewood baked pizza pie in a stone oven; you really can't beat that quality!  The aroma of the basil, the stringy mozzarella cheese, and the sweetness of the tomato sauce is enhanced by the toasty smell of the firewood! Yum!  \n\nThe service was very good!  There were several people that attended to us, but seem like they were all in sync and willing to help to make our experience so much better!  The place itself is different from the one downtown.  This one had more of a farm home feel with a touch of spring!  In the end, a must visit next time your around the Biltmore area! - Enjoy!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2014-07-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'JIHbz6V2TJ6ho0yUaBsckQ', 'review_id': 'UnIqaDAVPPazVOJYBBt59g', 'text': "The staff is friendly! The decoration is cute. The location is great. Pizza was tasty. I ordered the Biancoverde which had fresh mozzarella, parmigiano reggiano, ricotta, arugula and I added fennel sausage. It was pretty good, although I should of added prosciutto instead of the sausage. That was a fail on my part! The only bad thing is that they didn't have ranch and my pizza was slightly too toasty for my taste buds! Sad day. Cool place though!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2014-07-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': '_LsbT_uW0UE6rhsWiAIrsg', 'review_id': 'lQLeNaDcheJ4vQB5aHVSdw', 'text': 'no one wears gloves when preparing any food item.  Too noisy, and dirty, will not\ngo there again at all. You cannot talk to anyone.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 1, 'date': '2014-07-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jipiltA1mwlb6swaVWVuLQ', 'review_id': 'y9btNveyrV7--DLQTVQjRw', 'text': 'The pizza was great, had the margherita.  Pizza is wood fired so very fast to your table after ordering. Low lit restaurant, good ambiance and a decent selection of wine to pair with the pizza.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2014-07-31', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'myLlIKARGcfV9rU2IwOeqw', 'review_id': '0Tl8lmqfSkibBP35UZFQNQ', 'text': "Homemade & authentic \n\nAfter enjoying the downtown pizzeria bianco I was happy to hear of the location in town & country.  My mom and I met here for dinner on a week night.  We did not have a reservation but there was no wait.\n\nThis bianco has 2 main dining areas decorated in a modern shabby chic style that feels home, vintage and elegant.  \n\nWe shared a bottle of Lambrusco which was delicious.  For dinner we shared a wise guy pizza ($18-amazing) and the gnocchi w summer corn which was only ok.\n\nThe wise guy was a salty Caramelized yummy dream atop chewy homemade authentic pizza dough.  Love it always.\n\nThe gnocchi was a tad more firm almost crunchy, which is not how most gnocchi is served.  The pancetta bits were a little chewy and not crispy like I was hoping for.  The Arizona sweet corn was basically a drier creamed corn underneath the pasta.\n\nI took a pizza home for my hunny- half wise guy & half rosa.  The rosa was nice & tangy with the light crunch of pistachios yum!\n\nOur server was timely & obviously loved the food here.  We took our time with dinner & enjoyed ourselves.  Since we visited weeks ago I have a longing to return...\n\nOnly downside was dinner for 2 and 1 to go pizza was over $150!  Do not come here to get a deal that's for sure!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2014-08-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qxrwOv6pQ6rpP-zwshtEgA', 'review_id': 'j1xQA0OOKu-L9dPcCbNhkg', 'text': "Not sure how my review for Italian Restaurant ended up under here so I want to fix it. Love this place but go for lunch so you don't have to wait.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2014-08-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3IjNIijit0-_rovJOkszcQ', 'review_id': 'DYq_Nrraz_myP7Ow1Y5p1w', 'text': "Not worth the hype. After growing up in Chicago, I'm used to good pizza. The service is ok. The crust is so charred expect a nasty after taste for hours. Pizza is by no means health food but this one has oil dripping off of every slice. If you want to wait  for over hyped pizza then this place is for you. The only thing worthy of above average ratings is their shabby chic decor", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 2, 'date': '2014-08-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Tnbe2RurfGCzG0gT1cs5_g', 'review_id': 'E-h2acYfTTaWLB2wRPP8Bw', 'text': "Came in with my best friend to have a slice. To my surprise they have personalized pizza and very traditional authentic Italian pizza. Our server was a guy named Richard. He was very efficient, quick & funny. His food knowledge is perfect. I'm reminded that life's always a little better with this as a great restaurant. This is a Phoenix must. And ask for Richard, to make your dinning experience wonderful.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2014-08-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3E4z1eKlEVmg2hMnKIyaMQ', 'review_id': 'Hgad-V1xWCZhxPTHZjx0Ww', 'text': "We'd been meaning to try Bianco's forEVER, but just never got around to it.  We finally found ourselves hungry over by Town and Country the other day, and stopped in.  We had a very pleasant lunch experience.  Our server was prompt, and other members of the staff were present and friendly as well.  I love the look of the T&C location, very vintage chic.  We ordered The Wiseguy, and Sonny Boy, and both were fantastic!  We are big fans of The Parlor, and Bianco's definitely gave them a run for their money, just wish there was a bit more on the lunch menu.  Oh, and the peach crostada for dessert was warm, flaky, and not too sweet.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2014-08-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'nhkorBjYFl0sQ4R2dK2Mag', 'review_id': 'Wy3KeKmJ6KV3XD95RXJ7OQ', 'text': u"I have rated over 100 places on yelp and have yet to want to give a place NEGATIVE stars if I could...until I stumbled upon this dump. I couldn't WAIT to get home to write this review.  Not only was the food nasty the service was horrible, and the manager, Tyler should be ashamed of himself. Whoever hired Tyler needs a camera in his restaurant to see his demeanor towards guests. A group of 25 of us made dinner reservations here to celebrate our friend's birthday. I ordered the mozzarella as an appetizer and the chicken ranch as my entr\xe9e. The mozzarella (home made) was nothing special. The chicken was battered and deep fried-but actually burned.  I couldn't eat it so i asked for a side of marinara-hoping it would taste better. Wow the marinara was the most disgusting sauce I had ever had.  Canned tomato sauce tastes better.   By the way they charge you $3 for that crap. Everyone hated their food.  Furthermore, they wouldn't split the check more than 6 ways. They wouldn't allow us to bring our cake out. The manager came out upon our request, we asked him where the nearest ATM was and he had the nerve to roll his eyes at us. He was so unbelievably rude. I was astonished. He refused to split the check further and was basically yelling at us.  He should be fired. I wish there was more I could do about this. He ruined our dinner. The service was also lacking. None of the food came out together at one time.  DON'T COME HERE. You get better pizza at Papa John's or Dominoes for a quarter of the price. I promise.  BEWARE", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 1, 'date': '2014-08-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ezlREDTMySp-qdVjZBlnEg', 'review_id': '9AZV6DCwnkQojtAFakuJ5A', 'text': "Amazing pizza and pasta!  Probably the best pizza outside of NY.  Can't wait I go back!!!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2014-08-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'OpN1MhESDpc4_mPpx2Pd9Q', 'review_id': '02mvMIsv53f4EmxXgcIRtg', 'text': "Went to try Pizzeria Bianco in July and was sad to find out they were closed for the week! They didn't put anything on their website, Instagram, or phone recording about it. They only warned people via Facebook which I unfortunately did not see.\n\nI was happy to be able to try this place again on Friday though..finally! Loved the shabby chic look, very cute. We were greeted by a friendly hostess, and our server was absolutely excellent as well. I got the Field Greens salad and me and my boyfriend split a pizza which was half Marinara (For me!) and half Sonny Boy.\n\nI liked the bread they brought out, yum! The salad was $8 which seemed a little ridiculous for what we got. The greens tasted very fresh though. The dressing on it was a bit too salty for my taste, but it was edible. I was torn between getting the Margharita or Marinara, but decided I wasn't in the mood for cheese so I got the Marinara. The flavors of the marinara sauce with the fresh sliced garlic and basil was incredible. One complaint: the crust was a little too floppy and soggy towards the middle. The outer part was good though! My BF got the Flourless Chocolate Cake for dessert. I tried a bite, it was very rich. Pretty good, but the portion was very small for the price.\n\nThis is the only Pizzeria Bianco location that I have tried out, and I enjoyed it. I would be interested in trying the crazy busy downtown one!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2014-08-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uo5eCRTQtNDYVg4st0xIPw', 'review_id': 'fnXTi9ruZwfhZas6C-5j6A', 'text': 'The beat pizza in town. Service was great with a lot of seats. It was just like Rome when I had it. We had three pizzas for two people. Worth the wait. Yahoos top 10 pizza joints mozza was inspired by this place and uses their special tomatoes. A must try even for the line. Lunch on a week day is very doable.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2014-09-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'hCire4K01_C40QSgx9k7cg', 'review_id': 'ixZZQgERrj368nQhztLWcg', 'text': 'If you want good food, they have it. But if you want good food and a European-style dining experience, this is not the place to go. It has the ambience, but not the manners. Last evening I was in a group of ten who had dinner here. We were there from 6:00 to about 8:15. Food was very good. We spent almost $500. Our waiter came by and told us they had another group waiting for the table. We were a group of friends enjoying an evening out. Couldn\'t they offer to put us at a different table (since 4 of our party had already left; or combine tables for the other party? I wish I/we would have thought to suggest this at the time, but it happened so fast it was like, "what just happened here?" So we went to a neighboring restaurant for after-dinner drinks and coffee. I hope they take this review to heart. In this crazy, rushed world, there is nothing like a relaxed evening with long-time friends. Guess we\'ll have to find another place to do this.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 2, 'date': '2014-09-28', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 0}, 'user_id': 'D8W5xMnKO6ATRp8RGir9fQ', 'review_id': 'jy2FRH_l_s1mFD-C_y9OWg', 'text': 'Food was great. Customer service was okay. Felt like we were being rushed and then we were amazed that after just 2 hours they "politely" said that they needed our table for another party and basically asked us to leave - after spending over $400! Please note that we are a group of mature women who were talking and catching up. We weren\'t loud or annoying. They just needed our table. Won\'t be back.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 1, 'date': '2014-09-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '68zB7FYPFA8xy0UfHJGuPw', 'review_id': 'NnwSkXyCKLOL6ekphoK_hg', 'text': "Went for lunch on a Saturday and it was very quiet. I know a lot of people complained about the service but our server was very nice and attentive. We only had the Margarita pizza whichever we shared and it was good. Great crust! But from what I can remember it wasn't as good as the pizza at the original location downtown. Will be back the next time I'm in the area.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2014-09-28', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'Cf71UDaqt_w685oV4pU9NA', 'review_id': 'N4GRFxbv6UkX46h4N6tjyw', 'text': 'The reviews of PB at the T&C Center look pretty mixed. Which I understand, since I myself have had mixed experiences here over the past year or so. Been here about 10 times total: happy hour side, fine dining side and take out.\n\nTHE GOOD-\n-Good to great ingredients used for their dishes. Obviously this place is most famous for its pizza. And I agree, it is frequently tasty. At times delicious...at other times just good...sometimes just-OK. It depends: did they burn the crust? Did they ration the cheese/sauce/toppings properly? If all is done well here, it\'s quite good. Not THE BEST...but nonetheless very delish.\n\n-Homemade pastas; love it!\n\n-Really like the decor in the fine dining room. (Can live without the bumpkins who chow on the fine dining side in cargo shorts and poopy sandals, though.) The happy hour side is a little cramped, but that\'s fine...it\'s what you\'d get in the city... or Milan... or anywhere crowded. \n\n-The bussers: honestly I think the bussers here are sometimes better than the servers. They are on top of water & bread re-fills; and dirty plate takeaways. Very efficient.\n\n-Parking: plenty on all sides of the T&C Center, chief.\n\nTHE MEH-\n-The menu is small and some of the items offered are less-than-inspired. Frequently the salads are lazy. Like, they are **halfway** to being complete salads. STOP SERVING mixed greens + olives + parmesan and calling it a "salad". Maybe this passes for something in Torino...but in !!AMURICA!!, we demand more ingredients, paisan!\n\nTHE NOT-SO-GOOD-\nSome of the servers are GREAT. Some of the servers are just Cute But Don\'t Know A Lot About Food. We had such a gal on our last visit, which was a good meal. But when you don\'t know what you\'re serving, it causes problems. For example, Cutie Gal recommended the "key lime pie" for dessert, saying it\'s one of the best items on the dessert menu. NOT. First of all, the "pie" was actually a "tart", which is MUCH different. Plus, it was 97% citrus and 3% sugar, i.e. not suitable to eat and certainly not a dessert. We sent it back. The menu here isn\'t that big - I\'d want the servers to at least be familiar with it.\n\nIn all, a flawed restaurant, yes. But usually good service, nice atmosphere and quality dishes. Through trial-and-error, you\'ll learn the better items on the menu and better times to visit. A little pricey, but a solid, good experience on most nights.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2014-09-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'GQ5hjnYDGUmwHBdZ9IGMhg', 'review_id': 'b6uwC-M2AtnfrnIZs07yxw', 'text': 'Pizza was good. Just good! After reading an article online that touted this place the number 3 pizza place in the US I had to try. I think the food would have tasted better if the prices were more reasonable!', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2014-10-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wS9ldL2Uyvm1lF2901xdNg', 'review_id': 'Afcu5uSIgl4G2JMfmMSJhQ', 'text': "First visit to Pizzeria Bianco and was very pleased with the whole experience.  The service was very good and the pizza was even better.  We went to the location off of Camelback around 4 pm so it wasn't very busy (and we wanted to beat the dinner rush hour).  We'll definitely be going back soon.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2014-10-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rJLsblRgUD7dirhArkCrpA', 'review_id': 'KuAs0YDwY4JA0E0D7Vdg1w', 'text': "My wife and I shared a Caprese salad and the Wiseguy pizza.  We were big fans of the Caprese as the mozzarella tastes better here than it does at most other places we've been.\n\nThe Wiseguy was just fine.  I like a good balance of crispiness to chewiness in the crust.  This one was more crispy than chewy.  All in all, a good pizza, but I wouldn't consider it my favorite.\n\nThe location at Town and Country is easy to access and there is plenty of parking.  I'll try to go to the downtown location next time to see if it's any better.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2014-10-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QdzPJC4kpqLxu_PKQPK2xg', 'review_id': 'VVQYBrUVD8G5AOxWjbUFVg', 'text': "Updated review.  Now I've been coming to this location I've enjoyed the entree options and the food is top notch.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2014-10-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 3}, 'user_id': 'R3hxk_psogGPRjTjUug-dg', 'review_id': '8c5dK50gLsgcgwf2dWOM6Q', 'text': u"We had dinner there to celebrate my sisters birthday and I can't say enough great things about this place.  The ambiance for starters really made the place feel cozy, and was full of eclectic vintage d\xe9cor.  The service was outstanding suggesting several wonderful plates all of which were equally fantastic.\n\nThe food tasted fresh, all the portions were perfect, and I found the prices to be very fair.  We had a wonderful time and even got to meet Chris Bianco.  I would highly recommend this wonderful place to anyone looking for a wonderful meal with the family to a romantic quaint date with your significant other.\n\nThanks Pizzeria Bianco for a great experience!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2014-11-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tFyQbNbBQEyEc9oCr1pJUg', 'review_id': 'y_N6KZET00doU653RoWFAw', 'text': "The prices were a bit much for what you got. The server we had was nice in the beginning and then at the end seemed annoyed. Service was alright along with the food. Expected just a bit more from... Wasn't impressed as I guess this place is ranked #1 in Arizona.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2014-11-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CIOWTD8kQlvJYvjfX1dXXw', 'review_id': 'ZwEtoToRNZGxAEXLw7CVQg', 'text': "Had to try this place based on hype and really wanted to love it as it's close by and we love quality.  Unfortunately, the service killed the experience for us.  The place just didn't make us feel overly welcome and the pizza came out without the toppings we asked for.  The server offered it up on the side which took about 5 extra minutes which is fine but they then charged us separately for the addition.  When we asked to split the bill 3 ways at the end, the server took the tab back seemingly hastily.  Not a super friendly feel here.  The pizza was good but can get better for the high price.  No desire to return to this place.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 2, 'date': '2014-11-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'fIvDzLhs-cXbTKWp8P3eIA', 'review_id': 'uTbR5rMtDA4QglpphZHWBA', 'text': "I've been in Phoenix for 3 years now. Being from Chicago so many people told me to try PB. Magazines, tv shows, Oprah all say this pizza is the best. Well, don't believe the hype. The pizza was good, but not the best. There are so many varieties of pizza: thin crust, super thin crust, thick crust, deep dish, white pizza, etc. PB makes a basic, simple, light pizza with fresh and few ingredients. I would nominate it for the freshest pizza, but again not the best.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2014-11-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ucGfMGHDxYCMJ_VLpMjAOw', 'review_id': '7LspdnBEer1Wj7q_WmNhhQ', 'text': "Really good wine, and the best pizza I've ever had!  They made a tomato-less base one for me and it was freakin bomb!  Can't wait to go back!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2014-11-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': '0lXjMakFtAX_iVbKYOCsfQ', 'review_id': 'TGWSkEDHao4d-WMREoX3yA', 'text': "The best pizza in town!\nI am very pleased at every visit. I like to come here with a group of several people to be able to taste as many dishes as possible.\n\nMy favorite appetizer is Caprese salad. Their fresh mozzarella is really good, taste like homemade, mixed with very good olive oil makes it so perfect.\nSpeaking of olive oil, I always like their olive. It reminds of me what my mother-in-law used to make at home.  They are so good, in fact, even those who don't normally eat olives liked their olives.  They are that good.\n\nMy favorite pizza is biancoverde. I like arugula, and eat them as salad often. Garlic paste they use matches arugula and cheese really well.\n\nFor desert, can't miss the flourless chocolate cake. 80% of dark chocolate gives you just right  amount of sweetness.  I also like their coffee. I haven't had a chance to ask about beans they use but I can tell they use really good coffee beans.\n\nService is always good, location is convenient (near 51 and Camelback), this is a must try at least once place.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2014-11-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'mO2dGH8UcJBDp9lhE9MgqQ', 'review_id': 'sS40JLbulxzThdeqLNLpbQ', 'text': "We come here every week and always split a sonny boy pizza. It's my favorite pizza in the world! So delicious!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2014-12-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Om82Bhb9yclV4jM6xIGyBQ', 'review_id': 'AOY4-7j885qdfmOvH9Z5gA', 'text': "Amazing menu. The pizza has a delicious and distinct flavor. Definitely in the top 5 of my pizza experience. I'm from philly and haven't a good pie in awhile. This gives any pizza I've had in philly a run for its money. The meatballs as an appetizer was perfect moist and juicy. I highly recommend this establishment with its charming decor.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2014-12-07', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': '9wmMMAmFusDZVGpZ6wksXA', 'review_id': 'Sdp7RqEYGgHlqol-wP2S3g', 'text': 'Man I hate to say this cause I love the other location, but this place is overrated and over priced. Paid $48 for a take out salad that was 3 bites and 2 pastas that could only feed one person. Plus the server was rude. I am a big lover of the phoenix restaurant scene, but I will definitely not be spending any more money or time at this joint.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 1, 'date': '2014-12-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Q0a4EazUm4kb4yQxprctxA', 'review_id': 'frHz8h0HVrtT5L6tRbtRQA', 'text': "I know this isn't the original location but I was hangry and couldn't wait. First of all, I'm excited there are decent places to eat in arizona (I'm a CA native). I went on Saturday night. No wait at all. Ordered and pizza came out without 5 minutes! What?! I was so happy you have no idea how hungry I was. Waiters were attentive but I was too far in la la land with my slice of margherita pizza to notice anything else. Wow! Tomato sauce makes this pizza. On point! Thin crust goodness. I can't even form real sentences right now cause I'm too busy drooling! Lol yum they have an extensive wine list and other drinks too. Oh this lady next to me tho ate only the insides of her pizza and left the crust, actually putting the crust back together into a circle. Blasphemy! Please don't. The crust was the best.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2014-12-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JQWezD-lwN60VjcgvblIkQ', 'review_id': 'UiARZ4kltBZkGt219fv7rw', 'text': 'What can you say about this place that hasn\'t already been said. The hype is true, and we\'re lucky to have nationally renown chef Chris Bianco stay here in Phoenix all these years. Pizzas are perfect, and pastas are surprisingly great & fresh (if you can resist ordering a pizza). Menu is often changing and new additions and recommendations are usually worth taking. Have not yet been to the original downtown location, am intimidated by no reservations and what I expect to be long lines for a reputable place. The "Town & Country" location is fashionable shabby chic, not intimidating. Parking is kind of a cluster. Look forward to coming here again on the next possible date night.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2014-12-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xnaSoCfAZa3v8MLPsoMyKQ', 'review_id': 'Om07NnbUJNC_sP37afMaxQ', 'text': 'The food is excellent! Pizzas are delicious! We had the Sonny Boy and Biancoverde. The pasta was also terrific!  YUM!', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2014-12-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Z1s3Zb4lMmyqyxyHWHRkEg', 'review_id': 'myMR0KUVlEbHeKCwWGziFA', 'text': "On our first day in Phoenix my friend and I started to get hungry and or quick lunch just wasn't satisfying. She called her friend who owns Pi Pizza truck in Houston and he told us this place was on his bucket list. I'm not going to lie, but we came here purely to rub it in his face and took lots of pictures. It was definitely worth it. The pizza was good and the service was friendly but not the best I've ever had. Pi Pizza ftw...", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2014-12-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '66oDhsKSB_eSrhCKiERDow', 'review_id': '8I4ieV6gKNuKL_nOj1JuUQ', 'text': "Our table for two was very small, and it was a little noisy, but the food was pretty amazing.  I had the gnocchi in brown butter with pancetta and some of my friend's pizza.  It's pricy, but I'll be back ordering pizza as my entree next time!\n\nIf the parking lot at the front of Town & Country is full, park in the back on the LA Fitness side, where there's also covered parking by the hotel, or on the Sleep America side of Whole Foods.  A little walk won't hurt after a hearty Italian meal!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2014-12-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KK_2vxqNug1wQhVo22soQw', 'review_id': 'p2V1PwqS9E7eWOjiNZmxfg', 'text': 'This is a go-to place for an indulgent lunch. Simple greens are always a perfect beginning.  The Wise Guy pizza was like a mozzarella dessert. Wait staff all quite crisp and working well together to service customers. Restaurant, including ceiling fixtures, was very clean.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2014-12-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '-tZ2zJk0gYpy0yEc_LbEwQ', 'review_id': 'PN45BJ3qAYmTw9GyPVhOdQ', 'text': 'Look, it would be unfair to compare this location to the original, but the food I confidently say is comparable. Nothing about the homemade mozzarella and local tomato and basil \'caprese\' salad was to fault. Follow that up with the Sonny and Margherita pies...uh, yeah...the Town and Country location are another Bianco masterpiece! The service was rapid as always, and at times lacking attentiveness, however it\'s never a deal breaker for me. \nFelt sorry for our server who had to handle the high maintenance customers who wanted to meet the chef, said their bottle of Merlot was "corked" (not kidding). However it was quite entertaining and made our visit even much more memorable. \nThis location, from a foodie perspective doesn\'t lack anything that the Heritage Square location brings. Don\'t let it scare you off.  Of course if I had to pick I would always go old school original, however blindfolded if the food is the same,does it really matter? Great job as always Mr. Bianco...wine snobs and all.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2014-12-31', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 3, 'cool': 4}, 'user_id': 'A9M8m5P_Dw5r9x940G1x_w', 'review_id': 'fEWMAyl76UeCGngEFPfrBg', 'text': "The travel gods were really smiling on me today!  First, I dodged the bullet on having to sit next to the world's most annoying preschooler on the plane.  Next, I scored a double upgrade at the car rental place and am driving a little 3-series for the next few days.  Finally, I was referred to this place by a couple of Phoenix Yelpers who were kind enough to respond to my request on the local talk page.\n\nI started with a beautifully fresh salad of locally-grown greens with a delicate dressing.  The star of the show had to be the three olives I found under the greens.  Each one was a slightly different color and flavor.  All were delicious and they were so tender!  Apparently they are from a distributor in California the chef selected based on the quality of their products.  In my humble opinion it was a great choice.  The salad was bg enough to split so I just ate half to save room for the pizza. \n\nBread service with a really impressive olive oil that also comes from the same distributor in California.  None of that wimpy light-colored olive oil here.  This place is bringing out a richly green olive oil with a fragrance and taste similar to what is found in Europe.  I controlled my bread-loving impulses and limited myself to just one piece to ensure I had plenty of room for the pizza. \n\nNext up... the main event!  The pizza arrived with a sage word of advice: let it sit for 1 minute before digging in.  Based on my view of this pie, that minute probably ranks among the top ten hardest minutes of my life.  I so wanted to dig right in but I hate biting into a pizza too soon and burning the skin off the roof of my mouth.  After feasting, I grilled my server to be sure I really understood the experience.  He has been with the owner for 18 years and is a partner in the restaurant so he nailed every answer to my questions with a phenomenal amount of detail and enthusiasm!  Here are the highlights:\n\n- Sea salt in the dough is responsible for the slight saltiness of their crust.  It is crunchy and chewy at the same time.  Slightly bubbly around the edges and very thin in the middle.\n\n- The wiseguy does not include sauce (olive oil instead - odd in a pizza with sausage and caramelized onions on top of it) but they use a variety of their house-made mozzarella that they smoke in their oven.  If you find yourself inhaling slightly before taking a bite you will pick up the smokiness immediately.  Pretty amazing! \n\n- The sausage is locally produced using a recipe the chef/owner devised.   Lots of fennel here... always a good omen for an Italian sausage being served to a native Chicagoan. They split them,  dress with a little olive oil and then into the oven they go.  After they cool,  they are sliced and used to top the pizza such that they go through the oven a second time and pick up a slight crispness around the edges.  The result is sausage like you rarely find on pizza and pure perfection if you can open your mind to other than bulk sausage appearing on top of your pie...not that I have anything against bulk sausage. \n\n- The Margarita pizza involved a finely-blended fresh tomato sauce that goes on raw and cooks in their 800-degree oven. \n\n- The basil comes from a local farmer who let's it grow until it resembles a bush before harvesting,  thus producing leaves that looked to be about twice the size of the basil I grow at home.  They were very generous with those large leaves and that just served to make the pie that much better.\n\nI was really impressed, Phoenix.  This place would be in the rotation if I lived here.  I'm also glad that I tried their expansion joint instead of the original place because I received far more patience with my questions than I'm sure I would have received at the downtown location.\n\nSadly, the flourless chocolate cake eluded me - I was just too damn full and happy to eat another bite.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2015-01-19', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 2, 'cool': 0}, 'user_id': 'iwWBF3nKoRMoy1sbkLJwvg', 'review_id': 'IcY49wXi7z_Q_9S-cY_ekw', 'text': 'I have purposely held off writing a review of this spot thinking that perhaps my four visits were anomalies and not the norm but after my last experience on Saturday I have decided that in fact that it just isn\'t going to get any better... so here we go.\nYes the Rosa and the Sonny Boy are sublime. In fact there are a handful of things on the menu that I believe don\'t get any better.  But there enough things on the menu that are done equally as well or better elsewhere that they lose their first star and are down to 4.\n\nAmbiance is actually nice.  In fact it is quaint, with the home like feel of the two rooms, resulting from what used to be the two restaurants in one concept that they thankfully abandoned. This location is far more roomy than their other venues, which is really appreciated, unless you are one of those people that doesn\'t mind squeezing around the door and straddling the seat to get into your allotted 2 sqft. Nice doesn\'t warrant a bump, so we are holding at 4 stars.\n\nService is what kills this location. Yes, I know you believe you are local food gods but refer to my first point... you are very good in some areas and lacking in others, so if you want to rate five stars then you are going to have to kill on service and well you do sort of, just not in the way that is good.  So once again, the meal took on a sort of combative feel and to quote Patton Oswalt\'s stand up that came later in the evening, "I\'m so pissed right now, but I can\'t wait to see how this all plays out." \nAs a customer, I shouldn\'t feel "beholding" to get a table at 5:10 p.m. on a Saturday.  When I walk in and you have a total of 4 tables, do you have to sit my party of five at the smallest four-top in the restaurant?  Should the waiter come to the table three times, blurt out some information and dash off to his other table without so much as asking for drink orders? When our party asked if we could move to one of the larger tables that might actually accommodate food for five people, is it required to hold an adhoc summit meeting in the corner, comprised of five wait staff, the GM, and the hostess all glaring at our table and whispering?  Hint: If you don\'t want people to know what you are saying, just move your bodies into the other room...  (Down .5 stars for invoking the spirit of a cold war peace talk)  Should the hostess come to speak at length to our table and condescendingly explain that ALL of the other tables are reserved so the larger four-tops aren\'t available because the parties are coming in at 6:45 and I\'m assuming she didn\'t think our party could eat in under 1.5 hours?  After expressing that we could probably meet the time requirements for a larger table if someone were to actually take our order, we were ushered over to a different table with grand Downton ceremony. (Down 1 more star for tainting my favorite show and making this feel like we were a Make-A-Wish kid being granted their final request)  And then apparently we had been branded the "trouble table" because we were now under the care of the GM and experienced peripheral glances from the entire wait staff.   At least service picked up at this point.  We were able to place our order, which may have included more items but we knew we were under the gun and had to vacate the table before 6:45, so we stuck with simple and straight forward and quite frankly I think we all just wanted to eat and get out of there by that point.  Amazingly we had only been at the restaurant for fifteen minutes and we had gone through what seemed like a full month\'s worth of soap-opera drama and long staring pauses.  If only we had the appropriate soundtrack to fill out the backdrop...  Net result 2.5 stars.\n\nThe food came out quickly but considering the number of patrons and the simplicity of our order (four pizzas), this didn\'t seem like a Herculean effort.  The GM poked his head around the corner for a peek or hovered around the table at approximate four minute intervals, plates were whisked away at an alarming rate and at 6:08 p.m. we left the restaurant.  Fifty-eight minutes of some of the most uncomfortable dining experience possible.  So my fifth visit will be my last.  If you want CB\'s food, go to one of the two other venues in the city and pass on this one.  Or just go to one of the other local, less glorified, spots that are on par with his pizza and where you don\'t have to take on a submissive stance for the privilege of eating.\n\nHint:  You are honored by the presence of your customers and exist at their whim.  Not the other way around.  :(', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 2, 'date': '2015-01-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'ugmYc6jJbLd2t5NB_7vXDw', 'review_id': 'zhQcQfRRc_G3c_zobEop9Q', 'text': 'I have been to Pizzeria Bianco once before with two friends, but this last time? It was something so special and Pizzeria Bianco made it something to remember. It was my 26th birthday back on January 18th, and my boyfriend had "told" me we were coming here for dinner, just the two of us and had planned a little menu for us and already ordered my favorite wine (Lioco Chardonnay). This did fool me because I assumed that this Restaurant would be a great place to put personal touches to a special night, such as a select menu for two. WELL? \n\nI walked into the restaurant with my boyfriend and was escorted to the back room by the hostess, turned and there was a table, 20 people full, all of my family, friends, my boyfriends family, and a restaurant to cheer them along when they yelled "Surprise" and "Happy Birthday". Pizzeria Bianco had already been taking care of them with antipasti, wine and beer. Once I sat down after the tears of surprise/joy and hugs, the food started to come out, perfectly cooked! This was all done family style too. \n\nTo Start: Antipasti, local greens, Spiedini (wood fire skewers of prosciutto wrapped fontina)\nDinner: Grilled Basil Chicken, Roasted pork shoulder\nPizzas: Wiseguy, Rosa, Margherita  \nSides: Risotto, Vegetarian Lasgna \n\nWe ended with a Cake from Barbs Bakery that Pizzeria Bianco was kind enough to keep in the back and slice after they presented it to me, candles and all. We finished our meal with smooth espressos and cappuccinos. \n\nTHANK YOU Pizzeria Bianco, your restaurant is so well run, quaint, and with some of the best food in town. You threw the best birthday for such a large party and never once skipped a beat. I could of not been surprised with a better birthday dinner location than this.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2015-01-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'a1gsrIC8Wxxy0MHGDElhUw', 'review_id': 'AmrCYf3sE9txYMBn73lO5w', 'text': 'Huge letdown - Pizzeria Bianco is very disappointing, especially for a pizzeria rumored to be the best in America.  The pizza you make yourself at home, from raw ingredients, is probably better than this.  This is just pizza - not more than that, or less than that.  It merely fills a cavity in your stomach but does not add any value to you or your existence.  We found much better places in the NYC area.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 2, 'date': '2015-01-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1pkgcCbTAoZFwbIWy7X6pg', 'review_id': '1S_C2cx6gd_YqUBtGQPVsA', 'text': 'The meal we had last night made my heart sing! We had Sicilian red wine, one of our favorites, by the glass. For starters I ordered the escarole and citrus salad with fennel. It was a perfect blend. My partner had the most exquisite grilled asparagus. They were the first of the season, tender and slightly crispy at the tips with olive oil, lemon and shaved pecorino. Then he ordered the Margherita pizza and I had the bianco with arugula. The food was outstanding and the service was excellent, worth mentioning they clearly care about the food and the customers. Bravo chef, maitre d and servers!', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2015-01-31', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 3, 'cool': 0}, 'user_id': '_nt2NUYsNBKWaHsdwepVIg', 'review_id': '5m-wAL35sJrc2hLQmY7wcw', 'text': "I've heard so many people say that this place is a must go for Arizona! \nWhen I was at another restaurant the guy said that there's people who fly out here just to eat. \n\nI'm a big fan of New York Style pizza and I was hoping for something like that. \n\nThe ambiance was nice vintage like, very cute setting. When I got the menu there's definitely more drinks on it than food. I felt like the Pizza place should of been called Wine and Bite. For someone like me who enjoys trying new food. It's false adverstiment Pizzeria Bianco... geez", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 1, 'date': '2015-02-03', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'KlFeveRTUtwt9UJYW6Y0Wg', 'review_id': 'RBsUU7bN80NXk7js3zJpgw', 'text': "We came back, this would be our last. Our waiter was friendly. The bread was cold, olive oil was bitter and spicy, not to our liking. My beer was not cold as if it sat out for 1/2 hour or so. They don't serve roasted veggies anymore. From the looks of things and prices on the menu it probably didn't have enough profit margin. The pizza was just ok, nothing to hate nothing to write home about. $52 for two pizzas and one beer (tax and tip). The hardest working people here were the waiter and the manager. Dear owner, I am not getting my money's worth at your place, for that reason, I am not coming back.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 1, 'date': '2015-02-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MseJPsz1Zi4VaYtRZyG4ug', 'review_id': 'hSr7IiUL2eTqmfhmiDKoJg', 'text': "Let's start with the pizza, since it is a pizzeria. I had the opportunity to taste several of them from the classic margherita pizza to the wiseguy topped with smoked mozzarella and fennel sausage. I do have to say it was good. The dough is made fresh with fresh ingredients and everything is handcrafted. But what makes the pizza is the wood fire oven which gives it a delicious light charred taste. The appetizers were also very good but the portions are small like the Spiedini but still delicious. Finally we did have dessert and we ordered the lemon curd this was a bit sour for my taste and I would difinintly order something different next time. The service was great and everyone seems to be on point when it comes to knowing the business. Overall great food pleasant atmosphere with inspiring decor. Come check it out when in the area.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2015-02-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ezlREDTMySp-qdVjZBlnEg', 'review_id': 'dryTRlDREqkCc7pfQqMVUw', 'text': "Still has great pizza but the service was horrible this time around.  I'm amazed at how managers can stand and watch problems arise and do nothing about it.  I'll have to think twice about returning.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2015-03-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lAJbCT7cBzZMNgggNIzglg', 'review_id': 'ieQXdh9gs439HSv45oojrQ', 'text': "I'm a fan and if I had this place in NY, I'd be eating carbs like crazy. \n\nVisited Phoenix recently, awesome town BTW! but before I left I had to make sure I went to Pizzeria Bianco. \n\nCouple of friends here in NYC raved and swore I had to go. They all know I'm obsessed with pizza, pasta and all the artistic beauty of Italia. \n\nTook 1 hour to get a table for 2. I literally had two hours to get to the airport and begged them to let me sit at the bar so I can try the pizza. The pizza was amazing! Just like how they do in Italy. Finito.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2015-03-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'szDBHQEOK5PkwgSpreoC6g', 'review_id': 'EqoZ_011PS2YcfA_Y5X7zA', 'text': "The first time my family and I strolled past this place, we assumed it had to be really good. With an hour and a half wait time, many people were willing to stay and wait for a table.\n\nSo, we decided to eat here the next day. It did not disappoint! The service was great and every dish we ordered was delicious. The Sonny Boy was full of flavor. The pasta was amazing. The mozzarella tasted freshly made. The asparagus came with a Sunny Side Up egg on top, which I wouldn't think to do, but the side was very tasty.\n\nI'm not one to wait an hour and a half for a table at a restaurant, but I understand why someone would for this place.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2015-03-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'egbUe2ZJHlFKR-TZ5HOIFg', 'review_id': 'J99FDeI1LICc-D6mon_35A', 'text': "The food is amazing! The owner expects perfection with his pizza and he certainly provides it. \nMy only issue was with the waiter, he was very nice but didn't do much to provide us service. We asked 3 different times for water before we finally asked someone who wasn't our server to bring us some, which they did near instantly. And that's just one example.. All in all, I'd definitely go back!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2015-03-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'amh-JBZUcClnggA2xt2nuQ', 'review_id': 'F83HwkpJ2nosVsle2cN8cQ', 'text': "Food was Very good! Atmosphere was nice and cozy.....Very impressed....and make sure you order the Spiedini, it's Amazing!!!! Definitely will be back!!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2015-03-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'f7Elon84rXu2bj6Q5zqPTQ', 'review_id': 'XITc9zMmSgn0dIrslSk58g', 'text': 'BEST pizza and BEST food we have had in all the years coming from NY to Arizona.\n\nLoved the Town & Country location kitschy atmosphere, great wines, great service, amazing pizzas and the best fresh in house made pastas.........we had the hanger steak w/ sausage and potatoes, and the cavatelli w/ cauliflower, the lemon cappellini, simple and gorgeous.    The feast did not end here.\n\nMesquite cake and nutmeg Italian ice were amazing.............we went for lunch and dinner and I can not recommend this place enough.\n\nOur favorite in the Phoenix area.   Wish Chris Bianco would move back to NY!\n\n:)', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2015-03-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'sVYkb6l9Qttbb6mbejBBPQ', 'review_id': 'yQBaXEa6w9ZzrqjC4YUwiA', 'text': 'I have been waiting a long time to finally try Pizzeria Bianco. This review is for the Town & Country location rather than the downtown location. The restaurant is big and open with indoor and outdoor seating. It has a larger menu than the downtown location, but we were here for the pizza.\n\nWe had the Wiseguy and Rosa pizzas. The pizzas are rather large and have a great thin crust. Both of us agreed that the Rosa had a lot of flavor with the pistachios, cheese, and oil. The Wiseguy was rather bland, even with the sausage and smoked onions. The onions would be great on another pizza though. Both did not have a tomato sauce, but it was not missed. You can save the crusts to sop up all the olive oil remaining on the plate too.\n\nThis place deserves most of the hype, although I would not wait in a long line for it. The other location probably has more atmosphere, but this location is a great way to get the food without the fuss.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2015-03-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'h6DbdlOieRqalIhOF8K_Bg', 'review_id': '2v25xsRQL_gyPq78rEPIJA', 'text': 'I want to cry when I read reviews from other people stating that the pizza here was "amazing" or  was "perfection."\n\nLets start off with the ridiculous pricing. The pizza ought to be perfect for the prices Bianco charges.  $18.00 is what Bianco is charging for his Sonny Boy and Wise Guy pizzas.  Am I paying for the pizza or am I helping to pay Bianco\'s rent?  Interestingly, at his other restaurant Pane Bianco, prices for the pizzas are $2.00 less.\n\nThe Sonny Boy, which has sopressata and olives is what I decided to order after passing on the Wise Guy.  Upon ordering, the waiter informed me that the Wise Guy does not have sauce on it and that I could order a Margherita and get the fennel sausage on it for an additional $5.00 surcharge.\n\nAs I was not going to spend $20.00 for a pizza, I declined.  Upon getting the pizza, it was very tasty but far from perfect.  While I like a crust that has some char on it, this crust seemed not only burnt but very dry.\n\nAdditionally, at lunch time, the menu is incredibly limited which is a turn off.  \n\nDespite these things, the atmosphere was pleasant and waitstaff was great. \n\nAt the end of the day however, I doubt I will be back because I know I can get excellent pizzas at several other places in the valley without paying Bianco\'s exorbitant prices.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2015-03-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0YFXxKsZsfzQLSF737jsqw', 'review_id': 'PimRs49vRed7Kig8XRrDog', 'text': 'Very dissapointing. No real flavor. Crust charred. People were nice and no wait which is a plus. Mushrooms were organic which is also positive. Im quite surprised by the success this place has had. The garlic was not roasted either (just sliced).', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 2, 'date': '2015-03-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'V5E4hIs2eIPda2WvtpiY-w', 'review_id': 'J71wbvSveEfKN5ZKCfUPyg', 'text': 'I hate to give any restaurant a 5 star however the pizza dough is so incredible nothing else matters. People can say things about service and make up things like how they were inconvienened but the fact of the matter is every thing on the menu is awesome, especially the pizza choices. Try weekday nights if you have no patience or move to a small town with blah blah food!\nThis place is just as good as the downtown location. Highly recommended by some who cooks pizza in their own backyard!', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2015-03-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '2JelnbQWLLw8oH0p8dNO_g', 'review_id': 'enaVM_c_hixknfoqx-pmbg', 'text': "Hmm... Let me see if I can break it down.  It is a nice enough atmosphere quite clean and fresh. The customer service is great really attentive, besides a few people who seem just a smidge snooty. The chicken salad we had was very good besides the dressing on the greens bit to heavy on acid makes the face pucker. The rest if the dish was very tasty. We had the sonny boy pizza. It was underwhelming. We appreciate the brick oven however ours was actually burnt and the flavor of burn came through a bit to much on the end of the taste. I had a glass of wine that I like however I could buy the whole bottle for what the glass cost me that's not necessary. Overall we will likely choose other options here in Phoenix we were a little disappointed we did not have the same stellar reviews others have.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2015-04-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'U29PDIZFIwoGMDvI1sOU7g', 'review_id': 'kQiPi87p1b905OVbOfJY6A', 'text': "Nothing wrong with this place but it certainly isn't the best pizza in the country let alone AZ. It was OK at best - we have Antico's and Campanias here in the Atlanta area that are much better!  Crust is supposed to be a little burnt but ours was way over charred. Toppings were also a bit bland.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2015-04-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bvlZOGoPmO5mxedxcnqs5A', 'review_id': '-h6G6liEylttfWx8-C4sLw', 'text': 'Delicious pizza . Almost as good as the original.  The service was good. Biancoverde all the way!!!!', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2015-04-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1FO2vM4LwY_P9RpvKviNsw', 'review_id': 'lQnaaV4vSM6HavUlZPnlMw', 'text': 'Lived up to the James Beard reputation. Creative and delicious food, attentive and professional service, and enjoyed all the fine details making it an enjoyable experience.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2015-04-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '3UDYuIkrdCafFwl8MLxeVw', 'review_id': 'dBZQTaDBSXxpGh9nz8B1dA', 'text': 'A longtime favorite of mine. So great to see him back in Town and Country. And I can now walk there.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2015-05-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'DxELKwncx5pJlr-nJigOHg', 'review_id': 'AKpL7rtiB7ynFrnFDouufQ', 'text': "Abandoned by my wife, I was forced to fend for myself in a new city. So I found this place through an eater article for lunch. \n\nGranted I came during off hours, service was excellent. It's kind of silly but I was sitting outside and the wind swept away my napkin. By the time I picked it up, the waiter had a new napkin for me. Slightly stalker-ish but there weren't a lot of people there so I appreciated the extra attention. \n\nService started with two black olives and a green olive. Since I was a little hesitant about olives at first, the waiter brought out some bread and olive oil as well. \n\nSince it was just me, I went classic and got the Margherita pizza. Pizza was pretty good but not the best that I've had. Thin crust, crispy yet yielding. Wood fired oven gave it a nice cook with a little bit of that char. Sauce was solid, but would have preferred it a touch sweeter and a little more acid. \n\nFinished off the pizza and decided on a whim to get a lemon curd. It was a lot for one person but bursting with lemon flavor. They topped it with a vanilla cream and two soft and crumbly shortbread cookies on the side to counterpunch the sour. Thought it worked well. Recommended for those who like citrus. \n\nBased on the pizza alone I might have rounded down from 3.5 to 3, but the service certainly made it an enjoyable meal. \n\n4/5.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2015-05-10', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'lafEBiRaHwSgAc79VsaEVg', 'review_id': 'Wg7itAu9IxTokMjGuKXtcg', 'text': "After hearing all the great reviews, finally decided to go there last night with a couple of my kids.  I really don't understand why people love this place.  The pizza is just okay. I had the wise guy. The crust is crispy (just how I like it) but nothing else special about the pizza.  My kids had pasta and both were happy.   I would rather go to Grimaldi's, Oreganos, or LGO for pizza.  Also, the bill with tip was about $80 and we drank water.  That is a little steep for pizza and pasta for one adult and 2 kids.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2015-05-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Dbblh8IZau62gNGC4jUoYw', 'review_id': 'wwaRxx3mQ9TTFz76kYdXxw', 'text': "I laugh at these weak reviews. You clearly don't know about true  Napolitano style pizza, or are not seeing or tasting the details and nuances that go into this pie. The doe is perfect with a little bit a stretch to it, the toppings are just right, not too much sauce, not too much cheese. The margherita pizza is the best in the state. Even next to Pomo this is hands down the best. Basil is fresh sauce is boss and the mozz is different but its rich as done right. The Rosa is amazing. Pistachios, rosemary, red onions, and Parmesan reggiano. Service is usually great, and the food is usually consistent. They always take care of us. Chris bianco knows what he's doing. Panne Bianco and the downtown location also do a fantastic job. If you want american pizza go somewhere else, this is gourmet connoisseur pie. And I've been to New York, ate pizza in every borough and grew up with Italians on the east coast, so take my word for it.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2015-05-13', 'type': 'review'}
{'votes': {'funny': 6, 'useful': 5, 'cool': 3}, 'user_id': 'F5NvOP5YeKetvkYo1W4t3A', 'review_id': 'SWqev_hjyrjAcOMXV0nHOg', 'text': "Prior to living in the great state of AZ, my wife and I used to come out to vacation here in Phoenix/Scottsdale.  A little over 4 years ago, during one of our visits, we decided to hit up Pizzeria Bianco down on Adams Ave.  I had waited years to try it out and when I finally got to try it, I was a bit disappointed.  (See review here,   http://www.yelp.com/biz/pizzeria-bianco-phoenix?hrid=bwzEu7e35wv532D4WMB6VA ).  I thought it was too expensive for what we got, plus it wasn't the heavenly pizza/experience that some people described it to be.  Fast forward 4 years, I live here now (AZ), and saw that Bianco has branched out and opened a spot over here on 20th Street.  I had my mind made up since last week that on my day off, I would head down and get a Margherita pizza.  That is exactly what I did today.  Would it be better than last time?  We shall see.........  \n\nI cruised down to the place and found a parking spot in the lot.  I had been down here a few weeks prior in order to go to Whole Foods.  Pizzeria Bianco is located behind Whole Foods and to the left a little bit (if you are looking at Whole Foods from 20th St).  I walked in and was immediately welcomed by a nice young fellow.  He asked if I wanted to sit inside or outside.  It was a nice, breezy day so I decided to sit outside.  They have a cool little patio which also lets you do some people watching if you so choose.  My waitress brought over a glass of water and I placed my order for a Margherita Pizza.  A few minutes later, my pizza was ready.  Here is how it was..........\n\nMargherita Pizza ($15.00)-  This thing looked great!  6 slices of food porn!  The crust had a nice slight char to it, the cheese was melted perfectly, the crushed tomatoes and sauce were vibrant, and there were a couple of leaves of fresh basil  layered on top.  It smelled delicious, too!  Unfortunately, that was the highlight of this pizza...the look of it!  I picked up a slice and noticed that it was incredibly thin.  We are talking paper thin...literally!  I remembered from the first time I went to the OG location, my big beef was that the pizza was too thin.  Hey, I'm all about a thin crust pizza and actually prefer a thinner crust over any other style  This crust was so thin, you could pretty much see through the dough.  If you were ever a prisoner behind huge steel doors, this pizza still may have a chance to slide under the most minuscule opening of light.  I seriously don't know how this dough doesn't just disintegrate when you pick it up!  I tore each slice in half so that I could fold up the thin dough and eat it without having the cheese droop off.  The tomatoes, cheese and basil that they use are delicious!  The outer crust even had a nice chew to it and was my favorite part of the pizza.  That razor thin dough, turned me off though!  I could have EASILY eaten 2 pizzas just because of the thinness.  \n\nOverall, for $15.00, I wanted more. It was a $20.00 pizza after tax and tip.  The taste of the pizza was nice, fresh, and tasty,  but the value was/is horrible.  Not sure if I will be back.  I have 5 other pizza joints in Phoenix that I would frequent before here.  I guess all I can do is try his other spot (Pane Bianco) for pizza one evening.  If it's exactly like this and the Adams ave one, we may have just looked at strike 3 and struck out!  We shall see............", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2015-05-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nrr1hIT_hU098uoFK_b73A', 'review_id': 'nChIfd1kBPyft-_XXVChEg', 'text': "We had such a lovely lunch at this location! We split the special pasta of the day and a pizza and it was the perfect amount of both. I'm so happy my husband works near here so we can go more often! It was delish and quant!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2015-05-15', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 1}, 'user_id': 'hd3BHvFC0FFYj_Qh8d43MA', 'review_id': 'B0krYnjKCLHI95OF9eNFvQ', 'text': 'Ate here years ago. Returned today for a late lunch. Was not busy like their location downtown. Poor service, waiter forgot our drinks not once but twice. The salad is a bunch of dandelion greens with a strong Balsamic dressing. I would recommend the Fresh mozzarella and local tomato salad with olive oil and it was delicious. We ordered the Wisely pizza, no sauce, mozzarella, sausage and roasted onion. flavor was excellent but the crust was very chewy. I think the Parlor across the street is so much better.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 2, 'date': '2015-05-15', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 7, 'cool': 4}, 'user_id': 'EsGJlE3aKNAByq1GfXYmMg', 'review_id': 'ka-EuBBjhIHjc7BsIXojTw', 'text': 'pizza that gives NYC a run for it\'s money! now that i\'m moving from NYC back to LA i\'d have to say pizzeria bianco is the closest pizza that compares to my NYC loves\n\nyou can order pizzas HALF/HALF which i wish i knew when i ordered\n---lambrusco: perfect pairing to the pizza\n---complimentary italian bread: baked so well & they give you quality EVOO to dip\n---SONNY BOY: MUST TRY, so good ... i want another right now\n---wise guy: a "white" pizza that was good too but i prefer my pizzas with tasty tomatoe sauce \n---gnocchi too sweet & the pastas we ordered weren\'t cooked al dente so i\'d stick to the pizzas\n\nNOTE: you need 6 or more ppl to make an RSVP', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2015-05-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'khUJYVou2qqm3Tk-25__7g', 'review_id': 'TnyWcnWbO6yRbzdWExmbgQ', 'text': "Ok.  I'm 4.5* for the last visit only because the beef shoulder was a little dry.  Pizza amazing.  Pasta fabulouso.  Tagliatelle with bolognese.  Delish.  Will return soon.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2015-06-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0rOIvxlURdppFMU9u5Ep5w', 'review_id': 'Xdbrkd7OwHq7th_YsA9eJg', 'text': 'We have to set the record straight about what\'s original. Chris Bianco had his first wood fired oven in Town and Country on 20th st and Camelback. He was young and passionate and his pizza was sublime. I never really understood his move downtown but it worked out for him, at least in the fame department. We found it too difficult to be loyal followers at the Adams location with the long waits and lousy parking. The pizza was excellent, but the hype about it being "the best" was a distraction, and like all such titles is debatable and temporary.\nThe operation has expanded to 2 eateries and returned to almost the same spot in Town and Country and   we think it\'s darned good. The service is attentive and the menu is appealing. We prefer it for a late lunch outside, but that might just be an age factor. I miss the good old days listening to Chris extoll the virtues of fresh mozz to my culinary son,but today\'s version is still solid fare', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2015-06-09', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 1}, 'user_id': 'm1AHP80IkjNIZYPuJnGVFg', 'review_id': 'zM28DQQ8zElGGSRMhGhX7Q', 'text': "Last night I took my family that was visiting from out of state to my favorite pizza spot.  Sadly, it was the first time that I had an experience that I would rate less than 4.5 stars. \nOCD Version:\nFood: 3 stars\nService: 1 star\n\nService: We had a reservation for our party of 8 and I was surprised to find that they were barely half full at this time.  Previous experiences at this location had at least a small wait during peak times.  We were seated promptly.  We placed our drink orders but I was disappointed that there was really nothing sweet to drink other than water for my seven year old who doesn't drink soda or caffeinated products.  It would be nice if they had juice or lemonade.  I stepped away from the table and when I returned, the drinks had come- but not mine.  The server did not return for another ten or so minutes and when I informed him I did not get my iced tea, he seemed to think I hadn't ordered anything.\nWe placed our orders for three small plates, four pizzas and one pasta dish.The three appetizers came out at the same time and were all fine.  It took about 20 minutes more for the first two pizzas to arrive and the remaining two took another ten minutes.  The pasta dish was a no show but we didn't get a visit from our server for quite a while because he was speaking to a table in the corner for over ten minutes.  I flagged down another server to inquire about the missing pasta dish.  He intercepted our server who proceeded to RUN over to the POS system and feverishly pound something into it.  He returned to our table with a comment about that he's not sure why the pasta hasn't come out but he will go check on it.  Ten minutes later, the pasta arrived.  He continued to spend time at that other table the rest of the evening, never checking on how our food was.  Overall, the service was a display of willful neglect and the resulting unintended errors.  When it came time to pay, the check sat on our table for another ten minutes while he visited with the table in the corner and with the little ones we had in tow we wanted to get out of there.  I had to take the bill and credit card to the front of the house to have someone run the card.\n\nFood that I sampled:\nSPIEDINI: tasty, albeit quite greasy.  I think that is hard to avoid given the ingredients.\n\nMARINARA PIZZA: this was good but somehow not as tasty as it was in the past.  The sacue was good but the other ingredients were flat.\n\nROSA PIZZA: Typically my favorite pizza here.  Tonight, the flavor seemed off and all the pistacios were localized to one spot on the pie near the center.\nSPAGHETTI BIANCO DINAPOLI POMODORO.BASIL.PARMIGIANO REGGIANO: this was delicious as always.  A simple, yet wonderful dish.\n\nAll this was so disappointing after talking this place up to my family and sad that this service experience happened while Chris Bianco was in the house.  I am torn as to whether I will give what was my favorite restaurant in town another try anytime soon.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 2, 'date': '2015-06-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'N9X3e1m_jj0x0f4JOxHLJA', 'review_id': '113FUGYC97RvHMp6ZxHH_Q', 'text': "We've been to a lot of great Italian restaurants in Boston, New York, AND Italy. And Bianco's is the closest thing to real Italian food we've experienced in Italy. We gladly travel the 17 miles from Fountain Hills to Bianco's about once every two weeks to get our Italian fix. And his pizza is as good as what we had in Rome and Sorrento. No other pizza in the US comes close to the real thing. I don't know how you do it Chris but just keep doing what you do! If you've never been there, you don't know what you're missing.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2015-06-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'UwzkhcbR0ZbSYEq1-OYgzA', 'review_id': 'yU-0cy1-NSHhBiN_3GYVgw', 'text': 'The food is just as good as always.... the service was terrible.  \n\nWe told our waiter when we got there that we had a bit of a time crunch because one person in our group was going to the airport to catch a flight after dinner (the flight was scheduled to leave 3 hours after we sat down at our table.)  After waiting for about 30 minutes, our waiter finally brought us our drinks.  We spoke to several waiters about our time crunch and asked to order immediately, and our waiter basically repeatedly ignored us and kept saying "he would be right back."  15 minutes later we flagged down a different waiter, who also wouldn\'t take our order and said he would grab our waiter again.  We finally placed our order close to an hour after we initially asked to place our order, and our group was incredibly annoyed by the complacency of the waiters.   There were other issues with how the little the wait staff cared about taking care of us but not worth the time to list everything, although the bartender was good and I do like that this location offers alcohol.\n\nThere are a lot of rumors around town about how poorly managed the Bianco restaurants are, but this was some of the worst service I\'ve ever had in a restaurant.  I\'m definitely not going to return to this location for a long time, and only when I have nothing to do afterwards.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2015-06-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'XGsmsVLvfsn2U-3JJxUsSA', 'review_id': 'alkjYCl0vr7YgO17bo1-mg', 'text': 'Came here on a tip from a local that I was visiting and I was not disappointed. This has to be the most professional pizza place I have ever been to. This place had valet parking for one which I was not used to for pizza but then realized that it was valid for the entire street of venues. The pizza was made in a brick oven which gave it that perfect crispiness that I always look for when eating pizza. I ordered a pie that came with onions, sausage and cheese.. no marinara. Next time I will get a pizza with Marinara because the one I tried was a little dry for me.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2015-06-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'FRUrykQ7sVT6DUSJ8E_J1Q', 'review_id': 'DughIJ5UngrdsR7ZSRkY3A', 'text': 'First and last time here. Waited about an hour while we had drinks at Grassroots (which was a really nice place with a good menu...should have ordered there!)\n\nBianca had a very sparse menu, but with all the hype we thought we would give it a try. Big mistake. I was surprised that the inside looked a little dingy. And, very loud. \n\nWanted an appetizer like calamari but was told they had no seafood products.  The waiter was very busy but did a good job checking on us and running around. I really was hoping for a good pizza and ordered the margarita pizza with fennel sausage and a beer. My wife ordered Pappardelle an a glass of wine. \n\nThe waiter brought us bread and a saucer of what was supposed to be melted butter?  Someone must have taken all the flavor from it before it got to us. $7 Beer was tasty though. $14 glass of wine was good too. \n\nThe Pappardelle (about two cups of overly done mushy noodles and a meat sauce) was well under par for an $18 entree dish. No salad. \n\nPizza... I was expecting 12" of something special for $20. Looked like the cook was blindfolded when he made it or maybe shook it around before serving it.  If you like super thin cracker crust with very little on it, then this is for you. \n\nSo, we ate very little and stopped back at Grassroots.  Took the Bianca leftovers to my mother in law ;  )', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 1, 'date': '2015-07-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'GoDF1coPlZwDGd449a_XdQ', 'review_id': 'xymgKY2DfiieWwKm8k80Rw', 'text': u'Had the pleasure of dinning at Bianco for 10 plus years.  Long ago, it was "just" a solid pizza option for me, nothing more.  Over the last 10 years my palate went to grad school.  I dinned at The French Laundry for the first time 9 years ago and realized there existed a world of food out there about which I knew nothing.  Prep, plating but most off all the subtlety of flavor combinations.  From TFL my journey became more focused: per se, Daniel, Eleven Madison Park, Saison, Urasawa, Melisse, Providence, Orsa and Winston.  All of these places help one master the subtle delineations of flavor and texture.  Wine was a similar journey.  Gone are the days of oaky Cali Chardonnay and only giant alcohol bomb cabs.  I now appreciate the subtle differences of Burgundian appellations from Chablis to Beaujolais.  My food fellowship has  taught me to appreciate what Chris is attempting all the more. Source the best possible ingredients. Create subtle flavor and texture differences. Throw in a solid wine list sprinkled with a little white Burgundy and pink Provence. All of this to create something that is most certainly not for everyone. Not for every night. Not for every budget.  I\'ve watched my favorite morph from a Sonny Boy and a Giant Nebbiolo to The Wise Guy and a Domaine Tempier Bandol Ros\xe9.  My advice:  Don\'t recommend Bianco to your friends. Don\'t tell them it\'s "the best pizza" ever.  Just leave it for the rest of us who get it.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2015-07-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'A2xjchI_eZ5E0EB5UeUKYA', 'review_id': 'xIvFVK0UDaQo1cy0Zd4LBg', 'text': "I really dig this place. I work nearby and have been for lunch on a few occasions- all really great experiences. I always get the pizza but my friend ordered the pah-sta (It's how my English friends says pasta. It's adorable.) and she said that was really great, too.  Also, I've only ever had nice babe waiters so the service has always been solid.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2015-07-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wuS9i8P1gv9W5_fEQn6wDQ', 'review_id': 'mci4p0KYU2LnRkK8iHgUKQ', 'text': 'I\'ll admit it. I can be quite the "pizza-holic" at times. And it just so happened that I was trying quite a few pies during my Phoenix trip last week. Fortunately, I was able to cap it all off with a pilgrimage to one of the greatest pizzerias in America: Pizzeria Bianco.\n\nOf course, we had to wait a while for a table. But when we\'re talking about pizzas coming directly from the brick oven and made with fresh quality ingredients, the wait is worth it!\n\nOur party tried the Biancoverde, Margherita, Rosa, & Wiseguy Pizzas along with the Tomato & Mozzarella Antipasti Plate. And my goodness, the mozzarella was super creamy! And my goodness, the pizzas! The Rosa blew me away, and I\'m not a big onion person. The Margherita definitely met my standards for that classic zesty goodness. And the Biancoverde was a pleasant surprise with a nice, spicy kick from the fresh arugula.\n\nI didn\'t try the Wiseguy, but the carnivores in our party were somewhat underwhelmed by the fennel sausage. Other than that, no one was really disappointed by Bianco. Oh, and I very much enjoyed my Prosecco cocktail!\n\nAll in all, I was quite pleased with what I found and what I tasted at the original Pizzeria Bianco. And I now know why this seemingly humble spot tucked away in a strip mall was won so many culinary awards. It\'s definitely a "must eat" in PHX!', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2015-07-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'nbxsXJHWdrT11WfvV00Z6g', 'review_id': 'OleL7Distp9hXCIwWFthgQ', 'text': 'Its OK. It is not great by any stretch of the imagination, I cannot help but think HUH? when I heard it was rated 5th best in the country. By who? LOL  It is NOT even in the top 300. How can anyone who knows think otherwise?', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2015-07-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nXp_Xhpr3z30aSayztzQmw', 'review_id': 'xPc0Ru-rFhmVxSLu0IRtGQ', 'text': "The Rosa pizza was amazing!  The margarita didn't wow as much.  The salad was completely over salted and I had to send back.  New one came back much better but still on salty side.  Second visit:  homemade pasta with meat sauce.  Nice presentation and very fresh pasta, but the intensity of flavor was lacking.   Salad was much better today!   I think I had a better impression of the original place on Heritage Square when we went about 10 years ago.  But, not bad at all.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2015-08-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'pdenwBx4OjGUCg6MF5sdSw', 'review_id': '1SOi2uWj1okJEUQk-upvNg', 'text': "The location wasn't the easiest to find. The restaurant had a unique atmosphere to it. The food was great and the service was fast. Prices were what you would expect from an upscale pizzeria. Don't go in expecting your typical pizza choices. I'd definitely recommend the Biancoverde pizza.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 4, 'date': '2015-08-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kMyd_ai0L_YGHVrzN3agaQ', 'review_id': '8DxLywqiVDUeBiBxa7eS9w', 'text': 'Loved this place. Got the wise guy, marguerita, and sonny boy with the melon prosciutto salad. All of it was amazing. The sonny boy was my favorite with Italian olives and prosciutto. The scenery was cool right by the science center and our server was very friendly.', 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2015-08-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'TGXj89l5JxLCrKCsDLJlsA', 'review_id': 'k1iwuyvDLn8SYXIUTdfr1w', 'text': "8/8, 5pm.\n\nThe service was about average & the margherita pizza was average.  The prices were a little expensive.  I could see this being a better visit if I had brought a date to this place, as this place seems to cater to couples & groups better than the random single traveler.  The visit wasn't bad, but it could have been better.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 3, 'date': '2015-08-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'b55NYJJavY4rXXx8V3HaFQ', 'review_id': 'CrB6RWHgSpANa_v_t0zbMQ', 'text': "The food here is outstanding.  I reiterate my previous 5 star rating from last year.  We waited 5 minutes for a table and had our food within 10 minutes of ordering.  The pizza is spectacular and the pasta doesn't disappoint.  I think they could do better with the dessert menu but overall it's fantastic.", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2015-08-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'j2hPlZTkbkRr_2b2zDqVOg', 'review_id': '_blGhB-PTCQnIGkCZcEbEQ', 'text': "OMG best pizza ever.  The sauce makes this pizza!!!   It is the best sauce I've ever tasted.  All home made from the freshest of products.  To add to this wonderful experience was the special salad - arugula, pears, gorgonzola and apple cider vinaigrette.  So wonderful and I am not a big salad person!  We three pizzas and all were wonderful.   I highly recommend!!!", 'business_id': 'BPi1Q5wX0_o5VlO_XRyYuQ', 'stars': 5, 'date': '2015-08-26', 'type': 'review'}
