{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'jcns4g1Gp2TwqtDS4ef23g', 'review_id': 'wqEUKE0oP4G3-OCzyZAPtw', 'text': "Along with the new pool, the new gaming floor, the updated rooms at the Golden Nugget, there has also been a major revamp of the eateries here. \nThe Grotto is a decent, physically darker version of Olive Garden-type resto partially open to the casino floor.  The waitstaff was friendly and swift, but they did seem rushed as there always seemed to be a wait to get a table.  \nThe bread served before the meal is soft and doughy; comes with a chili-garlic olive oil for dipping.\nThe bruschetta was awesome - long buttery, crusty oblongs of bread lightly drizzled with balsamic, topped with a fresh garlicky tomato tapenade. The bf and I gobbled that shit up quick.\nI ordered the rigatoni with meat sauce, very good with that comforting feel, and the bf had the chicken canneloni which he apparently loved (none left) and I thought was ok (one bite).\nPrices weren't dirt cheap but so much less than eating at a comparable hotel eatery on the strip.\nOne day, Mario's, but on this day, Grotto fit the bill just fine.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2008-03-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-Dof9NwAoQwRM-GVPZk5zw', 'review_id': 'VaqdWQehKO7VgIUcxB4pcQ', 'text': "I love Italian and this is great Italian.\n\nEverything from the water to the desserts was fantastic.  The water comes with a plate of lemon wedges and mint leaves.  How great is that?  I know its just water, but it really made it taste great.  Surprisingly, it didn't even taste like desert tap water to begin with.  The bread is tasty and comes with a garlicky, spicy olive oil.  Yum!\n\nI had a creamy pasta with regular and spinach noodles, prosciutto, peas, and lots of parmesan.  My sig other had meatballs with marinara and a caesar salad.  Those meatballs were somethin' else.  Crispy on the outside and delicious on the inside.  A great meal.\n\nThe best part of all was the desserts.  They brought out a tower on wheels that puts the term dessert cart to sham.  An unbelievable good looking chocolate cake, Italian wedding cake, four flavors of gelato, tiramisu,  spectacular strawberry cheesecake, and a few others.  I went with the pistachio gelato and I'm glad I did.  It was so delicious and a perfect pick for this gelato lover.  They even make it right there in the restaurant.\n\nThere is a row of tables on the outside with a view of the fish tank/exhibit.  Make sure to get a reservation if you want one of those tables.   I would have if I had known.  I also saw them hand making the pizzas.  Nice touch.  The service was very good.  Ciao!", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2008-04-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UrtbOQWrRlIyxvT_vAKG5w', 'review_id': 'aQB2FdjnvpTi6nNJOKF50g', 'text': "Thanks to past influences by the likes of Wynn and other corporate big shots, the Golden Nugget is truly the shining yellow star of the underrated downtown Las Vegas scene, and the Grotto Italian restaurant is an example of why the Nugget stands out, be it a little overpriced.\n\nLocation is nicely tucked next to the casino without the distraction, and next to the beautiful new pool and fish/shark tank area, and we lucked out by getting a table with a tank view.\n\nAnother plus were that they were very accommodating to my kids. You don't often get a kids menu and crayons at a place like this, and my five-year-old could stop watching the sharks. \n\nI had been told the veal dishes here were the highlight, and my veal dish didn't disappoint. Nice sauce, just the right tenderness and tasty. But it didn't quite taste like a $28 dish to me.\n\nDecent wine selection, and the apricot iced tea needed no Splenda.\n\nDesert (chocolate cake) we all share was good, though nothing special. Had about as good at several of the local cheap buffets.\n\nOverall, might have been closer to three 1/2 stars if the option was available. Food was very good, but not worthy of a five-diamond mention and you lose a star for being overpriced.\n\nBest eats downtown remains the Main Street Station buffet, and you can get that for less than half the cost of Grotto's veal.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2008-04-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MZjTLZ0S-sbiapAnvXh0HA', 'review_id': 'Hc5l5Mpip5igFsO45X-L8A', 'text': 'Surprisingly good. I had my doubts since it seemed overpriced from a glance at the menu, but it was quite good. I had their chicken francese, which is nothing like the typical francese sauce one might expect (creamy, with artichoke hearts and mushrooms). My boyfriend had the lasagna and enjoyed that as well. The atmosphere is very nice and the service is fairly good. They are especially attentive with the water for some reason! We could see parts of the fish tank outside from where we sat in the back...a nice view. Overall, a great experience. Expect to pay $15-$25 for your entree, however.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2008-07-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '9khCXCLz36OhZimZFlxVyg', 'review_id': '_s0YR_IEu7ksmbbBU78ong', 'text': 'I was quite surprised at how good this place is.    I had the lobster bisque which was one of the best I have ever had.   Our friends had the wedding soup, which they raved about and went back the next day to have again.   I tried their pizza, which was not the best brick oven I have had but very good nonetheless.    Our friends had the Pasta Diavolo and some other fettucine and were both very happy.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2008-07-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'y1kai4WcCUHXx-tcGXNEFg', 'review_id': 'QMC92bKWC52eY9PGarQ4mA', 'text': "I was simply stunned at how delicious and seemingly authentic the food was here. I hope the next time I dine here the food stays consistent, the chef who was working the nights I've went is GOOD! I grew up eating my way through North Beach w/my Grandmum, so we are a bit snobbish and jaded when it comes to our Italian food. I was surpirsed to find something this good in Downtown Las Vegas. I love sitting in the extended dining room area so I can check out the pool!   ;)", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2008-10-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'b5xaOubwyrdcE23NOOQuQw', 'review_id': 'A-r260QmALrT8tgomV1-kw', 'text': "Dammit, the restaurant is good!  I've had excellent pizzas and pastas there every time I've stayed at the Nug.  But even better is to hang at the bar, and enjoy the Grotto while you get all blotto.  \n\nFull menu is available at the bar, the staff is funny as hell, and occasional wine refills are included.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2008-11-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GZTl2jYpBV5nFnjeoksyCw', 'review_id': 'HWQh3uAEjS1imiZNLL5B2w', 'text': "Just so you're not shocked ... this restaurant has the typical casino restaurant lay out, in that it is amongst the casino/lobby area. So while you dine you are just a half wall from people walking around the casino and you look directly into the spectacular pool/aquarium area. \n\nI wanted to say that because after reading these reviews and going to their website, I thought it would be more of a traditional restaurant with it's own space ... but either way, the food was great and I highly recommend it! \n\nDelicious Food - try the cannelloni! \nCasual/ Fun atmosphere \nGreat people/ aquarium watching \nReasonable prices", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2009-04-07', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 2}, 'user_id': 'Khyjmmg6R0MTgt0OiOShvA', 'review_id': '1cOi7sAb_PE81b-ut2W65w', 'text': 'i swear they have a lil old gramma in the basement ball and chained to the wall making the meatballs. they were awesome.\n\nwe say by the pool at night and watched the fish go round and round. it was nice.\n\nthe food A ++ \nthe service.\nwell it sucked. hardcore. some of the worse i have ever had. we really wanted a sweet treat after dinner to celebrate our winnings...after waiting 45 mins for the waitress to come back..wine glasses empty..etc..\nwe said screw it. paid and left.\n\nbut man the meatballs. \nyumm.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2009-04-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qWKSjoXIbjbqn2SWv6F9nw', 'review_id': '6ccHA-u7QJ5_dW1DZdx9xQ', 'text': 'The second time we have dined here.....and each time the service was superior and the food outstanding! The veal was very good, the Chianti recommendation was on target, and for being in the middle of a casino...the atmosphere is great!', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2009-06-28', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': '-7D9gqIP72pXCrdRWEsfCw', 'review_id': 'KCFjwMuuJaVPG1NZ4OUUJA', 'text': "Who knew gin and tonics and mussels are so good together! We highly recommend getting that when you go here. \n\nWe didn't have much else so I can't comment too much on the place. \n\nWe had set our stuff down at a table and never saw a waiter so we assumed we had to order at the bar. I left my purse on a chair and went two steps away to the bar and magically a waitress appeared straightening chairs. Well..she joked that my purse was at one of her tables, but I got the distinct vibe I should move my bag. So...we sat at the bar and had a great time. The bartender was super friendly, I think his name was Michael.\n\nPoop on you angry waitress lady! \n\nPoop on you.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2009-06-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TfCB91gno3ju-6sqZPYjmQ', 'review_id': 'ug0-_xpbzPaS860CNnH8WQ', 'text': "Some of the best calamari I've had!  The remainder of the menu is limited and average.  Service is average.  Wine list and server wine knowledge is average.  If you're in the Nugget you'll get much more bang out of Vic & Anthony's!!  Maybe stop into The Grotto to watch the pool crowd, have an calamari app, and glass of wine before dinner at Vic & Anthony's; that would be a perfect evening!", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2009-09-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 4, 'cool': 1}, 'user_id': 'YgNrdpNP9DG9Kbj2fLQNNg', 'review_id': 'ui59oc8Is1ljKggQKNPXAA', 'text': "Staying at the Nugget, so this was a choice of convenience.  Ordered Sea Bass as a recommendation by the waiter.  It was smothered in a dark mushroomy sauce, that seemed to be more suited for a steak....not a white fish.  Didn't like it.  Husband ordered eggplant parmaesan and it was good.  My friend ordered a saffron risotto, and I made her send it back as it tasted like an old dish rag.  They made a big fuss about our complaint and two different people came over to the table to discuss why we didn't like the risotto.  They insulted us by insinuating that we didn't know that saffron has a different taste, whatever......it was still bad. When we received the bill it was taken off, all $4.99 of it. You would have thought it was a big ticket item the way the restaurant was reacting to our complaint. \n        We did enjoy the beer that was micro brewed there, I believe it was called Sin City. \n        After gazing around the room, I think the hot item in the restaurant was pizza, ah hindsight.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2009-11-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'iG4whwdLBarPu3dD5OKCvA', 'review_id': 'y1CBmczaers0HuhrVpi1wQ', 'text': 'Ordered a pizza for carryout for lunch...12" pepperoni....very thin crust....lukewarm at best...paid only $8 after $5 off coupon from hotel book....not again because for one I won\'t be staying at hotel where it\'s at (more on that on another post)', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 2, 'date': '2010-01-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'kCsawkVOGajlhL9Ct-_rrA', 'review_id': 'OKrtvybAyrwtaEC5VpszUA', 'text': u'With faux-Tuscan arches accented by whimsical Italian maxims (Due Piedi Non Possono Stare In Una Scarpa--"Two Feet Can\'t Fit In One Shoe") and fanciful chandeliers, The casino-side Grotto doesn\'t promise anything remarkable. So it\'s all the more impressive to discover it offers many common dishes uncommonly well done. \n\nWe got off to a good start with soft Italian bread with garlicked olive oil...Calimari Toto promises that you\'re getting all the octopus--authentically Italian--fresh but flavorful pieces of the tentacles and head, in a light egg batter that makes it hard to stop eating... meatballs come two near-baseballs to an order, a thin crust protecting the piping hot, almost pate-soft inside (which they claim is all flavorful beef chuck, though you\'ll suspect more tender veal). The Italian Chopped salad balances proscuitto, bacon, egg, with Gorgonzola and provolone cheeses with iceberg lettuce so deftly that the thin-sliced grilled chicken breast on top seems unncessary. \n\nChicken and seafood are clearly the strengths here (though they also make their own fresh pastas)...particularly the Roasted Herb chicken, a half-bird rotisseried with rosemary over white oak and nothing less than tender, savory perfection. \n\nBut the pizzas deserve equal attention, especially considering how few and far between are good pies found in the city. Grotto\'s hand-tossed rustic rounds, cooked in a wood burning stove in the middle of the dining room, taste just like you\'d expect from a street caf\xe9 in Napoli...but maybe a bit better. Our margherita, hitting the table in a cloud of aroma, didn\'t have a chance of survival. \n\nThe garlicky sweet marinara sauce that accompanies many dishes is the kind of recipe you could easily crave, fresh, simple yet deceptively complete. \n\nA small wine list offers a baker\'s dozen reds and ten whites by the glass, including their own robust chianti-esque Rock N Roll blend, totally acceptable.\n\nBeware that huge dessert cart--it will call you, with the signature featherlight wedding cake, dense and deadly chocolate mezza notte, respectable tiramisu, and certainly not least of all, a solid New York cheesecake with strawberry cream, impressively authentic.\n\nLunch diners get a voyeuristic view of action at The Tank pool deck, and a limited selection of their most popular items, augmented by some creative panini, and an old school "Nugget" salad.\n\nI think they have good deals on the pizzas during happy hour.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2010-01-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 4, 'cool': 2}, 'user_id': 'AirVzN1BVQBmq5zY0YMNYQ', 'review_id': 'tbq8KVOafWTb8P80EojmuQ', 'text': "While staying at the Golden Nugget and consuming all of the gluttonous food and beverage that Fremont Street has to offer, my friend and I decided we needed a nice big salad for lunch.  The restaurant is right next to the beautiful pool and the awesome shark tank & water slide.  We were lucky enough to sit by the window and it felt like we were sitting on a patio on a perfect sunny day (which it was, but we were inside).\n\nI decided on the Italian chopped salad and was very happy.  The salad was great and I couldn't believe I ate the entire mound of chopped delicious ingredients.  I did get the dressing on the side, so I'm not sure how much they would usually put on the salad. \n\nWe brought the boys back for the end of happy hour so we could check out the pizzas on special for $6 (happy hour is from 2-6). They were a great size for the price, thin crackery crust, and delicious toppings.  The drink prices were not great on happy hour, but I've learned that is pretty consistent for The Golden Nugget.  Then again, it would make sense seeing as how it is a step up from the rest of the hotels on Fremont. \n\nThe server for lunch was very nice, however the bartenders for happy hour seemed a little less than happy. I know it can get crazy in a small bar area with everyone wanting to order, but when your working for tips a small smile every now an again won't hurt. I promise your face won't crack!\n\nOverall, I'm a fan of Grotto and will go back for delicious food anytime I'm on Fremont.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2010-03-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'N0BW2CplbUwo8_3gGb-GrA', 'review_id': 'JXV_FEjn21i56tuXM0mUAw', 'text': 'Had dinner here with a group of 5.  I had the lobster bisque and it was the best one I had on the trip.\n\nThe cobb salad was very good.\n\nService was excellent.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2010-04-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'q6EYtVwBrMzS_8Qhfr81oQ', 'review_id': 'q5VdkQgEXqgXk3-3dtEjeQ', 'text': 'Our food came out cold.  I have a strict policy of not sending food back so ate cold lasagne.  Was still tasty.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2010-04-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'edPP8Ybe4gq9vxwhI7GEcQ', 'review_id': 'ihYYkm78UDUFmTAfNrSkaA', 'text': 'Was fairly empty... Hostess sat us next to the kitchen anyway... Waiter was preoccupied with conversations with what seemed to be the manager... Forgot to put our order in... Food was really late, with no apology...  The food was ok... Pizza is the best thing we ordered... Our bill was $120 for 4 people with a bottle of wine... Not bad but the service and vibe was really bad.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 2, 'date': '2010-08-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QLW0cyw4zeY_6O4PUXTKDQ', 'review_id': 'T-wA3w9qt-2MWlnC5lrYJA', 'text': "Had dinner recently here and the food did not disappoint. Various members of our group had seafood pasta, eggplant parmigiana, and, of course pizza, and everyone enjoyed their meals. I absolutely love their pizza, just the right thickness (actually, thin-ness), crispy, with freshly made sauce and chunks of tomato. I had the prosciutto with pine nuts, and even polished off some of the margherita that my kids didn't finish .... it's that good. Decent selection of wine too.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2010-09-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SF5He8lgBNTzFuCCosuq7w', 'review_id': 'owhEMi0x6KTgBRCA8aqHDw', 'text': 'The pizza was very good. The salad need more to it.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2010-09-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4Z9CUoBGvER2m1mh9cPwOA', 'review_id': 'I4bZcmAOhKqwtm9FjtNxRw', 'text': "First of all, props to the staff. Even though it was a busy weekend evening, we still got fast, attentive, and friendly service. Secondly, the food tasted sooo good. Their lobster bisque is by far the best I've ever had. The mussels were super tasty as well. Other dishes we tried were the spaghetti bolognese, chicken marsala and ravioli, all scrumptious. The decor made for good conversation as well,  and by decor I mean the murals featuring European characters performing public sex acts while enjoying their meals. haha. Good times at the Grotto.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2010-09-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LIdBsu7nspO56DdYYI5TTA', 'review_id': 'CG70O7rnBqp_io-3SHMuEg', 'text': "Kinda odd place to dine since I'm a local here with no habit of gambling, and I have no business coming to LV down town... but wow, I have to say, this is the place you can come to get the great lunch/dinner for affordable price! I had a bowl of tomato soup and I splitted goat cheese chicken pizza. Bill was no more than $25 I believe... and I felt like I was at spago! Soup was simple and perfect, not too acidic and basil played nice side kick to it. Pizza had so much flavor, I rubbed my tongue many times just to taste everything in my mouth. Very satisfying. My friend ordered a plate of lasagne and it was also out of this world too. Great ambience, not too crowded, and it stays open at weird time (like 3pm where everywhere else closes down). Highly recommended!!", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2010-10-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Jrx1fLr5JdqgHdIfMT7wag', 'review_id': 'cw2Q484hoCHekPGHEjKQCg', 'text': "Horrible! Gave it two chances and the first night it took over an hour to get our food and they ran out of entrees. Both nights the food was just average. I could have gotten better quality at The Olive Garden and for less money. I'll stick to the buffet next time.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 1, 'date': '2010-10-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'gah2pORPRg1negALVDeMOw', 'review_id': 'fLyfbaPc4kcOv9XPFF0fsQ', 'text': "We went here accidentally because we didn't know where to eat since we tried to go to Lillie's Asian Cuisine but it was closed for lunch and we went to go to Market Street Cafe to try their famous oxtail soup but the oxtail soup was not available until 11 pm. So we decided to go to Grotto, boy we were glad we came here. \nWe ordered: \n- fried calamari comes with their yummiest tomato sauce (i never like tomato sauce but this one is so delicious i ate it clean), the calamari was dry not oily like other restaurant.. very good.\n- lobster bisque ... very good. the best lobster bisque beside the one i tried at the four seasons hotel san francisco. They gave a good chunk of lobster meat.. so delicious. Just don't order it to go because i liked it so much i ordered it to go and they didn't give the lobster meat at all.. so disappointed.\n- chicken alfredo linguine.. good, the white chicken meat is good but it is not grilled like what i expected, i think it was sliced roasted chicken but the overall is good because it is not greasy not too much butter and i didn't feel bloated after that.\n\nTheir bread was good, served warm and so yummy, one of the best bread but you have to ask because they won't give out the bread unless you ask for it.\n\nThe only thing that was off: the food took a while to get out, we had to wait for each of the food to get out and the restaurant was not even crowded.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2010-12-24', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 3}, 'user_id': 'HpjppzvCJpYHzPVtjevACA', 'review_id': 'NNX0NK4cWj8EzaatrHwurg', 'text': "Top notch service, good food, and beautiful atmosphere make this place a WIN at the Golden Nugget! \n\nWent here for a 'romantic' dinner during happy hour on a Tuesday. The bar tender was the best server we had on the whole trip. He recommended we sit in the bar to take advantage of half price pizzas and $2 off drinks! Thanks, man! It was a completely affordable delicious meal. Their pizzas are wood fired with top shelf ingredients. We also ordered the meatballs, which were garlicky and good, plus the ravioli alla vodka, which tasted fresh and well balanced. Overall, the service put it over the top and we were very happy we happened into the Grotto. \n\nWhen our party of 11 decided to go downtown for Christmas Day, my boyfriend and I suggested Grotto to the family for Christmas dinner. We were glad we did! Everyone was impressed! The service was amazing, again and the food was well prepared. Everything was on point. The appetizers were priced at $8-$15. Bruschetta was excellent. Fried ravioli was a touch overdone. My favorite dish I tried was the chicken francais. I ordered the chicken marsala accompanied by fresh fettuccine Alfredo, which was good, but not the best I've had. The ciabatta bread was soft and hot and the dipping oil was really well flavored. Desserts looked amazing, but I was stuffed. The favorite of the table was a ricotta cream and strawberry bombe, which was beautiful. \n\nThis was by far the best family meal we had in Vegas and I would recommend Grotto to anyone looking for perfect service and good Italian food!", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2010-12-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VqEY5lGKKF1SOgXy4pxAEA', 'review_id': 'XSzqhYJyWUc_VKF9Cdq8wg', 'text': "Food: 4.5/5\nDecor: 4.5/5\nPrice: 3.5/5\nService: 5/5\nOverall: 4/5\n\nGrotto must be the best restaurant at the Golden Nugget Casino & Hotel. I had the Paglia E Fieno with chicken which was phenomenal. The service was great because my friends mom and grandma had to go to the airport at 7:30, so she asked if they can get our orders out quickly and they did. I wish I still had room for desert because the desert cart looked amazing. I highly recommend Grotto over Carson Cafe at the Golden Nugget any time. I would most definitely return when I'm around Downtown Las Vegas.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2010-12-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'TWs1G1PxdWR_ms0hFL8MYQ', 'review_id': 'UUOiAgvMP7cL2nXcG22Qtg', 'text': u'We went because of the many reviews and it was near the hotel where our friends were staying. Pleasantly surprised by the pretty interior and our table had a wonderful view of the pool & shark tank. \n\nNone of us had starters but a basket of bread was brought to the table along with some olive oil. NOTHING special about the bread-it could have came from Smith\'s or Albertson\'s... \n\nI had the Cannelloni (17.99) which was stuffed with chicken and spinach, with b\xe9chamel and marinara sauce. The plate was served with 2 cannellonis which were delicious. My husband had the Filet alla Griglia (34.99), a center-cut filet with Italian roasted potatoes and asparagus topped witha rich Borolo demi-glace. He enjoyed every bite & said the asparagus was cooked perfectly!. One friend had the Fettuccine alla Campagnola(17.99) which had chicken, mushrooms, peas, mozzarella in a sugo rosa sauce. She said it was very good. Our other friend had the Rigatoni della Sansoni (18.99) which had a meat sauce and is normally topped with homemade meatballs but our friend asked if italian sausage could be substituted instead , which they did with no hesitation or extra charge. \n\nThe staff was very pleasant & attentive without being intrusive. \n\nThat said, I can only give this restaurant 3/5 stars.  There is no way we would go out of our way to eat here again given all of the italian eateries in town and given the price, nothing we tasted was "out of this world" and portions were very small and only a few of the pricier entrees came with sides (albeit very small portioned sides).', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2011-01-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nBWKJamLNaSrnOU-PrLMiQ', 'review_id': 'WRokgtTpcQrs-ZgmRNY8_g', 'text': "I'm giving it 4 stars because the service was really excellent. The food is OK, but my kudos goes to our superb server that took care of us. We got there maybe 30 minutes before they closed (do they close?) and got seated with a view on the pool / aquarium outside.\n\nAppetizer: Calamari - Not so good, it smelled fishy. Our server offered to take it back and have them make a fresh batch of the stuff after he saw we had hardly touched it.\n\nThe pizza I ordered was really good...and really BIG! Do NOT order one of these for yourself, they are big enough for two. The margherita pizza was delicious and really hit the spot. Also had a glass of their house red to go with it.\n\nThis is probably one of the nicer places to eat in the Freemont area.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2011-02-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_tX-W_aCiMVo971AyIhRTA', 'review_id': 'SAmVahgUHmA4YmBom_L7NQ', 'text': "This is a very pretty atmospheric place with great service.  The food was okay, nothing to  write home about but passable.  The bruschetta is a really nice appetizer, although it apparently was inconsistent from one time to the next, as my out of town relatives were disappointed that the bread seemed to be different from their previous visit. Nonetheless, it was quite tasty.  The Tiramisu dessert unfortunately really missed the mark...I've had much better and it didn't taste at all of coffee or any type of liquor, more like caramel or something.  So, that was the main downpoint.  Eggplant parmesan was okay, could have used a bit more seasoning as the eggplant flavor didn't come through in the dish itself, but hey, it was still good, a large portion (for me anyway), served hot and fresh..... and for the blend of atmosphere and very attentive service you get here, you could do worse than coming to The Grotto for dinner.  If I came back would try other things on the menu, maybe the pizza, as I'm sure there are some stand outs that are quite good.  Have fun! You won't be disappointed in this place unless you're looking for top of the line Italian...it's an enjoyable overall place to hang out, especially for out of town friends and family.  (the fish tank and waterfall/pool  area while a bit noisy is all part of the action and fun of Las Vegas!", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2011-02-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7CgHEeGagZ32JBOwqEbM_g', 'review_id': 'bVXZA2HbmdF7GntMOFC83A', 'text': "This place is in the Golden Nugget where I stayed so it was convenient.  But I ate there twice because the Italian Wedding Soup is so good.   Very delicate and tasty.  It's made with chicken instead of beef.\nThe pizza is also good as well as the pear salad.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2011-02-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HLe1DT83kndSGXTge6DPvQ', 'review_id': '_3KNfrVt-LZ5xIFpOa2DPw', 'text': "If you are looking for a Goidelic and reasonable lunch then head here. It's located in the golden nugget. We had salad and meatballs the first time and a pizza the second. Great view of the pool area.  Good solid food", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2011-02-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dU4TPMnb_D5vyIrSuIMIgg', 'review_id': '7GETZJuwazrrnmkYCOPdKg', 'text': "Fourteen of my friends and I had dinner at the Grotto tonight on Fremont Street.  \nThe service was fabulous although we only had one waitress and she handled it well.  \n\nPROS:  The chopped salad was great and there was a huge plate of it, enough for 6 of us to share.\n\nThe Spaghetti Bolognese was good but just good, not great, not memorable. At $19.00 per plate it SHOULD have been better. \n\nThe Chicken Piccata was also a good choice with lots of lemon and loaded with capers and served with a generous helping of angel hair pasta and asparagus.\n\nA few in our party ordered the cannaloni appetizer ($9.00 each) and loved it.   \n\nCONS:  The thin crust pizza fell apart under the weight of the large amount of cheese, sausage and peppers.  The crust tasted more like crackers than pizza dough.  The flavor of the pizza topping was very good, but hard to handle.\n\nWe shared all of these  dishes among 6 of the 14 so we ordered 4 extra meatballs along with the two that came with the Spaghetti Bolognese.  The meatballs were huge but we felt that $4.00 for each meatball was a little over the top. \n \nThe dessert cart is very interesting to look at but the coconut cream pie (a huge slice) was almost all whipped cream.  I would have liked a little more coconut cream.   At $8.00 per slice it was hard to swallow.  LOL.\n\nThe restaurant itself is loaded with Italian atmosphere and very comfortable but noisy.  Some tables face the awesome aquarium at poolside so try to ask for a table there. \n\nProbably won't go back there again and that's too bad since we're locals and frequent the restaurants on the Strip and Fremont Street.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2011-02-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZaYHYPURSV1y9cN1sGprrQ', 'review_id': 'p1ry9DwnBXcaLKCy92L6Lw', 'text': "We stopped here while visiting Fremont Street.  As an aside, the Golden Nugget has been nicely kept up through the years and holds its own with resorts on the Strip.  Anyway, we expected Grotto to be an expensive version of Olive Garden, but we were pleasantly surprised.  \n\nFirst of all, our waitress was wonderful.  She helped us choose entrees, and suggested that we split a salad.  Hubby had a sea bass encrusted with a pasta-type coating.  He thought it was terrific.  I had a veal marsala, which was very good.  Our side dishes were also very well done.  \n\nThe desserts were the best!  When you're done eating, they wheel out a dessert cart.  Naturally, everything makes your mouth water.  We shared a cake layered with cream and strawberries.  Light and decadent!  \n\nThe atmosphere was okay -- we got to look out into the pool and fish tank area.  My only complaint would be the noise.  Like most restaurants in Vegas, the restaurant is open to a corridor with people constantly walking through. \n\nIf you're downtown and want to eat at a nice Italian restaurant, I would highly recommend Grotto.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2011-03-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'L_Y1hj1OupsXdtWopa79dw', 'review_id': 'vDOg6adw4dDrfn7HeWawUA', 'text': 'Prices high but the food great.  Roasted garlic on my chicken herb pizza excellent. Pizza size was way more then one person could eat.  Wait staff a little slow to make first contact but excellent after that.  Even though it is a little more expensive the quality of the food meets the price.  A great casual place to eat with a terrific view of the pool area and shark tank inside the Golden Nugget Hotel and Casino.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2011-03-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'iF6bSB6l8_oYVfXujBzFkA', 'review_id': 'y87oP6IHQ-Acl1xt1hXn-A', 'text': "Denise was a great server!  We had 40 minutes to get in our order for 6 people before we left for our flight and she made it happen with efficiency.  \n\nI'd highly recommend the Lobster Bisque.  It is one of the best I've tasted in Vegas.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2011-04-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'os5DXiwMcPO22sFsiNXslw', 'review_id': 'XecmJs1MZM2lZx9WCbJGMw', 'text': "I should've done this sooner so I could remember our servers name because he was so great.  Anyway..My girlfriend and I took a trip to Vegas to warm up from the cold rainy days of home.  We ended up going  to Fremont Street because I'd never been and I had to see it.  We waltzed into the Golden Nugget to check it out and ended up eating at the Grotto.  The best decision we made the entire trip.  We both really loved everything.  We had one of their pizzas, half something she loved and half what I loved, Margherita. The waiter was attentive and fun and the pizza was fabulous!", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2011-05-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dDwoYol7DKnQS1nA69wCGw', 'review_id': '28FLAM0zq7vIZQW94Kgd0g', 'text': 'WOW.....Best Italian we have ever had!!  I had the Crusted Sea Bass.  No words to describe the flavor...soooo good!  I only wish I had ordered Two orders so that I could have had some to take home!!', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2011-05-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'n7SG66zQG_w-0y2W4jURIg', 'review_id': 'cn7z0ve8SDn-VUWbuw62Kw', 'text': 'GROTTOS HAS THE BEST PIZZA I have ever eaten!! (in Las Vegas). Being from Chicago this pizza is ... well, different.... \nI NEVER would have considered eating at the Golden Nugget. c\'mon its reputation (to me) was an old dumpy casino in old dumpy downtown Vegas, but a co -worker recommended it so we gave it a try.  \nWe sat at the bar, ordered a nice chardonnay and were happy to find out it was "happy hour".  for 7 bucks we had the most delicious \n"Roasted herbed chicken and garlic, mozzarella, basil,\ncaramelized onions, roasted tomatoes and goat cheese" pizza!!!\n\nDELICIOUS.  I DEFINITELY WILL go back to GROTTOS!!', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2011-06-02', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'hcpEWVuP0Kfhz1EHtU-gXg', 'review_id': 'Bp_KR3dVQZWq4lo75gg5cQ', 'text': "This was definitely the surprise meal of the trip. We went here out of convenience and turned out to be wonderful food. I had the italian sausage rigatoni - it was excellent, gf had the roasted herb chicken pizza and loved it. The italian wedding soup was the only flop - probably the worst I have had (especially for 7 bucks). Dessert was great.\n\nThe only thing keeping this from a 5 star review is that we were given someone else's leftovers. We got back to our room later expecting to have some late night pizza and realized we had someone else's leftover dessert.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2011-06-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cQMjcul-XdxFc9Kk9ocdow', 'review_id': '1vHPeiekcCRVyRN--Rb7iA', 'text': "We took a trip to downtown Vegas to explore and had dinner at Grotto's.  We ordered the Bruschetta (7.99) which was grilled Tuscan bread served with marinated Roma tomatoes and the Peperoni pizza (12.99) which is imported peperoni, tomatoes and homemade mozzarella.  Both were very flavorful and yummy.  And cheap to boot considering the pricey food we'd been eating all week.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2011-06-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'RLr440yXDIRQ-Y7jX9-j-Q', 'review_id': 'fLpGVOGKJ8rfpO6E3Q_1fg', 'text': "Great italian at an awesome price since it's off the strip. Staff were responsive and very speedy for a party of 10, that expanded to a party of 12 at the last minute.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2011-06-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uuP18BF420bjGxjdfru-QQ', 'review_id': 'mqaKqfBE5IyYM6HsO5QW9Q', 'text': 'This restaurant has a very classy Italian feel. The friendly service, classy atmosphere, and delicious food would be typical of places charging $10 more per entree. But the prices were perfectly reasonable. I was with a party of 4 earlier this week, and we all enjoyed our food very much. The menu was great, our server was very helpful, and it was the best meal of our trip!', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2011-06-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'AEp_xhZM1sTA0GIM1MG0Jw', 'review_id': 'CYRnm-S3OW3NoJ8X-DponQ', 'text': "The Grotto has solid service, solid food, and an interesting view of a shark aquarium. For all that, it's just one of many restaurants in a casino in downtown Vegas. The one thing that stood out to me was the cappuccino. It was very good...and I can be quite a coffee snob.  :-)", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2011-06-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9sm5UUXqZ8JC91RhjkvCuQ', 'review_id': 'Fwjt5F7K33gqRbc0R3etzA', 'text': 'Grotto was perfect for a nice, romantic dinner with my wife. We were staying at the Golden Nugget Resort and so the location was ideal. The food was amazing and the prices were reasonable. We will definitely be back.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2011-06-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ajiXxzXo1LjdbNgfVllX7A', 'review_id': '_WlQyFSkcCAye6hyga3EGw', 'text': 'This place was pretty tasty. I liked the setup next to the pool where you can watch all of the sharks and fish in the tanks. It isnt really close but close enough to enjoy the setting. \n\nFood.. well it was pretty good. I had chicken and it was tasty.. Not the best in the free world but it was good enough to go back. I liked the servers who were pretty cool and on it with drink service. I got tons of water refills and vodka tonics one after the other.. So overall I would return', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2011-07-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jDLd4XJ0I59EO8jB81vcpw', 'review_id': 'ZInLycTtsf-u0clcU34AQg', 'text': 'My new husband and I wed and honeymooned at the Golden Nugget so we visited Grotto many times during our 9 day stay.  \n\nOur first experience was the night before our wedding.  \nWe held meet & greet social to allow our out of town friends to visit with us before all the busyness of the wedding.  Mark was the ideal server who made food and wine suggestions that all 12 of us enjoyed!  The pasta dishes here are excellent but the pizza is definitely the star! All of them are good so choose your favorite with confidence!  The meatball appetizer is also fantastic with its scrumptiously seasoned interior complementing its crunchy exterior - my husband highly recommends this to accompany any dish.\n\n The Grotto Bar was one of our "go-to" spots when we done sightseeing and wanted a good drink in a nice environment.  They have a full bar and an excellent wine selection.  The big screens were nice as well and during one visit we were able to chill and watch a Giants game!  :D\n\n As stated earlier, we had several other meals here during our stay (lunch and dinner) and each time the food was outstanding and the service was friendly. You can\'t miss with Grotto!', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2011-07-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'gbpmlC9mU_VHKdjRZwugYw', 'review_id': 'qIPgdYyVAMaUUtL1kqDzeQ', 'text': 'Best flat bread pizza I have ever had.  \nBest wedding cake too!\n\nVery reasonably priced, with a great view of the Shark tank.  \nBottle of wine, appetizer, pizza, and dessert came out to under $65.  \nNine days in LV and this was the best place I ate.  Highly recommended!\n\nNot to mention the service was exceptional!', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2011-08-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 3}, 'user_id': 'vyfsQo-estP8EfiIFMsL6g', 'review_id': 'YfwJQAi0UraHIZhwDk6opQ', 'text': "During one of my last work trips in Las Vegas, I found myself stationed here at the Golden Nugget and feening for some food after an incredibly intense happy hour.  I learned of the Grotto by accident really - I was busy sipping glasses of wine and attempting to order bar food, only to learn that bar food was a delicious array of Italian fare.\n\nPerhaps it was the alcohol doing the talking for me, because everything I had was inhaled in minutes.  The Montel Wrap, a parmesan crusted Chilean sea bass married with roma tomatoes and lettuce was better drunk food than the burger and fries I was initially fantasizing about.  Another winner was the lasagna and the margherita pizza was deceivingly tasty.  I managed to go back to my hotel room in a pseudo drunken food coma, a condition best experienced in Vegas.\n\nI decided to come back during another night for dinner, this time sober and just as hungry.  Having witnessed the dining room for the first time, I realized it was easy to miss this place.  The Grotto doesn't stand out and the tacky decor wasn't going to win any awards either.  When examining a menu for a second time, it was clear Grotto's was a Italiana Americana restaurant, more than it was anything more authentic.\n\nService was good, almost too good for a downtown casino establishment.  They were courteous, professional, and prompt with everything.  I had a stellar recommendation in the very tasty ($9) lobster bisque, not too fishy and just a tad of creme.  Another solid dish was the linguine pescatore, but felt overpriced at $27 for a medium portion.  I also was able to try their herb crusted pork loin ($25), juicy and hearty, with a nice seared crust, had a nice flavor with it.  The yukon mashed potatoes were a nice touch but tasted like they were whipped with butter and sour cream.\n\nFinally our table of hungry hippos decided it would be a good idea to order the sausage and peppers pizza.  The crust was a little charred, too much to a point where it was dry and mediocre.  I would give this another shot, especially since I've heard more former colleagues rave about this pizza than any other entree on their menu.\n\nThe Golden Nugget has a mini gem here with Grotto.  For downtown standards, this is a decent and semi-reasonably priced Italian option in an area where good food is hard to find.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2011-08-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'iiXJ5kK3GIScYarNV6J__w', 'review_id': '060VymhzKjDpjcq4WViTxA', 'text': 'Not good... Bad service, the food is not gpod, my pasta was so sweet... Anyways I vote that this restaurant gets into kitchen nightmare series by Gordon Ramsey!!!! Enough said, skip this place', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 2, 'date': '2011-08-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'sgb91Hc4rVeLqehNy7Pvnw', 'review_id': 'TP3SzwtPIHM1jcF0xINDOw', 'text': 'Menu looked promising as we walked by, so we made reservations before seeing Gordie Brown show for all six of us. \nThe hostess was pleasant, and the waitstaff was attentive (initially).  Ordered a herb roasted chicken pizza. Good.  Not  great. Very little toppings. Tried a slice of friends pepperoni pizza and promptly kicked myself for not ordering that. The pepperoni was outstanding. \nOnce dinner was completed, our waiter sort of...disappeared.  took a while to get the check (remember, we had tickets to a show).  All in all a good experience.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2011-09-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1zGcOYTiFxp03Szen7ue4Q', 'review_id': 'e7NxZR75xWCDZM36J8wEdQ', 'text': 'What can I say...gotta love the Golden Nugget.\nLunch at Grotto right by the pool is a great way to do a business meeting.\n\nDelicious food, friendly staff, and great atmosphere.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2011-09-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'CZAw9nxnBWr-AQHdRLvU6w', 'review_id': '8Bb5hvbHNVfSDgw5Dxj63Q', 'text': 'Let me preface by saying the 3-stars came strictly from the food and the amazing table we had.\n\nAfter the Lillie\'s Noodle House BS (see review), we were irritated, flabbergasted, and hungry. We weren\'t in the mood to head to the Strip, nor were we wanting to search Downtown for a place to eat. We happened upon the Grotto and snatched up a seat. We put our name in and were told it would be 20-30 minutes, not too bad. We all needed a drink and decided to head to the bard for drinks and maybe an appetizer.\nWe sit down and look over a dinner menu. The same blonde, short-haired, older lady kept sprinting by us. After a few times, she said she\'d be right with us. After a few more times, she stops by our table to ask if we were waiting for a table in the restaurant, we said we were, and she said, "Oh thank God, that\'s the best news I\'ve heard all night" and goes back to the Indy 500. She laps us multiple times before we flag her down to order. She took our order and began her foot race all over again. Within five minutes we had our alcohol but no water. She gave us the excuse, "it\'s hard to get water around here" and continued her sprints. I felt bad for her because it seemed she was the only one working as a bar server and she was running around frazzled and stressed, but come on, it\'s not that hard to get water. She ran by at least three more times with the same excuse. I paid the tab, gave her a pretty good tip, and it was time for dinner. We never ordered our appetizer.\n\nMy brother walked up to the hostess station and mentioned that it had been about twenty minutes. One of the girls said she could seat us now and then grabbed four menus and walked off in the direction of the table, leaving my brother in the middle to make the decision to get our attention or to follow Speedy Gonsalez. He followed her and made it to the table with just enough time for to thrown down the menus and mutter, "Enjoy". We eventually caught up.\n\nOur table was against the glass overlooking the beautiful pool and shark tank, which was lit nicely for the evening. In need of a other drink and dinner, we checked the menu and decided what we wanted to eat. Silent Bob, our waiter, walked past the table multiple times, never acknowledging us. Finally, after the bus boy brought us water and set down the bread and olive oil (very good), our order was being taken. I think the waited maybe said four words to us. The pattern of passing our table continued until our drinks and appetizer (bruschetta) were ready. The bruschetta was amazing!\n\nDinner came out about twenty minutes later and was delicious. I can\'t recall what we ordered because I was so appalled by the whole evening. First, we\'re basically told that we\'re not wanted in Lillie\'s and then we\'re basically ignored at Grotto.\n\nThe food here was good, deserving of a full five star rating. Too bad service counts in my book, this restaurant barely deserves my generous three-star rating.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2011-10-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'n_cjeyVbB5LFcPK41EeXZg', 'review_id': 'oX-mDNESk0GegXtS_xe4lw', 'text': 'Excellent food.  Great, friendly, prompt service!', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2011-10-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ce7ueAOqX1Creo15xZnGcw', 'review_id': 'NKyCCQbOzEb2lwOURwbLzw', 'text': 'Good food, lobster bisque is top notch, good wine and a nice quiet atmosphere.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2011-10-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8-TLEpxyu9utNvYt2jVYnw', 'review_id': 'IM9L33AaDLkquprwioRFlg', 'text': 'Love. That is what I feel for this place after having dinner here. The service was friendly and spot on. I ordered the Herb Chicken Pizza and nearly died it was so good. I highly recommend this place!', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2011-10-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'RdDOfgGEzDIv77kyiw-UJw', 'review_id': 'EvsazEuwfEPVJIZpM6ovvw', 'text': "The best place to eat on Freemont Street!  Their pizzas are my favorite in the West (I.e. not Chicago or New York).  In previous visits I've had several of the appetizers,  salads and pastas.  All were good.  At happy hour you can get the full size pizza for half price.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2011-11-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'O0vvS6arf6WlUfTOoczcEA', 'review_id': 'kxuEgX2VW9wmFujcrrlbXQ', 'text': "It overlooks the pool, which is really nice. Don't drive out of your way to get here, but if you are in this casino it will do!  My friend and I ordered a Margarita pizza which had super thin crust, almost like a cracker. We asked for more sauce as it needed it, but the sauce was good.  And we shared a salad. We also had a glass of wine each. It was really quick. I saw other tables had bread, but we didn't. Another table order what appeared to be a meatball appetizer, don't get that, it didn't' look good! Couple other folks looked like they were picking up pizzas to go, which might be a great idea too.\n\nThey also played nice jazz music, which was odd since it was an Italian restaurant, but who am I to judge.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2011-11-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'BJq8QOWqaxjbphZEyQIrBA', 'review_id': 'wo887_e_TVwPy8nqOo8RNw', 'text': 'Great Atmosphere, and service with delicious food! Will return!', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2011-12-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cgFVx_MlX6cKKviYaT6JCg', 'review_id': 'Z9pXntVI43-Lrq1Wpt6L5Q', 'text': "The only good thing about our experience with this restaurant was the view of the fish tank out by the pool. \nFirst the waitress forgot our drinks. Then when she did bring our drinks, or should I say drink, she forgot my wife's wine. Fine, we told here to just make sure that it was not on the bill. \nWe ordered a pasta plate, and a chicken margarita pizza.\nPasta, well, to be honest, was so, so, but not bad.\nThe pizza, oh, the pizza........ it was absolutely the worst thing I have eaten in a long time. For me to spit out my food in a restaurant, wow, something has to be horribly wrong. Well it was. The chicken tasted like it was 2 weeks old. No joke, no exaggeration, old chicken has to be one of the worst things you can put in your mouth. Now imagine a piece of pizza you had just bitten into being covered in it!!!!\nWe informed the waitress, who must be an out of work actress, because she said that she could not believe what we were telling her and that she would look into it with the chef.  \nSo we waited for some kind of response as to what may have gone wrong, after about 15 min of waiting, the manager comes over and tells us that he cannot belive that the chicken was like that and that the chef was looking into it. Then he just walked away. No joke, no apologies, no comping the meal, nothing, he just repeated the same thing to us that the waitress had told us 15 min earlier and walked away!!!\nMy wife and I were going to walk out, but, unfortunately for us we have ethics. Finally we were able to get the attention of our waitress and got our bill, paid for the food we had eaten and left. \nPlease don't ever eat here, I don't want you to have to find out what old chicken, and I mean really old chicken taste like, the way that we had too.\nAlso, to be treated so cold by the manager, and a forgetful waitress is absolutely unacceptable. In today's economy businesses need to appreciate any and all customers who walk into their establishment. \nNever, ever again.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 1, 'date': '2011-12-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9hOcfz1_fV5oP1IoHGt7Tg', 'review_id': 'v2ycA2z8yfpNo1BElxWwJA', 'text': 'Chef turned bartender michael and basil cutting sous chef roberto made this experience worthwhile. Nix the table for a seat at  the bar where you can watch your pizza being made. not enough chicken on the signature pizza, bit yummy nonetheless.marinara was exceptional. Garlic olive oil for dipping made the boring bread pretty remarkable. Seafood pasta pescatore was fresh and delicious. I loved dining here! The angelfoods cake was truly (with the risk if sounding punny) HEAVENLY.\n\nI love the service and the atmosphere of this place.  The Golden Nugget is holding steady as the best place downtown.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2012-01-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'd_YmXlcEkDnDkLMgJFKmhw', 'review_id': 'Wx-fQkcbPL8HBtywTbXSfw', 'text': "I would give this place 4 stars but for the price, I expected the food to be above average.  I had the Penne Chicken Pasta and there was nothing special about it.  If this restaurant wasn't in a Casio, they would charge half the price.  I'm not saying it was bad, just not anything special.  Service was very good though.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2012-02-01', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'KAjX6AcK9auY0gzJj1Amgg', 'review_id': 'FIHxBNJgooqWXV08l5ymjQ', 'text': "Came to Grotto for a late night snack after losing a Bag o' Chips on Roulette.  Turns out that the resaraunt side was closed, but the bar was open and was only serving pizza.... perfect!  The pizza was baked on the spot and took no less than 10min.  We ordered a thin crust margherita, and well.. it got me shakin' my marakas!  The pizza hit the spot and paired perfectly with an ice cold beer.  Don't have much else to say about Grotto except the known fact that the pizza is definitely not Grott-esque!  Har har har..", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2012-02-04', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'qegru8GM6zXcOrVNVCVAEw', 'review_id': 'zmSv2TMBuNwr1m747SHHmQ', 'text': "What I like most about this place is the location overlooking the pool which makes for a nice glimpse of outside and hotties in bikinis.  I don't eat downtown that often but I do like that this place is clean, attentive service, and quiet enough for a nice lunch with friends or work reasons should you find yourself downtown.  This isn't the best italian food in town but it's what I consider one of the nicer places downtown and open for lunch which is rare.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2012-02-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2n6Qzu61VsuffhiJno1WdQ', 'review_id': 'r12X7JO-T1faFdL5l4L0NA', 'text': 'Much more than we expected In this dumpy part of vegas.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2012-02-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vjyPJBAkpiWonAMVuUEKJA', 'review_id': '0D9BLxC9oVJZOXGQVKtcig', 'text': "The bartenders are great and always make our late lunches amusing. The pizza chef manning the oven is an artist. Also, the cheese pizza is addictive. Plus there are happy hour food deals. I'm a fan!", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2012-02-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-AXrmhjaQ8PbZJFe5V9Hjw', 'review_id': 'fBDFL39fFzye-QAY3DGFYA', 'text': 'A little odd when there were many open tables but there was a wait. This was because The Grotto takes reservations which is nice.. as long as you can make it. We sat at the bar instead (one of my fav thing to do anyway). Food was pretty good, typical Vegas over priced but its hard to find anything around that compares with a good atmosphere surrounding it.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2012-03-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xsGLM2cMKqNDJfo3wJCV5w', 'review_id': 'MLK4Xe3pGSSW02hbdADJ7Q', 'text': "Joined a friend halfway through dinner so just ended up getting dessert.  I have to say I was very surprised when the waitress brought me the dessert menu only cuz it wasn't a dessert menu at all.  It was a towering cart of desserts! Although they all did look yummy it was overkill and I had to hold back laughing as she was trying to maneuver this thing around tables! \nThis dessert cart is not needed and a menu would have been fine :-)", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2012-03-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'O4XAjranoY3N9G0pYfMmWQ', 'review_id': 'aQWQOh1PJBGZGGxfeOVQiA', 'text': "I love the food here, but there is so much to be desired about the service. My husband and I come here all the time because the food is phenomenal, but if we are not spending literally several hundred dollars on dinner we have noticed they could care less about us. Every single time we go there to grab a quick pizza or some bruschetta and a cannelloni and a drink we are ignored until my husband finally says something. (If we are having a full course meal with drinks and our bill reaches several hundred then its a little different.) It's very unfortunate because that's becoming the last place we go especially when we have company.\n\nThe ambiance is lovely and again the food is wonderful but whether im spending 100 dollars or 300 dollars it would be nice to get the same well rounded service.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2012-03-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '90a6z--_CUrl84aCzZyPsg', 'review_id': 'tFvqrhXF27zhNDrWILEIDQ', 'text': 'Located right in the Golden Nugget hotel this little Italian cafe/restaurant surprised us with their quality and service. The place gets pretty  packed around dinner time. They offer room service too.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2012-03-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ye8EOK74un1w4I2YY60Nmg', 'review_id': 'JPiHsCO6AVbIBalOV_M2yQ', 'text': 'Incredible veal. My favorite in Vegas for their veal dishes. I agree, the service is less than stellar. But the vibe is nice and the food always very, very good. This seems to be the trend in Vegas. So many places offer mediocre service in Las Vegas and this is just one of them. To be in a city that needs to remain top notch, service needs to be impeccable - always. This would be 5-stars if the service matched the kitchen.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2012-03-31', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'JbnrvYm-zoH_V3w0P5onSw', 'review_id': 'VGPY6e8-HgwPD0WqvKrE0Q', 'text': 'Wine? Yes. Food? No. Stay away from the lobster bisque...too fishy.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 2, 'date': '2012-04-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XPU19vH0cB5Fmhh9H5T4Fg', 'review_id': 'GDKbwf0pyBa0kdXAoJn65Q', 'text': "I don't think that there are any good restaurants in downtown.  This was possibly the worst food I have had.  The pizza was soggy, cold, and had no flavor.  The lobster soup was fishy.  The best part of the meal was the wine...enough said.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 1, 'date': '2012-04-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'du2rmNm3aMiqfmfTp94_Vw', 'review_id': 'TEMnY9hR3FXuHVgJOVDMww', 'text': 'Had a truly great dining experience here. Our server was very helpful with our groups indecisiveness and recommended the signature pizza to share and the garlic olive oil for the bread was outstanding. I wish they sold that stuff in a bottle. The only complaint was the wait which was understandable given it was a crazy friday night with loud obnoxious drunk people rampart throughout the restaurant causing chaos and disorder. If you want authentic Italian food that is not a far cry from downtown, this is the place.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2012-04-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WubENyT9wJQEfmFGbLVp-w', 'review_id': 'KQ94AJjL1BTMvDm22snvMQ', 'text': "We've been here twice now during a regular trip to Vegas for business.  This last time I had the Spinach & Pear Salad.  Amazing!!! (Baby spinach, Bosc pears, tomatoes, caramelized pecans, Gorgonzola and balsamic vinaigrette)  Then I finished it off with their gorgeous thin crust Margherita pizza fired up in the brick oven behind the bar.  Normally at an Italian place I would go for a nice pasta dish but this hit the spot PERFECT.  That salad was amazing!  We ended the night with a leisurely stroll for the downtown Fremont Experience that only this off the strip location can offer.  SO worth the short drive off the strip!  I only wish I had room for their ginormous desserts.  Next time...", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2012-05-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'q0d7h1mcNEz5eBHX76u--g', 'review_id': 'elBKvsOLFP9xhteTbLQnMQ', 'text': 'Now, a favorite! Lovely atmosphere!', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2012-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TfHhf3tA9hl7UtjXjQAziA', 'review_id': 'kX7NV86kD5UlE1sSED9uZw', 'text': 'I never had a bad meal here, lunch or dinner. I prefer it to any chain Italian restaurant out there, prices reflect the quality of the food and the resort.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2012-06-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'e3bSJPE-y2CkGS_mPgNvxg', 'review_id': 'rHsnBRx9c-RjwmKhujsEVQ', 'text': "I don't make my way downtown in Vegas very often, but this place is a MUST-STOP AT when i do. \nThe italian home-style salad was very good and the fettuccine alla campagnola was delicious. one of best italian dinners i have ever had.\nService was impeccable and the decor of the restaurant is very nice, even though you are surrounded by the casino on all 4 sides.\nthe bread with the olive oil was to die for also.\nLOVE it.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2012-06-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '-FpL5aDuMrKWYtIq-M5vOQ', 'review_id': 'KnXdyb--jD3WXSz2C1UikA', 'text': 'Kim, our server was great. Drinks stayed full and she was atentive without hovering. The restaurant was busy but not overly so and we were seated without a reservation right away. We sarted with calamari which tasted very fresh, but could have ised more seasoning, i added tobasco to mine and it was great  then we had veal scallopini which was really good but I would have preferred a tomato based sauce. To finish up we had coconut cream pie.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2012-06-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'M7TeIKPi0zH9xkkzYSZogw', 'review_id': 'nyEJAMpYlvSAEdc4MtVIlg', 'text': "They suckered me by just smelling the pizza as I walked by! But what really got me was their wine special...was really wanting a very good glass of wine on this last night of our adventure. \n\nNever did get their pizza, although I seen it pass by a few times...Ordered their lemon Veal, and it was simply amazing. could cut through it with your fork. The waitstaff here was spot on, and the atmosphere and decor of the restaurant was beautiful...felt like you were in a little eatery in Italy. The prices are right...you get a good size portion - didn't order any appetizer...although they did bring out this very fresh, warm bread...which hit the spot! Was so hungry! \n\nthe wine was brought out in a little glass canister, and was enough for two glasses.\n\nReally enjoyed my dinning experience here, and I ate alone. Just sat back, relaxed and people watched.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2012-06-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'AuPJRHo1WVM_yofp_cZ5sA', 'review_id': 'cw0VoPCxlA4lGpXRVfvYVg', 'text': 'been coming to the grotto for a few years and raving about there amazing pepperoni pizza, but alas times they are a changing, must have new chef a once brilliant standout pizza is now just and average pizza, the peeperoni they once used seems to be no longer and replaced with a dominoes style pepperoni and the bread and pasta dishes have suffered a setback as well looks like one place I can cross off the list when we visiit vegas, sometimes change is not good', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 2, 'date': '2012-07-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 6, 'cool': 6}, 'user_id': 'qqtmFGhyyHc37coT4qJxaw', 'review_id': 'LCnOYxMEj43GzywcP-sPYQ', 'text': 'It was my first time at Grotto inside the elegant Golden Nugget Hotel & Casino.  I was pleased with its welcoming and informal look, and ready for a fine Italian meal.  The Italian bread in the bread basket was okay.  So were the two meatballs that I had for an appetizer.  One was medium and the other medium-well in doneness.  The mild Marinara Sauce that accompanied the meatballs was quite good.  And, a Half Caesar Salad featuring chopped Romaine Lettuce was nice and cheesy.  \n\nMy mushroom-covered main dish of Veal St. Pietro in a very tasty cream sauce was nice and hot, and very good.  Sauteed Spinach and Roasted Potatoes accompanying this dish were also tasty but warm rather than hot.\n\nService was very good and on target throughout my stay.  This dinner ended on a high note with an excellent tasting, large slice of Mezza Notte Chocolate Fudge Cake and Vanilla Gelato for me, and excellent Tiramisu with Vanilla Cream for Diane.  Both desserts were very rich and decadent!', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2012-07-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wdbX5siVQQFFDd-yr6DyGg', 'review_id': 'DCKyQK9hjUVo_zlkGBImHw', 'text': 'Great food and waitstaff! Must try the lobster bisque and meatballs. The chopped salad is great as well! The chicken fettacini with rosa sauce amazing!!! All and all a great place to eat if you want Italian downtown!', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2012-07-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_R1LuLb4Rvh2F1OqoHF8iQ', 'review_id': 'YyVMCnvOXyrbsX2C0sImaw', 'text': 'The restaurant is very clean and well presented upon entry.\n\nMy wife had the fried cheese ravioli, which was listed as an appetizer, for her meal.  I had the chicken alfredo.  The chicken was moist and cooked beautifully, just not blackened enough for my liking.\n\nOverall the service was prompt and responsive.  For an appetizer, an entree, and 2 waters of this caliber I would expect to pay between $15 and $18.  Our bill was $28.  \n\nAgain, I say you are paying for the service and location, not the quality of food.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2012-07-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'thSzP2Boq0TSwczUZ2laCQ', 'review_id': 'jhfVbP1E6kMq5_z7cXPjog', 'text': 'This is actually 3.5 stars\n\nThe good:  This is one of those places that has been a "must" whenever we go to Las Vegas!  I absolutely love the spinach salad.  Since I am a creature of habit, once I find something I love I kinda get it again and again.  I\'ve had the spinach salad consistently for years.  Yep, i love it that much!  The pasta dishes are excellent and the pizzas are delicious too!  Never made it to dessert so one day I\'ll have to try some.\n\nWhat you might not know:  This place is part of the Landry\'s Select club and you can accumulate your visits to earn those $25 rewards.  Also in the Golden Nugget is the another Landry\'s restaurant, a steakhouse, Vic and Anthony\'s.  Delicious!\n\nThe review on most recent visit:  I would\'ve given this restaurant five stars except for my most recent visit...\n\nLet me start by saying that the wait staff is usually excellent, attentive and professional.  However, on our last visit in July, our salad was delivered to the wrong table by a man who appeared to be a waiter and we had to wait a while to have one remade and brought to our table.  Mind you, we were there at least fifteen minutes before the other couple.  Let\'s just say, we watched as the other couple enjoyed our salads and continued to wait.  Finally, our salads came... No apology from our waitress except oh, it was delivered to the wrong table and that was the second time he did it to her that night, fourth time overall.... Hmmm...ok, so she was having trouble with another employee...she acted like she was irritated by him and the victim of the situation.  The only ones who got any benefit that night was the couple who had our salad for free. Can\'t blame the other couple though, it was their first time there and they thought the salad came with their meal.  I think for our inconvenience, we should\'ve been comped a salad too, or  at least been given dessert after our pastas for our inconvenience and having to be put between what seemed to be some sort of problem between two employees.  \n\nI\'m just glad that this wasn\'t my first time there or I would be missing out on some really good food, cause I would not go back.  This type of experience would be the type of incident that would keep first timers from returning.\n\nIf this type of incident was to keep occurring, I would seriously think about making it a "must" on future visits to Las Vegas.  Vacations are supposed to be fun and relaxing, not irritating and an inconvience where you\'re sitting around and waiting for your starter for over half an hour. \n\nSo, minus one star for waiter/waitress discrepancy and another half cause lots of time was wasted and were not given an apology, but an irritated excuse.  Any other restaurant where something like this happens, patrons are valued and given something comped or at least an apology instead of excuse.\n\nWe were done well after the restaurant closed, and should\'ve made an attempt to speak to a manager, but hey we were on vacation and so much precious time had already been wasted.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2012-08-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'it1vdnoMRhh_DZNjQMsHdg', 'review_id': 'MNwStph9dCFhD0hXNYOQVQ', 'text': 'Wood Fire Pizza!\n\nThis place had super good Wood Fire Pizza. We only got the Pepperoni Pizza and it was delicious. The service was great, the atmosphere was quiet, and the decor was cute Italian.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2012-08-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'XsS73EFOk9mecKgenjYkCA', 'review_id': 'GL9etRGExNp9sSOiEuFdkw', 'text': "This place is inside the Golden Nugget (Which is my fav downtown hotel)\n\nThe pizza here is sooooooooooooooo tasty! The first time we ate here we planned to share a pizza but it was so good we had to order another. They serve many more dished, which are also good, but the pizza is unbeatable! Unlike the pizza joints you may find on ever other street corner this pizza is a real treat! The crust is thin and light so you don't feel like you have a tummy full of dough when you leave. Its not too greasy and its just a very nice traditional wood fired pizza! If you are in downtown and need somewhere to eat lunch or dinner give Grotto a try, you'll be glad you did.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2012-09-02', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 8, 'cool': 6}, 'user_id': 'kZ11FAE4NGbddxOOPeRL5g', 'review_id': 'LCKUiGKOvDBFIXMcEBsIig', 'text': "Pretty standard, over priced, casino restaurant. I had Linguine Pescatore which was really good, but it definitely did not justify the $27 price tag. In fact, I have prepared something very similar before with a mixed seafood bag from Trader Joe's for $9.99 (which fed 2 people). The service was fine -- nothing memorable, but also nothing to complain about.  This is probably a restaurant to visit if staying at the casino, but even as a local I would not go out of my way to eat here again.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2012-09-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'hlRqMmotfAVD90fub0uWkA', 'review_id': '_pu_EZpAr8fn1CuqzWL0qA', 'text': "We dined at Grotto last Sunday for lunch and, like our last visit, it did not disappoint.  \n\nWe had the Lobster Bisque and Spaghetti & Meatballs.\nBoth were good.  \n\nThe grilled Chicken and Marinara sandwich is also delicious too. Try it if you come here. You won't regret it. \n\nThey also have good salads. \n\nAnother excellent visit.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2012-09-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_CadNo65TYc5sjN1eB0YAA', 'review_id': 'sy9XOXZez3514oeenm_W0Q', 'text': 'I had the Margarita pizza.  It was nothing spectacular.  The restaurant was clean and one of the least smoky places inside the Golden Nugget.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 2, 'date': '2012-09-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': 'MTixe0RyDeJLa31NZT4rug', 'review_id': 'RpC2aRPmLHJoXg53DAdLCw', 'text': 'Dinner with a business party, so there were about 30 of us lined up against the north wall (I think it was north...).  The appetizers were very nice - calamari and bruchetta.  The main course of fried shrimp as tasty, and desserts of chocolate cake and strawberry shortcake were over the top.  Received terrific service and would highly recommend if you love Italian.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2012-09-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'Wf8EdxK6kMGVKclTsLm7aA', 'review_id': '2VTVe0E8QzY7moCTcsUwJQ', 'text': "Hands down the best pizza I ever had in Vegas. We went in a party of 6, on a Friday night and everything's was great. We didn't have reservations, and we were promptly seated. Service as fast and courteous, drinks were generous and everybody loved their food. I had the Margherita pizza,because I am vegetarian, but the others had pasta with seafood or with chicken. \n\nThe pizza was amazing!! Perfectly baked thin crust, with a tasty sauce and just the right amount of cheese - not too much to mask the taste of the crust/sauce, not too little to keep me wanting more. Definitely a great surprise and we will come back for sure.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2012-09-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'hnDUptJM5SgLDnjO-xuE-A', 'review_id': 'r8JpP4B8dPEwKs4N-z4kOA', 'text': 'Went to this place last night with some friends and I really enjoyed it.  Loved the style of the place and the ambiance.  The staff was very friendly.  The food was really good, we ordered the Calamari Toto, Morty Pizza,Lasagne Al Forno, and the Rigatoni con Salsiccia.  Everything tasted great and the sauces were amazing and tasted as if they were made from scratch.  I would recommend this place to family and friends and think it would also be a great place to bring someone for a date.  I will be coming back.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2012-09-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'xR7T-HpPJRFBh-wO0c3XMQ', 'review_id': 'o47VZKi7mI2DwQEuAieLVA', 'text': "Grotto is an excellent Italian restaurant kinda tucked away deep inside the Golden Nugget. I've passed it so many times on my way in, out, to the pool, to the check-in counter, through the casino - wherever. But I had never stopped in before during my six years of downtown tripping. \n\nAnd I seriously regret that now. \n\nCame in on a Thursday evening by myself, having just wrapped up a conference. Seeing no one in line, I first asked the hostess for a menu so I could spot something I liked. She happily obliged. Everything looked good to me, so I went in and sat down at the bar area, which is large and wraps all around a huge brick oven. I was pretty much the only one there, since it was so early (like around 6 pm). \n\nA kind gentleman came out and provided a menu and a water. I looked it over and decided I was hungry enough to do an appetizer and a whole pizza. I asked if he had a favorite appetizer. He immediately pointed to the Three Cheese Ravioli, so I ordered it. I also ordered the Herb Chicken Pizza. \n\nBut first, let's not forget that ravioli. It was amazing. I mean really good. And really filling, too. I could have (and should have) made a meal off that dish alone. It was deep fried, covered in some outstanding spices, and the cheese inside was very tasty. I'd order two next time, eat both, then go buy some new pants.\n\nAnd I just recently started asking servers for recommendations prior to ordering. And so far, I've been impressed everywhere I've done this. So I think I'll continue that trend in the future. \n\nNow back to the meal. The Herb Chicken Pizza was not bad, just a little runny. I think it may have needed a couple more minutes in that authentic brick oven I sat across at the bar. Oh speaking of which, if you're going to sit at the bar, that's the best place to sit. I got to witness a myriad of interesting-looking (and attractive) pizzas coming out of that thing. \n\nBased on the parade of pizzas, I think I'd go with the pepperoni next time. I noticed a lot of those coming out and they looked pretty good. \n\nCustomer service here is outstanding. I'm about as low-maintenance as they come, but I noticed my server constantly looking out for me. Kept the water glass full, cleaned the dirty dishes up quickly, and so on. \n\nAnd he took it one step further when I went to pay. I had a $50 food & beverage credit from the Golden Nugget and wanted to use it when I paid. But for some reason, it didn't open up when I checked into the hotel a couple days earlier. So my server got on the phone, called two different people, and in about five minutes got it all cleared up. I think that was above and beyond. \n\nAnd so was his tip!\n\nSo I really do regret not coming here earlier but plan to make it a regular stop on all future visits.\n\nIf you like Italian, I know you'll enjoy the food and atmosphere, too.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2012-09-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ne-zPdAT6Q_9yrR6h9nMWg', 'review_id': 'JNJrd3bH8xwe-DRwHrD9Ew', 'text': 'We were pleasantly surprised in our meals.  They make a really good lasagna.  It was insanely busy, and it seemed like the kitchen was struggling to keep up.  Our waiter was very friendly, too.  Definitely a good value.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2012-10-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'PV5voYSD43Cn_3gHmxG7DA', 'review_id': '-aNO6rDkWlvKxBzRqrhxXw', 'text': "Let me begin with how shocked I was once I entered the Golden Nugget. I did not expect it to be so nice. A couple of friends and I were going out for lunch. I was early, so I took a stroll around the property and was blown away by how modern and clean everything was.\n\nAt first, I was apprehensive about the separated dining area. During peak hours, crossing traffic to get to the part near the pool must be similar to playing Frogger with a banquet tray. The weather was gorgeous and the pool is beautiful, so I understand why they seat this area first. As the first party there, for lunch, we got a central table near the window. \n\nOctober is pizza month. They are running a chef's special for $9.99. The special is a basic cherry tomatoes, mozzarella, and basil pizza. It was delicious and easily shared between two. So why in the world did we get bruschetta, chicken fettuccine alfredo, and lasagna? Both pastas also comes with an Italian salad. It was was overkill. Yet, it was also a death I am willing to experience again. I am not a huge fan of cream sauces, but I even took a few bites of the pasta. The lasagna was my favorite. It is a bit more saucy than I normally like, but the flavor was good. The pizza is a thin crust style that I was thankful for because I could not handle any more carbs. By the time all three of us were finished we had enough to send someone home with leftovers.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2012-10-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'e_I7IBCXAqhBOCDutW3vRQ', 'review_id': 'CHedrAqbh2fReW46BcHlTQ', 'text': "The Grotto is inside the Golden Nugget, which by the way is nicer than I expected.  I hadn't been to Fremont St. in over 5 years so it was a nice surprise.\n\nWe had a group of 5 and decided on The Grotto from the help of yelp! Couldn't have been more thankful.  We were starving and this fit the bill.  Food was great.  I had a pizza (sausage & peppers), my buddies had the bruschetta appetizer, penne & meatballs and ravioli.  Pizza's are wood fired and baked with thin crust.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2012-10-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jLadSL623Ca5iDcIHK676Q', 'review_id': '1TJFqsBXp1vJttKLmqYRHg', 'text': 'The place was about 3 1/2 starts.   I think its more than A-OK, but there are some issues.   The salad that comes with the pasta is very sad.   No taste.   I think all three of us left most of it.   It needs a better dressing, more flavor.   It was just lettuce and ground pepper.   There is more excitement watching soccer on television (sorry soccer fans).   The pasta was very good.  Nothing to rave about.   The tiramisu was excellent.   Had I had a tiramisu and a coffee I would probably have given it 4-5 stars.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2012-10-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kPn2nq3iudiSvOFmQj-dIg', 'review_id': 'alOE6DILMcDCLAEnhrdThQ', 'text': "i typically only review the food at a restaurant but the service deserves mention in this review.  i've been here a couple of times for both dinner and lunch and i need to read my review before i return next time.  the wood fired pizza is actually pretty good.  it's thin and crispy and well balanced.  everything else i've had isn't so  great.  on my last visit we started with bruscetta.  the plate was heaping with toasty bread topped with tomatoes, basil, olive oil and balsamic.  it looked nice but the tomatoes had no flavor.  the bread had been toasted hours prior, and the olive oil and balsamic were low quality.  for dinner i ordered a chicken dish with wine and mushrooms.  it was ok but it took more than an hour to come to the table after our apps were finished.  this is where i mention the service.  not once did the server come over and update us on our meal.  i understand there are sometimes issues with orders getting lost or not being placed.  or the kitchen just running slow.  what i don't understand is how a server can completely ignore a table for an hour.  small consolation at the end of the meal she bought a dessert for the table.  unfortunately it wasn't very good either.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 2, 'date': '2012-10-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '-Ozt8BSamVO4Ky5HY506JA', 'review_id': '4I5KcldNOxcsdv-gwN_KKw', 'text': 'This place was awesome!!  We stumbled across it as my hubby had to watch the end of a football game and tables near the bar have TV views.  It is amazingly delicious -- so much so that I wanted to "yummm" after every bite!!\n\nI had the pollo francese and it was a definite 5-star meal, every bite was yummy!  Hubby had the chicken piccata which he said was very good as well.  We both had salads and the bread with oil n spices were also wonderful! Mix the oil around before you dip and you\'ll taste the fresh garlic -- mmmm!!  \n\nWorth every penny (entrees were $19-30) and drinks were ($6-10, beer, wine avg).  We will definitely be back, want to try to the pizza!!! \n\nGreat, great, GREAT find!!  My new top Italian pick!', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2012-11-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dM28E7HkF-7A3ZrhISAG3g', 'review_id': 'pd9AaV2u5hq_KLmrUB96Yw', 'text': "We tried to go here on a Monday night for a birthday dinner and the dang place was so packed that we couldn't even get it:(  I can't comment on the food but the staff was either super overwhelmed or flat out rude.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2012-11-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZGDvL_DJzpk90H5LOxzc6A', 'review_id': 'xSNdfJlY_YLl7md0b2X0Ow', 'text': 'Grotto ristorante was one of those carefree yet elegant dinner spots.  My husband and I went there a date night dinner and the experience was awesome!  The service was amazing!  Unfortunately I forgot the name of our waiter but he was excellent!  I had the the chicken Romano and that was very well made!  My husband had their signature veal dish and he devoured it!  Wonderful meal and great price!', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2012-11-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SEXzOpyrvhgi4Fk_3478wA', 'review_id': '8Z4MNh9WaVwz5UXlUzlCkQ', 'text': "Our family love Grotto! We always come here to eat when we visit  Vegas. Service was always consistently kind and food was always excellent. Last night a busboy dropped a small sauce on my daughter's jacket by accident and the manager came to apologize; didn't charge us the entire dinner; and even washed the jacket spotless! What a lovely people! Thank you so much!", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2012-12-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hb5-czbQDXgOg6YRyiYJ8Q', 'review_id': 'gdAoRTHZg_4sEIEptnxBdw', 'text': 'Absolutely one of the best places to eat and drink downtown! Great bartenders, great food, and a fun atmosphere!', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2012-12-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Yz5sgWyDo8EmWQThEUPQXA', 'review_id': '8dN3oXrcIurdpN7wcOVdeg', 'text': "We sampled pastas and pizza when we came to the Grotto.  The pizza crust was nice and thin, with a good char on the bottom and crispy texture.  The pasta portion was hearty.  Wine prices were very reasonable, as were cocktails.\n\nI will say if you want Italian, this is a very serviceable option.  It likely won't blow you away, but the food was well above average and it's worth the price.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2013-01-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SoBDDrsqyYNr7SjpUYz6jA', 'review_id': 'xAuQONRvAh58C2wfpNEbYg', 'text': 'Service on a Thursday in early January was slooowwwww! \n\nWine was good, spinach and pear salad was enough for two to share and fabulous, bread and olive oil, yummy. I had the very tasty ravioli alla vodka which was excellent. Another diner at my table ordered the penne con gamberi al limone which was a bit too lemony for my taste but if you like your hot pasta lemony then go for it! \n\nI would eat here again but the service needs to be a bit more attentive.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2013-01-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7f5m_rFkM0CKl6PJjxqDDA', 'review_id': 'NGb8BD1aYNlfvonJYSCkAg', 'text': "Sat at bar for a sandwich.  Bartender was very nice.  He recommended a good draft beer.  Ordered a sandwich then looked up and saw the B health rating.  Hope I won't be hugging the toilet tonight.  (I subtracted one star for health rating)\n\n**note....3 days later and no sickness!  WOOT!", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2013-01-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JyhzaOk3Rpu5T2VULLh8CQ', 'review_id': 'aXGnBOLRBPTDrEzV9lNtvQ', 'text': "Although the food had excellent flavor, 2 out my group of 4 had severe food poisoning. I myself had the Lobster Bisque, which had excellent flavor but had a tiny amount of lobster in it. The two that got sick had their pepperoni pizza and the lasagna. Didn't expect to spend the last day in Vegas recovering...\n\nPrices were fair and service was great.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 2, 'date': '2013-02-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'EqCn5pUX79BvLhFVzZa9VA', 'review_id': 'ttjOoV2nnaCfwk2E0VpD0Q', 'text': 'Friendly service, all of the Italian favorites. Great bread basket and dipping oil!', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2013-02-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '3jOqmdi_wz6VsNd7Benmmg', 'review_id': 'S8H5tUitJxZ_DlryTn3kIw', 'text': "Best italian food in Vegas in my opinion and I live here. I know it's a chain I have eaten at the one in Houston before as well and it was equally good. \n\nSit on the terrace if possible it over looks the pool and shark tank its relaxing and romantic. \n\nTheir fettucini sauce is delicious, so is their lasagna and their cheese cake is so rich and tasty! Great wine too. \n\nWe always bring our friends here when their in town & it never disappoints.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2013-02-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fnxCtGHRzwJNynRTwipSIA', 'review_id': '--aXmPARoxq6f3ZvW_si-w', 'text': "Had high hopes in dining here last night and was overall, disappointed.\n\nMaking the rez on Open Table and getting in was not problem.  \n\nI ordered a pizza and was served a good looking, luke warm at best, limp one.  I showed the server it's lack of warmth and it's lack of crispiness - he apologied and took it away, only to bring the same pizza back it's now too-hot-to-touch plate.  They did not redo it, but warmed it, making it more limp.\n\nTried to eat a few pieces with knife and fork.  Not too bueno.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 2, 'date': '2013-03-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_qnExwSmynEIsQ4FmyAYnw', 'review_id': 'FoKZ2lq4Ta7AioB7hd7Gpg', 'text': "The food is good. Don't get the antipasto. Very plain, too many olives. Sat at the bar, service was not great. Over priced.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 2, 'date': '2013-04-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '38JK-SfO9NkAGs1RwlH2Gw', 'review_id': 'L7J0XD8R6T0oJmo5u3sqSQ', 'text': "This restaurant's happy hour, running from Mon-Fri 2-6PM, features $5 martinis and bellinis plus $7 pizzas. My wife enjoyed a pair of bananas fosterinis while I found happy hour bliss by ordering a lemonade (spiked OF course) and a pomatini. We will be retuning soon for a pizza and the house peach bellini.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2013-04-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'm_LdsvZiCLcRODZj_YOUzQ', 'review_id': 'Yz8iSuHbkbpMFSE5GhUNeg', 'text': "Worst dinner ever. The food took hours to arrive and they messed up every order. And, for some reason our server kept laying his dick on the table and laughing, despite how uncomfortable it made us. After the fifth time I asked to speak with the manager. It took the manager nearly twenty minutes to come to our table and when he finally arrived his dick was hanging out of his pants and all of the servers were snickering around the restaurant. I told the manager that my wife and I didn't find any of it amusing and our 5 year old daughter shouldn't be subjected to such vulgarity. He then insulted my manhood and asked my wife if she were in need of a real lover. That being the last straw, we asked for our check. I still tipped 20% because I'm a decent human being, but as we left, all of the male servers were swinging their cocks like pinwheels and taunting my family. Needless to say, we will never return.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 1, 'date': '2013-05-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-UqbUgAO8kG8II1aBjkheQ', 'review_id': 'OTQiRabIbgXmIVD0idq1uQ', 'text': "Decent Italian American food but nothing really authentic or memorable.  Pasta was kind of bland but I'm very biased since I travel to Italy on a fairly regular basis.  The bar staff didn't seem too enthusiastic but then again I think one of them was from New Jersey and people from there usually strike me as odd and/or irritating.   Oddly the power went out during dinner and the smell of smoke from the pizza ovens started to stink up the bar.  Would skip this restaurant and check out the steak restaurant at Gold Nugget instead.  I heard really good things about that place.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2013-05-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IocuVfhBSL997a0RzXR0ow', 'review_id': '6WCzT7sTPvResKbKS2jSDA', 'text': 'Excellent salads, nothing like we have ever experienced, and wonderful pizza.  Dessert was also very good.   Very impressed by the service also as it was wonderful.  An excellent dining experience was had by my husband and I.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2013-06-03', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'E6JVr7Pxox2ZbN7t85H2Bw', 'review_id': 'gD081pJdLqXjuRxRu7M_AQ', 'text': 'The food\'s actually pretty good. The service, however, is not.\n\nWater was not refilled for the entire meal. Four water glasses sat empty for literally an hour. Other empty glasses from wine and soft drinks were never picked up. Not even after the bill arrived. The empties just sat there.\n\nOur server was loud and sorta cocky. Which actually can be an asset in some cases. But this guy couldn\'t pull it off...and, based on our experience with him, he had no justifiable reason to be so self-confident in his style.\n\nFood, though slow to arrive, was pretty good on the whole.\n\nHalf of the table enjoyed salads and they were quite flavorful, particularly the mixed greens with beets, pears, and pomegranate dressing. Very nice.\n\nThe cannelloni was out of this world good. The portion was only two noodles. I could\'ve eaten a thousand. Fantastic!\n\nThe least successful entree at the table was a pizza, which had a droopy, limp crust, sparse toppings and little cheese. If  you go--and that should be a BIG "if" in my estimation--take a pass on the menu\'s pizza section.\n\nAfter such good food, I was ready to forgive the lackluster service. But that\'s when Mr. Cocky Server came back and took our final drink orders: a couple of wines, a coffee, and a refill of Coke. "Got it," he said, "two Merlot, a coffee, and a snort of coke." WHAT? Who says that? I wanted to kick him in the nuts for fucking up a perfectly good meal with friends.\n\nThe good food is not worth the awful service in my book. I\'d rather go to an Olive Garden. At least the server there wouldn\'t cap off the evening with narcotics jokes.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2013-06-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vT1nQLUcN_IRyD3Kh1oxUQ', 'review_id': 'JZbwoCtS0OAn-RBjoEmXhA', 'text': "we ordered room service, 3 pizzas, under $60.  VERY thin crust, and not crisp at all, very doughy.  my sister LOVED hers, but maybe it's because she hadn't really ate that day.  i ordered a triple cheese, and it had barely ANY freakin' cheese.  whatever.  I think they try to make gourmet pizzas, but Portland and Salem have sooooo many good pizza joints, that this wasn't even close.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 2, 'date': '2013-06-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DKrdRjYQko2Ldk-iAG7r5g', 'review_id': 'hUIneI2SwZAkPtXCH_og0Q', 'text': 'Server attention very lacking, busboys attentive, eggplant parmesan very chewy, spaghetti very tasty, jumbo prawns were medium size shrimp at best and would bounce off your plate from being overcooked. Would only come back for pizza or spaghetti at the bar.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 1, 'date': '2013-06-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'Gw7hdJwm5-PImSFaz3L-9w', 'review_id': 'rvrYTEbM7lrhjzwE832vTw', 'text': "Nestled inside the bustling Golden Nugget Casino and Hotel, this Italian eatery boasts the staples, like pizza, chicken parm, caprese salad...you get the gist. Though, I usually appreciated open quality of all the restaurant casinos in Vegas, this spot was a little too open to the guests moving in out of the Golden Nugget. It's no shocker when people are havin a good time in Vegas. Even being drunk at 2pm is a normal circumstance. I guess it's just not always appreciated while you're trying to enjoy a nice midday salad. Especially when you are there at the restaurant to escape the craziness that comes in out of the casino.\n\nDon't get me wrong, I realize I need to stop by belly aching. It's Vegas after all: I just need to get used to it or get out; however the interruptions were incessant. If the restaurant was just a tad more closed off, it would be a quaint restaurant with actually very delicious food. In fact, the pizza sizes are generous and the Italian Chopped salad is topped with a lot of grilled chicken. The server was incredibly nice and patient with my parents who can be a tad overwhelming with requests.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2013-06-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': 'ky5-rv7r3nnbnRuA_m3UZw', 'review_id': 'KWo2cjTBluPGZRGwJpzc2w', 'text': "Excellent dinner and even better service! The kids loved their spaghetti and meatballs. The dang meatballs were the size of softballs and very tasty! We shared the seafood pasta which was outstanding as was the lobster bisque. Oh, and the bread.....the best I've ever had!\n\nA real surprise for a hotel restaurant!", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2013-07-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1hcOLNZNSuRAW2jguhNX9g', 'review_id': 'Pte-24EdFjuKNwU6G7gY7w', 'text': 'good pizza', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2013-08-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2K2iIJkvmwtzj2z6jzoLHg', 'review_id': 'F776dxicz0hMXvvXd2dU-A', 'text': "We had dinner here and the food was excellent and the service couldn't have been better!\nThanks Jose! \nWe will be back for sure.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2013-08-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': '4YABK3YTNflyjBBSaALuRw', 'review_id': 'V3BIBbEkZR_IKCMTEsmP9w', 'text': 'Been here twice, once with group of 4 and another with a group of  6.  Service was great and food was yummy.  I enjoyed the pizza made from their pizza oven and the spinach pear salad.  Chicken parm is huge with side of angel hair - delicious!  Also snaked a bite of the steak panini and stole a fry from my neighbor, very good.  I would say the only drawback to this place is looking out on the pool in the middle of a work day thinking that it should be you with the bucket of beer next to you soaking up the sun.  Check it out for sure.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2013-08-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zMvITbo-0Brz5WGs0UiO1A', 'review_id': '2B4G65pKr_2qXm0yx81ZhA', 'text': 'Great dinner! Great service!  Excellent salad!  Awesome flat pizzas!!!  Will definitely be back.  Almost ate there twice while in Vegas!', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2013-08-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'eA4vcob3uk4L_MpNJkYS7g', 'review_id': 'Cbbl6BMG2AzGurWM4iut9w', 'text': "This place is a diamond in the rough (and I use rough jokingly) the Golden Nugget is beautiful and up-to-date. With that said this authentic Italian restaurant was so good I had to create a Yelp just so I could share. \n\nWhat we had:\nLobster Bisque = 5 Stars rich, creamy with chunks of fresh lobster \nMeatball Appetizers = 4 Stars original Italian meatball, very good, I would of liked more herbs and spices but still a delicious meatball\nCheese Tortillini = 5 Stars beautifully plated, delicious pesto sauce, pasta cooked perfectly \n\nI agree with another yelper about how it's openness in the hotel allows for whoever to walk in and out so you get people who may already be intoxicated walking up to have a cocktail (we had a somewhat loud table near us) but hey it's Vegas and we chose to sit in the bar section....I'm not complaining personally just stating. Didnt take away from the decor and food though.\n\nExcellent service (Tony) who was knowledgable about food and drinks, friendly, and attentive. Even brought out the desert tray at the end but we were full. If your in the area definitly check this place out, worth the $", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2013-08-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '47fjpJpW3HrFpZpdE2OnSQ', 'review_id': 'yJfwiFlEX-k1fIROlz5EtQ', 'text': 'Awesome pizza!! Nice and thin crust with fresh toppings...great place hid inside the Golden Nugget...u will not be disappointed coming here to eat.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2013-08-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'YHyXm2325E6spmnDJW6FPw', 'review_id': 'OQKHEY0E13-yhrRaHBmS6g', 'text': "I was staying down at The Plaza for a week long event and was dying to get out of there.  So my friend and I took a stroll down Freemont Street and happened upon the Golden Nugget.  We cruised in and found the Grotto.  Italian food...PERFECT.\n\nIt was a Tuesday night but it was very crowded.  We were seated within a few minutes and the gluttony began.  We started with Stuffed Mushrooms...always a perfect start.  We ordered a bottle of Reisling Wine...can't remember which brand but it was good.  We both left with a little buzz and that was even after we ate so much.  Next we moved onto the Tomato Caprese Salad...delicious.  \n\nFor my main course I ordered the Penne Diavolo and my friend got the Seared Sea Bass.  Both dishes were superb.  And what meal wouldn't be complete without a little Creme Brulee to top it off.  Our service was excellent and the food was wonderful...by far the best meal I had my entire stay in Vegas.\n\nWe had to walk around Freemont Street to keep from going into a food coma but it as well worth it.  I'll be back here again the next time I'm in the area!", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2013-09-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 2}, 'user_id': 'Iu3Jo9ROp2IWC9FwtWOaUQ', 'review_id': '3WlXAvX0zJnqzSLcOslIvw', 'text': 'We decided to give the Grotto a try before a play in the Arts District.  As Dana said in his review, this is pretty standard fare in an over-priced casino restaurant.\n\nFirst our iced tea orders were taken and we were brought some slices of standard Italian bread with a container of olive oil for dipping. \n\nI ordered the special of the day, a risotto with lump crab.  My wife ordered the Pollo Romano, a chicken breast--"Romano crusted chicken scaloppine" and served with penne in a sugo rosa.  My wife\'s chicken was very good but there was more of a breading taste than romano to the chicken.  The penne was very bland.  A little salt helped that along.  My risotto was good and there was a fair amount of crab meat.\n\nWe shared a slice of mezza notte chocolate cake.  It\'s very rich and very good.  Lots of chocolate drizzled with chocolate.\n\nService was good.  Iced tea was refilled and the server took my Landry\'s card early and linked it to our order.  \n\nWhile you can sit along the windows by the pool, I didn\'t push for that.  The one table remaining along the window had a large man with a tattooed back almost pressed against the window.  Needless to say, that wasn\'t a view of the pool I wanted to have.\n\nThe place is quite noisy from both music, table talk, and people walking through this way to go to the Rush Tower or back the other way.  It wasn\'t a detriment to the dinner--just an observation.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2013-09-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'wY05e7eTtMLvkg0bcZ6zwA', 'review_id': 'hKO6QrGmrY3XCJWzvR4F4A', 'text': "Review for happy hour only. It's decent, though the drinks are not as cheap as I'd like to see at a downtown happy hour. Wells, wine and beer for $5-7. Our pizza was cold when it arrived, but it was only $7 so I'm not too upset. \n\nService was alright, except for the pizza incident. Drink glasses stayed full and we hung out for about an hour and a half and spent $40. Not bad for a weekday afternoon, I suppose.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2013-09-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vkHRDod6IwAOpUpf5Rsqmg', 'review_id': 'gijWJRbjZq2Po1mlnHrd9g', 'text': 'This restaurant has good food but a little high price for the amount of food. \nThe food was tasty and bread was freash and warm but could not get balsamic vinegar for dipping. Kinda strange for Italian? ???\nNow the waitress was friendly but she was very slow and the restraunt was empty. They seem to only focus on happy hour. Kind of a shame due to we were paying way more and getting the meal portions.\nIf your in a hurry eat somewhere else but the food here is worth the wait.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2013-10-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '_2tmeYYPWU5sX3bEoSqf6w', 'review_id': 'r4OCYiSoTZEoGVgb4o67UA', 'text': "I am not even comfortable giving this restaurant one star! The most horrible service I've ever had! Food came out late and our breakfast potatoes were cold. Server never came back to check on us until it was time to bring the bill. When she took our order, she completely forgot about one of the people in our party. It wasn't that busy either! She spilled coffee on the table and in the water glass. Did she bring back fresh water? Of course not! Over priced, horrible food, AND bad service. Will definitely not be going back.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 1, 'date': '2013-10-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WFC8ewL_YraG3WqKwYm-bg', 'review_id': 'n5zoDxZ_9npAE0T_5nQwOw', 'text': "The lasagna!!!! Don't the 5 stars say it all!!! I just wish I had a frig and a microwave in the room. The grotto salad is fresh. The bread is so soft and delicious. The fried ravioli dipped in the marinara!!! \nGolden Nugget, Las Vegas, the Grotto, the best. \nAlso, Monique was a great server. Very attentive, and funny and informative about what was going on in Vegas for the weekend.\nWe will always be back.... At least 3 times while we are in town:)))))", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2013-10-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': '7oJa9gaIzIqdLLXdyNpGNQ', 'review_id': '2xb1qzPvuqlqjGfEAGARzw', 'text': "We had my Aunty's 80th bday party here Saturday night we had a group of about 36. This is located inside the Golden Nugget in Downtown Las Vegas. it was a set dinner course I had the breaded chicken with penne (can't remember the name) w/ a Caesar salad and dessert Strawberry cheesecake. Service was excellent here we had 4 people catering to us and all four of them were outstanding my other Aunt and I were the special ones at the table cause on my meal i didn't want mushrooms and artichokes mixed with the sauce on my chicken so the guy put the special order for me and my Aunt didn't want the Strawberry cheesecake or the chocolate cake that we had to choose from so the guy brought her ice cream instead. Another thing was i dropped one of my med pills it was a very small white round pill so as i looking under the table for it with flashlight and all the girl waitress came over got on all floors to look for it way beyond the call of duty we couldn't find it luckily i had extra. She was a trooper going underneth the table and all. I would definitely come back here to eat again. Overall great food and great to see family that came from Ohio, Texas, and Hawaii. Sorry no pics i chowed down my food so fast lol.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2013-11-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GZPmUmnnH7rx3xUzF5vqwQ', 'review_id': 'ZVVOL4Jg0uQa90HKouGWQg', 'text': "Wife and I had dinner here and then lunch on the day we were to fly back home.  Dinner was wonderful.  We made a reservation and they were running a little behind, about 15 minutes.  They offered to take my cell # and call me when our table was ready.  It was ready right at about the 15 minute mark.  We received bread and water almost immediately after we were seated.  Kimmie, out waitress came over and introduced herself and took our drink orders.\n\nI cannot say enough about Kimmie.  The restaurant was very busy and Kimmie was a dynamo in action, but she took the time to answer all our questions about the menu and keep our drinks full throughout our meal.\n\nWe started with the bruschetta and it was delicious.  My had the spinach, pear and bacon salad and the chicken piccata .  I had the tomato basil soup and the veal kickerello.  The soup was outstanding.  Creamy with a ton of tomato flavor.  The veal was tender with a touch of lemon served with fettucine alfredo.  The salad was good, my wife didn't care for the balsamic dressing, but Kimmie was happy to replace it with the house Italian.  The chicken piccata was very good as well.  It came with angel hair pasta and sauteed asparagus.  The asparagus was a little tough, but tasty.  I don't remember what is was called, but we had the angel food cake with strawberries.  It looks impressive and tasted out of this world.  I nice finish to a great meal.  \n\nThe tomato soup was so good we had to come back and try it again along with one of their pizzas for lunch.  We split a pizza and a meatball panini and both had a cup of the tomato basil soup.  The soup again was great.  The pizza was thin crust and crisp on the edges, but just slightly not as crisp as I would like in the middle.  The meatballs were tasty, but I would skip the panini next time as it was just OK.  Service again was outstanding.  I wish we had a location of the Grotto near us as we would be regulars.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2013-11-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '53nLX7Y4cTt87UPckhBoPQ', 'review_id': 'tCJqexBnS26SVnXbHQrCSA', 'text': "My husband and I landed here for dinner last night. We were looking for a good place off Fremont that wasn't super expensive. We found it!\n\nTheir bottles of wine are cheaper here compared to other Vegas restaurants. Cakebread was $84 instead of the usual $100. I didn't really compare prices on the rest of the bottles. \n\nI got the ravioli alla vodka, which was $16.99. For how much I got it seemed a bit high in price to me. However, my husband got a fettuccine dish that was huge and only cost a dollar more. So, I guess the value varies depending on your dish. Both dishes, however, we're delicious. \n\nOur waitress was very nice and checked on us regulalrly. She was also knowledgeable about the menu (which is quite extensive).", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2013-11-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'DAyniYbaa9XALkLGQs32FQ', 'review_id': 'R_TQG2qK7kbLcsTPRc4ctg', 'text': "Sat at the bar for a quick glass of wine and to order some food to go. I ordered A glass of red wine. It was good, i don't know if it was worth 9$ a glass though. The bartender seemed a little mad I wanted half spinach, half romain on my Cesar salad. I'm picky, but I am nice about it. We ordered the spinach pear Gorgonzola pizza. It came out cold, and wasn't that amazing. Probably wouldn't come back.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 2, 'date': '2013-11-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'ppnYDdjSchFmwKFCcyqmQA', 'review_id': 'w2BT7KxuM8bp-2fQRT9lVg', 'text': "Food is good but the wait staff is VERY SLOW and the Hostess is RUDE'. Won't go back.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 1, 'date': '2013-11-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9TfxiASay9fKiS0XqffSAQ', 'review_id': 'KVV_XPY5yHJU2Cy5ycDLWQ', 'text': "I was a bit concerned about the quality of a restaurant in the downtown Vegas hotel, but Grotto has given me new confidence.  We were received by a friendly hostess and seated a nice table overlooking the pool area (night-time).  Mark our waiter was very friendly, funny, and helpful.  He answered any questions about the menu and was particularly helpful with the wine list, noting several affordable options available from a recent event, not on the list.  Service was great throughout the meal and the food was very good.  We mostly had pasta dishes, which were all delicious.\nI'd definitely recommend it and will go back next time I'm staying downtown.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2013-12-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'C6fplX71G3jypY1xljB8OA', 'review_id': 'GJBJdSKSn-fJLljz1DpXPQ', 'text': "Happy Hour... Pinot Grigio at $5. and pizza at $7.is a very good deal, and quite good.\nCalamari... as good as it gets, and a huge portion (enough for a meal).\nLasagna... we thought as close to the best we've ever tasted.\nRigatoni... this was in a garlic cream sauce with diced tomatoes, roasted red peppers, and sweet sausage.  Deeelish!", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2013-12-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ekZTElftEi0vnbKAjMrf3w', 'review_id': 'U1Jw_v3ZD8uBxdcLDuYQ1g', 'text': 'Both service and food were good.  Sat in the bar for Sunday football and the waiter made some great suggestions on what to order and never let our drinks get empty.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2013-12-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5EnanuUMHxevr5R8ORM0Xg', 'review_id': 'd_kWFZ5dj4NCawSY5ZdiDQ', 'text': u'We went here christmas eve before seeing Gordy Brown.  Honestly our expectations were quite low and Grotto blew them away.  I was in a group of 4 and we decided to do family style and get a pizza that was great and chopped salad for an app and then two entrees--chicken parm which I get at almost every italian place and it was excellent and we got the garlic shrimp that was just fair.  Our service was great and the creme br\xfbl\xe9e dessert was amazing!', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2013-12-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6S1EpP_RB40jtaonD7hxxQ', 'review_id': '4sBR0e-Go4yolPTIIXEHfw', 'text': 'In short, the Grotto was about as close as you can get to fine dining near Fremont street.  My wife and I split the Mahi and Lobster Bisque.  Both were fantastic.  \n\nI asked if there would be a plate sharing charge, the waiter says, no, we just require a smile.  They split the bisque into two smaller bowls and they did the same for the dinner.  \n\nEverything tasted great and the service was as expected.\n\nThey brought out the dessert cart, which included chocolate cake, a cheese cake, a 7 layer strawberry wedding cake and espresso with biscotti.  We had to pass because we were full.  Next time we will get you, dessert cart.  Next time.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2014-01-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '1JqdJd9BGDBIztOQlVjhyg', 'review_id': 'ZXzh0Q6JVORscBabbxWNFQ', 'text': "Ate here twice while in Vegas in December (we stayed at the Nugget).  Very good food.  Try the pizza. It's amazing.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2014-01-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'v7nlFZnsOb_ceoGYz7b97w', 'review_id': 'bG97RKge4mh0Bad3GaH3Bg', 'text': "This is a upscale Italian  restaurant  with wide range of dinner options . The wife and I split a Caesar salad , one othe best I've had and the wife.agreed. Then we had the calamari app very good served with a red gravy ( marinara ) We then had a wood oven pizza that was delicious but this is we're the the only negative I have to report on. We order a proscutto pine nut and artichoke and got a  chicken goat cheese. You think You would notice right away but the red onion and shredded chicken impersonated proscutto and artichoke at first take.\n\nLong story short the waitress knew it was the wrong pizza and asked if we wanted another pizza . We said no that this was fine. We thought  they would have comped the pizza on our bill which they did when we told the waitress she should do something abouther mistake. I know she asked us if we wanted another pizza and we said that this was fine . We were simply being accommodating and didnt want to wait for another pizza to cook . \n\nSo caesar salad $ 9.99 , calamari $11.99 wrong pizza $17.99 total bill $ 99.59 oh yes there was four alcoholic beverages  involved. Why has Vegas decided that a martini should cost $15.00 bucks. I guess because we the insipid consumer will pay for it. I'm just saying we are collectively the problem with over priced booze concert tickets sporting events etc...\n\nSummary, the food is delicious the service was good  and the booze over priced. They have happy hour mon- fri 4 to 7 with half priced pizza and $4 beers . Good time to go..", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2014-01-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yqMjaKMXsrDNSK1k_TNC2g', 'review_id': 'o2Vo4iQklK2DMhjX157lZg', 'text': "It's in the Golden Nugget but it had awesome food.  Friendly waitress though she forgot our drinks twice. Had the fried ravioli which was very good and the Chicken Herb Pizza that was a okay.  Wish I had got a pasta fish or the recommended lobster bisque.  Still a good choice if you're down on the Strip.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2014-01-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'wEJRsRDn_GT3Rj0qZUcv_w', 'review_id': '47ZkbzxZe4N11c-wnjLRjQ', 'text': "Phenomenal.\nI am quite the snob when it comes to Italian food, but this place is a gem.\nAfter walking around Fremont street for an hour looking for a place to eat, we stumbled upon this place and the exquisite aroma of the food is what drew us in. For a party of 5 on a Saturday night with no reservation we we're sat right away. \nWhat impresses me in any restaurant is a server who is passionate about what they serve and ours was just that. She was knowledgable about the wine and food pairings and recommended great dishes. \nAntipasti- 5 stars\nCannelloni Di Pollo- 4 stars\nChicken Picatta- 4 stars\nTiramisu- 5 stars\nBut what blew me away was the Margherita Pizza. Wow. Thin, crispy crispy baked in a stone oven. Just wow. And the flavor is to die for. I'd go back I Vegas just for this pizza.\nVery romantic seating, worth getting dressed up for.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2014-02-07', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 2}, 'user_id': '0vCEI3ZJF_gXgWHpcR7WtA', 'review_id': 'LexUWxS5HbkxQUBqH60ueQ', 'text': "Food - okay.  Service - terrible.\n\nWe stopped in on a whim on a Friday night after exploring Fremont Street.  All of the food around us looked and smelled wonderful, and we were starving.  If I had to guess, I'd say that the restaurant was about 80% full.  For this reason, I had no clue as to why the service was SO SLOW.  No seriously, like slower than I've ever experienced in my life.  The worst part about it is that the waiter never even acknowledged it or apologized until AFTER we paid the check!  \n\nMy advice would be to wonder in to some other restaurant on Fremont Street if you want a dining experience that won't take all night.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 2, 'date': '2014-02-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'qBBUvgh_KAQqUJZs7qwNwg', 'review_id': 'QwktYuvgq2uJrfh8CZ8sfQ', 'text': "Ben here at least a dozen times. Food generally very good. Pizza, pasta, chicken, even breakfast Joe's Scramble, all very good.\n\nAte corned beef and hash this morning. Now I know why it's called corned beef AND hash.\n\nRecipe: start with mirepoix, add green and red bell peppers, and potatoes. Then add 2 tablespoons of tabasco (really). Add cubed corned beef (good), drop two poached eggs on top.\nThis dish not recommended.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2014-02-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': '0L7J1aRYEB8fbO5X__M7lQ', 'review_id': '8oYYFdDlRrdiNRVrj7bjfw', 'text': "As far as downtown restaurants go, I think Grotto is pretty good.  Located inside the Golden Nugget, the bf and my good friend and her bf and I went there for Valentine's Day dinner.   Now, mind you, my 4-star rating does not mean this is a 4-star restaurant, similar to the ones on the Strip. \n\nFor the price, they give you a good amount of portions - definitely not trying to gyp you.  We shared the antipasto, stuffed mushrooms and the calamaris as appetizers.  All three were really good for what it's worth. \n\nI had the seafood pasta, which was very delicious.  I tried a couple slices of the pepperoni pizza, and I thought that was worth mentioning as well.  \n\nI originally ordered the Aqua di Mare cocktail.  It was in the color of Windex, and it tasted like Windex to me (no offense).  I asked our server if I could change it, and he was very nice and was happy to change it for me.  They took the cocktail off the bill, and I was happy to make up in tips for that.  \n\nI cannot give Grotto 5 stars because it was more on the lax-side as far as the clientele.  It could have easily been a 5-star restaurant experience, but most patrons dressed too casually for my taste.  However, if you don't care about these things, then go to Grotto!  Have a relax night out in downtown Vegas where everyone is just there to enjoy themselves!", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2014-02-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QXFU_bIPFX9X0o_LzrnteA', 'review_id': 'RfqzbM_zeNH7BRDr799yXg', 'text': 'Last weekend I stayed at the Golden Nugget and on Saturday morning myself and a few friends decided to go to your Grotto restaurant for breakfast. The restaurant at that time had two-thirds of its tables available and we were told that it would be 10-15 minutes to be seated. When we were seated it took another 10-15 minutes to be acknowledged and greeted by a waitress. Then when the waitress came to our table she mentioned to us that this was not her table but would take our drink order and have the waitress that was assigned to our table come to take out order. Another 10-15 minutes go by before we get our drinks - a tomato juice and an ice tea. We are now 35 to 40 minutes in and the waitress that was suppose to be assigned to our table has not even acknowledged us to take our order, so we grab a waitress to take our order. Within the next 30 minutes we watch three tables around us complain and walk out of the restaurant because they are not getting their food. We at that time also decide to leave the Grotto without being served. \n \nAfter we left the Grotto we went to the front desk to ask for a Manager to give them feedback on the bad service that we and others had experienced at the restaurant. We talked to a Sean whom I believe is one of your restaurant managers. He apologized and asked us to give the Grotto a second chance for dinner that evening and that he would take care of us because of our morning experience. My friend and I both took that as "come back and have dinner on us". So we did choose to take Sean up on his offer, we expressed when we sat down to our waiter the morning experience and that Sean was taking care of us (or at least we were led to believe he was). After the dinner we had mentioned we did not want desert the waiter came back a second time and said Sean wants to send you a desert, although we did not want the desert we received the desert. Then to our surprise we received a bill, not only were we mislead by Sean taking care of us for dinner but the compensation that he gave us for the mornings bad experience was a $7.00 desert that we did not even want.\n \nI was not happy - Customer Lost!', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 1, 'date': '2014-02-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'E6loaKH9RLOVleJmg-2EWg', 'review_id': 'BZ8aGli_pqX6eRdWKe9I7A', 'text': 'Best food in Vegas. I would rather eat here than anywhere else; the desserts are amazing!', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2014-02-22', 'type': 'review'}
{'votes': {'funny': 6, 'useful': 13, 'cool': 7}, 'user_id': '2_CDbZkNq_gDXXp3yB5N7g', 'review_id': '3WKjCDR4HSrFbuO3VfYvJQ', 'text': "Review #11\n\nI ate here last Wed, 26 Feb 14, for a late lunch & the food was superb, but my waitress was very inattentive to refilling my water glass & very offish towards me.  Then a male waiter took over for her but he didn't bother to ask me if I wanted water either & my glass was almost empty.  He also took a long time to bring my check.\n\nI give 3 stars for the food & 1 for the service.  The restaurant was hardly busy since it was 2pm & the normal 11am-1pm lunch crowd was gone.  So I don't know why the wait for my food was so long & my water glass was never refilled.  I left too nice of a tip for the service I received.\n\nMaybe another time the service will live up to the food!", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2014-03-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QSSrgOWOK9-CSEwiNqU7Vg', 'review_id': 'D3eiveKgHIraT8aJUsIoig', 'text': 'We had a wonderful experience sharing in food and cocktails with family an friends who attended our Vegas wedding. The Grotto staff accommodated out party very well, stored our cake on site for us and the wait staff was great. The management continually checked to ensure all was well. Not to mention the food was great. If looking for a place in downtown Vegas, check it out for comparatively reasonable Italian fare. If with a small group or couple, grab a seat by the pool viewing window.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2014-03-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'hG7tKFN-REC22Zm48IP-0A', 'review_id': 'KB-U0EAZoLTQXswlWwLuHA', 'text': 'Even though I spent 5 nights at the Golden Nugget during my recent vacation to Vegas, I didn\'t get around to trying Grotto until my last day there. And in retrospect, that\'s a shame, because Grotto was definitely the best restaurant I tried at the Golden Nugget. Grotto has a bit of a Olive Garden feel to it, but with slightly better food. And since I am a fan of Olive Garden, consider that a compliment.\n\nBut unlike Olive Garden, they do cater to the Vegas casino crowd by being open early for breakfast. This was first meal of the day at Grotto ... stumbling back into the Golden Nugget after a marathon session of brews and Sigma Derby at The D. Looking for something sweet and decadent, I ordered the cheese blintzes. I received four delicious, ample-sized blintzes with a side of fruit compote. I was happy and headed to my room for three hours of sleep before checkout.\n\nMy flight out of town wasn\'t until late that night, so after check out, I hung around Golden Nugget. After getting some additional rest and nursing my hangover poolside, I decided I needed some carby comfort food. So I went for round two at Grotto and settled on their Chicken Fettuccine Alfredo. It came with an ample portion of salad and bread - both good. The menu advertised homemade fettuccine, and the noodles were pretty darn good. The chicken was cooked nicely and tasty. The Alfredo sauce was a bit on the thin side for my taste, and could use a bit more cheese flavor, but it was still enjoyable. At $15, this was a pretty good deal for lunch from a casino.\n\nThe dining at Golden Nugget tends to shade towards pricy and upscale - what else would you expect from the parent company of Morton\'s? And the dining at DTLV tends to be either high-end or divey. Grotto is one of the few "in-between" options - they offer a reasonably-priced sit-down meal that is both tasty and a good value for your food dollar.. If you are looking something between the spectrum of fine dining and Fried Twinkies, Grotto is worth a try.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2014-03-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wGnocaAYTuBME2JNAs6k3w', 'review_id': 'gVuD3UfqS_D-2al2uTS5RA', 'text': "My family and I had a fabulous dinner at Grotto!  It was my birthday and we received excellent service!  Our waiter, Steven, couldn't have been any nicer and was very attentive!  I ordered the Herb Roasted Chicken Pizza and a mixed green salad!  Both were very yummy!!!  The rest of my party were very happy with their selections as well!  The night was topped off by a wonderful, huge slice of cheesecake!  We will definitely be back on our next visit to Las Vegas!!!", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2014-03-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'jbqCWfF65QQ4bEkyc3w3_g', 'review_id': 'H0Mndg6_yUBV7yIwfh0mrA', 'text': "Been here a couple of times for decent italian fare. Stopped in for a pizza and beer on on a Friday afternoon. The pizza is a thin crust cooked in a wood fire oven, and is delicious, and the beer selection is decent. The service, however, is where we have a problem.\n\nI found our server to be inattentive, scatterbrained, and borderline rude, all in one service. I've beed served by her before, and noticed some of these attributes previously, but this time, I'd had it. My wife and I ordered a beer and a glass of wine respectively. These took what felt like an eternity to bring to us. Once we got our food at the table, she flat out ignored us, failing to check up on us once. I'm sure the manager would be unhappy to know she lost 2 more beverage sales as a result. I know we weren't a high ticket table, but that doesn't mean you can give bad service. What was more annoying is we got to overhear how personable she could be while serving the two ladies at the adjacent table. When check time came, she dropped it and vanished like a vaudevillian magician in a puff of smoke before I could hand her my Landry's Select card. When I gave it to her, she acted as if it was a huge pain, and I should have told her sooner.  How could I? She was damn near avoiding interacting with us!\n\nNow, I know there are two sides to every story. Usually when I read complaints about servers, I am open to the possibility that there is a reason the reviewer got bad service. Perhaps they were rude to the server, smelled bad, who knows. Let me tell you, I was raised to respect what a shitty job waiting tables is. I say please, thank you, and appreciate the grind. My wife is the same way. So I can honestly say that the attitude was totally unwarranted and from left field. As a result, I left an appropriate 15% tip and bailed. I will be sure to not be seated in her section again.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2014-03-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Me32-A1PVmhdt92HV2E42A', 'review_id': '1wj3-TT-Lw8Ix99bD078RQ', 'text': "The sea bass was amazing!  Served with asparagus & corm salsa.  Yummy!  The $5 martini's were delish as well!", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2014-03-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'wga9TNeb7YK4wTW5m-wgvQ', 'review_id': '9Ndu4DpWi-swLXXW_itMfA', 'text': 'Stayed at the Golden Nugget this past weekend and happened to eat at this place inside.  It was really delicious.  We ordered the pepperoni pizza and caprese.  The ingredients were fresh and I love, love, love the super thin crust on the pizza.  My husband and I split both items and there was nothing left.  Service was excellent, even on a Friday night which was extremely busy.  Yummy, recommend if you like good, fresh Italian food.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2014-04-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'S7ULuL2KJHdgjGS0WWaA6A', 'review_id': 'N0iXyuXZdi1tAN_OEOB7HQ', 'text': 'Not impressed, my dinner was bland, the mahi was over cooked, shrimp were good, I would pass on this place, cute if the shark tank was the only redeemable quality to dinner', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 2, 'date': '2014-04-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_r7_5ESQWxausEs4frScqQ', 'review_id': 'I9VQrK9ZMrntOGuQ6UAbrw', 'text': "Wife and I decided to see what Fremont St was like in the day, so we parked at the Golden Nugget and recently read online that Grotto was a pretty decent place to eat with reasonable prices.  They lived up to my expectations and exceeded.\n\nFirst off, Hugo was our waiter.  He was very attentive the entire time and very friendly.  I didn't have breakfast that day so I was wanting more of a larger lunch, so I ordered the Grotto spaghetti and meatballs.  Salad and bread first came out.  Salad was good, but the bread was amazing.  Very crusty on the outside and pillow soft and warm on the inside.  Then the lunch came.  The noodles were perfectly al dente, and the two meatballs on it were huge and very tasty and tender.  Perfectly done.  Probably one of the best pasta and meatballs I've had, all for a price that's not overly inflated like a lot of the other restaurants in the downtown area and strip.\n\nI would recommend this place to anyone looking for a good meal at a reasonable price around Fremont St.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2014-04-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Nn68SVDtJ8ET975G6Vlp5A', 'review_id': 'RPxw299_1o2MnQsjqRAPng', 'text': "This place has some if the best Italian food I've ever had. Our waitress was terrific, the drinks were delicious, the food was phenomenal, and the view isn't so bad either!", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2014-04-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pFpiW_WEttPFPmHOtJSsYw', 'review_id': '76KHy-vGJ2fOjLIpATNpxA', 'text': 'I ordered the Chicken Milanese salad. Half the items mentioned as the ingredients were either not there or just barely there. Service was good. Bread served tasted great until the second round when it came to the table partially frozen/ cold. My daughter ordered the ravioli and there was only 5 of them. The place is overpriced and over rated. Not enough on your order to fill a normal person.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 2, 'date': '2014-04-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'd-Z9PqSm8TwHfd1B-_pS4A', 'review_id': 'AlyzQY2x93_vJlcONOR-rQ', 'text': "There is nowhere else like The Grotto!!!\nThe food is simply awesome!\n\nTry the meatballs as an appetizer, they are so light and fluffy they are hard to explain.\n\nYou can't have a bad meal here", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2014-05-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'auN-ZfEfmIZth7NvByH1-Q', 'review_id': '3NHfbYmL96VUJYlm2aWRMA', 'text': "The food here is so amazing. Everything we tried was incredible. We were there on a Saturday night and the service was not bad at all. My only complaint was that it's loud, but as it's in the open there isn't much to do about that.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2014-05-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kvPY98QkHXi-aJTXbhc4qQ', 'review_id': 'ewkpUPHB_jYG-G6PAbVXsg', 'text': "Anybody who goes downtown must eat here.  We actually stay at the Golden Nugget in part because of this restaurant.  I was blown away to discover this is part of a chain. I find the food to be almost perfect everytime I come here.\n\nThe service and the setting are very good if not perfect. The food though is what steals the show at this restaurant. Every dish that you try explodes with flavor and freshness. I have been eating here for over 10 years and it is consistently 5 stars every time.\n\nThe grotto is not a good restaurant for downtown; it is easily one of the very best restaurants in all of Las Vegas.  They blow away most restaurants that are more than double the price. Get your Italian on and eat at this restaurant, you won't be disappointed.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2014-05-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'o5zDH8honGv8BieCsm9Tvg', 'review_id': 'JTQ0c4OWE7EAfFH4L1ItOw', 'text': "We had a terrible experience.  Our server was doing an OK job till he told us he had to go on break and someone would be taking care of us.  In the fifteen minutes that he was gone, not a single person came to check on us or clear our plates.\n\nThe bread was good and that's it. UGH!! I ordered the lasgna and honestly it ididn't even look, smell, or taste like real meat.  I sweat it looked like some kinda of mystery meat and it smelled terrible after i scooped it off the layers and set it to the side.  I felt sick after eating and all I had was the layers of noodles and the cheese.\n\nMy friend had some kind of pasta and said it was too sweet.\n\nPoor service. Terrible food.  Overpriced.  I will not be going back. Stay away. Try Trevi at Caesars--way better!", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 1, 'date': '2014-05-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'od4COF_-99N1GO9uZxbpJA', 'review_id': '675pAbHn1vuO_WI3AlcUpA', 'text': "We've been coming to The Golden Nugget annually for over 30 years. We were disappointed to see that the Carson Street Cafe was closed and Claim Jumper isn't opening until after we leave. We went to the Grotto for breakfast. What a mistake. 11.00 for bacon and eggs. TWO pieces of bacon. Is there a pork shortage or what?   $55 for three of us. The waiter was very nice which is the only reason they are getting 2 stars. Avoid at all costs. Mickey D's is right down the street.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 2, 'date': '2014-05-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jSJ1aZpx5XQ5rxU2Ov4BMw', 'review_id': 'SKTyqqtG11qB3NjnHKxuVg', 'text': "This dining experience was absolutely atrocious due to the service and ambiance.  Definitely not a destination dining spot.  If your next stop after Grotto is within walking distance, fine, but it's certainly not worth getting in a cab and driving downtown from the LV strip. \n\nIt literally took 35 minutes to receive our fried calamari appetizer unfortunately, it wasn't worth the wait since the dish was  overcooked (rubbery) and extremely salty. \n\nFor my entree, I ordered the Veal Kickerillo. The menu description read: Parmesan-crusted scaloppine with mushrooms & a touch of lemon served with fettuccine Alfredo. What I received was 4 small and paper thin medallions all the exact same size with 1 slice of a mushroom on top. I honestly believe there was more breading than veal. \n\nThe highlight of the evening was when a homeless women approached our table for money. Right in the middle of the dining room.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 2, 'date': '2014-05-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'eQSj2Pg6zlybas4UfipmrQ', 'review_id': 'qCXkeW_-x2-V_cMO8BoBgQ', 'text': 'Very nice upscale Italian restaurant. Great service and a fantastic menu to choose food from. There is so much to choose from. Every meal comes with fresh bread and olive oil.\n\nI highly recommend reserving a table in advanced due to high volume of tourist wanting to come for dinner.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2014-05-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CwUquy7CTLD5S5WWpr05Ow', 'review_id': 'ZLX0sRgfFtZBKIgu2k2fSA', 'text': 'Food was okay not super impressed, but service and atmosphere was great just wish it was more authentic for the prices. Would not come here again.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2014-05-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GIbLx4WZBJ2AclxLd2hUdg', 'review_id': 'o0rsy9FCfJsHaLNnkPc5NQ', 'text': "Went to grotto's at the golden nugget, it was so good we came back again and ate. If u come to downtown vegas you won't be disappointed here. Food, service and atmosphere is all very very good.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2014-05-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BkQyypcIKfObD107jzTm7Q', 'review_id': 'tjto2y63nYdXI3tXOkBBiw', 'text': "we happened to stroll by and decided to stop in for dessert.  we loved the view of the pool area and the desserts were amazing.  it was a very busy friday night but even though we were only having dessert the wait staff was very attentive and efficient.  we'll definitely be going back.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2014-05-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'RkNcFw5kgQHSmKrHbXKWEA', 'review_id': 'lI2uTXrqzlHAG0ti6UJPjg', 'text': "Everything was OK. I wasn't impressed with my options, but the others I was dining with seemed impressed and really enjoyed their food. The menu had a good selection. There is breakfast pizza that looked a lot better then my corn beef hash. \n\nMy only real issue with the place was the service. It started out really well, but then went down hill. Once we got our food we were no longer important enough. \n\nIt was a pretty place and a nice location in the Nugget between the casino floor and the pool.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 2, 'date': '2014-06-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'VFi9POhoB-7sprNBD9RZdA', 'review_id': 'uC1pT53syNp2pq0y56Ts-g', 'text': "We came to this restaurant on a whim after hanging out on Fremont Street, and it was one of the best impulse decisions made. The service was stellar -- even though we happened to show up while there was also a large party being served, the staff was very attentive to us as well as the other smaller tables. The food was excellent -- warm loaves of bread with garlic and basil infused olive oil for dipping are provided to every table, and we followed it up with perfectly tender calamari. Every person at my table had excellent reviews for our entrees, and understandably with a very large party ahead of us, the food was slightly delayed coming out, but honestly I've been to places like IHOP and waited far longer. Because of that little delay though, the manager provided dessert for free. \n\nWhich comes to the highlight of the dinner: the strawberry cassata. If you come to this restaurant you cannot leave without trying this Italian wedding cake or you're simply wasting your time. So light and fluffy and moist, I can confidently say it was the best dessert I've ever had. Every future trip to Las Vegas for me will include stopping at the Grotto for their strawberry cassata on my itinerary. \n\nSpecial shout out to Carol of the wait staff, such a lovely and enthusiasticand funny woman!", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2014-06-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4-YgRr_jzHq0nnCkPVSnfQ', 'review_id': 'k1sav17Bn42D_WCtwh8E9g', 'text': "Had lunch. So good. Sat in a table looking out at pool. Good people watching. Had tomato basil soup and meatball appetizer, both of which were awesome. Bread basket was great too. Perfect bread - crispy crust and soft middle. If I came back, I'd order that again. My husband's order was messed up, so they brought him some lobster bisque to enjoy while he waited for his correct meal. Nice touch. Great service. Not too impressed with the lobster bisque, but he liked his steak and Parmesan panini. I'd come back here for sure.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2014-06-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nQlVAsx3OT38pn6feoQGIg', 'review_id': 'GO-Vq2Aw-6t1Pf7xnhjLbw', 'text': 'We loved the glass room that overlooked the pool.  The meatballs were fantastic 5/5.  The Fettuccine Alfredo lacked flavor and was very bland 1/5.  The Penne Arrabiatta 4/5.  Service was excellent.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2014-06-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'q5GiLSNUscn1Rs1NpaG6eg', 'review_id': 'L2_Jc5U0xSywerfiiJVPFg', 'text': "OMG!! Been wanting to try this place for months!  Tonight my husband took me there for our anniversary dinner!  Best eggplant parmesan I've ever eaten!  You have to have the Hawaiian Margarita!  It's awesome!  They also have a great white wine selection!  Dry to sweet and all the ones I tasted were excellent!  Great Italian fare! Hubby got a lasagna and loved it. We started with fresh shrimp cocktail.....really fresh! For living in the desert it was superb!  If you find yourself in Vegas looking for great affordable Italian food look no further than The Grotto at The Golden Nugget!  You won't be disappointed!  Awesome wait staff and bartenders who mix a mean drink!", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2014-07-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'RoLYwDdG3Ep0HaFcm1-nGw', 'review_id': 'tSkmWW_du5wmficleINGtQ', 'text': "The food is awsome the meatballs are world class the chicken franchasise was amazing the bread is true Italian nice soft middle with a crust every thing about the food is amazing the service a little  slow  servers have to many tables and they a game with seating they leave open tables so that as guest walk by you think there not on a wait  then they make u make 15 20.minutes which ever one waits because you can't walk anywhere else", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2014-08-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9QG9k9DPfTSZ1D7eF6MjQQ', 'review_id': 'aFTPR5ztEzekGQXg6oorWQ', 'text': 'First of all our server, Kim did a wonderful job. I had the chicken marsala. It was a little light on the sauce for my taste but Kim quickly brought me extra. It was so good I ate every bite on the plate. Everyone in my party thoroughly enjoyed the meal. The bread was delicious and all the food was very fresh.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2014-08-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MnPtx5KJEuGwkOm_T5dPdw', 'review_id': 'dFNsjwnLC2PTdPGm_3zspA', 'text': "Came here with a group of 5 other ladies with reservations. We were a few minutes late but I called and they were very polite about saving out reservations. We were seated right in front of the swimming pool with the shark tank so it was a great view (although if you don't want to see half naked people while you are eating you might want to sit inside). \n\nWe had one drunk person in our group who was having a lot of trouble ordering (and comprehending anything). Our server handled it amazingly. He pointed out something he recommended so we ordered it for her. When he brought it, he let us know he would bring something else if she didn't like it. Luckily she LOVED it! The bread and dipping sauce was amazing. I had the spaghetti Bolognese and it was just okay. \n\nThe only time the service was noticeably slow was when we were waiting for our checks. The restaurant seemed to also get busier (around 8pm). \n\nThere was a walkway splitting the restaurant, so you do get some sketchy people walking by. But we didn't have any problems.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2014-08-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': 'MuF1JfULuUwed_QqYjQazg', 'review_id': 'bWboFqYW6qmTUWYlquI_1g', 'text': 'Came here looking for something sit down and a bit "nicer" as we were staying at the Downtown Grand. Both the ambiance and the food was just okay to me. Service was great, we had a nice view of the pool and tank, but I found the food at Maggiano\'s better and probably cheaper too! \n\nWe had the prosciutto wrapped sea bass over veggies/potato - the veggies were really good. I think my husband had the mistake of of asking for his fish more well done than seared coz then the prosciutto was over done (and kinda tasted burned/fuel) and did no justice to the fish. I just had crispy risotto and meatballs. Both were good but nothing to write home about or something I couldn\'t make myself. \n\nThe service really makes this place stand out. With so many places to try in Vegas, I don\'t think I\'d come back here anytime soon but it is a safe choice if you\'re pressed for time and are in the hotel.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2014-08-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ILldYvVupWZBHvQ1W4ob4A', 'review_id': 'Ya5E3DCNZxVCKBJ2-wtjaw', 'text': 'So we chose Grotto as our dinner location prior to a show at the Smith Center. The service was decent, but very quick (almost too quick, but it worked for this night because we had a show to get to). Our server was pretty good, but seemed to either have too many tables or get a little overwhelmed at times. The food on the other hand was very good. I had the Lasagna. I was very impressed with the flavor and it is definitely worth another visit. I give it a four on food alone. On the next visit if the service gets better, it may garner a five star rating.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2014-08-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'RLODsM-ZUBb_D26eo_ncwQ', 'review_id': 'ahlMthIC2NqTuB_R0R0m0Q', 'text': 'We were so impressed with this place! \n\nThe service was amazing. She recommended a great bottle of wine. We split an appetizer, salad, and dinner. All of which they served already split. We had an amazing view of the pool shark tank. Even though we were seated next to a large part the service never suffered. \n\nWe walked in looking for something for dinner and were torn between this place and RAW (sushi). We know we made the right decision. The bruschetta was wonderful! And it\'s large. Really more than enough for 3+. We split the most comparable thing to a dinner salad, which was more like a chopped salad. It also was more than enough. It would have been too big for one if ordered with a meal. Finally we shared one of the house pasta specials (the name escapes me) with roasted peppers and sausage. Again, it was great. \n\nThe pricing was better than anything you would get up in "new" Vegas. The service was amazing. My only complaint... It didn\'t come up on my search on Yelp. I just happened to stumble in. YOU MUST TRY THIS PLACE.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2014-08-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oq_zCkOGjCxIdEDR17BvEQ', 'review_id': 'BPYshrT1oxjK_RpfWimVZg', 'text': "I ordered the chicken piccatta. The portions of both the pasta and the chicken were tiny. I had far less food than the two children did after ordering off the child's menu. I left there still hungry. And this place is expensive.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 1, 'date': '2014-09-01', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'vU2JSQk_vBzqdJnD4wqRNw', 'review_id': 'lellUD9uIvNFhMWuTaaKRA', 'text': "Was staying at the Golden nugget and this restatement looked very appealing. The happy hour is what stood out. Was one of the only places in the casino with a good HH. We had the calamari for an appetizer and that was delish! We also tried their homemade pizzas and a pasta dish. Both were so yummy and we really liked that they make the pizza in front of you at the bar area. For our Drinks we had beers and bellini's....which I luv well made bellini's. They were tasty! Overall we were satisfied with decor, staff, and food! Highly recommend if staying at the GN!", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2014-09-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ILldYvVupWZBHvQ1W4ob4A', 'review_id': '9G5F8hOriUF5iW4YZ3bNaQ', 'text': 'We decided to go to Grotto again for dinner prior to another show at the Smith Center. This time it gets five stars. We arrived about 20 minutes late because of parking and traffic. We were sat quickly and told our server we were running behind. She was super nice took out full order and promised to help us make our show. Thirty minutes later we were on our way to the show. We had the lasagne which was very good. We have another show to see in about a month and we will definitely choose Grotto again.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2014-09-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WUAMo5YPBitBRUT4BFXcRA', 'review_id': 'jzq2uchUR8ECEdsPvf34-Q', 'text': u"I was very pleased with my dining experiences at Grotto.  I had three meals at Grotto over my Vegas weekend vacation.\n\nOn the first occasion I shared the house salad, Chilean sea bass and strawberry cake dessert with my fianc\xe9.  The kitchen split up our meals which were the perfect portion.  I'm not a fish person but I really enjoyed my meal.\n\nOn the second visit I went for happy hour and had a margarita pizza - yum!! Great drink specials too.\n\nFinally I had my wedding reception here with 26 guests and Grotto delivered amazing service and food.  I definitely recommend this venue if you are looking for an affordable (about $40-50 per person), intimate restaurant with various dinner options.  Guests were able to choose from 2 salads, 3 entrees and 2 desserts - all of which were very tasty!  Upon first visiting Grotto, I was a little considered about privacy because they don't have a private dining room.  Our party was set up against the back wall of the restaurant and luckily it still felt like our own special event.\n\nI'm so happy I went with this restaurant!  I basically planned my wedding using yelp reviews and if there's anyone needing a lovely setting for a large party, nice dinner out or decent happy hour, I strongly advise considering Grotto!", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2014-09-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'J1QAHLBeLMcmJHKldRsHpA', 'review_id': 'CL_8xN9I2v2yBJHZ1GHUjw', 'text': u"One star reserved as the prices are ridiculous. This is not a high end bar! It's a casino bar for craps sake.... That said. Friendly chatty bartenders are attentive and informative! I ordered Fire and Ice ( cinnamon whiskey , pi\xf1a colada mix and pineapple) yum! Very professional staff! Will be back for their Happy hour and some of that awesome pizza!!", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2014-09-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'mdEBj4exaptQsO3fHaXruw', 'review_id': 'NzUR1Gj8JK4Mnrv_KWpNog', 'text': 'The food was AMAZING!!!!!!!! Oh my gosh so good!! The service, however, was far from amazing. She talked badly about other tables that she had at the same time,  and got our salad and one of our dinners wrong. It took a while to get the right one, but when we did get it, it was really really good. Try the strawberry cake! Soooooooooooo good!!!!!', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2014-09-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Dj0Gj1G6uWW5vRJbi1CRjw', 'review_id': 'lS86pJbPBIj50tqqfeawnw', 'text': 'Great atmosphere and amazing pizza!  Eat here every time we stay at the Golden Nugget.  \n\n100 A++++', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2014-09-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vUr488Tnde9uuI2EVoGEig', 'review_id': 'cynLLW-mNz4fRTzENNE-cA', 'text': "Really awesome place next to the shark tank and the staff was really cool about reservations and finding us a table. The pizza and pasta was pretty good as well but not to die for. Fun night but probably won't go out of our way to go here again.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2014-09-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JaYSwBIeznoHrjgPkLVcDg', 'review_id': 'efdFR3ZMqfJI-yMmEhnh7Q', 'text': "3 people - weekday night.\n\nCrowded with a 45 min wait, so we opted for immediate seating at a small high table in the bar area.\nPaglia e Fieno, Spaghetti Bolognese,( I've forgotten the third entree) were all above expectation for such a highly affordable establishment.\nOur choice of the bar area turned out  good because it insulated us from the din of the main seating.\nService was slow.  Waitress failed to bring our soup before the meals were delivered, so we cancelled.  She was very apologetic, but then failed to remove it from the bill.  While we were waiting for the correction, the manager passed by to ask how our dinner was.  When we mentioned the error on our bill, he immediately corrected it, and took off a few extra bucks. \nI definitely enjoyed this restaurant, despite the waitress' shortcomings.  I will visit again. I will recommend.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2014-09-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'dI2_3qtH7KSjsY9SpiW_2g', 'review_id': 'vVi7e1-vnJSPmYW20DTzwA', 'text': "Food was great. Only 3 stars because you stare at gross people at the pool (you might lose you appetite) or people shuffling through the middle of the restaurant. It's loud and hard to enjoy your meal. 4 stars for the service we received.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2014-09-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'qcWgaSr2Txozm7BWCNQ9kg', 'review_id': 'R9VuvDuZ9Hl1qL8j7uFCQg', 'text': "We stayed at the Golden Nugget our first night in Vegas and decided to eat here for our first night. We wanted to watch the 49er's v Bears game and this spot was the only area that was not so packed (we sat at the bar). No we are not Bears or 9er fans, we're Seahawks fans and wanted to watch the 9er's lose (to which we did!) since the Hawks last this tragic day :( \n\nANYWAY, we had a great time here! The food was really good, a little pricey though. Our bartender was new, meaning one of his first days or something. He was very friendly and made us great drinks. We'll probably end up eating here again when we come back to Vegas, but not in the bar area this time since the rest of the restaurant  looked very cute, intimate, and romantic. Totally recommend this spot.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2014-09-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'B87PALJCXjeEpbuGaMkptQ', 'review_id': 'l4ahF1BlV0AY02PCFaHWKQ', 'text': "Went here yesterday (Wednesday) around 5 pm. After we perused the menu at the hostess stand and showed interest in the pizza-of-the-day, the hostess told us the pizza was only $8 in the bar because it was happy hour. Sweet! She pointed us to a table in the bar, where we sat. And sat. And sat. There were two waiters working the two tables next to us while completely ignoring us. One actually stood at the bar chatting with his friends. Seriously? After 6 minutes of being ignored, we left. There are lots of restaurants around, too bad you don't care to pay attention to us.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 1, 'date': '2014-10-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jx9GYxyB8KsQ8zBi0LdNcw', 'review_id': 'uN_pFSipxVWcHsMrALepRg', 'text': "Amazing !!!!!  Customer service was sooo good. Honestly one of the best places. We had a party of 5. And got two apps to starts sooo good. And then shared three pastas. Sooo amazing !  Meatballs to die for. Next time I'm in Vegas I'm coming back.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2014-10-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'E4gwM7YOGW0sK9p4s_w__Q', 'review_id': 'hRm9Au-J9z_9zrmxo_B01Q', 'text': "Second time here, second time I ate too much. Food is amazing, service is very professional without being phony. Food takes a little longer than the average restaurant, but it is worth the wait. The bread and olive oil/garlic dip is to DIE for! The Pear/gorgonzola pizza - yum! The soups are excellent. The best Moscato wine I've ever had (dangerously good, easy to forget it's alcohol) and the dessert tray....don't even get me started! This will be a MUST GO TO restaurant any time I'm in Vegas.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2014-10-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Bf_3lZAWvB3rclxGRuXpbA', 'review_id': '8k8xnbLYSjUqJOscR5hmvA', 'text': "This is a great Italian place to go to when you're downtown. They serve fresh made bread with olive oil for dipping. The pasta sauces are delicious, I recommend the spicy fettuccine with grilled chicken. The frozen Bellini is a must have!", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2014-10-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2iJJuezeIPJVtQqhOO4W7g', 'review_id': 'CGyYs_gSj3tHs0pCib8RFw', 'text': 'Golden Nugget is still awesome and getting better but the Grotto is weak at best. The pizzas are mediocre for the price. The sausage and peppers was especially sub par. Almost just a cheese pizza with tiny amounts of sausage and hardly any peppers. Will stay at the Nugget again because I love it but will not eat at the Grotto again.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 2, 'date': '2014-10-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'EcEFp7lUkCXw80HK81mmxA', 'review_id': 'CAY72z6ztpZSHSrVdr9ugA', 'text': 'I had the special pizza of the day ($10 to eat in, $15 to go), artichoke, garlic, tomatoes w/olive oil.  It was a bland dry cracker crust with gluey cheese and maybe four bits of artichoke in the center, very little topping.  It was horrible.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 1, 'date': '2014-10-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '910twvrpMYp12VLXO3bfxA', 'review_id': '8Se021nhVztIUlgr3cgehA', 'text': 'Overpriced.   Got lasanga and it was very small portioned.    Friend got the pizza and that was large.   Waiter was dull bland and boring. Gumdrop margarita didnt even have a gumdrop in it.  Not very tasty drinks. Lasagna was tasty even tho it was tiny.   Cool view of shark tank.    Waiter was a buzzkill', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 2, 'date': '2014-11-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7rHPLwGIRtPBy2ZmRxh7VA', 'review_id': 'fCWow0UEJMyY9xU-HuFLbQ', 'text': "Staying at the Nugget and looking for a nice dinner close by. Went to the Grotto around 6 on Monday. No reservation needed, although the place started filling up an hour later. \n\nService was a little spotty at first, but got better as the meal progressed. The fresh bread and seasoned olive oil was excellent. I had the Pollo Francese, which was just slightly overdone, but still good. My wife had  the Shrimp Griglia, which she liked. Just enough garlic to require a stick of gum after, but not enough to taste the next morning!\n\nThe best deal of the night was a Rigatoni Bolognese special for $10. Two of our friends ordered that dish, and they both felt they got their money's worth. \n\nOne disappointment is the inability to order a side salad with dinner. One of our party asked, and she was directed to the main salad menu, starting at $10. Missed opportunity, folks. You likely would have sold several salads at $5, but instead we kept asking for the free bread. \n\nIf you're looking for an easy, somewhat upscale alternative to standard downtown fare, the Grotto is a nice go-to in a pinch.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2014-11-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dXvmjgTH4d4T9hSnj_AhTw', 'review_id': 'x-UJNekOrPoyWVUqoqR8cw', 'text': u"Best Chicken Piccata I've ever had!!!! Actually one of the best meals I've ever had!!! Our server Darwin was awesome, very attentive but not intrusive. Part of the restaurant overlooks the beautiful pool with a huge aquarium in the middle.\nI will definitely be back the next visit to Vegas and Fremont. \nTry the Creme Br\xfbl\xe9e it's orange instead of the usual vanilla and surprisingly delicious.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2014-11-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2rQmHRrIjHAA-KkbgbFGeA', 'review_id': 'yqoxramwpNQuuMqhYTfgdg', 'text': 'My husband and I went here back in October. This place was amazeballs. He got the veal which was outstanding and I got a pizza which was also outstanding. I miss this place.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2014-12-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ITv8yEh025y_WRidwfuJeg', 'review_id': 'UdknOIZxL5jSHOfpLtYHJQ', 'text': "Small portions & expensive. Waiter didn't seem to know much about the menu or drinks. My specialty drink was suppose to have candy in it... It didn't. Lasagna was tiny.. Pizza was okay. I didn't mind it.. Nothing special tho.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2014-12-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '17-Su_PzFGJlCoEg9nIkyA', 'review_id': '850zWMkRDGqK4nmyQysHDg', 'text': 'One of my favorite Italian Restaurants of all! The Wedding Soup is to die for and the Chicken Cannelloni is superb! However everything on the menu is delicious!', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2014-12-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MhDlRiZwYABQnN7bbMQTGg', 'review_id': 'bH4BOYs2CUfPASVvO3g3cg', 'text': 'The bread is the only thing delicious here. Service was poor,, Cesar Salad taste rotten!! Fettuccine chicken was bland!', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 1, 'date': '2014-12-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'cChmAOxmJFqrznWpiJAQ3A', 'review_id': 'zdNP3JxYEvpGLVO2oJ0Uhg', 'text': "Excellent! came here last week with the bf because we were staying in the hotel and didn't want to drive to restaurants. it was christmas day so no reservations were needed. we got seated right next to the window so you can see the aquarium/pool. lovely view. \n\ni see some comments here about good the bread was, but that was probably the least stand out thing about this place. i had the rigatoni salsiccia which was BOMB!! the server said it was going to be spicy but i was like, please woman i'm asian i can handle any spicy food. and sure enough, it wasn't :( but still delicious. so many restaurants have bland pasta but this is not one of them. the bf had the roasted herb chicken pizza which is fair in size and sooo goood. the goat cheese was divine. oh yea and the lobster bisque!! might be the best one i've ever had!", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2014-12-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'TBWi-AuPTGCsnJmX8xLA8g', 'review_id': 'I3DmIGod7axVSTnBakiWSg', 'text': "My general impression is 'meh', which is sad, because the food was good.\n\nFor three of us we had the Calamari, the Meatzza and an Italian Chopped salad. The calamari was nice and cripsy.  The pizza was a nicely sized thin crust, they had crushed red pepper and parmesan cheese to boot! The Italian Chopped was by far my favorite. When you put bacon in a salad it becomes a game of 'Find The Bacon!'\n\nThe unfortunate part was the service. The bulk of the restaurant was empty, only the bar area really had any people in it.  We sat down, it took probably 10 minutes just to get menus. After that it took another 10 minutes for beers to be delivered. After that our waitress never showed back up after almost 15 minutes AND someone saying they'd go find her for us. Apparently they never did.  We moved to the bar. 15 minutes later our waitress came back out and proceeded to get in an argument with the bartender about which one of them screwed up someone else's bill right in front of several customers (including us) and also never even apologized for not having shown back up.\n\nI don't think I'd go back again even though the food was solid.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 2, 'date': '2015-01-12', 'type': 'review'}
{'votes': {'funny': 7, 'useful': 11, 'cool': 8}, 'user_id': '8dbRf1UsWp2ktXHZ6Zv06w', 'review_id': 'FOAqW1zMkFI-zljGXxR6Sg', 'text': "I was excited to try this place out, lots and lots of great reviews; the place is within the Golden Nugget and right across from the shark tank.\n\nWe had a reservation for a party of 14, and they were able to accommodate us, our server Denise was chatty and friendly, she asked where we were all from, it was an even split between California and Arizona. She even remembered most of our names, and she told us she was 63, man she didn't look it at all! Life has been kind to her.\n\nAfter glancing over the menu 1st thing that caught my eye, damn this place is pricy, for a bowl of spaghetti and sauce was 20 bucks, that stuff better be amazing!  Also on the table they brought out fresh sourdough bread and oil with spicy herbs, that was pretty tasty too, the bread was delish!\n\nSo after the sticker shock, I went with the Pollo Romano and small Caesar salda (additional 4.99 charge). The Caesar salad had crisp romaine lettuce, garlic croutons, a great tasting Caesar dressing and was blanketed in Parmigiano-Reggiano cheese. It was a great tasting salad,\n\nThe Pollo Romano, on the menu had great potential, it Romano-crusted chicken scaloppini with artichokes & Roma tomatoes in a white wine sauce served with penne sugo rosa for $19.99, I guess I should have really pay attention to the scaloppini part of the chicken, man my chicken was small, almost to the point of not being there, it was 2   pieces about the size of a half dollar and as thin as a sheet of paper, super small, piled on top a heaping mound of spinach with 1 artichoke heart cut in half propped to make the chicken appear bigger and to the side of this was a huge mound of pasta with minimal sauce, so very disappointed in my dinner, did it taste good, yea the 2 bites of chicken was great in flavor, the white wine sauce was thin and sparse, the mound of spinach felt like it was never ending, and the pasta was cooked all the way but was very dry. I do not feel this meal was worth the price. Everyone was under wowed by their meal, but had a great time enjoying everyone's company.\n\nSometimes you can't believe the hype of a place, and I feel this place falls in that category.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2015-01-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yOn5RtoAgPRGcTttvN-Dog', 'review_id': 'eH4D-2ZvSaA2-1z9O7m-Cg', 'text': 'Never again service was horrible with to go orders food portion is way too small and price is way too high.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 1, 'date': '2015-01-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pRzCuajpHvqmUajg65bbJA', 'review_id': 'KNznaTS7BNE5phw7tov2wA', 'text': 'Excellent wine selection, delicious food, and superior service helped to make this the best dining experience we had while we were in Las Vegas.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2015-02-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7hyBh6-t-_gx_8wtx8ddSw', 'review_id': 'xZ1KKoqHIyfoJ0NNLvR2lw', 'text': 'Here on business. Daniel was my server and did a fantastic job. Very helpful in making decisions and explaining the menu. The view of the pool is amazing. Ordered artichoke dip and the penne garneri al limone. Wow! Def a must go to.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2015-02-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VZvgUbeysz1JQNwgt5rcCA', 'review_id': 'CoSTTKi6cWnikEpgaia_mA', 'text': 'i eat out a lot.  this was not one of my better experiences.\n\ni chose to eat at the bar.  it was fairly busy, so i ended up seating myself at the back side, near the pizza oven.  the view and activity weren\'t as great as i would have hoped, but the service still should have been excellent... right? i mean- don\'t put the seats there if they\'re not going to receive the appropriate service and attention...  while my bartender was polite, i would not say that i received good service.\n\ni ordered a few small plates to compose a full dinner.  i started with the meatball appetizer.  the meatballs were tasty, as was the red sauce with which they were dressed, but... no bread?  no nothing with which to sop up the yummy sauce?  hello- this IS an italian restaurant... right?!\n\ni next had a caesar salad with was on the upside of good.  the romaine was crisp and really beautifully dressed.  however, there should have been more croutons (i think i got exactly 3), parmesan and at no point was i asked if i wanted freshly cracked black pepper.  (sorry- it\'s 2015, right?).\n\nnext was the cappriciosa pizza: prosciuotto, pine nuts, artichokes, and san marzano tomatoes .  as a base- the pizza is beyond NYC perfect: thin and beautifully crisp.  the pizza was excellent.  (which makes me question even more why the meatballs are not served with some version of bread- even pizza dough as a flatbread!)\n\nthe one total blunder of the night was the arancini.  for those not in the know- arancini are cooked arborio rice, usually with some kind of stuffing to create a "dumpling," which are then deep fried and served with red sauce.  you\'ll often find them with a meat filling, but these were just cheese.  because i was in the mood for sampling, i ordered these, too.  now- i\'ll be very honest: it\'s only once in a blue moon that i send food back, or refuse to pay for something.  today was once in a blue moon.  i took only one bite, and it was more than enough to deem this dish a complete waste of time and energy on whichever chef put it on the menu.  (this is a chain.  i don\'t fault this location, but i DO fault their test kitchen.)  these were greasy, without flavor, and part of the cheese filling was orange.  ORANGE.  i don\'t know of a single italian cheese that is orange in color.\n\nwhen i expressed my displeasure, management was nice enough to stop by and explain that the arancini had been taken off the check, but took zero responsibility, and made no indication that my experience would be reported to corporate.  thanks for not caring.  slap in the face moment?  the code associated with the arancini being taken off my bill was "did not like it."  sorry y\'all- it\'s not that i didn\'t like it; it\'s that it was a disgrace to arancini, in general.\n\nadditionally, even though i had mentioned to the bartender that i would be ordering a lot, and taking much to go, i had to lean over the bar top to get the to-go container  myself, and package my own food.  \n\ni might return, but only at a table.  it\'s my opinion that the bar-top service is lackluster and inattentive.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 2, 'date': '2015-02-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ru_s3fe-qrokCtiWYkxXiw', 'review_id': 'TNMk6eMfwYxumfXjaubHtA', 'text': "Excellent restaurant, I came here with family for my Birthday, we had great service, our waitress was great, I can't remember her name. The food was amazing, somewhere I will come again when I come back to Vegas!", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2015-02-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-FnHmdZaNfqvx895q0lY3g', 'review_id': 'jekfv62fe-Isz9ApJbTJIg', 'text': 'Loved Mark our waiter\nLoved our dinner, the veal was devine\n\nWe will be back!!!', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2015-02-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VZvgUbeysz1JQNwgt5rcCA', 'review_id': 'Fc32mEJPucnoCgNbMGOvqQ', 'text': 'i was contacted by the business after filling out their own, internal feedback survey.  i had a very nice conversation with a manager who was apologetic, and agreed that my order of arancini (apparently he was working at the time of my meal) was not up to par, and the error had been addressed with the kitchen staff.  however- i was offered nothing more than a "handshake" should i return to vegas.  once again- this restaurant does not live up to general expectation.  i\'m not impressed with the customer service at this establishment.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 2, 'date': '2015-02-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZDktQ33NO8BXTlerNuLVSQ', 'review_id': 'NYKvvdRT_OhMfwtaOqXOvg', 'text': "We were in Vegas for a couple of days and decided to check out the happy hour here! We ordered the meat lovers pizza and bellinis!  The pizza was very big, an extremely thin delicate crust and delicious!  We didn't have to add anything to enhance the taste! The bellinis were delicious!  At $8 for the pizza and $4 for the bellinis (we each had two each) it was a great deal!  It was a perfect lunch of the beaten path but worth visiting this restaurant in the Golden Nugget.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2015-02-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IGj-xH46LA9CboyeZqNYJg', 'review_id': 'Xbvb7DnCibS81tvXd03Pmw', 'text': 'Went here with my friend for dinner Saturday night. Carla was our sever , she was a 10 out of a 10. Her menu knowledge was awesome and she was honest with her recommendations. The veal my friend got was amazing he said and I had the chicken. Parm which is my fav all time and it was one of the best.. We sat on the patio which was awesome.  Nice wine list. But the lasting impression was Carla, I loved her and will go back just for her to serve us again. Thanks for a great night!', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2015-02-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dYt0pVZ22DSzM_rSac2qHw', 'review_id': 'd1i6L3C9hVZOMcz73RySuQ', 'text': 'The Stawberry Cassata dessert at The Grotto is the entire reason I planned our trip to Vegas February 20th. We had previously eaten here in 2007. My husband does not typically go for dessert, sweets, cakes or much breadish items in general, but he loves strawberries, so the first time here he ordered it, and has talked about it for years!! I have called several locations trying to have a cake shipped to me around his birthday with no luck! So this year I thought "I\'m just taking him to that cake!" One we arrived for our 7PM reservations we were offered patio seating for our special occasion and the gorgeous weather! It took a while to be greeted by our server, but we are typically leisurely and understanding at restaurants, especially on vacation! Another server made sure we were okay and insured that we had been helped by someone. Another table was a little more displeased and vocalized it to us. Having worked in food years ago, I\'m more patient and understanding, especially when it seems someone is "in the weeds". All in all our server was great, food was delicious! The manager directed me to the restroom, and helped me have this cake brought out to my husband with a candle. We hope the next time we\'re here is much sooner than 7 years!', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2015-02-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'aiHTrICoiQyR434B2t9IiQ', 'review_id': '7M7W9Qs4j8NiiQ_k5_Yc5w', 'text': "Absolutely terrible-- our entire party was joking at how bad it was. I had the veal and couldn't finish it even though I was still hungry. No one like anything.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 1, 'date': '2015-03-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lA6S1wFJrKf_bI7WOdebpw', 'review_id': 's0H49KJf8pK37FUXg-pH5Q', 'text': "I've never had a bad meal here. Sure, it's a bit pricey, but it's some of the best Italian food I've had.\nLove the thin crust pizza. Lasagna is the best I've found. \n\nExtensive wine list. A plus in my book.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2015-03-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ziHtj2Q35U2lo8cH9shNcQ', 'review_id': 'NJRxwmBZ2H-OVN7Nc2J6Sw', 'text': "We ended up here after attempting to get a seat at Andiamos at the D. Unfortunately they were booked solid for the night. Still wanting Italian, we took a quick walk down to The Golden Nugget and quickly got a seat at the bar at Grotto. The atmosphere was pretty cool at the bar since you got to watch them make their pizzas. I had the seared mozzarella appetizer which was delicious (especially the tomato sauce it was in.) The veal scaloppini in the main dish was very good as well. The highlight of the meal was the strawberry dessert. This was about two weeks ago and I can't remember the name of the dessert, but just get it. It was delicious. I tried to replicate it as soon as I got home and it wasn't close. Ask your server, they will know what it is. It's almost cake, cream, strawberries, and magic I think. The only complaint was that the service was a little slow. But I suppose that is to be expected on a Friday night at a bar seat.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2015-03-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zgCbxpMH025r6ljVrOuEkg', 'review_id': '5iRrPSAt1Cw7qSdPwj1epA', 'text': 'Love this place, the ambience is amazing.  The chickem parmesean is my favorite.  My husband and I purposely go two times a month for date night!! Everyone is always pleasant:)', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2015-04-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'imWqywVjgR6JsJ3wBnuu6w', 'review_id': 'uHvpo7ZH5fWzENWx5tPcEw', 'text': "I don't know where to begin from service to food everything was amazing. I had a friend come to town for her daughter spring break. First she had few expectations but let her have fun and take memories back to new jersey to share with her friends. My friend was pregnant and had a taste for everything but I digress. \n\n\nWe checked out the steak house menu first,  we checked the BBQ restaurant next then landed in front of grotto menu. This is all after having explained and offered all to ms. Pregnant to FINALLY have her pick grotto because she finally had so many options sound she couldn't pick one.  \nI had the lobster bisque and canoloni (sp) almost like a soft shell taco rolled up sided with chicken and spinach.  I could lick both plate and bowl.  Friends daughter had the tortellini with pesto sauce we ....yes we all tried one another meal lol. Then my girlfriend had a house salad that had fresh made dressing to die for and some chicken dish, I forget the name,  that had capers and angel hair pasta that all melted in your mouth. \n\nLastly,  I tried the orange creme brulee for dessert.  It wasn't the best creme brulee I've had but it was delicious.  \n\nWell definitely be going back.  Great find in what would seem the last likely place. I always tell visitors that residents rarely venture to the strip regularly but for Grotto my spouse and I will a little more often,  with or without visitors in town.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2015-04-09', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 4, 'cool': 4}, 'user_id': '22glItKiH7hQRWszhmcohw', 'review_id': 'xaU8BchzPdbvYSi9T-qOlQ', 'text': "OLD VEGAS ITALIANO \n\nCame here with a group of my co-workers to celebrate the MARCH BIRTHDAYS. \n\nThe resteraunt is located right next to the hotel pool & they have an awsome view of the shark tank too. The decor make me think of how an italian resteraunt looked like back in the days. There were also cool looking blown glass chandeliers. The lighting was dim & the place was packed.\n\nWe had a party of 5 & the host seated us quickly followed by our server to greet us. I wish I remembered his name because he is what made this review a 5 star. He was very professional & informed us about the specials for the night. \n\nWe started off with some cocktails that came out quickly & he gave us a few minutes to look over the menu.\nWe were given hot fluffy bread at the beginning and with some garlic infused olive oil.\n\nTOMATO CAPRESE $12.99 - we ordered 2 and they split it up for us and also added one more mozzarella-tomato-basil & so each dish got 2 pieces which was nice but we couldn't even eat more than one because they were so big. \n\nLOBSTER BISQUE $9.99 - it was nice & delicious but definately cannot have one serving to myself\n\nSPINACH & ARTICHOKE DIP $9.99 - can't really go wrong with this appetizer \n\nPENNE CON GAMBERI AL LIMONE $20.99 - this was the dish I ordered & I have to say that it was just okay. The pasta it self could have used more flavoring because it was a bit bland... the shrimps had a lot of flavor though.\n\nPROSCIUTTO-WRAPPED CHILEAN SEABASS $29.99 - it was delicious... presentation was a little plain but it was gonna be eaten regardless. The seabass was cooked to a perfect medium temperature.\n\nCIOPPINO $35.99 - this was a flavor packed dish. Lots of different seafood from clams to crab claws with the flavorful broth it comes in.\n\nITALIAN CHOPPED $17.99 - the dressing was tossed in & there was a bite of every ingredient of tomato.onion.feta.kalamata olives. Grilled chicken. The chicken was also juicy & not dried out.\n\nCHICKEN PICATTA $19.99 - didn't get to try this one ahhahaha\n\nCOCONUT CREAM PIE $7.99 - OMG it was just filled with cream but there was just enough toasted coconuts on the outside to give a little texture & flavor along with the pie crust.\n\nTIRAMISU $7.99 - you could taste a little bit of the alcohol which was great & it literally melted away the moment it touched your toungue which is exactly what I look for in a tiramisu! The decor presentation was cute too.\n\nCREME BRULEE $7.99 - simple but the least of my favorites out of all the desserts but only because it just tasted like a really good normal creme brulee. The sugar crust on top was perfect & the creme inside was creamy soft perfection.\n\nSTRAWBERRY CASSATTA $7.99 - my first experience & the light angel cake on the inside was amazing with the cream & fresh strawberries with strawberry sauce... DROOL\n\nCAPACCINO $4.50\nBOTTLE OF ARGYLE PINOT NOIR $65\n\nThe fact that he lit up a candle for every single one of the desserts was a very awsome touch to the whole dinner. One sad thing was that they didn't offer anything little for dessert which would have just been a nice touch. \n\nALL-IN-ALL service was great... ambience & decor was wonderful & fun... food was delcious... didn't really realize timing for everything because we came to dine & enjoy ourselves so you don't realize the timing on anything. But i know we were there for over 2 hours!!! =]", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2015-04-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Gxmpf0MGYL7EkEfbctQI6g', 'review_id': 'eNDdX1JQPlktUEXPaH_Zsw', 'text': "The location right by the shark tank pool is great. I had pizza and the fired mozzarella, both were excellent. I tried two other dishes from my group, spaghetti and a cream pasta dish... I'm glad I didn't order what they did but again mine was really good. I would absolutely recommend this place for a nice lunch!", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2015-04-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'B4ieEMdOtTRwZNrsvfMVXQ', 'review_id': '6C5YBRZ8HCtCLXS4URBYzw', 'text': 'Super great wait staff and delicious food. Also great drink specials during happy hour. One of the best meals I had while in Vegas hands down.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2015-04-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0mjkru9SELDOBfP8I6QXVw', 'review_id': '9DwMfgNgonsG8VKm0S2Izg', 'text': "Always go here for happy hour where pizzas are $8 ( basically half price) \nThey are huge and I had a hard time eating the while thing nut did. Usually I share with my wife but she wasn't on this trip. The Grotto has numerous interesting combinations to choose from all made in a supper thin crust cooked to perfection. You won't be disappointed.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2015-04-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KkKgip3CmRKYBJFu3-XRvA', 'review_id': '9vj0-S7gjo3Xk6Rz9s4Puw', 'text': u"Two days ago I was spending my last night in Vegas. A friend and I decided to go to Fremont street to look for souvenirs and see the lights so we decided to look up a place on online/yelp. I found grotto ristorante had pretty good reviews, didn't look extremely pricey, and we wanted to see the golden nugget anyways so I thought we'd give it a try.\n\nI don't have a bad word to say about this place but my expectations weren't that high either. I got linguine pescatore and it was AMAZING! I loved that there was so much seafood piled on that I couldn't even see the pasta at first. The service was excellent and I loved that we got seated by the pool where we could watch people go down the slide and watch the Sharks/fish swim. My friend and I also stayed for dessert. She got tiramisu and I got orange creme br\xfbl\xe9e. I got to taste her tiramisu and both desserts were amazing. This ended up being my favorite meal in Vegas!", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2015-05-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'YiWi597Vq556ZXKARDu-Rw', 'review_id': 'FfWzptjCFsmqmF0F8mMvcg', 'text': "I took a risk taking my prom date here seeing as the reviews weren't too nice. Immediately we were seated and tended to. The view was nice with a good look at the shark tank (unfortunately during pool hours views of overweight swimmers are also seen but after pool hours the view gets amazing)\n\nWe were brought more than enough bread which is the furthest thing from bad. The apps were brought hot and quick, along with our food. The penne was delicious and hot. I would give 4 stars but having this place but 3 and a half stars is much under the credit it deserves. I highly recommend going after 7:00.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2015-05-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DW9P1pqUpcjP6NXvlZXr7w', 'review_id': 'UStqcpbXACJVK4FNIXZc1w', 'text': "If you're Italian and know good Italian food... Don't go here. We saw the good reviews and figured we'd check it out... Let's just say we were disappointed. We started off with the spinach artichoke dip and that was eh... Lacked flavor. My boyfriend got the veal kickerillo and could barely eat it. I had a pasta dish and it was ok. I really wouldn't recommend this place unless you're looking for cheap Italian food.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 2, 'date': '2015-05-14', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 2}, 'user_id': 'OAd-vbR_POac1zHtu-Y2Zg', 'review_id': 'axfDUfM9xqDe-e3TchIcRw', 'text': "I've dined here a couple of times for lunch. It's alright. Nothing ever stands out. And I never leave feeling like I just had a great meal. But it's good enough to actually eat it. So yeah...it's a-ok. The ambiance is more of a lower end casino cafe. The service is generally nice, but not exactly pleasant or attentive. Eh, it's all just fine.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2015-05-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'OZJ62dCZ1vcQT43N4TaXhw', 'review_id': 'bxtKuZkOs9wYP6-N-uwZXA', 'text': "What seemed like a nice little restaurant wasn't quite what i thought it was. ...\n\nWe ordered the calimari as an app, it arrived at a decent time but seemed a bit cold.  Still tasty though. \n\nWe ended up ordering 2 pepperoni pizzas and a small salad.   It took over 45 minutes for it to arrive! !  After noticing that groups of 4-6 were already finishing their meals i finally asked when our food would arrive? !?!   It arrived soon after that and the manager stopped by,  He didn't have any idea why it took so long but was nice and friendly and did take our appetizer off. \n\n Was nice that the pizza was larger than expected but it didn't set  I'm my husband's stomach ):  \n\nMy salad was  just ok, simple vinaigrette but as a bit wilted?   Babe that's why it didn't set well in my tummy either ):\n\nDoubt we will eat here ever again after this experience!", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 2, 'date': '2015-05-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'nVXGSCdCoLkt0nUQ2gJDAw', 'review_id': 'BIRMe9Gqb2lVGZLgVvN98g', 'text': "We came to the Golden Nugget to see a show. We got here early so we felt we had time to eat in one of their nicer restaurants. We had not tried the Grotto for a long time. There was no wait and we were able to get a table close to the window overlooking the pool and the shark tank. On the positive side, the service was outstanding. Our waiter came to our table within minutes of sitting down, explaining the daily special and taking our drink orders. The busboy brought the bread almost immediately. It was delicious. It came with olive oil. He also brought a flavored butter that was excellent. I was disappointed that the restaurant only had two beers on tap. However I was able to order their Sin City Amber. It was excellent. We started with their Italian chopped salad. It was just ok. We had it with their bleu cheese dressing. The bleu cheese dressing was just tasteless. For the main course, we had the chicken cacciatore. This was also fairly devoid of flavor. There was a small amount of vegetables that came with it. Again, almost without flavor. Overall, five star service brought down to a three star rating because of the quality of the food. I don't think I will be back. There are too many other good dining  choices in the downtown area, even within the Golden Nugget.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2015-05-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'CikImqMfA1lMHvPHBgKRpw', 'review_id': '0pcF8dBNd9N8sSLjQ6brfw', 'text': "Let me start this review off by bragging on the bread. Holy shizballs, the fresh baked bread with the basil and garlic infused olive oil was the bomb. I could have eaten that all day. I wish the other food was on this same level.\n\nSo, my first experience with the Grotto was ordering Chicken and Goat Cheese Pizza. The crust was just okay, but I loved the sauce and the goat cheese. The chicken unfortunately tasted boiled versus grilled so it gave a weird one note texture experience and almost blandness. I think I would have enjoyed the pizza as a vegetarian option better. Also, the price I paid for it made me shake my head. Vegas is overly expensive for no reason. \n\nOn day two, I was really wanting brunch and their brunch options caught my eye. I HAD to have the Ossobuco Hash. It sounded way amazing. So I ordered and I think it confused the waiter that I wasn't drinking. Look, the prices I've ran into have turned me almost tea totaller. Plus, watching drunk douchebags over the past 24 hours have turned me off. \n\nSo I order my food and I'm just people watching while trying to figure out if I can eat my food without choking on the fumes of cigarette smoke- because obviously it's 1995 vs 2015, and my food comes out, I look down and I'm immediately disappointed. I don't see any of the rich colors associated with Ossobuco. It just looks like shredded, boiled beef. Also, I was failing to see the hash part. But the biggest sin were the two petrified volley balls sitting on that plate masquerading as poached eggs. No cook with pride would serve that. No line runner worth their salt would approve that. No waiter paying close attention would let that mess make it to me. They were boiled eggs. For the amount of time I waited (and I'm an easy, easy going person to wait on) and knowing how many hands had to touch that plate, I was kinda livid. Well, more insulted. Not all of us are so drunk that everything looks awesome. I had to track down my waiter and tell him what was wrong and it's like he knew! I'm like WTF, if you knew the eggs weren't poached correctly, WHY would you serve them to me?! With no other moisture in the dish, it hinged on the runny yoke. \n\nSo he takes the plate and I wait some more. Finally a woman brings it out and she's cordial enough but something about her gave an air of agitation. Well excuse me doll face for having a sense of culinary pride. I thanked her for my order and was happy to see things looked right. I broke the eggs and was very pleased as the yoke ran beautiful on my plate. I tucked into the meal and it was okay. There were missteps pertaining to layered flavoring and again, the key ingredients of Ossobuco. It definitely wasn't bad, but it wasn't really good or great either. It was just okay.\n\nDo I think I'll eat her again? Nah. I never want to return to Vegas again!", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2015-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Dh_damdffTZvKDxu01BPAQ', 'review_id': 'PY2uEU_gjPoHmmnXRe3_uQ', 'text': 'Very delightful experience with delicious meals. We had the wedding soup and rigatoni with meatballs and meat sauce. Both were served hot. It meal came with hot bread and dipping oil infused with basil and garlic.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2015-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jepoCopfHVKNPbvcBQK9DA', 'review_id': 'jXm_V-Puy1fc-Ha7970iFA', 'text': "Fantastic food. Had the cheese ravioli and it was awesome. Didn't get a chance to take a peek at the wine list, but I'm assuming it's just as impressive as the food.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2015-06-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ea2yxFZvLApzCZH6eCTaqw', 'review_id': 'FghmNd0GQ4sQbenvGC8Vcw', 'text': 'Only reason i am not giving this place 5 stars is because the service was really slow and we were starving when we got there. but besides that, the bread, peach bellinis, lasagna, and pizza are a 10!! u cant beat this place. I am italian and from san francisco, where our little italy north beach area is top notch in food and this matched it!!! a must go if you are on Fremont Street and dont want another buffet. Excellent! i would stay at Golden Nugget one night just for that!!', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2015-06-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-RvCiIK2kMABSEivpzVv0w', 'review_id': 'B9oT2wcXNLs27oCT04-AyA', 'text': "The culinary standard for the price is a comparable experience. Service was a bit subpar with drinks missing refills and entrees mixed up. Our table had one of our party personally fetch the water pitcher for refills. Considering a slow Tuesday night, the lack of attention was disappointing. \n\nThe appetizers choices of antipasti and calamari were both excellent. A careful fork full of baby purple onion and blue cheese from the antipasti platter was the killer combination, if you're a fan. The calamari came crisp and tasty. \n\nEntrees included a great Chicken Parmigiana; however, our server was confused with the Chicken Parmesan $10 monthly special we ordered. This was later corrected. Paglia e Fieno was expected to be lathered in a rich Parmesan cream sauce but ended up rather bland. Similarly, a less spicy version of Fettuccine Campagnola was served. \n\nTiramisu was an excellent desert choice. While a nice gesture to add a birthday candle on a desert we ordered, it was given to the wrong person. \n\nA nice stop in Fremont but likely not to return.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 2, 'date': '2015-06-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7Kg2J0A9z9rm_GU-EBfbPg', 'review_id': 'LmRSWS3PQbDnz_pv8yCMmA', 'text': 'We come here every single time we are on Vegas six or 7 times a year. The food is always consistently exceptional. Two of our favorite dishes are Chicken Marsalis and the Veal Parm. All of the deserts are incredible so save room.\nThe best thing about Grotto is the customer service. They hold a very high standard and I have never seen it slip', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2015-06-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2TPWCFF1-Bs6ErURR7u1Yw', 'review_id': 'mzXrCkCdwmbMi_0lt-hzEg', 'text': "Tomato Basil soup was delicious but a little pricy. Waited over half an hour for it (server must have forgot). Meatzza pizza was tasty, didn't care for the meatballs on it though.\n\nOverall food was good; service was painfully slow.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2015-07-03', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'C4xR0If63TG5AKdeqC6dTA', 'review_id': 'B_RAdWRPJH0pYx8b8b6vow', 'text': 'Came here with my mother when she was staying at the Golden Nugget for a business trip and I have to admit I had heard bad things and read some bad reviews but I was pleasantly surprised!\n\nThe only bad part of our visit was at the very beginning for me and I have read this to be true in some othe reviews on here as well. We had to wait a really long time at the Host desk to be greeted and seated and there were only 3 or 4 tables eating in the entire place there was really no excuse for the hostess to be MIA.\n\nFrom there we got seated with a great view of the pool and we were introduced to our server. Great experience from there on out!\n\nThey brought out some ridiculously good bread with some oil and basalmic. We ordered a Margharita Pizza and a Casaer Salad to split and everything was incredibly good!\n\nGreat service and beautiful food at a decent price,\n\nI will definitely be back!', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2015-07-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GRIzuQxjZnuEmrES1uNQQA', 'review_id': 'Zseq5CYrVZ00Bt_v__7iqQ', 'text': "The pizza is fantastic and the atmosphere is perfect. Don't listen to all the naysayers, for the price this place is a great deal.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2015-08-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'gvgq9zkESrS1MKbyn16HmA', 'review_id': 'Lh5el51tOB3NTHBAtu91nQ', 'text': "Thankfully we had reservations because I'd never wait 2 hours for a table here.\n\nThe food is ok, not great however they will substitute eggplant for any meat, so it's a nice option for vegetarians. My veggie pasta was $19, and I thought that was a bit pricey and bland.  However my coworker loves the veal ($25). So it must depend on what you order.\n\nSince it's an open floor plan and right off of busy hallways and next to the casino it's really noisy. \n\nMy favorite thing about the Grotto is you can order anything to go at the bar, enjoy a drink while it's cooking and take it up to the room.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2015-08-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6Lr1gCuw45QPWFl-g9HeoA', 'review_id': 'w7UlmcPZLuvO8af5m9CPBQ', 'text': 'The food was absolutely amazing!! They service was fast our waiter tony was great! Btw he will suggest a desert after you meal, no matter how full you are take his advise!! Huge most amazing dessert possible', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2015-08-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9bPIzAL2zWZhsb77mFe4iA', 'review_id': 'y1WdiWWpUExzF0cQXGeUHw', 'text': 'The best meatballs I have ever tasted and amazing service. The best part of Vegas is getting amazing food any time of the evening.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2015-08-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FwFxzxvvaMLJS1BD7bzAuQ', 'review_id': '_2v8p0W5HaVHCbp8PlDLDA', 'text': "We had an excellent experience. It was my Uncle's 82nd birthday and we happened upon The Grotto on a Sunday evening. The server was great, the food arrived quickly and was very good. We had 2 Italians that were discussing their family recipes so I thought it would be a tough sell. They were both impressed with the meatballs and praised their entrees as well. Reasonably priced, great atmosphere for being in a casino setting and friendly servers.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2015-08-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MU1PTncAVPAxiHpcgXlMeA', 'review_id': 'pFM-rgx5WziZhxE6ZDOjEQ', 'text': "One of the best Italian restaurants in Vegas. Try the fried mozzarella. It's not like anything you have had before. Great wait staff and great view of the pool. It's also another reason to go down to Fremont Street!", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2015-08-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2ecQU5atHdTBHC7r-jfbng', 'review_id': 'OYG0_Fc8QCjDlvBoS0dxjg', 'text': 'best pizza in vegas hands down (do not fold em)', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2015-08-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bmFwEbU2sfT1sIvV8KJyYg', 'review_id': 'EmurfaFistF07DhNm1Djvg', 'text': "Very nice setting and good service from our server Denise. The food though is not what everyone is hooting and hollering about. I ended up getting an appetizer for an entree that was nicely done, and fantastic flavor. The husband got a pizza that wasn't cooked long enough and really wasn't anything spectacular. He ended wishing he got what I ordered.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 2, 'date': '2015-09-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'we2SEkzJCpWAcSTBJn-84A', 'review_id': 'DcdSAmpdQ3lrPrcU8iOuzw', 'text': 'I have eaten here several times and always find the food to be good and the portions filling. The desserts are huge and good and the antipasto is excellent. The pastas are good and of a good size. The prices are very reasonable for a Vegas restaurant especially in a casino.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2015-09-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UQ6-nLAnJQqAp3DH_lYqpA', 'review_id': 'krE6lf3jsLn0aea0QyWhmg', 'text': "I'm giving 3 stars because in the past it's been decent. I really want to give it 2 stars......food is ok.....service is ok....one time I had deplorable service at the bar and it was not corrected. Today was........what I imagine Olive Garden to be like? But much more expensive. With much less food. Given this joint a few chances, not returning .", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2015-09-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4U3hCZC6BX39_gTM5RSoow', 'review_id': 'F9wf7YdtnBbnDpuf3rAhXQ', 'text': 'Go for the meatballs, I hate meatballs and this are so wonderful I had them three days in a row!  Actually everything I tasted here food wise was really top notch, avoid the sangria though.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2015-09-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'NVFqGBpzGIcvD7H90RRsIA', 'review_id': 'oQVkwPGKx35d3nnd7eG3BA', 'text': "Our table of 8 dined here on a recent Saturday evening.   On the recommendation of the door man when we arrived, we tried Grotto and were glad that we did.\n\nGood Italian food as part of a large menu in a lively atmosphere.  Veal Marsala was tasty and the vegetables were good as well (asparagus in particular).   Sauces, which are a good indicator of a restaurant's quality, were smooth and flavorful.\n\nService was the highlight, with Denise being a treat as a server.   We had just had a poor service experience at lunch the same day, and Denise showed that with effort and a good attitude, you can turn a good dinner into a fun evening!", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2015-09-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'pqBtZK8nSv34ieYSa1ZjZw', 'review_id': 'L5JMwahT02My2T_BzT980w', 'text': 'Had a wedding reception for a party of 20. The food tasted great, the service was wonderful and all of the food arrived to our table at the same time and all warm, which is difficult to do with a party that large. The manager was great and even comped us a huge piece of wedding cake. All of our guests enjoyed themselves and had a wonderful time.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2015-09-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'Zef9kQbT7IHfw4uMPWn-Jw', 'review_id': 'rqjsLzNnyz6EoKQCEe23Iw', 'text': "We came here mostly because we were tired, staying at the Golden Nugget, and didn't feel like going too far out of the way. We sat in a part of the restaurant that is separated from the rest by one of the resort's pathways. In some ways, that was nice, because it felt a little more private, and at the same time you could people watch. On the other hand, service may have been slowed just a tad, due to location. The food was good, and the cocktails were nice. The tiramisu was OK. I did enjoy the dessert cart coming over to show us what we could choose from. Nothing very outstanding, but nothing bad either.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2015-10-01', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 3}, 'user_id': 'M-O0tasOl0SGiUsxdO5cZw', 'review_id': 'f0ESr6fzoC4lz-C6xasVCQ', 'text': "I came here with a large dinner party and where we were seated in the room to the left of check in.  That night it seemed to consist of just large parties.  So as far as being located in Vegas downtown I think it's a great venue for celebratory occasions.  I only tried three items, the bread, artichoke & spinach dip, and the Cannelloni di Pollo.  It would have been nice to have vinegar on the table along with the oil for the bread.  I thought the artichoke and spinach dip was okay.  I found it to be a little watery for my taste.  I enjoyed my Cannelloni di Pollo.  It was only an an appetizer portion but after stuffing my face with bread it was the perfect portion.  Being that it was a large party I was pleasantly surprised that the waitress gave us all separate checks.  I know none of us were expecting that as we were prepared with cash.  \n\nWill I go here again?  Probably not.  There is just much better Italian food in Vegas at a much better price point.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2015-10-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UHRPKoNmwZEeJB9uuAyAYQ', 'review_id': '1xHs_EnAf-3kG_qeM6nsYg', 'text': "Meatballs meatballs meatballs!! Some of the best I've had in long time!! So light and delicious! The tiramisu is a must!! \n\nWatch out for the peppers that are served with the house salad. I tried cutting into one and ended up wearing some of the juice on my shirt...right before a show no less.\n\nService could have been a little faster that night, but they did have a banquet of over 20 people that night so it wasn't a big deal.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2015-10-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6WzGJlhAZRyjUK6W4mXFUg', 'review_id': 'No3T6gIIX0wQ8gbMIMyBLg', 'text': "Last night around 7:30, eight o'clock. Me and my family decided to grab a bite to eat for dinner at The Grotto since Giada and Guy's resturant reviews were horrible. \n\nThe night starts with us arriving and the hostess giving us a wait time of an hour and forty-five minutes for a table of 5. Their was plenty of tables available to sit us and the other families that they were turning around with children. They tell us the wait was long due to a large party they had coming in of 18 and 20. Long story short the manager Neill seats us and our waiter Santos were the highlight of our service. Santos was johnny on the spot along with numerous other waiter that was walking around the resturant. The food was excellent, it was the best authentic Italian food that I had since I left Italy. The wedding party of 20 that was making everyone go elsewhere to eat was late and we ate, paid our check and leaving before they sat down. Will I return it depends on if the dirty blonde curly haired hostess is still their. The Manager Neill OUTSTANDING job for taking care of customers.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2015-10-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ZgYhkcXxS_KX2wA7zVbuNw', 'review_id': 'dAQlTug6m2tKXqwP7o9Knw', 'text': "We were spending our last night on Fremont at the Golden Nugget and Grotto was recommended to us when we told our friends we wanted Italian.\n\nAtmosphere is lacking. Its smack in the middle of the casino and very loud and smokey. This normally does not bother me in Vegas - but it didn't feel like a real restaurant... just kind of a spot to eat in the middle of the casino.\n\nMy sister ordered the pizza, I ordered the veal parmesan. We had a soup and salad to start.\n\nStarters were fine.\n\nOur mains came out - her pizza was basically cold as if it had been sitting out. My veal parm was borderline disgusting. It is rare I leave leftovers - I left over half my meal.\n\nIt was super expensive for the quality and portion size.\n\nHonestly worth the cab ride to the strip for proper Italian. I cannot stress how bad this meal was. Go somewhere else.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 1, 'date': '2015-10-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jaNORBQpVbfuNClKfbvN1w', 'review_id': 'V-t9ozZCGwV9SyCiJbkB1Q', 'text': "We wanted a special place to share an anniversary and birthday celebration so opted for this since it was convenient to our hotel. Ambiance was a bit too noisy for good conversation so if you want a quiet place to chat, this is not it.\n\nFood was fine, a few notches above typical Italian and well done. One of us had an order that got mucked up but the waitress handled it beautifully and got the right one to us within about 10 minutes. The major disappointment was that management didn't come out to apologize, and nothing was offered as compensation for making 1 of us wait to eat while everyone else had their food.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2015-11-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1VR_G3rNXFs31Woin0cJMw', 'review_id': 'RZe84ZRM0ROZheMo4TOh0A', 'text': "Initially I chose The Grotto because they have cable TV and the NFL game I wanted to watch was on the TV. \nI had no idea it would be So Awesome!!\nTo start I ordered  the Lobster Bisque it was FANTASTIC perfect lobster flavor with just enough cream and sherry & Chunks of Lobster meat!!\nOne of the best I've ever had!\nI asked for a special order Margherita Pizza - I wanted the tomatoes added after baking with the fresh basil.\nIt was Delicious!!  Thin crispy crust too!!\nMy Water glass was never empty and my Moscow Mules were served in the copper cup!!\n\nThe service was FABULOUS, FRIENDLY & EFFICIENT!!\n\nI will definitely return!", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2015-11-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'odE013P646cYBTAkis-8aQ', 'review_id': 'PBdu0dcSWWGIeM8cqbSbGw', 'text': "A group of us went for happy hour the other day and enjoyed a few drinks and appies in the bar area. It wasn't busy, as we went on a Tuesday around 2:30pm - but the service was quite slow despite the near empty bar area. \n\nI had Peroni ($5) and a shrimp cocktail ($13.95) which was extremely overpriced for the happy hour portion, which was 4 smallish prawns. Not very high quality, and they were a bit over-cooked. Our table also had the stuffed mushrooms and an order of bruschetta, which was quite tasty. I would go back for the drink specials, but I'd rather eat somewhere else for better food.", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 3, 'date': '2015-11-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'C6fplX71G3jypY1xljB8OA', 'review_id': '5KmNinfO9eDR5mumjMorug', 'text': 'We Keep Returning, It\'s Good"\n\nService, excellent! Food, very good. We all enjoyed our meals... but, I ordered the chicken diavolo and it didn\'t have any diavolo (spice heat). Otherwise it was still good. Objection... coffee at $3.50 is a little out of whack compared to the rest of the menu pricing.', 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 4, 'date': '2015-11-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'A8Otn9AxypkoEVQnC7k0Bw', 'review_id': 'y1ynIPnLPZjegzJJsH36qA', 'text': "Seriously our favorite restaurants in Vegas are in the Golden Nugget!!!  This time we tried Grotto. Everything we ate was Delicious!!!  From the warm bread they brought out in the beginning, to the meatball appetizers, then on to all of the 4 mains courses we had at the table...  DELISH!!!  One person had the lasagna, another had a rigatoni dish, another had a spicy seafood dish, and I had the Veal and Fettuccini dish. My stomach hurts and my mouth is still watering thinking about it. It was ALL so good!!!  Can't wait to come back for dessert :-D", 'business_id': 'Crd82TFkF-cF5WF_qKuJ4A', 'stars': 5, 'date': '2015-12-03', 'type': 'review'}
