{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '7OKAChL7R23OzPZufQ67VA', 'review_id': 'Un5XyPGM_vOAaq01ETRgIw', 'text': 'The crab and steak were excellent. Steak melted in my mouth and the crab was delicious. The service was outstanding. If you are in Chicago or Las Vegas you definitely need to eat here.', 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2005-11-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VNVL8aemR6ripOPoC86-QQ', 'review_id': 'N5SsIPC9Z0ASGqG3J7ICOw', 'text': "LOVE this place...in fact, I make it a point to have a meal here everytime I'm in Vegas and it has yet to disappoint.  The meat is great, the seafood is great, the SIDES are beyond great (the potatoes!), the bread is great...well, you get the picture.  The service is fantastic (especially since they lost our reservation one time, but immediately made it a point to seat us as soon as possible - within 5 minutes).  Reservations are a must on busy nights!", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2006-03-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_cWGvb5K6EdMa_9PxO7xdQ', 'review_id': 'kdZgGNL5dImUInWByoTGbQ', 'text': "the atmosphere of a corporate men's club - lots of wood, leather chairs, repressed sexuality and self-congratulatory good cheer. good crab, good seafood, big drinks, decent steaks, adequate service: overall recommended for a good spendy meal in vegas.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 3, 'date': '2006-04-18', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 1}, 'user_id': 'XZklFMhPERUDok9E-8zktg', 'review_id': 'fzt1AGOgcPKlyBnKSOdTLw', 'text': "not all it's crabbed up to be.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 2, 'date': '2006-04-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-umEKdH3Yz1m8Wp2xierGQ', 'review_id': 'frTP7n0fBv5ouRq7M-yezA', 'text': "very very yummy - pricey but that is to be expected - not as good as the original in south beach but still a winner. great bar - huge martinis!\n\ndon't make the same mistake as us... we went with people we didn't know all that well and they went a little pale when the $1000 bill came and we ended up paying for about 80% of it.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2006-07-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': '6ba7HtIOhGQywdOj79FIxg', 'review_id': 'FSOoIsunbj2XhIDCub2GLw', 'text': "Stone crabs the size of my fist.  So lovely, so sweet. . . we ordered way too much. . . the lobster bolognaise. . . sigh.  I am so glad they are in Las Vegas. . . easier to get than to Chicago.\n\nTip:  Go during crab season. . . super!\n\nThe wine suggestions were great too.  Oh man!  I'm drooling.\n\nLet's see. . . tips for Joe's:\n\n1)  expect to pay for quality\n2)  medium crabs are better than the super humongous crabs\n3)  do not order with your eyes\n4)  ask the servers for suggestions\n5)  go during crab season (yes, there are off-seasons)\n6)  go HUNGRY!!!!", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2006-07-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'ewxF3dMszIb4U7aEunY60Q', 'review_id': 'oO8g1nHODmUWyzLIxI7W6w', 'text': "Someone at the table compared Joe's to Morton's (an accurate description, I think). Had to travel to LV for a conference (i.e. expense account...jackpot!). So, made reservations here...sooo goood. Especially if you like crab...very tasty BIG claws. Split a HUGE bone-in rib eye with boss...this made us SUPER happy & fostered employee/employer relations. Fantastic mixed drinks (BTW - french martinis are very popular in SinCity these days...very worth a try) and extensive wine list. Gigantic portions, interesting & chatty waiters (ours was a chivalrous, old-school, Sinatra-type who provided impeccable service, dahlink). If you're going to blow a wad of cash, it might as well be at Joe's...at least you're guaranteed a great meal.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2007-01-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'BW2sIZnJSRbi-FcGpU7MYg', 'review_id': '_TbDTY_1fRCNFgPrUpGapw', 'text': "Ehh....\n\nQuite overrated for what it is, a mall restaurant in an upscale mall. I'm not big into Stone Crab to begin with, but it was OK... They pre cracked them well so that was a plus (not too many shell injuries), but the mustardy-sauce for dipping was bland and tasted like Hellman's Dijonaise. There's not a ton of meat on the stone crab claw, and i personally don't see what all the hype is about. \n\nPerhaps it stems from the fact that when stone crabs are harvested, they just rip their arm off and throw it back to live on in the sea and re-generate another one in time. I suppose that makes it less cruel (Though I don't agree, sounds like virtual hell to me).\n\nI didn't eat the steak though the fillet looked decent. I got Crab cakes and they were mediocre at best.\n\nBiggest disappointment, when eating a $300 dinner for 3 (with a mediocre 4X markup wine), I don't like sitting at high-rise bar tables, even if they are disguised with a white table cloth and a napkin ring. \n\nIf you need Stone Crab, try Del Frisco's instead! It's not a far cab-ride from Caesars, and the stone crab (which is not their specialty) comes with a WAY better version of the mustard sauce. Plus it's way classier for your money and not much if at all pricier.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 3, 'date': '2007-02-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'YrJ3PxuXK9vfeCoc9e8Wgw', 'review_id': 'X0MOtttDdDEI0SY4dvsW5w', 'text': 'I\'ll keep it simple. If you got the money, you gotta eat here at least once. We had the money, so we ate here once...so far.\n\nExcellent service (the waiter washed our hands in fresh squeezed lemon and ice water) and the food was as good, if not better, than the service. \n\nFor Appetizers, we had the "2nd Mortgage" : Medium Stone Crab Claws, Jumbo Shrimp, Lobster Cocktail, Shrimp and Scallop Ceviche.  \nFor our Entrees I had the 22 oz. Lobster Tail and the wife had the Rib Eye. Both were excellent, steak seared a perfect medium and lobster was as good as lobster gets! We had the Garlic Creamed Spinach  and Lyonnaise Potatoes for our side dishes and they were great! For dessert we had the Boston Cream pie and that was rich, but very good. We\'ll definitely come back and dine here...when we Re-Finance the house!', 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2007-02-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': '1RFAKCeMX8QC3Unmj6flDw', 'review_id': 'tWpknXqnlBUsBPyLR0gaHw', 'text': "Everything from the service down to the stone crab is just amazing. \n\nI LOVE crab, and stone crab - while it was the first time I've ever eaten it, was simply, AMAZING. The claws of these suckers are huge because the stone crab claws were HUGE.\n\nThe restaurant is sorta on the high side price wise, but seriously, if you are looking for a quality meal in between your bar hopping while on the strip, this place is worth checking out.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2007-04-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pgxHSaHvx9Uz8Nw0PyEA9A', 'review_id': 'XH40QfVO_F9DwC7N1D0l3g', 'text': "One of my best meals in Vegas, it beat the Mandalay Bay restaurants.   I was not in the mood for crab.... Not sure why, but it did not matter... I had the gulf shrimp with amazingly delicious sauce and will have dreams forever about it.  Also good:   Fried calamari, Jenny's potatoes and creamed spinach.  Strawberry rhubarb (special, seasonal) pie for dessert  was perfect.  \nService was excellent.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2007-05-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '_jW1H29ZEcdjrCk9H4AheQ', 'review_id': 'VsSyUIqAWq9vbNvUI1cM2g', 'text': "This is part of a small chain, based in Miami Beach.  I had lunch here.  Service was inconsistent.  The initial greeting was friendly, and I was seated quickly.  Water was quickly offered, and a very good bread basket arrived shortly thereafter.  However, the server took a long time to bring me a menu, and seemed in a hurry.  This slow-to-return then in-a-hurry attitude would recur.  Oh yeah, I was never even offered dessert, just handed the check.  Isn't this place famous for its key lime pie?\n\nI had never had stone crabs, so I gave them a try as an appetizer.  They were OK, but I guess I'm not a fan.  Also, I thought Joe's was known for its mustard sauce.  None was provided.  One nice touch: after I was finished, an assistant came by with a lemon, and squeezed the juice over my hands into a waiting bowl.  He then gave me a hot, wet towel.  Much appreciated.\n\nI had glazed black cod as an entree.  It was a big piece of wonderfully moist, flaky fish.  The glaze was excellent.  A trifle sweet, it began to cloy after a few bites.  Not to worry - half a lemon was provided; the juice made the sauce perfect.  On the other hand, I could have done without the pedestrian French fried sweet potatoes.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 2, 'date': '2007-06-21', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 3}, 'user_id': '4nw21oGz8qhL4sS1v7ra_w', 'review_id': 'wxWqV-ccMRy3pVcyA0IWXA', 'text': "If you like crab claws then this is the place for you.  Holy shit the claws are huuge!  See in my pictures.  Really good place and it's in Vegas so you know it's fine dining at it's best.  The lobster bisque wasn't bad either.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2007-07-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'a1WczdQDbTg5ly0EJUIN8g', 'review_id': 'HOYrwVRjDG-tRiQNv4DnZA', 'text': "We were staying at Caesars & wanted something nice but not too spendy. We found the listing for this in the hotels magazine & decided to give it a go. So happy that we did! The place was pretty packed for a Wednesday night but the wait in line wasn't long. The reason it wasn't soon became clear, as we were seated in the bar. I was a bit disappointed by this but realized I shouldn't be, as we had no reservations & didn't have to wait more than 5 minutes. \n\nThe bread they bring to the table is really excellent, with various types including one that's much like a soft pretzel. Yum! \n\nOur service was very good... very attentive. My husband wound up ordering the fish & chips and I had the broiled salmon with 1/2 baked potato. Both were served quickly and I must say that salmon was some of the BEST I've ever had!! \n\nIn and out in probably just a bit over an hour, and prices that didn't break the bank. I'd definitely go there again!", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2007-09-02', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': '7gwZdP-4HB3ioZd1LBJEng', 'review_id': '7WoAxF8umJoDp_fl70swHA', 'text': "Apparently this place is pretty popular... I for one always thought it was the dressed of version of Joe's Crab Shack but according to everyone else it's a Miami dining staple!\n\nThis particular location is quite random, very bottom floor the Forum Shops in Caesar's Palace. When you walk it it leads to the bar area, which seems kinda fun but is mostly there for those enjoying happy hour. Dining area is either in the outside area where you can gawk at shoppers or in the back dining room where it's so dark, you might just fall asleep.  \n\nThe food selection is enormous. The wine list is so long, it's actually kinda intimidating, and the specialty drink list looks interesting (I opted for the Pomegranate Martini and ended up with nothing but a Welch's drink). Bread is not very good... they offer different variations which is a nice touch, but I don't know how you could possibly serve 7 different kinds of BAD bread? \n\nWe finally decided on the steak and tails dinner: $49.99 each. Lobsters were small but the taste was truly decadent. Steak was OK - but was a little on the dry side. I did see a waiter debone a fish for another customer and I was truly amazed! He literally got every piece of fish off that bone and in record time, it seemed! Overall, dinner was a 4 stars (counting just the food). \n\nSo, after we were done eating, it took a record of 20+ minutes for us to even flag anyone down to clear our table and bring us our check. We were trying just about anything to get the servers attention but to no avail. Finally, after a sturdy 'EXCUSE ME' - we finally got the waitresses attention. \n\nOverall, food is good... but not necessarily the best service. Service should come standard with the prices, but definitely not at Joe's (maybe it's different at the one in Florida).", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 2, 'date': '2007-09-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lqpzHxxL4tALyqUgbEMZMw', 'review_id': 'Kzb2-LiV8n0HUeX_1O-l2A', 'text': "Stone crabs that's all I can say.  It makes me drool when I say it because it was pretty good.  Service was excellent, wine was picked to the tastebuds delight as it was the Houghton cab/shiraz 06.  I had the Ribeye Steak and it was cooked perfect and the sauce for the steak was very different than what I have had for steaks and I really liked it.  My girlfriend had the halibut and it was cooked very good as well.  The main thing that made it appetizing were the stone crabs, they are served cold but the claws are definitely worth a try.  If you love those little crustaceans which are different from the dungeness crab, they are worth it.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2007-09-18', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'OfCRg48-XGxN3iTBWLdAPA', 'review_id': '0WaqSB7R9AQSjpHu3kwxjQ', 'text': 'I usually adhere to the rule "If The Restaurant Has A Type Of Food In Their Name, Then That\'s What You Must Order." Common sense would tell you that Bob\'s Beef Palace is not the place to order tofu, for example. For Joe\'s, however, I made a rare exception and took our waitress\'s advice to order the king crab legs rather than the stone crab. Talk about a good choice: 20 ounces of the most delectable, savory crab meat you could find south of Juneau. I\'m afraid Todai will just never be the same for us...sniff, sniff.\n\nTop that off with great bread & sides (we opted for the garlic creamed spinach), and amazing pies for dessert (try either the banana cream or the key lime), and it made our trip to Vegas. No wonder this place was packed solid.\n\nOne word of warning: be careful about ordering drinks at the bar. The bartender working the Saturday shift likes to vary the price of drinks based on how much he likes the cut of your jib.', 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2007-11-02', 'type': 'review'}
{'votes': {'funny': 6, 'useful': 6, 'cool': 5}, 'user_id': 'AixLPxra_4HirfchjPkiWA', 'review_id': 'lh86r8ewwSS4XC_vte8-Vw', 'text': 'Every now and then a girl has to treat herself.   A nice new pair of shoes, some pretty undies, a decadent spa treatment, etc....these are all things a lady will do for herself sometimes.  \n\nYesterday I decided my treat was to get some crabs.\n\nOk, Ok, get your mind out of the gutter, even if I am in "Sin City"  you know that is not where I am going with this. \n\nJoe\'s has a dark wood interior with a large patio and all the servers in their crisp black and whites, I felt a little underdressed in my no-makeup-tennis-shoe look.  This was not to stop me, however from getting my crabs.\n\nFor those that don\'t know, stone crab is only really in season for three months and usually comes from the Gulf in Florida.  It\'s a rare treat, these little claws of perfection, so you have to get them while the getting is good. \n\nI sat down and the server immediately came over. She was pleasant and helped me find an excellent medium bodied glass of white wine to complement my seafood. Throughout my whole meal she was attentive, polite, and personable.   \n\nI chose an appetizer for my lunch, but this was no mere starter - this was the "2nd Mortgage".  A stone crab claw, a jumbo shrimp, a small lobster tail and a small portion of shrimp/scallop cerviche, all chilled with cocktail and mustard sauces for dipping.  This was a dish to relish so I took my time. All the seafood was cooked and chilled to perfection with that just caught fresh taste. I really wish I had just gotten a plate of the stone crab because that one claw was so good I am already having major cravings for more.\n\nAll in all a perfect dining experience - a girl has to treat herself and to borrow from a certain ad campanign - "I\'m worth it"', 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2007-12-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GueCVIqvXa1daOQDLvNCMw', 'review_id': 'oj1sStHIWgxtLWDtMyshsQ', 'text': "I have been to the one in Chicago but I went with family while in Vegas for the weekend.  The restaurant was just as good as the one in Chicago.   This is one of those restaurants where it doesn't matter how often you go the food is always good and the service is always great.  \n\nFor an appetizer we had the cerviche which had a good flavor for cerviche, it was a bit more acidic then I like but it was still tasty.  The tuna was fabulous.  It was cooked rare to perfection which I find is very difficult to get.  We also tried the crab stuff sole which was good but I thought it needed more crab. For dessert we shared the apple tart which had taste and was a nice way to end the meal because it wasn't too heavy.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2007-12-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rHRFNqVpo15otk5eLoJp9g', 'review_id': '7P_BLPpL4raV-9UUGfW8sw', 'text': "What a disappointment!!!! We went on Christmas night to Joe's, and it couldn't have been worse. For a place that claims to be known for their seafood and steak, both were mediocre at best. The shrimp and scallop ceviche was chewy, hard, and almost bitter. The $40 filet mignon which I ordered as medium rare came WAY over cooked, and when I asked for a replacement (at $40 for a piece of meat, it better come the way I ordered it), not only did the second steak come undercooked, it was completely cold inside...they took a steak from the fridge, threw it on a grill that was way too hot, and served it rare and cold. Who is in charge of this kitchen? Our waiter was not only unapologetic about it, but acted put out by their mistake and hurried us out. The stone crab was not worth the money either. We highly recommend AVOIDING this restaurant.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 1, 'date': '2007-12-30', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'AoQ5L42ZIeghmilujytEYg', 'review_id': '2trCP7b4wprrsZrJJYs7qA', 'text': 'Mouth watering crab cakes with a delicious mustard sauce, and Key Lime Pie to die for.  Yum!  Even better, they have recipes on their website.    I cannot wait to take a stab at making both.\n\nhttp://www.joesstonecrab.com/recipes/intro.html', 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2008-01-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'tCgCFJPWtJg64vrM6295QQ', 'review_id': '0_qjk8pJvFEAE64vj-SQYw', 'text': 'I usually have to stop here at least once every time I make the trip out to Las Vegas.  Came in on the first night of a 6 day trip and decided to have Joe\'s for dinner.  For a Saturday night there was no wait and we were seated immediately.\n\nThe usual variety bread/pastry basket is brought to the table at the beginning of the meal.\n\nFor the entree I decided to have the Select Stone crab claws.  According to our waiter, the Select Stone crabs are a bit larger than the medium and the shells are less "grainy".  For our side dishes we had the garlic spinach, lyonnaise potatoes, and a creamed spinach.\n\nSelect Stone Crabs - 6 claws per order and they were delicious as usual. The crab meat a has a very light and sweet taste to it. Served with their signature mustard sauce.  If you don\'t know about stone crabs then you\'re really missing out.  These are from the Gulf of Mexico where they harvest remove one of the claws from the stone crab and throw it back in the water for it to re-generate its missing claw.  \n\nGarlic Spinach - sautee\'d with A LOT of garlic.  I am a garlic lover myself but the garlic was a little too overpowering to go with the sweet flavor of the stone crab.  This is probably a good dish if you order a red meat dish.\n\nLyonnaise Potatoes - These are one of my favorite side dishes of any restaurant.  The potatoes are soft and somewhat scalloped, lightly seasoned, and browned for a crispy upper crust.\n\nCreamed Corn - The corn has sweet taste to it with just the right amount of cream and just the right amount of corn.\n\nAll in all a great dining experience and a perfect start to any Vegas trip for me.', 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2008-02-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'Lc3XHZZQ9aKl48CnRut4Kw', 'review_id': 'zOxKpnWAXABszuOYUDZWmA', 'text': "This place is located on the first floor of the Forum Shops at Caesars Palace!  We stumbled upon this place back in 2005 on accident! Our group of 10 was on our way to Pure but decided to make a pit stop somewhere nice to celebrate my bf's bday! Chris suggested Joe's...it looked nice...very old school steak house with dark woods and dim lighting! Anyway, their Peach martinis are delicious!! Mmmm...they serve a basket full of different types of bread in the beginning! My friend wanted to steal the basket! We stopped her of course! C'mon now...theres a place and time for thievery (is that a word?!!) Anyway, our steaks came out juicy and moist! We had steamed asparagus and Jeannie's potatoes! They were melt in your mouth great!! Great great first time..\n\nMy bf and I came back the following year for our 5 year anniversary! It was just as great as the first time!! Tasted the stone crabs this time...and oooh...they were yummy! I am not a seafood person but i enjoyed these things very much!  Our dessert was on the house since they knew it was our anniversary!! Really nice establishment...totally recommend it to everyone!", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2008-02-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'BqVWPPV0M9sRj52tn-rheQ', 'review_id': 'o0FqZCgXFTRa1IxUGrELlg', 'text': "I love stone crab, but this location was a little disapointing for me.  I could go on all day about the Jumbo stone crab claws that I had in Miami, in Vegas it was just ok.  They were out of the jumbo claws and maybe the large because we ended up just getting the mediums, you really can taste the difference.  In Miami the sweet potato fries are thick cut and in Vegas they're shoestrings and I prefer the thick cut.    The garlic creamed spinach is the same.  Do not order the fried chicken!  I had heard so many great things about the chicken , but ended up so disapointed, it was not salted at all so it tasted really, really bad.  I'm sure this locaton loses some of it's charm because it's not in the salty air of  the Miami coast, but there is no excuse for the bad chicken and being out of jumbo claws.  I'll think I'll stick with the Miami location for future. Oh and our server was not very nice.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 2, 'date': '2008-02-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'nmYMIqvpgME75EImtUc54Q', 'review_id': 'tqTXSWJvIUrNoKp9bhDv-w', 'text': "The service was amazing, the streak melted, and the atmosphere was casual enough for an early dinner that I didn't feel like a total heel for wearing shorts and sandles.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2008-03-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '17LPTsu4RgqTZ3SxsGzzxw', 'review_id': 'ktaX_w2peEPDEO-OaCo5yw', 'text': "My grandmother took me here for the first time a year ago and told me stories about the original Joe's Stone Crab in Florida, I believe.  She's been eating there for years and she only told me about this place now?  Shame on you, grandma!  Every time she comes to town, we go eat there.  We get the stone crabs every time, and those dipped in their signature sauce is delicious.  I've had family come eat with me that don't eat shellfish, and they've said the steaks and pasta dishes are just as good.  Definitely a top choice for a date or buttering up the boss for a raise!", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2008-04-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7Wm9-yarUx6hIrmqQetcFg', 'review_id': 'AreYIzDNMP5DVOAoMsDOvA', 'text': 'Good food.  Great service.  Highly recommended.\n\nWe started with the Crab And Artichoke Gratin, Calamari, and some Select Stone Crab Claws.  All of them were very good.\n\nI had the Bone-In Filet and it was excellent.  It was so tender and just melted in my mouth.\n\nA nice place to go to get some good food.', 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2008-05-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Syn0IvWg-M7I4G2t_XyHoA', 'review_id': 'tju2ViLHu8hx4LnFNjwvCg', 'text': 'This version of Joe\'s Stone Crab must be the more, well to do brother of the original location, as the decor and atmosphere is so opposite of the South Beach restaurant.  Having dined at both,  I was a little disappointed to find the Las Vegas branch more "corporate" - the typical look and feel for an upscale steakhouse.\n\nThe fillet itself was not particularly memorable and having not been particularly impressed with the Stone Crab at the Miami location, I figured that I would give it another try.  I was more impressed with the thickness of the shell of the crab, dumb I know, but I came away with this experience realizing that I did not have an appreciation for Stone Crab, I simply can\'t tell the difference between it and it\'s more simple sibling, the crab.\n\nThe only real highlight was the crab and artichoke gratin appetizer - quite rich and gooey and I would order it again if I opted to try stone crabs for a third time, but honestly, I think I\'ll pass on them for something tastier.', 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 3, 'date': '2008-05-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4HZ2NWZvtJA8A0kv8bmHew', 'review_id': '_7Ct4kp1c2Vgy-pOpy5F5A', 'text': "A little pricey but worth it.  The stone crab claws are delicious and match perfectly with the sauce they offer.  I usually order they lunch special which includes 4 claws, hash browned potatoes, cole slaw and a slice of key lime pie.  It's the best overall deal for lunch.  The potatoes are pretty bad however.  Too salty and dry.  Everything else is great especially the key lime pie.  The key lime pie is the best I've ever had.  Perfect blend of sweetness and tart.  They somehow manage to serve this at the perfect temperature also, just below freezing.   Definitely worth the visit.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2008-05-20', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 4, 'cool': 2}, 'user_id': 'YyPncV7fwWflne10BiCf6Q', 'review_id': 'zc7pYtkzfUP-BKbvBKnXeA', 'text': 'We went here before our flight back home after a wedding in Vegas.  After all the great food (Four Seasons room service and catering, Sonic) I wasn\'t sure what we were going to do.  The Girl had to make a return to the James Perse store so we made our trek after checkout (amen for having a rental car this time) to the Forum Shops at Caesar\'s.  It was insanely crowded being Saturday afternoon of Memorial Day weekend so we had to park pretty far.  We had about 2 hours to find something to eat so after much deliberation we decided on Joe\'s Seafood because it was near James Perse.\n\nThe wait was long but when we went up the maitre\'d looked at me and said "You look familiar, have you been here a few times?".  Of course, me being the honest fellow but not wanting to upset the dood and just wanting to get a leg up on everyone else, I said "Yes!"  So it APPEARS he put us at the bottom of the top sheet where there were clearly no open spots left.  w00t.\n\nAfter about a 30-minute wait (by the time we got in, the wait was up to a hour ... this was 2pm), we got seated.  Service was a bit slow but the food was pretty good.  You have to get the stone crab claws.  They\'re served cold but with a little lemon and sauce and they are just fantastic.  They crack the claws for you so it\'s on hassle, just be careful not to inhale small pieces.  The bread is good as well and the onion strings are light and crispy and highly seasoned but insanely addictive.  We also shared a ribeye which looks amusing like Salisbury steak on a cafeteria plate but was decent.\n\nThe place is a bit pricey but it\'s pretty good.  You really should try it if you get the chance.\n\nStone crab claws: 5/5\nOnion strings 4/5\nRibeye: 3/5\nService: 4/5', 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2008-06-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'IhwB3d8UJVEOWqjn7EWK2g', 'review_id': 'TPXuANy9_dof4pzNbQG8ow', 'text': "Came here with my gf when I was flown in for an interview.  I heard about Joe's on Food Network and knew there was one in Miami.   To my surprise my friend Karen told me that there was one in Las Vegas.  So being the foodie that I am, I had to check it out.  Joe's decor is reminds me of a NYC steakhouse. Dark wood tables, chairs and floors.  The stone crabs are definitely the star in this place, hence the name.  The stone crabs come pre-cracked so the all the hard work is done for you.  The meat is sweat and very flavorful and pairing it with the honey mustard sauce is genius!  I had the scallops and the gf have the crab stuffed sole.  The scallops came out alone with a little green garnish and a little greasy.  For me, it was too plain.  I needed something to go along with the scallops, maybe a mixed green salad wtih balsamic vinegrette.  The crab stuffed sole was great, especially when dipped in the sauce.  The onion rings were good if you like them thin and stringy.  The mashed potatoes with the fontina cheese is to die for!  Granted were on a low-carb diet, but you have to try it.  You only live once!  As you can tell, we obviously weren't able to finish the meal so we brown-bagged it home.  What a night at Joe's!\n\nI've been back many times and love their stone crab. I love this place!", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2008-06-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'niy6fNwM6M-q7R-VpdwOtQ', 'review_id': 'Nt1DEOpQdKvt8UZlHImJJQ', 'text': "I was just there on Saturday. The stone crab was normal. I was expecting a lot more. Everything was good, don't get me wrong, but for the price I could have had so much more at much better places.\n\nI like the crab at Pacific Fish better and the cost difference is considerable.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 3, 'date': '2008-06-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'POuaJicO1plXLpixnWr_4w', 'review_id': 'BoZCrdIweVnCKpeA-fTNbA', 'text': "The best meal we had in Vegas, we picked this restaurant because it was in Caesar's Palace, which was supposed to have fireworks on the 4th this year (but didn't) and also because I had a dream involving crab legs. Yes, crab legs.\n\nI ordered said legs, and our waiter took the liberty of bringing me the smaller portion, with the explanation that he thought I might want to start with the smaller plate, as I could always order more if I wanted. He was so right, my eyes being much bigger than my stomach, even though the king crab was really excellent. (And nicely pre-cracked so I could maintain a delicate and girly demeanor while wielding the little crab fork.)\n\nWe shared a bottle of champagne, very nice, and the stone crab appetizer. Stone crab is the specialty and great, though I preferred my legs. Someone at my table ordered oysters, also very good.\n\nOur waiter was fantastic. In conversation, we found out he was a philosophy major and had lived in Chicago, where we're from, so we could have a chat about Chicago winters in the desert.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2008-07-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'B0LyEx_dntI4rkcL6n5MXQ', 'review_id': 'IXveDFpCCp9aEBzTOlQJ-A', 'text': "Pretty substandard for Vegas as far as I'm concerned.\n\nThe service was pretty slow. We'd order drinks and the waiter would have to be reminded to bring them. I don't think he smiled at all. He didn't seem to happy to be serving us. I tried to get him to smile, but this guy was stone cold. We were dropping a fat wad of cash too, can you at least pretend to be happy that we are there?\n\nThe food was pretty bad. The house favorite, butter seared scallops were god awful. As was the veal. The fish sandwich looked like something you got at a fast food joint. The one good thing I had was the 2nd mortgage. For 20 bucks you get a sampling of various, shrimp, crab, ceviche, and lobster served on ice.\n\nI would not recommend this place to anyone.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 2, 'date': '2008-07-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nGYN-MBuaABPMD_eOxEyQQ', 'review_id': 'RFo_GF_LRzWjo-Qt_Ue7nA', 'text': "I had a great piece of Chilean Sea Bass here, but the fried asparagus (although very tasty) ended up souring my stomach (nothing a few single-malts couldn't remedy). Seemed a bit on the greasy side. The salads were nothing special.\n\nThe service was friendly and constant - a little slow though. I like being able to eat good food in an unpretentious atmosphere (we sat in the front). It was also nice to walk up and be seated without waiting at prime dinner time.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2008-07-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yn_qqs1GTtBy9tRdHjqYXQ', 'review_id': 'lavO4sLJ0r_iOwoNfH4FKg', 'text': "I've never been to the original and we went here on a lark. My friends C and J and I went in looking for lunch. I had heard of Joe's and J's parents had been a few weeks before and loved it. So we knew it was probably pretty darned good.\n   The menu is pretty big and the prices can be off putting if you're expecting something from the old Vegas ($15 for fish and chips could freak some people out). C had a cheeseburger and asked for it to be medium but it came out a little closer to medium rare which I know he wasn't happy about. J and I had the Joe's Classic Lunch which is five stone crab claws, hash browns, cole slaw and key lime pie. The stone crabs were sweet and didn't really need the dipping sauce that came with it. The hash browns were super crispy outside and flavourfully tender inside. The cole slaw was less successful despite the tableside dressing it got from our waiter - it was better than KFC but still a bit underwhelming. I wasn't a fan of key lime pie before but that little sliver with it's massive dollop of not overly sweetened whipped cream was really wonderfully tart with a great buttery crumbly crust. \n   Our service was slow to start with but picked up half way through. I will come back next time I'm in Vegas.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2008-07-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'xdU-tR3irC-xs9d7QbBvkw', 'review_id': '7s76ucxhaG2mOL7DA7Pkpw', 'text': "I had the lunch special which was $19.99 for 5 crab claws, coleslaw, hash browns and a slice of key lime pie.  Oh my goodness, so good.  I've never had stone crab before but it was succulent and buttery.  They provided a spicy honey mustard sauce to go along with the crab and it was such a great match to the sweetness of the crab!  The server made the coleslaw right at the table, fresh and it was quite good.  I opted for no hash browns as I had had hash browns the previous evening in my drunken state at Treasure Island.  Just the crab and coleslaw was enough to fill me but wasn't heavy at all.  If you're a dude, you have to get the hash browns to fill your tummy.  The key lime pie was tasty, quite chilled (frozen, I think) but good with fresh whipped cream.  All-in-all, it was a great lunch for $20.  I totally recommend it.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2008-08-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'xt8iR1kTQKxbBc6tvYZxqg', 'review_id': 'YWa7OM1QhgX-T7QOfrrzjQ', 'text': "Beginning to end, I was highly impressed with Joe's and had one of the best meals I have had in a long time. The host seated Craig and me outside on the patio, in a great location where we could people-watch. \n\nThe free bread basket is artfully arranged and comes with 5 varieties of rolls and bread. My favorite was a thick, chewy pretzel stick....when I asked for another one our server brought us 3 more which I totally appreciated.\n\n It was about 100 degrees outside, and I was chugging water like a parched camel. They were wonderful about refilling our glasses quickly, and they brought me a little bowl of lemons to put in it. \n\nAlthough the bottle wine list is extensive, I  was the lone drinker at my table so a bottle was out of the question; I wish they had a few more options for single glasses. The Pinot Gris I tried was fairly good and paired nicely with my food, but it was the only option for Pinot Gris.I am not a huge fan of Chardonnay so I would have liked a few more options of Sauvignon Blanc, Pinot Grigio, etc.\n\nThe food was amazing though, which is why it still gets 5 stars. Craig is an unfortunately picky eater, but he absolutely gobbled up his steak sandwich. It came out beautifully grilled, and the fries were crispy and perfect. I ordered the seafood salad, and was impressed by the presentation and flavor. It had perfectly cooked juicy scallops, shrimp, and shreds of Alaskan King Crab on it, and the amount of dressing on it was just right and not overpowering. \n\nBetween the glass of wine, his soda, my salad, and his sandwich, our bill was about $65...but it was a relaxing, leisurely lunch on our vacation, and the service was wonderful. I loved it and will definitely go back next time I am in Las Vegas.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2008-09-02', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'M1kFiEqVrC7Qa029ZBiwfg', 'review_id': 'OOY8No_bHcSDHSwFwZGTRg', 'text': 'I tend to favor restaurants with foofoo menus, the kind of stuff I\'d never make at home, with ingredients you\'d have to have sent from outer Mongolia.  That said, Joe\'s was fantastic.  It\'s basically stone crabs, steaks and seafood, but anything but basic.  First of all, I\'d give 5 stars just for the best mojitoes I\'ve ever had in my (long) life.  Then the meal:  we shared stone crab claws appetizer with a delicious mustardy sauce.  I had stone crab bisque (seems the thing to do here is enjoy stone crabs) which was ethereal.  My husband had crab cakes which were blue crab meat barely held together in a "cake " form, there being little or more likely no breading.  Just sublime crabmeat.  I had a fantastic idea in menu offerings -- lobster tail tempura.  Lobster meat -- 2 large tails.  Deep fried in tempura batter.  What in the name of all that is right and holy could be better than that?!  And did I mention the mojitoes?  We also shared their highly touted, rightfully so, cole slaw and french fried sweet potatoes and still managed to save room for dessert.  Husband couldn\'t decide between the coconut cream pie or banana cream pie with foster sauce, so awesome server brought both (for price of one).  I had peach pie with melba sauce.  Great location, ambiance and friendly, knowledgeable server.  A great time.', 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2008-09-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'Jc1DMCgOyU38urx3XEOfDA', 'review_id': 'kuH36Y0tcF12y6pBlx7Wbg', 'text': 'Lunch special is the way to go -- $19.95 and delicious!  As others have said, five claws, cole slaw, "hash browns" (well, not like I\'ve ever had, but really good!), and Key Lime pie for dessert . . . \n\nNo substitutions, so I had the Key Lime pie, even though I would have preferred the apple -- but it WAS good!\n\nCan\'t speak for the rest of the menu, as all three of us ordered the lunch special, but it WAS by far the best deal on the menu, and it WAS really good!\n\nGreat Bloody Mary\'s too, and a reasonalbe wine list . . .\n\nOne question:  if you are INSIDE the Forum Shops, but they have a "patio" where you can eat that "feels" like you\'re outside (well, it\'s actually outside the four walls of the restaurant, but still inside the Forum Shops itself), does that count as "outdoor seating"???', 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2008-09-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IRHQ3j-2WROBMku8AbH9ww', 'review_id': '22LFlvDTtAm6TvvO5nirGw', 'text': 'the bone-in ribeye was perfect...took one star away cause i didnt appreciate paying $40 for 5 stone crab claws', 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2008-10-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'onJ0KMavhPhsaqtR-389oQ', 'review_id': 'zBjDNIbp3Ouo6mAX6WQcxA', 'text': "I had supper here.   We had reservations and were seated immediately upon arrival.  Service was excellent. \n\nBread basket was pretty like a flower arrangement.  Sampling the different types of bread was interesting.\n\nWe all started off with some stone crabs....not bad but expensive...the dipping sauce was very good.  We all ordered the ribeye steak (one of us ordered the ribeye with bone in).    Steaks were cooked perfect (from rare to medium).  \n\nWe were stuffed but we ordered a desert anyways....don't remember the name but it was like a mousse pie with peanut butter (very rich and good).\n\nThis is a very good steakhouse.  If you go here, you really need to order their steaks (some of their other offerings didn't look great).  Remember you don't make friends with salad.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2008-10-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'wkqmb9zmmw0vdt-kQDV9lw', 'review_id': 'wUUhTgDiJwQ9wDjKVhiA4A', 'text': u'if i could, i would rate this place with  3 1/2 stars...but since i can\'t, here\'s how this place stacked up:\n4stars for the food. sampled the stone crab and king crab legs - both the crab and the dipping sauce are amazing! =) had the filet mignon - medium well - and happily finished the entire thing (and im not a steak girl). key lime pie and chocolate cake a la mode - again, very, very happy.\nnow the 3stars-the service. usually the staff is amazing.  from the ma\xeetre d\' , to the reservation desk to the waiters, everyone is usually great. this last visit; however, not so hot. our waiter seemed very rushed - he practically flung silverware at us, forgot drinks,  sloshed drinks and sauces to the point that we were worried it would end up on us, and the killer: one of our friends wasn\'t too happy with her steak and asked that it be sent back for additional grill time. (the sucker was BLOODY!) yes, she sent it back twice, but for the price we were paying, the waiter mightve exercised the "customer is always right" policy rather than rudeness. now she\'s never going back and ill have to think twice.\nbut hopefully,hopefully, he was just having a really bad day and the 3rd times not the charm. maybe its changed to the 4th! (\'cuz that crab was pretty good!)', 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 3, 'date': '2008-10-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'y_QffIjdcp4Nk5I8u40buw', 'review_id': '2Vl5VIG9N_52UHs8jJJWnA', 'text': "When you're in Vegas, do not assume that you shouldn't consume mass amounts of seafood since there are no bodies of water around you. \n\nWhen you're in Vegas for work, and your business colleagues say they want to treat you to Joe's, do not, do not, I repeat do not assume you're going to Joe's Crab Shack.  Do not dress down because you're afraid the crab shells on the floor will stick to your heels and you bring your sunnies with you because you're afraid the neon lights will hurt your eyes.  \n\nYes, that happened to me AND my boss, because we are such geniuses.  \n\nBack to the crab, this was my first stone crab experience, and it was enlightening.  I am from SF so crab is something I know, but stone crab...yummm, uncharted territory.  So sweet, so indulgent, so tasty, and coupled with that tangy mustard sauce?  Oh sweet heavens!  I also ordered the scallop dish that's wrapped in bacon...you really can't go wrong with that combo.  The scallops were of a monstrous proportion, and they wrapped the bacon around the scallops to make the whole dish look like a filet mignon.  Weird, but good.  My colleague had the crab cakes, and it took all of my will power to not eat her food when she went to the bathroom.  There were 8 other people sitting around the table, but still, it took a lot of strength.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2008-11-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'szSlNT9mQhJ2btSw5edqeA', 'review_id': 'dtdFrtnGSHZ5yTUSZeuHfw', 'text': "Who would've thought you could have such excellent seafood in the middle of the desert?? Joe's proves that you can! \n\nWe made dinner reservations for Sunday night. When we arrived we were taken back to their main dining room and seated in booth. Our server, David was awesome! He was funny, friendly and unpretentious. They brought out a small bread basket with a variety of breads including a cheese topped roll(delish!) and a small pretzel loaf (Yum!) and a few other assorted breads. \n\nWe decided to start our meal with the Stone Crab cocktail-  sweet and delicious lump crab meat topped with their own mustard concoction. An awesome way to begin dinner. \n\nFor dinner I chose the Colossal Lump Crab Cakes. They were ALLLLLL crab and hardly any filler! LOVE IT!!! Huge baseball sized cakes made of large pieces of crab meat mixed with a minimal amount of breading and filler served with their own mustard dressing. It was sooooo good! In fact I'm craving it now!!! For our sides we chose the creamed corn and rice pilaf. The corn was sweet, smooth and creamy. The rice while tasty did have odd bits of longish noodles. We were unfortunately too stuffed for dessert but they did have a nice selection on the menu, next time we told ourselves, next time, haha!\n\n*Just a side note- they make the yummiest Shirley Temple! I don't drink any alcohol and rarely drink sodas, but every once in a while I do enjoy a Shirley Temple (I think it's the grenadine!) and this one was tasty :)\n\nThis is a GREAT restaurant! The service was spot on! The food was fresh, delicious and reasonably priced for the amount and type of food served.  And even better they can ship directly to you! I took one of their menus home because you can call and have their stone crabs delivered right to your home! Not a bad idea for the upcoming holidays! \n\nI will definitely be back on my next visit to Vegas!", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2008-11-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'gdf9ftAOMms8JToU52uX2A', 'review_id': 'M2Cz5CYcJiDNHedgdYKYeA', 'text': "Came here for lunch a few times and have had great experiences.   Food is great, and the service is attentive.  certainly one of the top eateries in Vegas.\n\nI'll spring for a nice dinner one of these days.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2008-11-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': '5fCb687qSkVe1eQVMITTnw', 'review_id': 'lgaU5C5WC2pyg_LtKnIkSA', 'text': "guess they got their Maitre D' at a home depot parking lot, worst managed restaurant I've ever been in.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 1, 'date': '2008-11-23', 'type': 'review'}
{'votes': {'funny': 12, 'useful': 8, 'cool': 9}, 'user_id': 'JJyzSAv6w83XsCAzLivqOQ', 'review_id': 'YGNjaAF0focspquDEnP8Fg', 'text': "Imagine, the generation's of  amputated Stone Crabs crawling around the Atlantic. Tired of hobbling and wobbling on one claw, day after day the crab dreams of having a bigger Claw. Just like my ex husband dreamed of having a bigger uhum pickle uh um, I mean pony. Just when their claw grows back in all it's glory, they're selfishly ripped off again and thrown back to the sea. This torture they endure for a lifetime. Ahhh, America. These stone crabs are delectable. More please.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2008-12-02', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'oGYUKw0P_el-0OYPp2ogVg', 'review_id': 'ItxFAsz3d_ECmQ8pAEPrXg', 'text': "This was definitely the highlight of Vegas. It was Monday night and wasn't sure what we wanted to eat so after doing some Yelp searching, the hubby decided to go to Joe's. The hubby have been to the one in Miami and raved about the stone crab and the key lime for over a year now and knew this is the time for me to try it. Once you sit down, a basket of variety of bread comes to the table, even though it is not the warm kind, it is still tasty. I started out with a cup of stone crab bisque which is nothing too special. It tasted like the crab and asparagus soup my hubby made. Then we ate an order of the 7 medium stone crab and each bite was so deccadent. My main entree was the Fisherman's Platter which consist of prawns, scallop, calamari, and fish; you have a choice for fried or broiled and because I am on a healthy kick, I opted for the broiled. My hubby order the bone-in rib eye and he claims it is the best steak he had. It was cooked just right (medium well). I had a couple of bites, and the meat was so tender and it melted in my mouth just right with all its own juices (salavating while writing this). At the end, of course, we had to have the key lime pie and according to the hubby, it was the saem goodness back in Miami. Our tummies were definitely fulfilled and what a great way to end our Vegas trip.\nThis is definitely a place to go for a special occassion while in Vegas or if you have some money to spend because it is not cheap.\nI didn't get it five stars because the service wasn't Great, it was just good.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2008-12-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'neIstssJwt_uFxUq4brdjA', 'review_id': '22tQz1HRJDr7gY-RTI9QGw', 'text': "I love this restaurant so much.  If you're a relatively light eater, the stone crab claws are a good portion and very delicious.  Otherwise, there are larger orders of steak or seafood as well as the typical upscale sides such as creamed corn and spinach.\n\nI wasn't able to try the steak here, but one thing I can mention is that the pumpernickel bread is the absolute best you will ever taste.  I suggest buying an extra loaf and bringing it home.\n\nAmbiance was dark, upscale, as expected.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2008-12-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'pIGib34_UZ8_lPVzSJrIHg', 'review_id': 'gcE8E9Bsd6YF3t5eaMVN-A', 'text': "Great food & great service!! Even though we were about 15-20 minutes late, we were greeted warmly and got seated right away. \nCrabs at Joe's are to die for...and so are their bone-in steaks. I got the bone-in filet mignon and it was cooked perfectly and super tasty. OH don't forget about their potato dishes! I am not a big fan of potato but I just can't get my fork off the plate! And I don't mean ordinary potato dishes like baked potato or mashed potato, try Lyonnaise Potato or Jennie's potato! And considering how big the portions are with great flavors, it definitely worth every penny. One thing about the clam chowder though...is that it's not the white-creamy chowder that you get, it was more like...borshch-tomato style soup. Besides that, everything else was perfect and I will definitely go back again when I visit Vegas next time!", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2009-01-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 4, 'cool': 1}, 'user_id': 'hDlSSyDreM9xY4yQWPm54w', 'review_id': '3Ru3BE_pLFUtaAbLe7QzJw', 'text': 'NYE specials out of this world! Best steak in the universe.\n===\n\nSo we\'re wandering the endless halls of Caesar\'s looking for a spot to chill for several hours before the countdown begins. The halls are a bustle of screaming children and many people. The host stand and its tailored dude greet you alongside the display menu and a few tables out in the mall for the noisy customers. The real restaurant is back two rooms behind the bar and is like a secret treasure room for the deserving. We were lucky!\n\nThe NYE special surf and turf themed card included jumbo stone crab claws (4), king crab legs, 3lb lobster and a "side" of 8oz filet mignon. I won\'t say which one I didn\'t order, but the steak was the best steak in the universe, the lobster was huge and meaty and the stone crab claws (those poor babies!) were phenomenal. Add to that a special price on the Tattainger reserve and it was one heck of a way to bring in the new year.\n\nThe bread basket included several varieties but my favorite was the fennel seed, roasted sesame seed and Parmesean lahvosh. Stuffed mushrooms were excellent.\n\nThe service was prompt and professional and I loved how our server kept stopping by to ask us if he could bring anything for us _right now_; very fun. The menu tells the story of the restaurant, founded in Florida, and I remember it well; this location honors the original in proper Vegas style.', 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2009-01-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QW0pwXX0_7Z2AXA81Orb6A', 'review_id': 's0kG2AOhYLxdcglccdgbyQ', 'text': "I ate here with my family and future in-laws for a nice new year's eve dinner. I think it was a great place to spend the last night of 2008. As in most restaurants they start with some bread. They give different varieties of bread, which is all really good. I ordered king crab legs with filet mignon, which was a new year's eve special. I was worried that the crab legs were going to be small, but they were HUGE! I like big servings so I was so happy that the portions were very good. I tried a little bit of everyone's food and I can't complain, everything was good! I loved the stone crab bisque and jennie's mashed potatoes.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2009-01-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mhFF84q9CZbmb5PqKzfGww', 'review_id': 'lwaoFFw6oms9lXeR8Dcc7A', 'text': "excellent wine list, we started with a chilean sangiovese wine that was simply delish and not too spicy or everlasting. i ordered the filet mignon and stone crab dinner. crab claws were supposedly fresh, i couldn't really tell. to be honest, i think i still prefer the northern californian dungeoness crabs (more meat and much sweeter). filet was alright, well cooked and pleasantly not fatty at all. we sided with a mashed potato topped with asagio cheese, good taste and balanced out the meal. bring your black chips to eat here.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2009-01-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'cGPWOz90aCFSuB3MZmD5Cg', 'review_id': 'jO7lITY1U4W8b8ehM1sbRQ', 'text': "My friend had her lunch wedding reception at Joe's this past weekend. She rented out the private area on the second floor of this restaurant. It was very nicely decorated. Appetizers consisted of mushrooms(sooo juicy and delicious), crab dip (omg to die for), variety of bread (yummy) and calamari. I ordered the swordfish, string beans and mashed potatoes. The swordfish melted in my mouth. I normally don't eat fish, but this was so delicious. The The potatoes had bread crumbs on it which made it different from regular mashed potatoes. Bf ordered the salmon au poivre I had a lil bit and it was too fishy for my taste. I will definitely be coming back! Maybe try some steak or stone crab next time around.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2009-01-26', 'type': 'review'}
{'votes': {'funny': 6, 'useful': 4, 'cool': 3}, 'user_id': 'JJyzSAv6w83XsCAzLivqOQ', 'review_id': 'tH30SuIyj9uMPfayFKqUVQ', 'text': 'If you get an asian waiter, request a new one.', 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2009-02-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1gWirEmvwAdjwvDzqZYhSA', 'review_id': 'W6K1GkUqpvlgEMyLjuq_vw', 'text': "This place is such a classy restaurant while allowing their diners to dress casual and feel relaxed.  Joe's (famous in Miami) is wellknown for their stonecrabs, which you MUST try.  I recommend only getting the Med. or Large claws.  Their steak selections are great and their tuxedo dressed staff are top noch. \n\nYou always leave fulfilled and ready to plan your next dining trip to their location.  Lunch is good, but I recommend a nice dinner with great friends or family.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2009-02-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Zco7DIeyDgoWtzFSyTZSFg', 'review_id': 'cHhV6O0R8_lf-PsSu-0Xgw', 'text': "Great food, but the atmosphere (inside Caesar's Forum shops) and service sometimes have room for improvement ...", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2009-02-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'RA39HhvrOBwZEo3mxJcNOw', 'review_id': 'OvYgPPjpCCFwAnb0z571aw', 'text': "Not what I thought.  I thought it would be good, but being located in the Forum shops, I thought it would be more run of the mill chain style restaurant.  Not at all.  The room has the feel of a great NY steak/seafood house.  The drinks are strong and the waiters know what they are doing.  Don't under value that.  How many times have you spent way to much in a restaurant where the waiter could care a less about you, your meal or even know how things are prepared.  Well at Joe's the wait staff is a partner (in a good way) in your meal. We had all the best stuff here.  Stone crabs, sea bass, bone-in rib eye, wedge salad and a great pinot.  All were top shelf and when needed our waiter helped make ours minds up and steered us in the right direction.  Go to Joe's, yo will not be disappointed.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2009-02-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hT49Whvr3CK7V09HhbTSLw', 'review_id': 'kdqbPEZ-EMhdi4fVrdbk1Q', 'text': 'We were so blown away by this place. I was in a food coma for the rest of the night;) We had the 26oz prime rib (ask for the steak season salt) if you\'re a true  Carnivore like we are than you know it\'s a perfect steak when you don\'t have to ask for steak sauce, we also had the enormous hash brown,mac n\' cheese, baked sweet potato and the best Oysters EVER!   A bit pricey but you get what you pay for. This is one more place we added to our "Must have" Vegas trip!', 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2009-03-10', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 2}, 'user_id': '8N481iGgsUYA1-TtESOntw', 'review_id': '5V75p26y4E7GDoMNEz8s5w', 'text': "Price: Lunch special pricing was great 21.95\nAtmosphere: Classic\nService: Excellent\nFood: Never let's you down\n\nI'd say Joe's consistently has great food and service, great place to have a business lunch.\n\nSalad with some of the best blue cheese dressing I've ever had, Bread and butter were amazing love when the butter is soft, much easier to apply. Stone Crabs claws were great, some of the best hash-browns I've ever had a must try when your here. We skipped the key lime pie but it looked great.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2009-03-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'HzsyMUAnRLXtKCjtJJe0wQ', 'review_id': 'Hhd0bk8E3NeHWkYDXfUKUA', 'text': "This place was alright.  Mahi-mahi was okay, soup was a bit salty and sole was eh.  Kinda noisy and not really for fine dining but rather a sports-bar type.  Would have been a good place to just have a drink and watch WCB and that's about it.  I doubt I will ever come here again.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 3, 'date': '2009-03-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uC85pyB2_LQ6UkFrrsOYdA', 'review_id': '03ucdEx2mRIhTtoEtGnlrg', 'text': "Great alternative for a foodie. Definitely no where near being Michelin rated, but if you get sick of eating tasting menus at 3 star restaurants, (seriously, try eating a large prix fixe for 3 nights in a row) come try the crab. Reminds me of a better tasting version of the chain restaurants  Hyde Park and Mitchell's Seafood.\n\nP.S. I definitely didn't get the sports bar vibe that one reviewer got. Sure, basketball was on, but only the NIT, and if they reviewed it the same night they ate there, that means I was there the same night, too... Also, outdoor dining means sitting on the fake patio that overlooks the mall.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 2, 'date': '2009-03-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': '39Bf_oe7JtiSHTJ5vLR5iQ', 'review_id': '2o1Q0E_4ga9NdbpLafB5pg', 'text': "Fantastic!!! I can't believe I missed out on this when I was in South Beach Miami last summer (very known there).  My Boss treated me here after a long day of training/classes and I had a superb experience..thanks boss lady =P  I had no idea  what to order. She said you have to try the stone crab of course. We started off ordering wine to celebrate. She ordered 2 orders of the Med. Stone Crab, which is 7 per order. A side of Cole Slaw and French Fried Sweets that we both can share. All 7 legs finished, soo tasty. Cole Slaw was perfect! More of the vinegar, not too much of the mayo. The server was great too! Omg, I'll be coming back here.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2009-04-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'gx6DN-VPiyoogBxBdMIntg', 'review_id': 'NEPLuEwUCYEStTpb_xhh7Q', 'text': "Every time I come to LV I make sure to drop in to Joes. How can I explain how I love me some Joes? Joes is consistent, fresh, yummy, excellent, fulfilling, and fast....(i could go on longer but I'll refrain) I do not like crab. Ugh crab is just so foul, so what do you order when the place is known for crab... salmon! oh my goodness, I love love their salmon. Then again I love all salmon but there is spectacular. Do NOT get it with their buttery sauce, it is perfect with just a hint of lemon. Mmmmm. My father likes to try other things so I would nibble off his plate since I cannot stray from the salmon. I've had their steak, I don't know which kind but wow. For a seafood place they can make a steak. Let me explain: My dad likes to get steak cooked black and blue, literally only warm on the inside, disgusting, and when I still had a bite I was in love. I didn't feel that I was just eating a lab of undercooked meat, I was gourmet-ing. THe ambiance is nice, the food is awesome, the service is sufficient, the key lime pie is fantastic. Joes is the place to go. But don't just take my word for it, try it yourself", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2009-04-05', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 3}, 'user_id': 'poYY5eAB5n7lyu_INGt9aA', 'review_id': 'kVD3mT0DQTrywnogCLlNgw', 'text': "Word to your mother, this place is great! \n\nWe were walking the shoppes at Cesar's and had seen this before. I was jonesin' for some steak (when am I not?!). The dining area looked full and we didn't have reservations. We thought we'd have to wait a while, which was no problem. We got seated right away. The seating is divided into 3 sections ( the faux patio, bar area, and main dining area). We sat in the bar area which I actually preferred. \n\nWe each ordered a ribeye with creamed spinach and lyonnaise potatoes. \nThe steak was the best I've had so far! It was like I was eating addiction! No joke! I've had steak from Ruth's, Morton, Smith and...., and numerous other places. This was numero uno! They also provided a tiny tin of their house seasoning salt. I'd forget about the high blood pressure anytime they'd bring this out.! It made the steak that much better! Just be conservative with it. What else looked amazing was the plate of stone crab the couple next to us ordered! I thought they'd taken those claws off some monster in a Godzilla movie. That's on the realz, homie. \n\nOur server was always on point. Like she was a Pre-Cog from Minority Report. \n\nI'm in Vegas several times a year, so best believe that if I'm in town and I'm craving a steak, I'm bustin' in on Joe's. Word is bond.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2009-04-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bIg6bapEaKzhGn2f6ULn-Q', 'review_id': 'BmuWymVG_e1AtKjcuu2jyg', 'text': "This place was simple. Simple decor, simple food but great tasting! I was amazed by how quick our food came out compared to our horrid experrience at Morton's. The bf and I started out with their yummy crab cake. All meat and almost not bread filler. We passed on the stone crab because we like our seafood hot rather than chilled but everyone around us were cracking away. Perhaps another time. The bf then followed up with a killer 220z steak. I had sole but it wasn't anything to write about which is the reason I am giving it a 4 instead of 5 stars. Our desssert was the delicious banana foster pie. Very yummy and fresh. I was very appreciative of the service because they were great. They were always around to refill our drinks but not hovering incesstantly. They knew when to give us our privacy and when we were ready for the next part of the meal. Overall, it was a great start to a lovely weekend in Vegas.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2009-04-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'AHV5hJ1Y-pOwgMHBNnKPlg', 'review_id': 'hrdT-VgrKi1uPfHXNRlMJQ', 'text': 'Living in Maryland, there is nothing better than some blue crabs (with Old Bay of course) and beer on a nice summer night at the shore.  So I was really excited to try Joe\'s Stone Crabs on my recent trip to Vegas (I never made it when I was in Miami last year).  \n\nI first asked the waiter what a stone crab tastes like.  His reply "a mix of crab and lobster."  After trying them, I would say that is a fairly accurate description.  While good, I prefer blue crab meat, which is much sweeter but maybe I am biased.\n\nThe ambiance was very nice.  Much like a steakhouse, as opposed to some type of Jimmy Buffet Margaritaville type place I was originally expecting.  The service was excellent. Our waiter called me "sir" every time, which is a nice touch and took the time to answer all of our questions.  (There is nothing worse than having a waiter with an attitude)\n\nThe best part of the night: the key-lime pie.  For some reason, I could not stop eating it, even though I was so full from dinner. Perhaps there is better key-lime pie out there, and maybe when I go to Key West this winter I will find out, but for someone from the northeast, it worked for me.\n\nOverall, a good place to try if you are in Vegas.', 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 3, 'date': '2009-04-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '7bjMJhjPdvr35epVeFlueA', 'review_id': '4csGX3BO6LvTr1BoqDln0g', 'text': "I've eaten here at least 4 times and I always try to stop by here when in Vegas. First off, their food is fan-freaking-tastic. The steaks are high in quality and worth every bite. The seafood is as fresh and tasty as if they were cooked right from the net/cages they were caught in. Secondly, their customer service is outright stupendous. I booked the private room for a party of 8 and all our food came out perfect except for myself, which unfortunately was over cooked & then came back way under cooked. While everyone elses food was good and almost finished they apologized to me serveral times when I wasn't too mad anyways. They comp'ed the whole $600 meal, when I didn't even imply for it to get to that, without flinching. We were all floored and left a $200 tip anyways. I've been back a couple times afterwards and loved my steaks/seafood. Zero hesitation to go back.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2009-04-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cg4em4uXe5ab5qH7pB01gg', 'review_id': 'sBaoQ3G7G7OQDLuGE856wg', 'text': "The positive reviews say it all, believe them and make the reservations now!!!!\n\nI've been to the real Joe's Stone Crab in Florida and I can say this establishment has it together.  I was so excited when I heard many years ago that Joe's was opening in Caesars Palace.  Sit outside (indoor mall) to people watch.  Try the bone in ribeye.....\n\nIf you never had a stone crab, you'll have a taste like no other when you try it, it's like a drug, you can't get enough of it.......   Enjoy", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2009-05-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Rjli7PYfieysUz1uJ-befw', 'review_id': 'vogZepoaW3mEDmcWGVlsQQ', 'text': "a friend told me that this place was a MUST eat next time i was in vegas. \n\nafter getting a little lost walking around the forum shops at caesar's (30 mins late to our reservation)... we were ready to try these famous stone crabs from miami. i don't like eating seafood as the main course because it's very light and from my reviews... you should know that i like to feel heavy and full after i eat. so... i couldn't resist the bone-in-ribeye (surprise...  surprise). this was the third time i've eating the ribeye in the past 2 weeks (i'm seeing the doctor next week... might as well hear bad news since i'm expecting it). since i had mastro's (see my review) last week... i had it fresh in my mind and could say that this steak was not quite at its level. but overall it was a very good steak. \n\nmy wife had the large stone crab (5 claws). of course i snagged a couple of them. very good i must say but was a little disappointed with the size. you only get the claws... that's it. i wanted the whole freakin thing. \n\nfor our sides we got jennie's special potatoes and sweet corn. the jennie's special potatoes were twice baked mashed potatoes with garlic, parmesan cheese and asiago cheese. i loved the creaminess of the potatoes and then the crunch of the parmesan and asiago... definitely one of the highlights. the sweet corn was good but regretted not getting the creamed corn.  \n\na friend of mine got the fried chicken and since fried chicken is a top 5 food of mine i had to try it. the chicken was very moist inside and crispy on the outside but the crust (skin) lacked a little flavor. maybe fried chicken and fine dining don't go together?", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2009-05-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'toQB-84mncrviYrnjrWERg', 'review_id': 'LItByTRyKbS722F_Fg8hDA', 'text': "Do you see the drool dripping down my face?  That's because I'm thinking about Joe's.  We had our wedding reception at Joe's in the private Gigi room upstairs- beautiful, and worth every penny.  My husband's family comes from dungeness crab fisherman stock, and so are crab snobs, they LOVED the stone crab (only after we brought and extra order to their table).  The desserts are to die for.  The mashed potatoes are INSANELY delicious.  The salad is even to die for.  Also, ask for the mustard sauce when you first sit down because the pretzel bread is great to dip in it.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2009-05-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'eJ_TmubmTyTWvd-_nRaeIg', 'review_id': 'Y-jLGy4OvZweHaXmc_nDKA', 'text': "The Joe's Stone Crab outpost at the Forum Shops doesn't have the same historical appeal as the original Miami Beach location, but the food is just as great.  We had the lunch special - salad, hash browns, 5 medium claws, and a half-slice of key lime pie.  The salad is simply a slaw of iceberg with a slice of tomato, pickle relish, and mayo.  The hashbrowns are rich and savory, and the claws are sweet and meaty, served with Joe's famous mustard sauce.  The key lime pie is hands-down the best around.  At $21.95/pp, this is a great deal and very filling.  We also ordered the crab cake - perhaps the best I've ever had and mostly crab, not much cake.  Note that the crab cake is just one cake, however.  Service is prompt and professional.  Being a Miami Beach native, it was great to have a taste of home with a great meal at this iconic restaurant.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2009-05-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'szSlNT9mQhJ2btSw5edqeA', 'review_id': 'ifHz24My5UcHJMTXdjOqfg', 'text': "While in Vegas a couple of weeks ago I had the chance to re-visit Joe's for dinner. LOVE THIS PLACE!!! \n\nThe service- GREAT!\nThe food- DELICIOUSNESS!!!!\n\nI stuck with the crab cakes which did not disappoint but opted for the mashed potatoes as my side (I love that you can order a half side order, perfect for 1-2 people!) SOOO GOOD! The mashed potatoes were creamy but just slightly lumpy, just how I love them, but topped with cheese and toasted bread crumbs. YUM! \n\nI'll be back for a super short trip in July and will definitely try to get back to Joe's!", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2009-06-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'fn26TEsWXfjBWGGLlFEvhw', 'review_id': '9ZZhJwxKlTZGTeT9rvnskw', 'text': "What is a trip to Vegas without having dinner at Joes?  \n\nThe service is great and the food is excellent.  \n\nYou cant go here without getting the Stone Crab Claws, they are to die for! (Well not really... but they are damn good!) The steak melts in your mouth and is always cooked to perfection...\n\nThinking about it makes me wanna go to Vegas again this weekend.  Who's down to go??", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2009-06-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Qhb6NTcTSwEmHGdbYZFVVg', 'review_id': 'oPf9BB2jl6Me5aYGQjfjBg', 'text': "Food excellent, service excellent, and its vegas baby.\n\nBut seriously do yourself a favor and order a BLT salad and the crab cakes, AMAZING! and I haven't even talked about the filet", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2009-06-15', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'SRsofHYNavGfAuDtIJ_n2Q', 'review_id': 'DJ5gKWaFkCHd0o19sFS_DA', 'text': "Need a place to eat on a guys trip to Vegas? This place has it all and isn't going to break the bank like some other places in Vegas.\n\nWe got a reservation for eight on a saturday night with little trouble on our own, no thanks to our incompetent Concierge at the Mirage.\n\nWe started out with drinks and a bottle of wine. A variety of bread and rolls were on the table when we sat down, everything from dinner rolls to rye to brown bread. \n\nOur waiter was the man. He steered us away from the 2nd Mortgage appetizer and basically told us the only two things we needed were the stone crab claws and the king crab legs. We were not disappointed. The mustard sauce that came with the claws was fantastic. The claws and legs were all pre-cracked/opened for easy consumption...\n\nFor dinner, most of us had steak. I had the bone in tenderloin (they didn't have a porterhouse, but this is essentially half of one). It was a prime steak and cooked to a perfect medium rare. The lamb and pork chops looked excellent as well. \n\nWe didn't save room for dessert, but the key lime pie looked very good...", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2009-06-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'auFznQwzwB8_x8K53ZtnWg', 'review_id': 'G8lxveRF3m-dFoZL17dejw', 'text': "My husband and I has reservations here on a Wednesday night at 7:00 Pm.  We got there promptly at 6:45 pm and was seated right away.  The service was impeccable from the host, to the waitress, and the bus boys.  They immediately gave us a good selection of some tasty bread to munch on.  \n\nSo far, so good right?  We order a nice white wine since we planned on having seafood and the stone crab appetizer and 1/2 a dozen oysters.  Stone Crab was nothing special to me.  I prefer king crab in all its butteryness.  Oysters were delicious but there's not much the chef has to do there.  For main entrees, I ordered the Salmon Au poivre and the hubby had the swordfish.  Here's where I found the taste and texture lacking.  Salmon was not that tasty and too lemony.  The Swordfish was too tough.  We order their mashed potatoes on the side and it was ok for me but their grilled corn was amazing.  \n\nThe bill was about $160 which included tax and tip and not worth it for just OK food.  I wish I could give them more stars because the staff was really nice.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 3, 'date': '2009-06-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MJ-nx96A-Wsv95DIh6TmWA', 'review_id': '7ZTh-SHYw3l9HmeLMk8wJw', 'text': 'Great place to stargaze...saw several celebrities. The food is really good and the service was fantastic. We went for lunch and paid maybe $85 per couple. The bread was excellent to start and even better was our steak. It\'s inside the forum shops which makes it kind of loud if you sit outside on the "patio" as we did. Worth giving it a try while in LV.', 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2009-06-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qXMObUokAEAkgUqD7Oc9Dw', 'review_id': 'CZFpZl5NJA5ursNUCXBE_A', 'text': 'Fantastic food from the 90% stuffed Crab Cakes to the Filets and Crab legs and finishing with the best Key Lime Pie in Vegas this place is top notch.', 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2009-07-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JxZXnrUd0P3lTOsdEhkidw', 'review_id': 'BdrJwN5W7s5EG0VFyZrOJA', 'text': 'If you aren\'t looking to save money, and you are looking to eat the best steak/seafood ever, then this is the place to go.  I was fortunate to go with the in-laws so I wasn\'t picking up the tab.....(thank god!).  The bad part now is I\'m hooked, so next time I go to Vegas, I\'m going to have to fork down my own money for this place.  I will do it though, because I had the best meal of my life when I went.  I started with a ceasar salad which was fresh, flavorful and prompt.  Followed by a bone-in filet mignon that was the best steak I\'d ever had in my life (and this coming from a person who is a meat eater and loves her fancy steakhouses....Ruth Chris\' doesn\'t compare!).  I also had rice pilaf that was tasty.  The rest of my party had the crabs / lobster and they said it was wonderful ("The best they ever had"!).  Didn\'t order any drinks (didn\'t want to put the in-laws in the poor house), but I\'m sure they would have been good too.  Service was sufficient and knowledgable.  highly recommend, but be prepared to take out a small loan to pay for this meal.  My bone-in filet came with a $50 price tag (that\'s just for the meat, not the sides and etc) and the Lobster rolled in at $69.95 (Wow).  Well worth it though!', 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2009-07-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LcWp2WChE9HpqdMEM8D2VQ', 'review_id': 'hRxJTniE_e136AnBe58uhA', 'text': "Woohoo what a gem! If you're looking for a superb restaurant on the Vegas strip, look no more, this place is it!\n\nSwung by on a Saturday night with reservations (recommended), greeted by the awesomest of hostesses and servers who know their food. Kicked off the night with a small bottle of Chianti wine, recommended by server. Appetized the dinner with the stone crab cocktail, which is a MUST-GET, amazing texture with a nice hint of lemon and their mustard sauce ..yumm.\n\nFor our main courses, we had the Filet mignon which was cooked to near perfection with a seafood salad, a generous portion of lobster, crab and shrimp with their house dressing (again, highly recommended). Side dish included mashed potatoes breaded and cheesed on top, a great compliment to many of their main courses. \n\nFinished the night with ridiculously melt-in-your-mouth are-you-kidding-me key lime pie. I should have bought a whole pie....\n\nTruly, as good as it gets!", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2009-07-21', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 4, 'cool': 2}, 'user_id': 'QPfUZ4As5MbVKLqRHUofTQ', 'review_id': 'FAu57Rmebb1N9RDscZOH_Q', 'text': "I LOVE the crab claws...delicous goodness.  I would recommend getting the large claws instead of the medium...so much more meat.  I went for lunch and got the 3 large claws with hash brown, salad & dessert.  The hash brown was ginomous...don't see how anyone can finish that by themselves.  I had a piece of their filet mignon and it was very good.  Can't wait to go back =)", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2009-07-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 2}, 'user_id': 'ZtFf2ervN53wKa-NoccTpA', 'review_id': '3LavcYi7jMprBiYSXeBd0Q', 'text': "The BEST filet mignon EVER! \n\nThis is it folks! When you're looking for a filet that is so good it speaks to your soul look no further - get it at Joe's. I generally do not order filet mignon because they always seem to lack flavor. Delmonico's is a prime example of an over priced bland filet. Thank God for Joe's that a sista can finally enjoy a figure friendly cut of steak that is out of this world. I ordered the lunch special and for $21.99 here's whatcha girl got: \n\nPetite Filet - Awesome! \n\nJenny's Potatoes - Not the greatest. I would never order this again. The hashed brown potatoes didn't look any better. They looked like an over-sized overcooked baked potato. \n\nGrilled Tomato - Phenomenal. Never had anything like this I'm my life. One slice of a grilled tomato covered with cream of spinach and then layered with baked cheese...don't knock it til you try it. \n\nTwo Crab Claws - My awesome waiter threw these in for free to ensure that I at least experienced the famous crab claws. He was honest about stating they were not in season. They were a bit frozen, but still okay. I was glad I didn't order them as my main course. \n\nKey Lime Pie - The Bomb! The lunch special actually came with banana cream pie...once again my waiter went over and beyond to hook me up. \n\nThe service here is the BEST. Everyone is there to ensure you leave extremely happy. My server went as far as to squeeze lemon juice over my hands prior to handing me a hot towel...OMG!!! \n\nOverall, this place was outstanding!. I would highly recommend.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2009-07-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XAz4I30tssPn373BzAduug', 'review_id': 'n0JMCkKJqW2nF_eKFoNSCg', 'text': "I've never been to the original in Miami but this one is definitely superb. The stone crab and king crab legs are delicious! This is a perfect spot for a great family meal, i think the next time I have parents in town, we will definitely want to take them here!", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2009-08-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_eIJOK2LEdBfZIp6KTdD3w', 'review_id': 'AYbx2EAvAesep_8iyJW-tA', 'text': "Everything about this restaurant is fantastic!!!  The food is SO GOOD here - and the service is awesome.  I went for my 33rd birthday with 10 girlfriends, and we had a blast!  The seafood salad is incredible, the crab bisque soup is delicious - and the crabs were amazing.  We were all very impressed with the side dishes we ordered - mainly the rice, creamed spinach and corn dishes.  I tried the Boston Cream pie - I loved it - I have a big sweet tooth!  Overall, it was a delightful experience and a great time.  I highly recommend this for romantic dates, groups, and special occasions.  You really cannot go wrong!!!  Everyone thought the prices were reasonable - you get what you pay for here and more.  We will ALL be back... we can't wait!", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2009-08-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'AAX8oeoIq2UvMDLghGBclQ', 'review_id': 'xC2-cOZDZHYenhKKUnzviA', 'text': 'Went here Sat night and had a fab dinner! I was all about the stone crabs after seeing Bobby Flay raving about them on the Food Network\'s "The Best Thing I Ever Ate" show. And I gotta tell you. The stone crabs were a little overrated. They were fine but I\'m glad they weren\'t more expensive cuz I would have been disappointed. Not as sweet as King crab legs and I wasn\'t crazy about their \'special\' mustard sauce. \n\nWe sat at a high boy table in the bar and had great service with a very knowledgeable server. We opted to try a lot of different dishes including the 12 oz filet that was definitely more than 12 ounces. Plus we had the corn (to die for!), mashed potatoes (ok), grilled tomato (great!), the wedge salad (best wedge salad I\'ve ever had!) and Joe\'s special scallops (pretty darn good!) PLUS the banana cream pie to end it all which was not overly sweet and  had a light caramel sauce with candied pecans on top. \n\nAttire was casual and we felt very comfortable to just hang out and take our time savoring every last morsel. Will definitely be back!', 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2009-08-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': '1Ib0FDveHWB9T40lwEUiDw', 'review_id': 'pZIxq0-XPQ1e9lT53dbVzQ', 'text': "More like 4.5 stars but I'll round up =)\n\nThe stone crab appetizer was delicious but I was really there to get my steak on.  My filet mignon was prepared to perfection.  Other high-end steakhouses can't seem to give me the medium-rare that I always request -- and so I always end up disappointed with a bland medium-well.  What the heck, right??!  Isn't it your JOB to know how to cook a steak??   Come on now!\n\nBut Joe's...WOW...that steak was probably one of the best I've ever had.  The meat was extremely tender and cooked exactly medium-rare.  There was not a single thing I did not like about it.  The sides of mashed potatoes, mac and cheese, and sauteed spinach were absolutely scrumptious.\n\nEnded the dinner with their coffee (served in a nice little mini kettle so it's actually about 3 cups) which I must say was very good as well.  What makes this place even better were their more than reasonable prices and excellent service.  Awesomeness.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2009-08-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '4kmyKavoLFRDv1eyLkb4gg', 'review_id': '3mJkucaPt3R7xPFVJ8kkhw', 'text': "I am a regular customer at Joe's for a reason...... it is simply the best food and service you can get.  The stone crab claws, lobster, filet mignon, side dishes, deserts, and wine cellar are unmatched.  The waitstaff is incredibly attentive..... even though you have no idea that they are watching you, all of a sudden they are there to fill your glass, clear the table, check on the meal, and whatever else you need almost instinctively.  Great ambience and a wonderful location at The Forum Shops tops it all off.  My hat is off to these wonderful folks.  BTW, I learned that Joe's is owned by Lettuce Entertain You... I should have known.... these folks are some of the best restaurant operators in the world.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2009-08-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Q4dM088wlbfPRJ75-KOHxg', 'review_id': 'IrQJQp-T44fEvzQ0FeSS-Q', 'text': "We were told by the concierge at our hotel that this was the spot to go to for steak & seafood and I will agree this place is the spot. Our party of four ordered everything from oysters, calamari, shrimp cocktails, crab, calamari, rib eyes, NY steak, lobster, and then some all in one night. EVERYTHING WAS GREAT! \n\nI wasn't a fan of the pies for dessert but I guess it's a tradition their but I was too full to care. We been to a lot of different steak & seafood places in Vegas and I would have to rank Joe's in my top 2 next to Nine Steak!!!", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2009-09-07', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 2}, 'user_id': 'K5ELQJBhgNTexIvKfZdGCw', 'review_id': 'QClrBJFZPtZfyjeyqUiSGA', 'text': "Didn't your mom ever tell you not to play with your food?\nwell, that rule DOES NOT apply here!\nso roll up your sleeves, pick off the shells (while sucking every ounce of flavor off from every single piece!) and devour yourself into these heavenly tasting stone crabs!!\nYou will not forget but crave for more and more!\n\nwhile you're there, I also recommend the oysters rockefeller... It was so good I wanted to lick the remaining off the shell... the best I ever had. and chopped lettuce, tomato onion & bleu cheese... it had real bacon crisped to perfection, flavored oil of some sort (maybe from bacon) was definitely a positive addition!\nand PLEASE don't forget the key lime pie!! like everything we had for dinner, this too was full of flavors! yum!\n\nnot only the was the food excellent, but staff also seemed to have been perfected! highly recommended!", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2009-09-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'neQPSjQZEcdaRCFgLOPUCw', 'review_id': 'D10xfvhpHOeCwIScj9E2EQ', 'text': "One thing I must say right away: Get the filet mignon!  One of the best I've ever had.\n\nAmazing and knowledgeable staff.  Utterly delicious food.  The bread basket was bananas.  Blue cheese-stuffed olives in my dirty martini.  And the best part was that the staff at Joe's made us feel very special and taken care.  Can't put a price on that!", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2009-10-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9LoYHyLngCC_yxWOxE_j0A', 'review_id': '9MJAC7XXoCk2Q6vcNtA21w', 'text': 'My Husband took me her for my Birthday dinner and it was so good! the Steak is amazing, I just started eating steak about three years ago and this is amazing! the stone crab is to die for! \nI like the service and food is consistant!\nWe have been her 2 times now and both were great!', 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2009-10-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PuW93FmHmLaU1hrWOXrvjQ', 'review_id': 'Tf8RDdCXYouv8H27DxHy0Q', 'text': "Joe's is always good. I only come here for the stone crab.  today, at the market price of 45.00 per 6 claws, we ate 2 orders of the large claws and a side of cottage fried potatoes with a crab cake to start.\n\nCold or hot, their stone crab is outstanding and always fresh.  I have to suggest their jumbo crab cake as a starter because it's heaven on a plate.\n\nIf you are looking for great stone crab or just want the experience, it's worth every penny at Joe's.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2009-10-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'T_kMEgHqIqwbHR_7yhqWFw', 'review_id': 'APsqWYAIbiel5RH2gQANRQ', 'text': "Joe's is great- the stone crabs were fresh and a good size, the calamari was good and the crab cake had little to no filler.  I ate in the bar and found the service to be a little slow (it wasn't that busy), but would certainly go back.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2009-10-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rI6j_9Hmy2z_gXNtquR4Lg', 'review_id': 'MqkiHvtV-E9iDsEMBE91_w', 'text': 'The service was ok, but the food was outstanding! The bread basket was very decorative and yummy, we started out with the calamari which was good and for my main course I had the 12oz Filet Mignon (cooked just right, flavorful, juicy, and mouth watering). The food again, was excellent!', 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2009-10-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wMC-8NPjKZwbfjjDThtqqQ', 'review_id': '8Yk-1DaplNGW-0N2brRrhw', 'text': 'this place was okay, not as good as miami.  the crabs were definitely frozen and stuff, i can get that in queens, no need to get in vegas.  if u want the stonecrabs, just go to miami for the real thing.', 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 2, 'date': '2009-10-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'oxvDwrRLjtIWfYV-0KyBbQ', 'review_id': '6UUlI2o9ajcRDf64IMRNNQ', 'text': "Joe's is a staple for us in Vegas--we just cannot get stone crab this tasty anywhere back home.  On our most recent visit, I tried my very first whole lobster!!!  It was beautiful and buttery and delicious.  We also had one of the suggested dinners with the large stone crab claws, creamed spinach, and some kind of potatoes I think.  WIth the tasty pumpernickel raisin bread (and others), giant lobster, crab claws, and the obligatory slice of their award-winning key lime pie, we were stuffed to the brim! (Sorry sides.)  \n\nOn past visits we've also had steak (well executed), the fried oysters (super delish!) and lobster bisque (also delish, but they didn't have it this last time).  \n\nAs their name implies, you seriously can't come here without getting yourself some sweet, meaty stone crab claws with the sweet mustardy sauce that they have perfected!!!  We settle for Truluck's all you can eat stone crab on Mondays sometimes when we have a real hankering, but no one does it like Joe.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2009-10-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'EFobJQjjuPE06TtrlYHYYw', 'review_id': 'CQf1SM0lSL-d5YOatsFHtQ', 'text': 'We were seated right away and the whole experience was great.  They even tried to find the football game my husband wanted to watch.  A little pricey for sitting at a bar table but the food was very good.  The seafood chopped salad was my fav. and they make a great blue cheese stuffed olive dirty martini!', 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2009-10-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'E221gu367rhRl0XdL19Lxw', 'review_id': 'eBTLg7PdkZ5HRbshFxtluA', 'text': "After my first visit to Joe's in Chicago, I was hooked, yet also saddened that there was no Manhattan location.  So, imagine my pleasant surprise when I saw the Las Vegas destination listed on OpenTable.  I made a note of this exciting fact and convinced my friend to try it during our trip to the crazy city.\n\nThe lunch hour brought a substantial crowd to the outpost at Casear's Palace, and we had to wait quite a while only to grab two stools at the packed bar.  Our busy and bland waitress/bartender did little to speed up our dining adventure.  We dug through our varied bread basket, each new roll or flat bread an exciting discovery.  \n\nWe each ordered the Seafood Chopped Salad, the dish that Joe's had won me over with.  The large bowl of mixed greens was topped with slices of hard-boiled egg, cubes of cheese, and various fresh vegetables.  Large succulent shrimp, flavorful lobster claw meat, and chunky Alaskan King Crab were scattered throughout the plate.  The shellfish tasted fresh from the sea, perfectly crisp and tender.  In terms of dressing, I had requested the Joe's Vinaigrette on the side, but was told that it usually comes with the creamy Italian instead.  However, the waitress offered to bring me a cup of each, which I was so thankful for.  The house dressing was more like an oily, garlicky salsa with chunks of ripe tomato.  The Italian vinaigrette was also delicious, with a light-bodied seasoning.  Since the Joe's version contained vegetable pieces, you could basically spice up your salad with drizzles of each.  This fresh meal was what health food dreams are made of, and the bread basket alone is reason enough to dine here.  \n\nJoe's is a fantastic chain seafood house that far surpasses expectations.  For all of its touristy, casual dining attributes, it will blow you away with its high-quality ingredients and traditional preparations.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2009-11-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'RLyUwIyd-0COUpJYa4x9bA', 'review_id': 'SLPbhyokW7w-oHB-EzUjKg', 'text': "I am very familiar with the original JOE's on South Beach and just happend to stumble on this one in Vegas while looking for a place for lunch...I was not disappointed. \n We were greeted with a basket of warm fresh breads including their delicious pretzel bread. I ordered the seafood salad that was loaded with Shrimp, crab and lobster  and it was great. Others on the table had the lobster, Clam Chowder,  oysters and crab cakes and all raved about it. We finished the meal by sharing thier Keylime pie....it too was super yummy. \nThis might be the best lunch in Vegas", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2009-11-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'a6EschgdOtUwo9U6CesTqw', 'review_id': 'KfrSwMSYF5ZkcPMmxrZ5TQ', 'text': 'Best Crab Claws in the Country!', 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2009-11-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '588oY8EejEFCr-ym_2TR0Q', 'review_id': 'mNAt4C40X7XU2s5u-rTrPw', 'text': "First night on our Honeymoon, we got to Joe's around 10:15pm right before closing at 10:30.  We sat at a table near the bar.  Our waitress came over and got our drink order, and about 10 minutes later they finally arrived with some bread selections.  Other people have commented that their bread was warm, but ours was cold.  The selection of different choices was a treat, and the lavashe covered with melted parmesan cheese went well with my Bacardi and tonic.  For our meal my wife and I decided to share an order of 7 large stone crab claws, shrimp cocktail, oysters Rockefeller, and the Aged 16 oz NY Steak.  Everything, and I mean everything was top notch.  The oysters were filled with bacon, cheese, and spinach; the shrimp cocktail, while not quite Morton's grade, was  tasty and had nice sized shrimp, the steak was thick, juicy, and cooked to a perfect medium rare, and the stone crabs.....Words cannot explain how good these were.  Growing up in a Pan-Asian setting in Hawaii, there are very few sea foods that I haven't tried.  From Jellyfish salad, to raw squid, we have it all there.  I've had Dungenous, Maryland Blue, King, Snow, and last night finally, I got to cross Stone crab off my list.  While pricy at about  $60 for 7 Large pieces, they are divine.  Huge fatty pieces of perfect claw meat await you after taking off the pre-cracked shell.  Follow that up with a dip in Joe's famous mayo sauce, and you have the food that the gods were suckled on.  And oh yeah, we ordered a bottle of bubbly to compliment the sea food, and  cut the fattiness of the of the steak.  Overall, a great meal, and a great start to our Honeymoon in Vegas.  I would eat here every week if I could, but at $300 including tip, I wouldn't be able to make my car payment.  That being said, the service, although very friendly was slow, and I know that it was because it was so late, and we were literally the last seating, but I have been to places in NY and Chicago that were the same caliber of food, had a late res, and they took care of us the entire way.  Last night it felt like a great meal, but a little rushed.  Never a good feeling when you drop 3 bills for a meal.  So a little our fault, a little theirs.  Next time we come, I'll make an earlier res, and hopefully the service will be a little sharper.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2009-11-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'C1eXcA1R7RWVGStrNTFIWw', 'review_id': 'zgmvSJ3vEMg8ocZlERkPXQ', 'text': 'had a business dinner there, ordered the stone crab for apps, a filet mignon with mashed potatos and spinach. Great meal, good service\na little pricey, but will return', 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2009-11-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UdkcZvYH35mmFa70lW0B0w', 'review_id': 'pg7v2N-UqwkZqAmmt17k3g', 'text': "I'm definitely a fan! The fam took a Vegas vacation for my parents 40th anniversary. A friend suggested Joe's. Great place to go for a party of 6. Their specialty is the crab and steak.  \n\nWe started with the calamari. Yum\n\nI ordered the Medium stone crab that came with mustard sauce. The crab was delicious and the sauce nicely complimented the dish. As a side i ordered the sweet potato fries.. it was sooo yummy with the mustard sauce. \nMy beau had the bone in filet. Yes were all a little confused that the filet came with a bone, but our waiter assured us it was possible. It was cooked perfectly and melted in the mouth. That's how I like my filet mignon! \nEveryone else loved their dishes. At the very end our server brought my parents a lovely brownie topped with ice cream to celebrate their anniversary. \nJoe's made us feel very welcome! A great experience indeed.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2009-11-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'R4Arglb6M2j6BbKZBY-fpg', 'review_id': 'q-eyav971Rvq2-VGDR_F9Q', 'text': "Best Stone Crab ever. \n\nWe went for a late dinner and had the stone crab bisque, which is just incredible, the onion strings and the 5 Large Stone Crab meal. And don't forget all the great bread. Our server was Stephen who was always available. \n\nWe are definitely coming back soon.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2009-11-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2mWZDiRgc4XpZPY4U1mHYQ', 'review_id': '_sYT2QP-j-EINJnvk4RkrQ', 'text': 'The patio dining area (where I ate for my first visit to Joe\'s Stone Crab (the original name of this establishment) is nice enough, with a view of folks strolling around Caesars Forum Shops, but the real transformative experience is in the dining room.\n\nThe dining room is one of those wood-paneled jobs, and it is manned by waiters in black ties and tuxes. A wonderful "old school" environment. I truly forgot that I was in a fake Roman mall. The service provided by the wait staff was unparalleled. It is great to be in the hands of real professionals. Yes, he\'s made those suggestions a thousand times, but such polish comes from commitment as well as experience.\n\nOh yeah, the food was great to. Fish cooked just right, tasty stone crabs, crunchy salads not over-whelmed by dressing and marvelous roasted corn (a spot-on recommendation.) My date said her steak was the most tender filet she had ever had. No room for dessert.', 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2009-11-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BNUtzOsKfIZLV3nOLLP3Fw', 'review_id': 'UL73dX7zjqO7C2yz9e9rCg', 'text': "We had our dinner here yesterday, and it was as wonderful as it could be.  Stone crab tasted light and fresh, the tip of the claw is black.  We also ordered a 21oz bone in ribeye steak, and it was so flavorful and cooked to perfection!  To top things off, their homemade key lime pie was the best I ever had.  The side dishes are hit or miss, so minus .5 star.  It's a great place to come with a large group, food is solid and consistent.  I also enjoy the relaxed setting and attentive service.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2009-12-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rb94j6oofp84stiy6JAOcg', 'review_id': 'Wf7QmCzE22EtIkYwic8P-Q', 'text': "We came here on a Saturday night in December, a party of 6.  We made reservations for 5 since the only other time was at 9.  It ended up working out well because we had a nice relaxing long dinner before returning back to our hotel for a nap and getting ready for the evening.\n\nDecor: 4.5/5  Clean, beautiful dark wood paneled walls.  We sat in the back circular room, the seats and tables were arranged a little strangely in that I noticed later the seats weren't evenly distributed (minor) but not in a logical way.  The seats were up against other seats from adjacent tables.  Poor planning and made getting in and out difficult.\n\nService:  5/5 Service here was fantastic.  The waiters (I didn't see any waitresses) were all in Tuxes and very professional but more importantly friendly.  Plates and dishes were cleared promptly and the waiter chatted and joked with us.  Amusingly enough, we stopped a bus boy (who was also dressed in a tux) if he could bring us a Jus -- he either misheard or didn't know what it was, but he did his best and we were brought some other sauce.  (Some white gravy stuff that turned out to be pretty tasty)\n\nSurf: 4/5 I didn't try the oysters but the table seemed to enjoy them.  The stone crab pretty much just tasted like crab to me.  The mustard sauce didn't have much flavor in my opinion.  I was underwhelmed by the crab but it was neat trying them.  I wouldn't feel the need to order that again.\n\nTurf: 4/5 the meat was good.  4 of us ordered the Petite Filet Mignon -- strangely I think only one of us finished it.  I guess we got filled up with the delicious bread (5/5!).  The meat itself wasn't bad but not amazing.  I think it was worth the money but sadly not memorable.  The fresh horseradish was not very spicy, their special mix of spices/seasoning was tasty (but very salty)\n\nSide Dishes: 3/5 we tried a few of their dishes.  Ranked from least favorite to favorite.  1) The creamed spinach could have been entirely skipped.  It was flavorless.  2) The Mac n Cheese was ok, they used spiral noodles.  If you're in the mood for Mac N Cheese you'd probably be satisfied, but it also wasn't memorable.  Then again I think I've started expecting bacon and maybe gouda in my Mac N Cheese now... 3.  Jennie's Mashed Potatoes.  The crusty crumbly bits on top were yummy and the melted cheese inside was great.  It was strangely dry though.  My idea mashed potatoes have chunks of firm potato and then soft creamy potatoes in it... this was just a little dry but great flavor.  Worth ordering  4) The sweet corn was surprisingly great!  I usually like corn plain, but this was really delicious.  I think we were all surprised with how good this was -- that was the only side plate that was entirely finished.\n\nDessert 5/5: We ordered the Key Lime Pie.  All their desserts are made fresh daily and since this is originally a Florida restaurant -- we decided on the Key Lime Pie.  It was thankfully not green and was very light and at least for me, the best Key Lime Pie I've ever had.  I finished most of the pie even though I couldn't even finish my steak (and lemme tell ya what a steak person I am!).  The coffee was also excellent according to my friends, but I think starbucks is good so I wouldn't know.  Sorry!\n\nOverall, it was a great meal.  If I went back to Vegas I'd probably want to try a different restaurant but I certainly recommend this place to anyone who hasn't been there.  The meal ended up being a final cost of  $78/person (that includes a $40 bottle wine). \n\nI'd recommend coming here with at least 4 people (we had 6) since the side dishes family style.  Apparently, you can get Joe's delivered to your house.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2009-12-07', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'dr1XMEyV064TurI_wYZi3Q', 'review_id': 'NTXJKdq3ehml-ZoNx3Qy-A', 'text': "I really have to give my highest marks to Joe's in Vegas -- it was the highlight of my weekend in Vegas. \n\nWe were treated absurdly well by our waiter, John, who was really the kind of waiter you'd expect and want in an old-school, classy restaurant like this. \n\nThe food was delicious and, of course, the stone crab was amazing. They serve it with a dijon sauce (I am used to butter with crab usually) and that was a great addition. I also really, really loved the green beans (which they have a far fancier name for) and my dinner, the crab-stuffed sole, was a new food to me and I loved it. \n\nI was particularly pleased with how accommodating they were of my dietary needs -- I couldn't have the lobster sauce that comes with the sole so they put it on the side and offered me several other choices. It sounds small, but it was a gracious gesture and they did not make a big deal out of it. \n\nI could not believe the size of the apple pie and it was so gorgeous my family hated to dent it... but, you know, it's a dirty job...", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2009-12-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 2}, 'user_id': 'PXAIu1h0kt2rqwYbup7NjQ', 'review_id': 'KUzbL2X_7fIy3XZF3xdYAA', 'text': 'Eat at Joe\'s.\n\nThis is one of the great steak and seafood restaurants in town. I\'ve been to the Miami restaurant but avoided going to the Vegas version for fear that it wouldn\'t measure up. I was very wrong. \n\nExcellent food. \nOutstanding service. \nGreat, and fairly-priced, wine list. \nVery good bread selection. \nAnd a lovely, clubby decor.\n\nThis, along with Envy, will be a "repeater" for me when I\'m craving protein.', 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2009-12-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'kCsawkVOGajlhL9Ct-_rrA', 'review_id': 'ms1ieZOxy8Sltk3c36v1qQ', 'text': u'First of all, LUNCH. Surprisingly there aren\'t that many nice places to have lunch on the Strip: Joe\'s is one of the best choices, particularly if you are unsure of your companion\'s dining preferences or looking to find something moderately priced and moderately fast (there are small salads, sandwches and burgers on the bar menu). \n\nA spin-off of the Miami legend, Joe\'s offers three distinct environments --a bustling patio in the elegant Forum rotunda, a very large casual bar, and a huge 40s-50s era dining room that is classic (I also discovered they have two round function rooms overlooking the Strip and a elegantly old school "Boardroom" for private dining/meeting).\n\nCoat and tie not required, but common, esp. in dining room--and large parties seem to be common. It isn\'t surprising to run into both Casino heavy hitters (even those from competing properties, who could eat elsewhere for free) as well as visiting celebs. Tuxedoed waiters  provide detailed service...though when things get very busy, they may run by you a bit too quickly.\n\nThe menu is full of surprises--beyond the expected stone crab claws, shrimp, oysters rockafeller, shrimp dejonghe (basically breaded scampi, but made with impressively tender prawns), crab cakes and fish dishes, there is an excellent Chopped Vegetable Salad, good garlic creamed spinach and roasted corn.\n\nThe bone-in filet mignon was among the very best I\'ve had in Vegas. And I have to tell you that I have sampled virtually all of the best steakhouses here.\n\nOur Dover Sole was lightly breaded and gorgeously saut\xe9ed to a golden hue; the waiter deftly deboned it at the table and served it with a slightly carmelized lemon butter (it didn\'t need it).\n\nThe fried chicken was another unexpected surprise, a hefty four pieces, lightly battered and deep fried, the crispy crumb batter giving way to moist flavorful meat within. Savory but light.\n\nIn season, the Alaskan king crab legs here are far and away the best I\'ve had: sweet, juicy, light with none of the mealy taste you get from lesser crab. \n\nTheir pies are offered in half portions-a great option should you want to sample more than one. I have had uneven experiences with the signature key lime pie--one time it was perfect, another time, it was rock-solid frozen, and the waiter neither apologized nor replaced it when I complained. \n\nGenerally speaking, prices are on the high side but the quality reflects that. Order with care.', 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2010-01-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'y2qEGFlKeJMvcVCWGP1NLg', 'review_id': 'XlY0-J7VozayqR83vzeO5g', 'text': "This is not your average Joe. The food here is pretty spectacular. \n\nCame here for the famous stone crabs and enjoyed them. I hear that stone crabs are a Florida thing so I bet they are better fresh there but these were pretty darn good. They give you a plate full of just the claws BINGO or should I say KENO since it's Vegas.  It's my favorite part of the crab and the meat has a nice sweetness to it.  To top it all off the crabs come already cracked for you. No more man vs. crab, a battle I've lost many times. You practically just slide the shell right off.   I left with no chipped teeth and without any scratches yea-ah. \n\nAlso had a nice ahi salad and the crab bisque. Both were delicious.  A nice light lunch except for the Bloody Mary. \n\nThe Bloody Mary here was the best I've ever had and I don't normally like bloody mary. It was like a meal in itself. Came with a large stalk of celery and these excellent tomato olives.  Asked for it spicy so it had a nice kick to it. Very flavorful and went well with the crab. No cocktail sauce needed after drinking that cocktail.\n\nAll in all a good place. It's not a hole in the wall type of place but it does burn a hole in your pocket. It's a bit on the pricy side but that's to be expected. I mean hey I don't see crab growing anywhere near Vegas. It's expensive to ship them in and I'll gladly pay anyone to crack my crabs for me.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2010-01-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DJpyQDtvNCY6xnW0RPQARg', 'review_id': 'E6hFaTxnz_MVodYBvlaneQ', 'text': "I am all for Joe's.\nI came here for dinner during a business trip to Las Vegas and was not disappointed.  The service was terrific and the food was great. The stone crab did not disappoint and i appreciated that they cracked the shell before serving it to you! I really enjoyed the horseradish dipping sauce that accompanied the crab and the sweet potato fries. \nI also enjoyed a couple of dirty vodka martini's and the bartender made them perfectly! I would go back for the drinks alone.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2010-01-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'gdf9ftAOMms8JToU52uX2A', 'review_id': 'AynzqTCeVrmny3ZyhCZBkA', 'text': "Went here for dinner with four of my friends and had a great time.  They real keep it simple with great quality food and simple service.   \n\nGot a mountain of Alaskan Red King Crab cracked table side that was perfect.   All of my friends steaks were perfect.\n\nJoe's takes a great concept and executes is well.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2010-01-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'czWjq7kZf6GQQXH0BUoeGA', 'review_id': 'lr9U25fL1fbTujgJSKBtiQ', 'text': "Excellent service. The food is fantastic. Love the stone crab with the hash browns and cole slaw. The key lime and banana cream pie were the best ever.  I had 1/2 a slice of each.   Can't wait to go back again.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2010-02-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '42CatAdKERIgf2M-F7U3ow', 'review_id': 'dF0DAIBeutogD-CmfIgMcA', 'text': u"We had a group dinner at Joe's and it was absolutely wonderful.  There were 12 of us, so unfortunately we had to split up into two table right next to each other, but it didn't matter... the highlight of the night was the food.  We started with the seafood sampler appetizer, which wasn't the greatest deal because we only got one of each item (jumbo shrimp, medium stone crab, and lobster), and it was ok.  The shrimp and lobster were good but the stone crab was difficult to eat and not very flavorful.  Next, I opted for the surf and turf special that night.  It was the signature bone-in filet plus 12 ounces of lobster (yes, 12-ounces!).  The filet was cooked perfectly and extremely flavorful, and there was so much lobster it was unreal.  I shared asparagus, broccoli, saut\xe9ed mushrooms, and cheesy potatoes with the table, but the sides were neither blockbuster not abysmal... just good.  Dessert was key lime pie, and it was great.  \n\nOverall, a wonderful meal.  A little pricey, but we knew that going in so I'm not deducting any points for the price.  Come with an appetite (and a full wallet).", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2010-02-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KKdxN80tUpf6JuU0WklG4Q', 'review_id': '5m-8XoCEvmsxEE0quvbB2Q', 'text': 'Tried this place for the first time on a Saturday last month and went back the very next day! Yes, It is that delicious!\n\nWithin our group we tried their stone crab, shrimp in garlic sauce, fried chicken, steak, macaroni and cheese, and roasted corn and if I could I would of tasted more! \n\nTheir service was also excellent and fast, and valet parking is free! (Gratuity still appreciated however). \n\nI cannot wait to go back!', 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2010-02-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'RUemAY0y3a1Up9-sT8pGww', 'review_id': 'okatSNROpGAL2Bk5nn2oYg', 'text': "The 2 crab claws that are ~$20 are not as juicy or flavorful as a normal dungeneas crab you can get at the asian market place.\n\nIt was a bit bland and tough to eat.  Sorry I don't have much good things to say, so I won't say anymore.http://static1.px.yelpcdn.com/static/20100209/i/ico/star_big_2.gif", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 2, 'date': '2010-02-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'P2FD7E392y01VcBVWli6og', 'review_id': 'QbFenapnt-rdT-NegIHvOw', 'text': "I am a huge seafood fan, so when it comes to seafood I want the best quality.  I will pay good money for that quality too!  \n\nThe seafood here is too good to be true.  I went there this past weekend for my Valentine's dinner.  We had the medium order of Stone Crab, and the order of King crab legs.  The stone crab is kind of tedious to eat since the meat really sticks to the shell, but it tastes so fresh, you will want to make sure you get every single piece of meat off the claws.  The sauce it comes with is very flavorful too.  MM hmm..to die for!  The king crabs....are definitely KING.  They're huge!  They are not your average size crab legs you find in the buffet.  These are like 1 inch in diamater thick crab legs.  They come pre cracked so you don't have to deal with cracking them yourself.  Instead, enjoy them with your bowl of drawn butter.  So fresh, so good, so meaty, and well worth the $60 you'll pay for them.  \n\nFor sides, we had the steamed asparagus, and the pan roasted corn. The asparagus was bland, but the corn was delicious!  I've never had pan roasted.  I like the texture!\n\nFor dessert we had the havana dream pie and a cappucino.  The pie was super tasty and yummers.  A little too much custard, but I like the white cake it lays on.  So good!  Cappucino was of course excellent. \n\nNice atmosphere as well, with nice wait service.  The maitre'd was super nice too.  I recommend this place for a fancy date dinner if you both love seafood.  I had a great time there! =)", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2010-02-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'nGvolzdWXhC-U8U0ZLydWQ', 'review_id': '2x5ILJVPGc89H_mPqtn2zg', 'text': "I love the steak fries here! They are cooked to perfection. \n\nBut let's get down to business: the food is great in a casual atmosphere . \nYou get a bread basket with an assortment of fillers to get you started. \n\nI've had the stone crabs which this place is famous for. It's a chain, but they do it right. \nThe seafood is very fresh! Apparently, this is the highest grossing restaurant in the Caesars Forum Shops. I can see why. \n\nI had the blackened mahi mahi sandwich which was also very good with a side of cole slaw. \n\nI heard the peppermint pie? is really good have yet to try, but will return.\n\nHighly recommended for lunch or dinner.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2010-02-20', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 4, 'cool': 4}, 'user_id': 'I3QDSkHyHUd3wlmRUb0eyg', 'review_id': 'D5BiS_yJPsFrCZiuwhPL6A', 'text': "I've eaten at Joe's 3 times over the last 4 months.  Luckily , i freeloaded 2 out of the 3 times - this place ain't cheap !\n\nOf course Stone Crab starter each visit - i'm still undecided between Joes' and The Flame at El Cortez - on price alone, El C gets the nod but you get more size options at  Joe's.\n\nI've taken a liking to their bone in rib eye with some melted blue cheese on top - now that's good eatin' !!\n\ncan't remember much else except the key lime pie was impressive !\n\npics added", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2010-02-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'BpIXi537n43BFg8Q64a-3A', 'review_id': '61kJe9N4cWDEw5Bl43mlLQ', 'text': "yum yum yum...i loveeee stone crabs :) i wanted to try it ever since is aw the best thing i ever ate and bobby flay was describing this delish item and i was so excited to try it when i went to vegas. i would recommend other crab lovers to try it...unless you're like my best friend and you don't like cold crab...also the mac & cheese was pretty good. would definitely come back!", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2010-03-01', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 5, 'cool': 1}, 'user_id': '7G8XccIrFyhkwj5avFA4ZA', 'review_id': '_-iOyquMK1M5yl4VRYCzow', 'text': 'My husband and I ate here last week. The food was good - he says the petit fillet he had was probably the best steak he has ever had - and we both enjoyed our order of stone crabs. The reason for not giving more stars rest solely on the service. Our waiter was so rude and seemingly annoyed with us that it made our evening unenjoyable. I generally let things slide when it comes to dining - I am not a "complainer" - but this experience resulted in me having words with the manager about our treatment. I wasn\'t looking for a handout or discount - I waited until after the meal to say something - but our waiter\'s behavior was terrible. I am generally a good tipper, but that night, all he got was 10%. \nWhile we did enjoy our food, I can pretty much guarantee that I will not be dining at Joe\'s again. If you are in Vegas and want a great meal with fantastic service, go to Andre\'s at the Monte Carlo instead.', 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 2, 'date': '2010-03-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'T8e6jQsFYMl-A6Kmov1dxw', 'review_id': 'MsGVgcVtR25XaA4egpcP0A', 'text': 'this place is perfect!!!', 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2010-03-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uagd_an2AZtpBZZ04uei3Q', 'review_id': 'sjZyjyLl6SKYCpdoWrgoqQ', 'text': 'The petit filet lunch special is a great deal.  \n\nHowever, I came here to try the stone crab.  Served cold, lacks flavor, hard shell pieces a pain to pick out.\n\nNever again.\n\nDungeness is so much better.', 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 2, 'date': '2010-03-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-1JkAt7id0C2lKdtv6FF8g', 'review_id': 'jyafvCbepFwGxl4lEBu9XA', 'text': "Love the Stone Crab claws and the King Crab here is excellent as well.  Stone Crab claws might be difficult to eat and the shell is very thick but the flavor is very mild and the sauce is a perfect compliment.\n\nThe New York steak is one of the better steaks I've had.  Not as good as Mastro's or the SW Steakhouse at the Wynn but very good.\n\nHaven't been in a year so I need to head out to Vegas soon and stop by.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 4, 'date': '2010-03-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': 'KKdxN80tUpf6JuU0WklG4Q', 'review_id': 'NXIYFWVC6C9ZEKgkKCI_2Q', 'text': "I can now die a happy woman...\n\nBecause I ate at Joe's once again.\n\nThis time I took 3 of my girl friends who had never been there, and they to can now die happily. \n\nIt was that amazing!\n\nWe had the stone crab appetizer, the New York steak, the Sauted Garlic Shrimp, the Roasted Chicken, and the Shrimp Scampi. Our sides included their Mashed potatoes and the roasted corn. Topped with 2 South Beach Peach Martinis and there you have it - The BEST meal in the world!!! \n\nIn addition, we were seated quickly, our server was fast and super friendly, and as always free valet. \n\nHands down the BEST meal I have EVER had.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 5, 'date': '2010-03-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '-4ld1qpaBNLocSBe85jWnw', 'review_id': 'rb6ZEipvaZRWrOCHwoRrTw', 'text': "I was very disappointed.  I have been wanting to dine here for a while -  it has been years since I first tried stone crab in Florida.  I finally had the opportunity and was going to splurge a bit, but what a waste of money.\nI ordered the medium plate of stone crab claws (their smallest choice @ $34.95) and also got the cup of crab bisque to start.  \nThe soup tasted nice, but the texture was off.  It looked like the fat was starting to separate out of the cream soup.  I know bisque is fattening, but I really don't want to see the oil slick at the top of the bowl.\nMy main disappointment was in the stone crab claws.  The texture of the crab meat was wet.  Now, I probably should have guessed that they would have been previously frozen, but somehow I expected them  to have a way of doing this that wouldn't hurt the texture of the crab so noticeably.  \nThe shell on stone crabs is quite thick, so they pre-crack the claws for you.  I don't remember ever having this problem before, but  with about every other bite, I was getting small bits of shell in my mouth  that I was then trying to discreetly spit out.  It just wasn't worth the $50 for my lunch.  About half way through the meal I grew tired of the crab and didn't even finish it.  That hurts me just to type it.", 'business_id': 'LLDGTT7FExklkQvHebEjRg', 'stars': 2, 'date': '2010-03-22', 'type': 'review'}
