{'votes': {'funny': 1, 'useful': 7, 'cool': 4}, 'user_id': '4j8c0ttT0OcIYTrARYQZNQ', 'review_id': 'etvC-lFYe24b2OdyT3Fudg', 'text': "It is so hard to find good southern food in this town. So far I have had the shrimp etoufee and and shrimp po'boys. There is nothing fancy about this place, however the food is amazing. Located in of course, a strip mall, next to LA Fitness. Somewhat hard to see, but definetly worth checking out. The prices are great too. Everything is under $10. Their menu has catfish, shrimp, chicken and a few other things. This is just a mom & pop little place which is awesome. I hope this place sticks around.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2008-12-13', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 7, 'cool': 3}, 'user_id': 'RMX11FC48KZTYIeExtGUCw', 'review_id': '8TnxponSXqHxgdTYZDG-8g', 'text': 'Eureka! At last, we have found the cajun food we have been long-seeking -- homey, authentic, real deal stuff. Not fancy foo foo "takes" on cajun food. Not watered-down,  dumbed-down versions of cajun food. Just the good, real, stuff, lovingly, and painstakingly prepared with quality ingredients.\n\nYes, the po\' boys are good. The bread is spot-on, the ingredients cooked just right. Even the spicy tartar sauce (ya know, remoulade) is right. But po\' boys aren\'t too much of a challlenge.\n\nThe entrees will make you or break you. Since I\'ve only been once (so far!) I\'ve only had opportunity to try the crab landry - garlic bread, sauced with crab stew, and topped with a few fried shrimp.\n\nI could not stop tasting and analyzing that stew. It was full of layers of flavor - smoky, sweet, spicy, earthy, a slight hint of briny - all cooked down and blended into luscious deep brown brew of deliciousness!\n\nThe dining room has all the atmosphere of a hospital cafeteria. Can we get some music maybe, at least? But I can easily deal with that, for the sake of the food.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2009-05-15', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 5, 'cool': 3}, 'user_id': 'AnH84g9V10x41CXmCvcaFg', 'review_id': 'SePJSDafCpd3g2Ie5X5kZw', 'text': "Great mother of Gumbo! Flavors of Louisiana is good homestyle cajun cookin' right here in the desert!\n\nThe food has just enough warmth to make your taste buds glow.  The shrimp are huge and juicy... so the po-boy is pure heaven. I wonder if the oyster po-boy is as good.  The Crab Landry (crab gumbo without rice, and 4 fried shrimp atop garlic bread) is amazing.  Jambalaya was tasty too.  I MUST come back on Friday or Saturday to try the seafood gumbo. \n\nThere is plenty of parking.  The dining area and facilities are spotless.   There is no table service.... just a counter.  No frills at all, just fantastic creole comfort food at a great price.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2009-06-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': 'd2RAl63RTdfZF7kcuKcj-g', 'review_id': 'L3vtl6SByzl-ek9tDt3dqg', 'text': 'Coming from a shrimping town, it has been painful for me to see the po\' boy catch on as one of the latest trendy re-appropriations for the chic foodies who like to brag about their "new urban soul food."\n\nI\'m sure some of it is good, but there is something inherently wrong about $12 po\' boy sliders.  Which are served on dinner rolls.  And feature lobster and sausage.\n\nFortunately, on a trip to the strip-mall labyrinth of the West Valley, I found this amazing, amazing place.\n\nThe po\' boys are actually po\' boys.  They make their own sauce, which is delicious.  Simple, fried seafood with lettuce on a chewy baguette.  I\'ve had the shrimp and the oyster varieties, and both tasted crisp and fresh out of the fryer, and practically exploded in my chomper they were so good.\n\nThe potato salad is also creamy and delicious, with the subtle balance of sweetness and vinegar that I think is crucial to a good tater salad.  It\'s not just a bunch of boiled potatoes mashed up with mayonnaise, or some bulk monstrosity ordered from the grocery store.\n\nIt\'s worth waiting til a Thursday to try this place just to get the crab landry.  Good lord.  Sweet crab stew over delicious garlic bread, topped with four fried shrimp.  The dish doesn\'t look like anything other than two hunks of bread floating in brown sauce, but it will destroy you in the best possible way.\n\nBest of all, the place is family owned and operated.  The restaurant is simple but not boring - one wall is painted purple and gold in celebration of LSU, and the other walls have a few pictures of other memories of Louisiana - but not in a stupid, kitschy way.\n\nThey also serve alligator now.\n\nWorth the trip from Phoenix!  Really!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2009-06-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'uptgzZkEm4ytmHuZKBtnhA', 'review_id': 'NotRKJbQTCPPEZb3kT0XFA', 'text': 'Now I\'m not a free giver of "5-Stars"...it takes something special, which I will get to. I find most places take on authentic Cajun cooking to be nothing but a stereotype of heat and Raggin Cajun\'s accents. The true taste of the food is lost in hell peppers and fire sauce. Flavors of Louisiana offers something that is vastly superior to this concept, authenticity. Cajun cooking (like most southern area\'s) is all about taking your time when you cook and not rushing it like most places. The restaurant is a little small nook that is easy to miss unless you are looking for it. \n\nI decided to order the Shrimp Po-Boy and some fries. While I was waiting, the owner was making her rounds talking to the tables and welcoming them, and asking if they needed anything. My food came up quickly and I was out in a dash. The food was amazing. Nice thick cut fries, good taste to the Po-Boy with the most amazing sauce on it. Reading over the menu, there are a lot of dishes I\'m eager to try. First time that I\'ve had real honest to goodness Cajun food in a long time. \n\nNow onto the merit for five stars: I was just standing waiting to grab my food and bolt back to my office like a good drone, and the owner asked me why I was just standing around and not relaxing. I explained I was in a bit of rush to get back to work, and she cut me off to say that "no sane person should ever say that." with just a twang of that Louisiana accent.  I just had to laugh because it hit it\'s mark. She explained that she was sorry to see me go so soon, because she wanted to make sure I liked my food. That banter is what makes this a five star place. Amazing food, good authentic people, and warm inviting environment.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2009-06-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'vUM21g3cPEdSlI89oDttgw', 'review_id': '7H26QXkT-5Y4nUmELyks4A', 'text': 'I have no clue what good Cajun food is b/c I quite literally have never had authentic style Cajun food (I am not counting that Zatarans rice in the box either).  But, after reading the reviews for it on Yelp, I HAD to try it!  \n\nAlthough I was way too chicken to try the crawfish or the alligator, I did go for some shrimp.  It was fried in this very crispy and light batter with a really tasty seasoning.  I decided on dirty rice as my side.  Dirty rice (I had to ask) is cooked with some pork and beans as well as some strong and flavorful seasonings.  \n\nFlavors of Louisiana is a small place, but was packed when we walked in after seeing a movie early in the evening.  There was a large family and several couples eating in and waiting to take their food out...a very good sign in my opinion!  \n\nIf you are in the same situation as me and have no clue about Cajun food...here\'s what I learned while waiting for my food and reading the educational bit on their menu:  \nAuthentic Cajun food is actually not spicy as many say, it is actually flavorful, slow cooked, made with love, and full of mouth-watering seasonings.  Interesting.  \n\nFOL is family owned and operated and they are incredibly friendly.  While we were there the owner came out from the kitchen to hug and greet what seemed to be either family friends and/or regular customers two different times.  One couple walked by us on their way out after eating and told us, "This place sure could make someone fat."  I overhead more than one family tell the owner how they will most definitely be coming back and how amazed they were at how delicious everything was.  \n\nI\'m not sure if I\'ll go back only b/c I really have no clue about Cajun style food and what it entails.  But, the shrimp and dirty rice I had were very good and I would have it again if I was in the neighborhood!  Oh, and I almost forgot, the dipping sauce for the shrimp made me want to lick the cup clean after using it for my shrimp...I\'m not even sure what the seasonings in it were, but who cares, it was yummy!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2009-07-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 2}, 'user_id': 'LQi_RgRvMi3Y1gaFgIaRuw', 'review_id': 'GhwacNwoLzbKQjNSR_hJ5Q', 'text': "Loved this place. the food took me back to my childhood when my mom's friend would visit us from Louisiana and make real backwater Cajun food. The seafood gumbo was spiced just right and was a very large portion. The Shrimp Po'Boy has HUGE, there was enough of the sandwich to feed 3 people. Finally the shrimp etoufee was good both not great. \n\nThe only downside is the restaurant itself....its very small but very busy. It was standing room only when I was there on a Friday night. \nit would be great for a small group but there is only enough room for maybe 30 people in the whole place. \n\ni WILL be back and I am looking forward to eating yummy Cajun food.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2009-08-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'Tz9vaxf98pQqjVP6z4uSzQ', 'review_id': '1U1Mw6TKzE1AtpxEKaf1jA', 'text': "Without a doubt, one of my favorites! Spending many summers in La Fourche Parish in Louisiana, their food brings me right back to the bayou. My favorites are the Shrimp Po Boys, dirty rice and crawfish, but I thoroughly enjoyed everything I've tried there.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2009-09-03', 'type': 'review'}
{'votes': {'funny': 5, 'useful': 11, 'cool': 8}, 'user_id': 'N-D-d1Z4UybdlkK1HxlNPA', 'review_id': 'qPB3X_eH1Nb_ZMQj9Z7lUg', 'text': 'Wow. Even Lafayette, LA born Hubby was seriously impressed with Flavors of Louisiana. The restaurant was far from full on a Saturday night, but the customers came in steadily. It is a small place, but very clean, and rather sparsely decorated. At least you can taste right away where their priorities are. \n\nHubby had the special of the night- three pieces of tender, perfectly cooked catfish smothered in crawfish etoufee. He had asked for, and was told that he would receive etoufee only, but got the special anyway. He loved it, but this mix-up is the reason for the 4 stars. Even though it was in a darker roux, which he normally does not prefer, he licked his plate clean. I got the shrimp po\'boy which came in a large basket with fries. It was two 6" halves of a fresh baguette with lettuce, tomato, a zippy sauce, and plenty of perfectly cooked battered and fried shrimp. Our dining companions had an equally huge and tasty fried oyster po\'boy, a side of fresh and tangy cole slaw, and a bowl of delicious seafood gumbo. Nothing was spicy, just super flavorful. The boys got the peach cobbler dessert, and even though we girls both said we didn\'t much care for peach cobbler, we certainly helped the boys polish off the big bowls when they got to the table. \n\nEven though FOL is quite a drive for us, we will be back very soon. Please note that as of October 1, 2009, they will be closing early on Saturday nights- 8:00 instead of 9:00 PM.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2009-09-27', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 2}, 'user_id': 'TVKTRVytJ57VpOK6GF_ixQ', 'review_id': 'dKIgxnhV2vG2emHctDVrkg', 'text': 'I have been in Phoenix for 7 years, and I have yet to find a place to get decent catfish, barbque, or Mexican food.  Well you can cross catfish off my list.\nFlavors of Louisiana has fantastic food, friendly service, and reasonable prices.  Not only is their catfish wonderful, but also their crawfish, and anything else on the menu.\nIt has TASTE, unlike 90% of what passes for food here.  They use spices, they want it to taste like it is supposed to taste.  This is unlike most places that are afraid to offend anyone, so we get bland.\nAdd to that the people there are real, they are friendly, and thank god they have an accent!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2009-10-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'JnRT9i2d71pY8D8ngzCz9Q', 'review_id': 'FbUfjHQqpT_g535dBxDUXQ', 'text': "Wow haven't had such a pleasant dining experience in quite sometime.  First off to be fair to other so called Cajun places in the valley while you are quite good, nothing compare to true Louisiana Cajun and boy that's what this is.  \n\nTo start this is literally a mom and daughter joint!  They opened last year and are starting to get quite the following.  The location is a bit tricky but take the ten to dysart road make a right at Rancho Santa Fe and go into the parking lot of LA fitness and Walmart.  The restaurant is located right in front of the LA fitness.  We made the mistake of going to the other side of the road as most people do.  \n\nInside the decor is quite simple chairs tables, condiment table with forks hot sauce and napkins the typical.  One side of the wall is dedicated to Louisiana State football so if your a Louisiana state football fan you are in good company.  \n\nThe food is very good priced.  I started with the gumbo which had all types of seafood as well as rice and an absolutely fabulous broth.  It has to be the best gumbo in town.  They don't put okra in it which kind of takes away the traditional gumbo taste but the cook told me that they do that because a lot of people don't like the okra around here.   I loved it all the same.  Today was the special gumbo and it had fresh oysters in it.  Melt in your mouth Gumbo!\n\nFor my main dish I had the catfish, craw-fish and the red beans and rice.  The catfish and craw-fish were both spicy seasoned not spicy hot.  Which helps with not to take away the flavor of the meat.  I was stunned at how both of these fish had no fishy taste to them at all.  It was as if they were caught on the bayou and served to me minutes after the big catch.   The catfish was specially good.  It had a homade cornmeal crust fried to perfection and not goopy take away the flavor fried but perfectly lightly fried.   The craw fish were fried in an absolutely melt in your mouth buttery salty spicy batter again not to over bearing.  The fried stuff comes with some special tarter that is oh so tasty.  The red beans and rice will make you wanting more.  The texture is right on and the flavor is that southern spicy mouth watering rich red beans and rice like mom used to make.  They are addicting.  My girl got the catfish and dirty rice.  Again if you love dirty rice and I mean in a traditional way this is right on the money.  \n\nOverall I think I found a new eat out place.  It is well worth the money and the staff , flavor, and tradition of eating in a place like this makes me wonder how I can bring my self to eat at a chain.  If you want a good home cooked meal with southern hospitality this place is for you.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2009-10-10', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 7, 'cool': 4}, 'user_id': 'W_QXYA7A0IhMrvbckz7eVg', 'review_id': 'lk-QlP4-YcVk5dhoh6Zwig', 'text': 'We had originally attempted to come here a few months ago, but our friends decided it looked "too cheap, dirty, and gross."  Ugh... we swore that we would come back next time we were out in the neck of the woods and I am really glad we did!  \n\nThe restaurant is located in an average looking strip mall and the interior is just as average.  That\'s fine by me though.  Like someone else said in their review, at least I can see where their priorities are.  I ordered the 2 meat combo with shrimp and crawfish tails.  It was served with my choice of side, and I went with the cole slaw.  I was surprised at how flavorful the cole slaw actually was.  The shrimp were big and their outsides were really crispy.  They were quite yummy.  There were tons of baby crawfish tails, battered and fried like the shrimp.  Those were also yummy and quite succulent.  I really really enjoyed my meal.\n\nIf you come here, don\'t make the mistake that I did and not notice the yummy seasoning on the table.  I didn\'t notice it until after I was full, but I sampled it, and it was DELICIOUS!  I will definitely come back here next time I am in the area.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2009-11-16', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 1}, 'user_id': 'fev0iI-XDrteD4SYRKjiUw', 'review_id': 'inVnftdaEF-mc7hpnCZwlA', 'text': "This place has been a long time coming.  It is damn near impossible for me to make it out to Avondale, ever, but we finally did last weekend and the first thing that sprang to mind was going here.  So very glad we did.\n\nI ordered the chicken & sausage jambalaya and a sweet tea.  Their tea was pretty good, the jambalaya was amazing.  The dirty rice was some of the best I've ever had and the combination of meats and spices was perfect.  Really well done.\n\nI would absolutely go back here if I ever made it out to Avondale again.  The only reason I marked them off is because of the location - far west valley, by a walmart, in a strip mall.  Too bad, downtown needs some decent southern cooking.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2009-11-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2lEGeMtHif7-Rd8gYBvo6Q', 'review_id': 'MUrDgsdbcJCr6lT5jeRhIg', 'text': "Wow!  A bit of the Big Easy on the west side!  You'd never know there could be such good food in such an unassuming place.  I read the reviews here and decided that a little Cajun sounded like the perfect change from the usual. \n\nSo, I was a little hungry and I couldn't decide between the oyster po boy and the catfish combo, so I got both!  Both dishes come with a side so I also got two sides.  I went with the cole slaw to go with the po boy and red beans and rice to go with the catfish.\n\nThe po boy was awesome!  The oysters were hot, crisp, tender inside... the bread and the condiments inside were the perfect wrappers to deliver those oysters into my mouth!  The first half of the sandwich was gone before I knew what happened.  Yes.  The first half.  There are two 6-inch sandwiches to this po boy!  \n\nSo before starting on the second half of the sandwich, I moved over to the catfish.  Again, I wasn't disappointed.  Lightly battered in corn meal, the catfish was hot, tender and tasty.  But, after having two of those tasty pieces, my stomach realized that there was already a six inch po boy in there and started to complain.  \n\nRealizing the limited resources and limited time before my stomach wins over, I quickly took bites out of each of the remaining side dishes.  Both winners!\n\nWill definitely be back, for the food and the service!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2009-11-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2fJXLk_fkVdLAQmHLCMi-Q', 'review_id': 'zyot-4fzrZ2IaEwe46J8Jw', 'text': 'We finally got a chance to eat at Flavors of Louisiana.  We both decided to get the Shrimp PoBoy.  I was really impressed with the flavor.  The shrimp were cooked to perfection.  I would have liked to try other items on the menu but that will have to be another time.  The decor is pretty basic but the food speaks for it self.  If you are looking for some great creole food I recommend hitting up Flavors of Louisiana.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2010-02-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '24f7wKVNsll36teFKCdzqQ', 'review_id': 't6KcUB7tb6zeu0nKzWT6Rw', 'text': "Not so good! I had the aligator and crawfish combo. Both were way over cooked and very tough. The breading was too heavy and didn't have any flavor.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 1, 'date': '2010-02-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'aqdzZLiS6d8XUDhTb5NAfQ', 'review_id': '1KrkB97has9oiHc_rYsavQ', 'text': "The oyster Po' Boy was amazing!- loved it! The seafood gumbo was terrific- very flavorful, but not thick and gloopy. We also really enjoyed the Cajun chips. The only thing I wish we could have had with our meal was a nice cold beer! The atmosphere is nothing to write home about, small and 'diner-like', but when my brother and I went there a few Fridays ago, the line backed up to the door to place an order.   It was a drive to get out there, but definitely worth it.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2010-02-19', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': 'IPVQ9aObQap81orMov_MwA', 'review_id': '36t0kxG2jyGoawWm8eJCaQ', 'text': "WOW! So this is what it must be like to eat at a little place by the bayou like in TRUE BLOOD, except that we have to settle for a small locale in a strip mall. Nevertheless, its all about the delicious food here. \nI had the Poyboy with Shrimp and Fries and KA-CHING, I totally got my money's worth when the delicious french bread toasted to perfection entered my starving mouth. I of course, added some hot sauce and lime to the sandwich which only made it much more tasty and spicy. \n\nI would have to add that thebreaded shrimp was the highlight of my visit to this place, it was thick, big  and meaty and was seasoned adequately. I only wish the restaurant were bigger so we wouldnt have to hear the patrons conversations in such close quarters. \n\nDamn, just thinking about my pleasurable moment at FOL I am starting to crave another one of them PoBoys.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2010-03-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'X-EV080aSeC5V00YBwxR1Q', 'review_id': '_8O6LBOiFXXH1gWBJc1K-g', 'text': "Love it! \nOrdered the Po' Boy shrimp with a side of potato salad and was so amazed with the entire dish. I would have to say that this is the best Po' Boy I've ever had. The bread was soft and delicious and the shrimp was plenty and fresh. \nI really wanted to have the oysters, but they were out of stock *sad face.*\nNext time I visit, I would like to try the peach cobbler dessert, and I hope they will have the oysters in stock too. So delicious!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2010-03-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'Daz7vORlh6_GtwVmHJzcUA', 'review_id': 'POP7JiDcSi4Q38NExr1MGQ', 'text': "I really don't know how I lived in this neighborhood for this long...and didn't realize Flavors of Louisiana was here.\n\nOK, that's not entirely true. This place is tucked in a little strip mall next to the LA Fitness place next to Walmart. If you aren't looking for it, you won't find it.\n\nBut you need to find this place. Quickly. This place serves incredibly tasty Cajun food. My wife used to live in SE Texas and says it's as authentic as you'll get.\n\nAs other reviewers have already noted, this place won't overwhelm you with ambiance. Which is just fine, because you're here for the food. We had catfish, alligator tails, shrimp, dirty rice, and red beans and rice. It was all fresh, cooked to perfection, and was enhanced by the real Louisiana Hot Sauce. If you like tartar sauce and get fish, make sure you get some of their Cajun tartar sauce. Good stuff, Maynard.\n\nTip: we got there about 11:30am, and had no trouble finding a seat. But this place gets crazy busy for lunch. Come at noon, and you might want to get it to go.\n\nTip #2: this isn't a budget place to get food. Po' Boys run about $10, and my plate was $14. But it's worth it. Save up and splurge on great food.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2010-03-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 2}, 'user_id': 'ceKoQX0_IJZ6Lr9-9LGcbA', 'review_id': 'QTEL9H0nbVdRDm0M2ZGaTg', 'text': "If you're looking for authenic Southern Louisiana cooking in the phoenix area then this is the place to go.  I know it is far drive for a majority of the residents in the valley, but I have to admit it's really worth it.  Located in Avondale right off I-10 in another strip mall like everything else in this metro area is a place for cajun lovers.\n\nThe po-boy sandwiches are great and you can choose to have a variety of meat on them such as shrimp, oysters, catfish, crawfish, tilapia, or alligator(I know I just said alligator).   The flavors with spices come together to make a great feast and are not to spicy as true cajun food is not supposed to be to hot over powering the meal.  Not to forget their chicken and gumbo soup.  What a flavorful delight this is!  I highly recommend trying some gumbo while here.\n\nThe atmosphere here is somewhat boring looking somewhat like a fast food cafeteria.  The highlight is a wall dedicated for LSU fans with purple and gold as I'm sure the owners are showing off some of their roots.  Prices are average as one person will spend between $9 and $12 which I feel is totally worth it.\n\nI don't frequent this part of town, but when I'm in the area again or on my way to a spring training game in Goodyear I just might have to stop by.  This place is great for anyone wanting to try cajun food for the first time or for the southern style connesiour.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2010-03-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'dn9DSDp9CYCRffmL1voq6g', 'review_id': 'aVVfAWint7_zE1GguOl9yw', 'text': "The only thing keeping me from giving the place five stars is the price.  It's a hole-in-the-wall little restuarant and the food is awesome but pricey for the quantity and type of food you get.  For example, a cup (not bowl) of chicken gumbo is $6.50 and red beans and rice is $6.25.  I think that's expensive but maybe others disagree.  The two times we've been there though, we were never disappointed.  I especially liked their boudain balls and the hubby liked the homemade chips.  \n\nEverything there is pretty much fried or smothered in sauce and if you know cajun, you know the sauce is not desirable for those watching their weight!  It's a family-owned business and we always try to support that.  If only their prices were more reasonable, we would go there more often but as far as the food goes, Flavors will not disappoint!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2010-04-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': '7SU_54vYBkFpKAcq4lqEfg', 'review_id': 'TSIbeBBWv1aJ0gNNRwPmpg', 'text': u"Cmon is that all you got?\n\nI've been searching Phoenix for months for a Cajun place close by so I could save the gas from driving to pappa's. Ordered the shrimp \xe9touff\xe9e and wasn't impressed. And I lived in Kenner la for awhile so me and Cajun have met. \n\nService was great. Lady hooked me up w an extra side of bread... even tho my fat ass could have used a walk to la fitness. \n\nRecommendations: po boys, garlic bread, Bo dang balls. Looking forward to giving them a second chance sometime soon.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 3, 'date': '2010-05-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'ZDn42x7z6ZwINiqZzeTCwg', 'review_id': 'bU8yHRTyqE9SBhCaL6wLww', 'text': "This is the best Cajun place in Arizona. The portions are great and the people behind the counter are really nice. I love gumbo and I have tried several kinds here and all of them were excellent. Yes the decor isn't 5 stars but seriously if you're more worried about mood lighting and soft cushions you can go to Pappadeaux's and get charged an arm and a leg for lower quality food. the drive and the price are definitely worth it for this place.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2010-05-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oubVUZ_h4enNSrvWNo6_og', 'review_id': 'NzDWDkgtaxA6y8UnLo7RIA', 'text': 'THANK GOD!!! I have finally found a REAL Cajun place here in the big AZ. It is a bit of a drive for me but at least I can get my fix of real Cajun food when I need it. \n   So far I have tried the Boudin balls, the red beans and rice, the oyster Po-boy, the catfish, the dirty rice, the shrimp creole, the deep fried shrimp, the seafood gumbo and the peach cobbler. EVERYTHING was excellent except the peach cobbler. But I will admit I am not a peach cobbler fan to begin with. The bread they use for the Po-boys is fantastic. Very good flavor and nice and soft but not to soft to be mushy by the second bite. There shrimp is some of the best I have ever had. Light as can be with a fantastic flavor. The service was great as well. The two sisters that run the place were very nice and helpful. \n    I recommend giving this place a try, I know you wont regret it. I would  eat here more often but its 26 miles one way. One of the sisters did mention they are going to be opening another place just like this by Arrowhead mall in about a year. This is good and bad. Good that I can get my Cajun fix much more often. Bad because I may end up weighing 400lbs in a month. This food is just damn good.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2010-05-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'z-JC1S58qaW8WNiOzUh_TA', 'review_id': 'knrnhQgymzmGa7PdA20hqQ', 'text': "Can't wait to go here again. Had the shrimp po-boy and some homemade banana pudding. I'll write more as I try different things on the menu, but what I did have was delicious.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2010-06-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'k0gCvAMZIM7vAX1s8oqdHQ', 'review_id': 'jJYFKd7HWOqb8Qud7lermw', 'text': 'This. Place. Is. GOOD. Very good! My husband had been nagging me to try this little place, but we are late dinner people when we\'re out, so the "earlier than most restaurant closing hours" didn\'t mesh with our schedule for a few weeks. It was worth the hassle to coordinate!! The Dirty Rice was incredible, and may just be my new favorite order out comfort food. We also had fried oyster Po\' Boys, and oh my heck, they were THE most incredible sandwiches EVER. Give this tiny lil place a try, family and locally owned!!!!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2010-06-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'V6rhoTCw7S6H8eHwv2M6Vg', 'review_id': 's6AmyPgi2uzBijcEYd581A', 'text': u"Ok, so I'm no expert on cajun food, at all.  To be completely honest the only experience I've had are through Anthony bourdain on the travel channel and a botched birthday meal at papa deaux.  After stumbling upon this place on yelp while at work, it was all I could do to not call out for the rest of the day and satisfy my craving for dirty rice right then.  When I did get off I grabbed my hubby and drove all the way to Avondale.  He ordered the sausage po boy, with cajun chips and cole slaw, and I had the Friday special, it was shrimp in a gravy over rice, dirty for me, I have no idea what it was called.  The shrimp was amazing, the spicy smoky flavors over the dirty the dirty rice hit the spot.  ITs a good thing mine was so good or my fianc\xe9 would have had to fight me for his po boy, that sausage was to die for.  I love the cole slaw, but thought the chips were so so, He loved the chips and thought the cole slaw was so so.  The employees were friendly the prices were good.  The decor was... colorful...  Overall, big fan.\n\nP.S. Beer would be nice.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2010-06-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zn81QpflLDUaGZkCMUowCg', 'review_id': 'jGkboq5I32IQvuglMVhZ4A', 'text': "Got the oyster Po-Boy & rice and beans side & my husband got the shrimp Po-Boy and seafood gumbo side.  Yummy and tasted authentic.\n\nTake note that the Po-Boy is HUGE and could be eaten by 2 people, especially if you each order sides.  I felt that after eating 3/4 of the oyster Po-Boy, I got a bit sick of it because it wasn't balanced by something more light.  I was craving a piece of fruit or something to lighten up my palatte so I could finish the Po-Boy.  I could've been happy with just half the Po-Boy.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2010-07-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 3}, 'user_id': '45V7-1r79DEG0HbuaKYIlg', 'review_id': '_9c-DYS7RrmNUf2Vk9EXbA', 'text': 'I was the first customer in today when they opened.\nI was about to order what I thought was too much food at too much money, when I saw the lunch specials on the back page.\nSo - for under $10, I got to try the gumbo AND a po boy!  I opted for the catfish po boy, gladly accepted the side or Louisiana Hot Sauce (I am out at home!) and took the food home with me.\nI was very impressed with the po boy - fish was hot, crisp and moist - bread was perfect - lettuce and tomato fresh as can be!  I honestly couldn\'t tell if it was dressed with mayo or remoulade (guessing it was a combo of the two...not enough flavor to be remoulade, too much for mayo) - but once I put some Red Spot on it, the sauce didn\'t matter too much, anyway.\nThat filled me up, so the gumbo was eaten out of the fridge a few hours later.  The chicken pieces were big and moist, the andouille was sliced thin and the overall flavor was so smokey perfect I was sad to only have a small cup of it!\nWhen I first was taught to make gumbo, I heard you need to either use okra OR file.  (A powder made from sassafras.)  I generally use both - but the lack of okra didn\'t detract from the perfect balance this gumbo was!\nA coworker commented to me several weeks ago the gumbo was too "soupy."  Not sure what his gripe was here...every bowl of gumbo I enjoyed in NOLA was just this texture.\nHappily, my sister lives nearby - so now that I have been, I will be back again and again!\n\n(Note to Miss Jennifer - I will be in on Saturday to enjoy a beignet!  I hope the coffee is with chickory!)', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2010-07-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'JkMOQaMjlBHMqp6gj-hL3w', 'review_id': '3M-Gvb7fB9R_JTXrK0ZUqg', 'text': 'I had the shrimp po boy, dirty rice, and catfish with some delish sweet tea!!! ALL was excellent and we received very good service all around...will be back soon!!\n\nYou can also get delivery here through You Buy and We Fly: http://youbuyandwefly.deliverycheckout.com/', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2010-07-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'IajbWwj6l-KHrfSEwZBLgw', 'review_id': 'xeZ8eFIIOBT1CGQVatpM4A', 'text': "This place is way tasty!!!  I ordered the shrimp Po Boy and some Jambalaya.  I wasn't aware the sandwich came with a side order of your choice.....I got the red beans and rice...   The bread the sandwich comes on is so fluffy and fresh, the shrimp are crusted with panko I believe.  The shrimp and fixings are super fresh tasting too.  I will definitely be coming back.  I gave a 4 stars out of 5 just because I was craving a Muffaletta and it wasn't even on the menu, and also for them being closed on a Sunday.  I drove a distance and didn't know that they would be closed on a Sunday, so I was a little upset about that.  But set that aside and the staff was friendly and the food top notch.  Try it out it's good stuff.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2010-08-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'd19_YEGjzLfG5IAxmf4G7A', 'review_id': 'hd_OPrreEeMf6rjQNG_rMg', 'text': 'I haven\'t reviewed Flavors of Louisiana yet? Really?!\nWell, let me tell you, I\'ve been there a lot of times, and they do it RIGHT. There aren\'t a lot of tables, but I can\'t remember ever seeing people waiting for a seat despite a constant flow of traffic in and out of the place.\nI had their oyster po boy and it was really good. They used a great balance of corn meal to flour (slightly more corn meal, making it crispier and trapping the juiciness inside better). They knew what I meant when I said "make it dressed with hot sauce." The bread almost tasted fried, but it is the best French bread this side of the Mississippi River. The oysters were definitely from the Gulf; it was a fantastic taste of home.\nI had my 2 girls with me, and I ordered their daily special; fried catfish smothered in shrimp etoufee. I had them serve it separately, and my older girl loved the etoufee, while my younger loved the catfish.\nI also had their red beans and rice, and that held its own. I wasn\'t crazy about their rendition of chicken and sausage gumbo, as it wasn\'t dark enough, but the seafood gumbo was very good. They diced up the holy trinity (celery, onion, bell pepper) to appropriate sizes.\nA word of warning; the sweet tea is done too sweet for some Southerners and definitely too sweet for most in Phoenix. Get the regular and sweeten it yourself.\nThey could use more drink options (no alcoholic beverages), and they ran out of 2 dishes plus their bread pudding on my last visit, but if you want truly authentic cajun seafood, this is the place to go. It\'s one of maybe 10 restaurants of ANY kind in the Valley that could survive in New Orleans, and when you\'re able to do that with non-local seafood, that\'s pretty darn impressive.\nBe aware that they\'re closed on Mondays; I\'ve made the trek to Avondale more than once to discover that I picked the wrong day.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2010-08-20', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 0}, 'user_id': 'LJeb2uiCMzVTt1U3T1HsyQ', 'review_id': 'HpmuCO57vzPQ7ipga_YPEQ', 'text': "Dear Flavors of Louisiana, \n\nI love you. \n\n- Kristen A. \n\nWe had the crab landry and scrimp po'boy last night. Amazing as always! No matter what we get, I am never disappointed. No matter how slammed this place is, the service is stellar. They always make us feel like we are not only welcome, but family. I will see you soon flavors.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2010-09-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': '18nyhFqh8ans74mUJ-OCyQ', 'review_id': 'PabL-vjWABiqUHvjTQ_A5Q', 'text': "I ordered the catfish po'boy, chicken gumbo, and the red beans and rice... the po'boy was pretty good while the gumbo was ok at best, i will never recommend the red beans and rice. Not the greatest place but i will revisit for the alligator po'boy and sea food gumbo, so far i am unimpressed but i'll go here before i drive all over the valley to get my cajun fix... i just hope the second time will be better", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 2, 'date': '2010-09-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tBvrnSCLSpUdCDm5w5GPkg', 'review_id': '7r31fXBBQOlQRWeq0p0-MA', 'text': 'OK, so you are probably wondering why is a NY gal writing a review on a Creole restaurant? I thought the same thing. I do not like Creole food per say ( Crawfish and Aliigator-??? seriously? Teehee. I still have nightmares  of those lil crawfish guys screaming when my friends had to cook them live at the catering resort I used to work at)  but I take chances on eating so when my friend said, "Lets go here my hubbie likes it and we can bring him some take out".  I said, "sure". (I always forget Cajun style cooking is not the same as Creole food-lol!) Add to the fact I am on a diet and really there wasn\'t much I could eat here since everything is deep fried and i do not like catfish. But this is what I observed while I was there. The southern customers in this place were raving about it. It is one of the few places they told me ( if not only) around town that has alligator if you like that. And now the reason for my review. Ok , wait for it-------The BREAD PUDDING! OMG! it is delish here! Some of the best I have ever had. Now they serve it with this white, sweet whiskey sauce. My friend and I have no pride and no shame so we were actually drinking the stuff right out of the little to go container. We were probably drunk all afternoon. LOL! Nay the alcohol cooks off so they say, but does it????HMMMMM!  But folks you heard it here first go and try it. So if you like Creole food you might like it. ( my friend says their portions are to small) But more importantly if you like dessert first, go for the bread pudding, like daily and if you like fancy whiskey sauce move in- I heard they have a cot in the kitchen-teehee!. Ok so there is my light-hearted review. Enjoy. I will go back and try a Poboy for sure. I had these rice style deep fried balls that were really gross! I definitely won\'t be ordering them again! (But they are suppose to be a southern comfort food-BLAH!!!!!!)', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 3, 'date': '2010-10-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 0}, 'user_id': 'HjpzhIQFRQbFmc_7CtFDmg', 'review_id': '7om9aqT9uMLshSjpwEKmmA', 'text': 'As a Louisiana native, I was not impressed.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 2, 'date': '2010-11-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '_Rjh0T26n0kTvPTEUNRr_Q', 'review_id': 'OdVOwCMm5xcHCf476dBlJg', 'text': "I just recently visited NOLA and I'm so excited I found Flavors of Louisiana. I love that I can get alligator here! Sure, it's a tad pricey but Arizona doesn't exactly have local gators so it's very worth it. Everything looks and smells amazing every time I go in, but I just can't stray away from my fried alligator Po'Boy...delicious!! \n\nAlso, try the locally brewed Sonoran root beer...it's the perfect beverage for their sandwiches. LOVE this place!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2011-02-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 4, 'cool': 0}, 'user_id': 'uP-k3VT4Ss8fubITUybf-g', 'review_id': '6hwQWYnIDpbcEzwgmZdXAA', 'text': "I would have to say that my husband and I didn't enjoy our experience here, we ordered two po boy sandwiches and two fountain drinks and the total bill was almost $30.00, for that price we could've had a sit down dinner and not fast food creole. As we ate, the server's children ran rampant through the restaurant, and there was discussion about whether she or her mother were going to be working or taking care of the children the following day. Then my husband walked up to the counter to get me a to go container and while he was talking to her, she answers her cell phone and practically ignores him. Terrible service and atmosphere, the po boys were actually good but not worth $10-13 a piece. We thought they had made a mistake on our bill when we saw it was $27.00, that's pricey for fast food sandwiches!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 2, 'date': '2011-02-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '4TZARz8AjNWfukK2UfZitA', 'review_id': '5tfB-ecEIpZeN-mosJzCsw', 'text': 'Fantastic. Shrimp creole was great. So was the chicken and sausage gumbo. I will be coming back.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2011-02-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'gmYBdZR_YduHDJvIPQlkkA', 'review_id': 'jbXfuzyg30q72ah6I_KQNg', 'text': "Sooo Good. Shrimp Po' Boy is my fav, but everything is worth the price and the drive.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2011-03-31', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 0}, 'user_id': 'Weem0jfLYBDJlyfKXgvMpw', 'review_id': '6b2JZVXEZCsSCI9_2cPaAw', 'text': "Po Boy was awesome, i suggest catfish, craw fish, or gator. \nprice is good, they also knocked down the wall so it's bigger now.\nThey are also now open on Mondays.\n\n\nUSEFUL?!?!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2011-04-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'RMX11FC48KZTYIeExtGUCw', 'review_id': 'm9Dc3UsqkMFmxswfHbryjA', 'text': 'We went back of a long overdue visit, and were surprised to find that they really spruced up the place! They have expanded into the space next door, and dressed it up with bright colors, a fanciful bayou-themed mural, and tablecloths. Yes, there is even now some zydeco to serenade you while you eat.\n\nAs always, the food is just as good as I remembered. Maybe even better.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2011-04-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'K5oJ9aQth_Ltg3Awgjy-wA', 'review_id': 'ZMgOcYQt-op85mX0BwFwFw', 'text': "I had a shrimp po' boy when I came here and it was delicious! The shrimp was crisp and the bread was fresh.\n\nThe only problem was the wait. I had to wait over 20 minutes for a po' boy and a sandwich. Maybe it was because I went on a Friday or maybe it could be contributed to the time went into making it. None the less, waiting for food that long on a to-go order wasn't what I expected.\n\nThe owner was very friendly and even offered samples to those who did not know what gumbo.\n\nIf you're looking for a fancy Cajun restaurant this is not it. The decor was nothing to brag about. But if you want to impress your family and friends by taking them to a place with good down home cooking then definitely stop by and give them a try!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2011-04-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'XJUqLrlB4S7JJxyTKrq4ig', 'review_id': 'mAxbRzxgW0gcrDkhctfu2A', 'text': 'Love the food and the non-casual atmosphere. A haven for a seafood junky like me :o)', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2011-05-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'e51F5DZOFwTNuKj6p1KQ8A', 'review_id': 'hfWbmwL4WT5HOvZATsv0XQ', 'text': "Went with the family and I had the crawfish po'boy and my brother had the Saturdays catfish special. We both enjoyed our meal, I loved the bread the po'boy was served with!  I love seeing local businesses with great offerings. If ur around u should try it out!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2011-06-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'W8yvAp2i9c1XDQ7d9lOz7Q', 'review_id': 'l3xGbkihMeaMN8V-ss8xsw', 'text': 'First time ever having Cajun food and I was so pleased and surprised. I took my husband here for our anniversary because its been so long since he has had Cajun food. I was very nervous and he was hoping it would meet the standards of the food he had in Louisiana. I had no reason to be worried if I would like it. He ordered boudan balls and I had fried gator po boy. Omg. So good. The atmosphere was very casual yet so friendly. The woman who helped us was very helpful and we tried some samples and "momma" made crackling...wow so good. I took some home. Oh and the pecan cheese cake was the topping on the cake. All around a great night.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2011-07-27', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'nTCt6CV-qx3lHsHIMJqizg', 'review_id': 'tkomvYi0y5Do0XVwi0ZFBQ', 'text': "Okay, the place is no frills, simple, would almost qualify for Triple D... Except, it TASTES good.  We've been to a few Triple D joints and most have been disappointing, making me wonder how much they pay to grab Guy's attention and the publicity.  Flavors of Louisiana brings it!!!!  Flavor, taste, smell, appearance, and portion... All good.  What would make them great?  One thing... Liquor license... so I could have a beer with my fab fish!\n\nGlad I grabbed the 'go' box because I had serious craving the next day. It reheated perfectly and I learned that the flavor was really the ingredients and not over saturation of grease.\n\nMomma loved her Gumbo and appreciated that there were NOT huge slimy chunks of okra in it.  The main man and I had oysters, chicken, and catfish... All worthy of ordering again and again and again.  I enjoyed the tater salad but we both thought the dirty rice could have used more meat in much, much larger pieces.  As it was the meat was so minimal and small it could not be tasted even though I could see it... That, and the lack of beer, were the only down sides to our kickin' Lous-E-anna experience!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2011-08-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'jifQQcGNRZYvHfeO2o4mTQ', 'review_id': 'WpbmLz5f_G1V5No3oqRgBA', 'text': "Second visit, second wow!  As a displaced coastal Texan, I miss great seafood and the the flavors of Cajun friend's cooking.  I think I have found a new home.  The gumbo is thinner than I prefer, but is otherwise to die for.  All of my order was served too hot (thermally) to eat.  It is a bit cruel to have to smell the aroma of great food while waiting for it to cool.  Clearly, everything is cooked to order.  Service is a bit slow, but very worth the wait.  A lot quicker than a flight to Louisiana.  \n\nThis visit they were out of bread pudding with bourbon sauce . . . darn.  After I ordered fried green tomatoes, they let me know they were out  also . . . darn.  After stuffing myself on seafood gumbo, fried catfish, boudin balls and red beans and rice, I saw banana pudding on the daily special menu.  The waitress said it was scratch made.  OK, this was a challenge.  Restaurants usually open a number 10 can of pudding and adorn with some sliced bananas.  I've never had decent banana pudding unless I made it because I make excellent banana pudding.  Wow, this one was too close to call.  Definitely scratch made.  \n\nA bit pricey for a plain diner style restaurant.  I paid around $30 for my dinner.  As a food snob, I usually don't get out of restaurants for under $75.  If you want cheap, stick to McDonald's.  Quality is worth the price.  I got more than my monies worth. \n\nSo, in two visits, I've been impressed twice.  Thanks for serving my ultimate comfort food.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2011-08-12', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 0}, 'user_id': '8ijB1-OsfKTncOLrEmfGFA', 'review_id': 'UF_8YArHO_-fMMPMM6V4hw', 'text': 'Absolutely awesome food.  I love their fried catfish, whether it\'s in a po boy or all by its lonesome.  I come from Nebraska, where we get fresh catfish right out of the lake and fry it up that night, so I\'m a bit of a catfish snob.  I give their fish the thumbs up.\n\nEvery time I\'ve been here, I\'ve loved everything about the place and prior to my most recent experience, I would have given them 5 stars, hands down.  However, I had a strange experience with one of the servers there this past weekend and can\'t get over it.\n\nI ordered the catfish dinner, which specifically states on the menu is 4 catfish strips, a side, and a roll.  Everything comes out, tastes great, and I notice after eating a couple of french fries that I only have 3 strips.  No big deal, I went up to the counter with the food to let them know they forgot one, and asked if I could please get the 4th.  Well, the server taking the orders at the registers just stared at me when I asked.  I didn\'t really know what to do except repeat myself and I even asked her if I was correct, while showing her on the menu where it says 4 strips.  She continued to stare at me incredulously until she finally said "Fine, I\'ll bring you another one."\n\n...\n\nOkayyyyy.  So odd.  It\'s not like I ate a strip as fast as I could and ran up there to report to her that I was missing one, hoping against hope that I\'d con them out of an extra catfish.  I mean, it\'s wonderful, but I\'m not that desperate.\n\nOther than that, the place is great and I totally recommend it.  Hopefully, the server was just having an off day and there won\'t be a repeat of rudeness :).', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2011-08-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 2}, 'user_id': '8ijB1-OsfKTncOLrEmfGFA', 'review_id': '4E7pUlozZtNBrB3SwQ1N1w', 'text': "I'm totally in a wonderful state of shock.  Not even a week after writing my review, the owner of the restaurant sent me a private message apologizing for the experience I had and offered to comp my next meal.  What a wonderful, attentive business owner.  The fact that I only have 4 reviews and am a relatively new Yelper didn't matter a bit.  Mad props to Flavors, I am completely impressed.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2011-08-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mZpIUEJbiaQoTVSyIrVufA', 'review_id': '8xLJFppdlVjza0uFqUl2ng', 'text': 'Wow what a great little place. Growing up in Louisiana and longing for a shrimp or Po-boy, Flavor of Louisiana you have answered the mail and talk value, you get your monies worth...........', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2011-08-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '8z2mKSqTW-4pLobAUNvrsQ', 'review_id': 'B4W0rFYTl2Miz3xdYL1cDQ', 'text': 'True Louisiana cooking!\n\nStaff is helpful and if you have a question about a food they carry they give you a sample. \n\nDessert is a must and 2 people can easily share 1 plate.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2011-08-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'zR8TgLiuWq4xZVXJEC8YEg', 'review_id': 'TnxDf98DjM8isVLE_42yGQ', 'text': "Delicious. Enough said. Oh and the customer service is always good. Best family owned restaurant in the area. I'm going again right now.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2011-08-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '7dwdRm4eu7CWtf_Eqit_dg', 'review_id': 'iOCbH0S8olcWBBQ5O2qtWQ', 'text': "The food was AWESOME!!  I am impressed and I have suggested it MORE than once!! They are very welcoming to the military members.  Didn't get the banana pudding so I am sad about that but I am going back to get some!\n\nPutting the word out!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2011-09-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'VhryahMYCaL4TJ5FtAK69A', 'review_id': 'pySVJu6L648LtGhL17Gs_g', 'text': 'I need to qualify my review with the fact that I did not eat there, that does not mean that l did not try, my experience mirrors that of many others. At 630 on a Thursday night l foung 8 patrons inside,\n2 eating....\n4 at various tables nursing their 3rd refils of self service pop...\n2 lonely souls standing in line at an unoccupied register.\nwhen l querried the people in line as to how long they had been there and how long it had been since they had seen a live employee they replied "more than 5 minutes" l put my menu down and drove the 5 minutes to Raul and Teresa\'s on Litchfield road and had a great meal', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 3, 'date': '2011-09-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wvSoHwvcMaZop922gaxwrw', 'review_id': '60opxYMTwZDX-Cy-kEaYMg', 'text': "The food here is excellent! The service is excellent! I'm hooked. I have been here a bunch of times. If anyone has a bad experience at this restaurant, I highly recommend you say something to them! They will fix it. And if you leave unhappy, go back and give them another try.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2011-10-27', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 2}, 'user_id': 'uvxM4Q5d8yKGf8VH37wr1Q', 'review_id': 'L0X6cCpTozq8eVdZHq14gg', 'text': 'I wanted to try something different and unique and came across this place. They serve shrimp, crawfish and alligator amongst other things.\n\nSo I decided to do something in the middle. I chose the 6" Crawfish po boy sandwich. Came with lettuce, tomatoes and a special sauce. http://www.yelp.com/biz_photos/8Vpfy_WtcVvZS8Wfz7JQJA?select=mB5BltElI3XPFBiM7gH4eg Despite having this sauce on the sandwich, the crawfish was a bit dry, but some Louisiana hot sauce fixed that. The bread was thick and crispy too.\n\nFrom my understanding, after talking with a couple of Louisana folks, that "po boys" are usually pretty cheap. But my 6" sandwich was $10 and that\'s a little bit higher than usual.\n\nFor my side, I upgraded with a $1 more, and got a small cup of chicken and sausage gumbo. Very hot and spicy. http://www.yelp.com/biz_photos/8Vpfy_WtcVvZS8Wfz7JQJA?select=O1O8644v0j73kL-7e5C73Q Great stuff. I should have ate this concurrently with the sandwich instead of eating the soup first. The sandwich could have tasted better if I dipped it directly into the gumbo, who knows.\n\nI also tried a big bottle of Sonoran root beer. http://www.yelp.com/biz_photos/8Vpfy_WtcVvZS8Wfz7JQJA?select=hgSfK9VzLLuKS4WKpiC15A Very refreshing Arizona root beer. I liked their bottle label too. Cool stuff.\n\nSo if you want to try something different, this place has several choices for you. The prices are slightly elevated but give it a shot.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 3, 'date': '2011-11-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'aoj5A4BXcnPdA4PRYCV77Q', 'review_id': 'SMoP6lLnKTBIzsqT9edBVA', 'text': 'Very authentic. Great Gumbo.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2011-11-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UtIJ2E2kAL44tmcGVQz4UQ', 'review_id': 'jO-IKcy4eml9u-co4K6jdw', 'text': "Me and my wife (both chefs) stopped in for a date night.  We wanted something a little different and not from a chain restaurant.  We started off with fried pickles, my wife is a huge fan of pickles but, gasp, had never had them fried.  They were an amazing start to our meal.  She chose a muffaletta with cajun chips for her entree.  The chips with cut thick, which is rare to find, but delicious.  The meat on the sandwich was great and the actual mix was so good, I could have eaten it on damn near anything.  I had the two meat plate with alligator and shrimp, the alligator had good flavor but was a little bit chewy.  The shrimp were perfect; not too much breading and cooked perfectly.  \nThe staff was so friendly and explained all of their sauces and were everything you would want from food service staff.  The plus about it is the fact that it is a locally owned, family owned restaurant.  We're already spreading the word.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2011-11-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'vBvTK-Fqfhl_DACCNaNOWA', 'review_id': 'etlhNLpV_u1FpR7-W-feEw', 'text': "Have eaten here many times and is one of our favorites in town. The food is spectacular and we look forward to it on a regular basis. I can't speak to all of the menu because I like the shrimp po-boy and red beans and rice so much it is all I ever get. I don't think I've had a better sandwich.\n\nI did have a small service issue a couple months ago and the owner bent over backwards to make it right and resolved my issue completely.\n\nWent back for lunch today and was better than ever.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2011-11-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'E4HbTIHd9PVjUnEKpysaLw', 'review_id': 'j3U-h8_SuaONg80Z8lb_dQ', 'text': "my boyfriend and I stopped by for an early dinner and there are zero complaints about this location.  It's a small shop, family-owned and the food was amazing (as long as you like cajun-style food).  My boyfriend is a huge fan of cajun food, spent a lot of time in New Orleans and loved the authenticity of FOL.  I am not nearly as familiar with cajun food and tried the fried pickles and alligator combo.  I loved it.  The helping was GENEROUS and definitely enough for leftovers.  The restaurant is going to be opening a second location in Phoenix and it should definitely be visited.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2011-12-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 5, 'cool': 1}, 'user_id': 'DueHdFSnn75LVHQmXM0x0A', 'review_id': 'jizjfpYrkhPBkpwx4b4WhQ', 'text': 'Let\'s start by disclosing that I grew up in New Orleans, went to school in Lafayette (home of the Ragin Cajuns), and REALLY know good New Orleans/cajun food. I grew up eating great po-boys, gumbo, red beans, and wouldn\'t consider eating any of these if not well prepared. That said, I can truly say that Jennifer and the Flavors of Louisiana gang make cajun food as good as any you\'ll find in New Orleans--SERIOUSLY. The po-boys are spot on (though the bread could be a little crustier) and the chicken & andouille gumbo is even better than mine--and, I assure you, that\'s DAMN GOOD. Frankly, I\'ve never had better. The only thing that is not "as good as it gets" is the red beans and rice. They\'re good, but not quite the creamy "Washday Monday" staple that I grew up on. My cajun grandmother has Jennifer beat on that one, but not by much. \n\nBut, if you want a special treat and want to taste something that kills all, get a sausage po-boy. Hot sausage or smoked sausage po-boys are a New Orleans staple and my favorite po-boys of all. But, Jennifer blows them all away with her home-made andouille. Simply put, I\'ve never had better sausage--ever. It\'s the reason her gumbo is soooo good and her po-boy the best ever.\n\nI\'ve eaten at Flavors many times, even though I live across town. Every time I go, I eat like a pig and bring some home to eat later. I have no affiliation with the restaurant, but wanted to post this as a review from someone who really knows New Orleans food and as a thank you to Jennifer and her crew for giving me a source for the best flavors in the World (not just Louisiana). As a matter of fact, I even overlook the fact that Jennifer is from Baton Rouge, instead of New Orleans or Lafayette and for not having any USL/UL Lafayette paraphernalia on the LSU/Saints wall. At least that is, so long as she keeps her promise to open another restaurant on the east side of town--that is, a lot closer to where I live.\n\nIf you want the ONLY good cajun food in Phoenix, treat yourself to Flavors of Louisiana. For me, it\'s just like a visit to any of my favorite po-boy shops in the old neighborhoods. It really is that good.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2011-12-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fUg0rGZVxhw_6vM1zYANXQ', 'review_id': 'A2fX81l_D7Ao1v2yDldbTQ', 'text': "I love this restaurant!! I have to stop by every time I'm in Arizona. I recommend the shrimp po'boy, delicious.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2012-01-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '60i9h-gPKH1f0YC_bZXDhg', 'review_id': 'qdE0n-O_cgZfGsdLRnCljQ', 'text': 'Visited this place with co-workers and ended up going three times in a week.  It\'s uber-yum, comfort food type of fare.  I\'m not knowledgeable about Cajun food, but one person I know from Louisiana who has been to this place said it\'s, "Really, really good.  You have to try her Mufasala!"  And yes, I\'m translating that last word.  All I recall is that is sounded like the name of Simba\'s father.  \n\nI have had the chicken and sausage gumbo, the shrimp etoffee (sp?), and the crab landry.  All were worth the visit.\n\nNice crew serving.  Fast and conversational.  It\'s cafeteria style after you order and have your food, though.  Self-serve drinks and table busing.\n\nPretty sure that if you visit, this place will be one of your regular spots, too.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2012-01-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'NxztOV-drq_cbVYLQZEzNA', 'review_id': 'sTNCs-nLDpnp9ITzoxOF6A', 'text': 'Their gumbo is awesome, full of flavor but not too spicy or overpowering.  They also have good fries for the kids.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2012-02-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'omJn7cgDDrLCsaQ8GXeNdw', 'review_id': 'zqhEN1Si-1fqGDO31-FIvw', 'text': 'The food taste great! We have eaten here 2 nights in a row and they have yet to disappoint. 1st night was the catfish & oyster combo and my hubby had the shrimp Po Boy,  It was a pretty hefty serving of deliciousness! 2nd night was the gumbo and red beans & rice plate, totally hit the spot. They even serve alligator. I love this place!!!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2012-02-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'lLrgP62n04pFmHXncK4k0w', 'review_id': '1KCot-B3GYY1EqHScLPZQg', 'text': "I used to live in Beaumont, TX which is about 30 minutes from LA. As a result, I would eat killer cajun food. Since I moved from there I haven't had anything as good UNTIL I came to Flavors of LA! U gotta have the boudin balls but have them roll them in cornmeal instead of flour. The catfish is great and the red beans and rice to die for!!!! Enjoy", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2012-02-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dwk15l9aIvwfEWS7ZYq9Ag', 'review_id': 's_TUnj_FGI6f0Kzpbms8Xw', 'text': "I love this place. I have been in my home for just about two years and I am sad that I found this treasure just about seven months ago. What was I missing? So much goodness, that's what. I order everything with a few boudin balls!!! The people who work there are really nice. I was not sure if I wanted to order dessert and they offered me a taste. The bread pudding is wonderful. It has no yucky raisins and the greatest sauce ever to pour on top. If atmosphere is your thing than this may not be the place for you. Forget that...it's the place for anyone. I get takeout from them once or twice a month and they never disappoint.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2012-02-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'W8yvAp2i9c1XDQ7d9lOz7Q', 'review_id': 'nsbcNuNp885R-e4ZSHBDCw', 'text': 'Second time at this restaurant and it was just as yummy as before. Great specials, great food and great service.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2012-03-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'CKQG21PTF4i3YRaOAOSdJQ', 'review_id': 'z72hS4TKhcU6VRn-VPXLaA', 'text': "Ok so lets start off with that I was really excited to try this place. I have been on this cajun food kick since my unexpected cancellation of my New Orleans trip and having a big Mari gra pot luck at work. I read the reviews and saw nothing but good things about this place. Javier and I went here on a Friday about 2 weeks ago. We both ordered the same thing. ( I usually like to order different things so we can taste each others food). We had a shrimp po boy with seafood gumbo and sweet tea. Lets start off with the good. The po boy was delicious, I liked it alot. The portion was huge, we ordered the half one and it was still a very good size so I could imagine the full size one. The bread was toasty but not too hard and the sauce in the po boy had a really good flavor. I topped it off with some Louisianna hot sauce which made it just that much more better. Second, the sweet tea was delicious. I love that it was brewed tea not the typical fountain nestea kind filled with artifical flavor. Since Javier and I both dont drink sodas finding a good beverage alternative is always a plus. Ok and now for the bad, and I really hate to do this because I really wanted to like this place alot. Im picky in the kind of seafood I eat, so I asked the cashier what kind of seafood in the gumbo. Given that I was in there on a Friday during Lent this was the only kind available. They had told me only shrimp and crab, perfect since those are two kinds of seafood I actually like. So when we get our order the gumbo smells really fishy, not typical of shell fish. I look through it and it looks as there is crawfish in there as well. I know for sure I do not like crawfish and if they would have told me that was included in the gumbo I for sure would have ordered another side. This isnt even the worse part. In Javier's gumbo there was something green and slimey looking. We had no idea what it was, looked like it could have been octopus tentacles or fish guts. Really it was that wierd looking. I now wish I would have taken a picture of it just to find out what the heck it was. Now I can admit I am a hard person to please with food, Javier on the other hand will eat almost about anything. Now for something to make this man not finish his food has to be really bad. Also the place was kind of pricy, our total bill was $14.00 and that included a buy one get one free meal coupon from the Entertainment book and 2 drinks. Needless to say we will not be returning. Yes I loved the sweet tea and the po boy, this was not enough to return back or to spend our $$$ there.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 2, 'date': '2012-03-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zIyFMiEiQU-hg80z0LPXcA', 'review_id': 'lOwJDj5kNZb-qtSh0fCU4Q', 'text': 'Dunkin catfish was my fav but everything was good.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2012-04-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'PUGeqbOMcynGB_2fMmNE-A', 'review_id': 'Gv2AhcmnRRvaWybF30rj4g', 'text': 'We went thre for lunch,  it was not too busy.  Husband and I both ordered catfish, I had red beans and rice and he had gumbo.  I liked the catfish but did not care for the red beans and rice.  I tried my husbands gumbo, did not like it either.  But thats just me cause he seemed to like it.  Im not sure we will go  back as it is a bit pricey.  They had NO sweet tea and the unsweetened tasted awful so opted for soda.   I have never had a muffeletta and want to try one, dont see a review here for that.  Oh and with no one there, the service was VERY slow, waited forever for food, was freezing in the dininig area.  Eating out of strofoam is never my idea of eating out either.\n\nWell have been back twice since, the muffeletta was delicious, the bread was outstanding. I only order the catfish and fries as that seems to always be delicious and my favourite,  it grows on you and when you want hot catfish this is the place to go.  Service was better this time.  Husband has been there twice without me for a gator poorboy but so far they have been out.   Oh and the tea was fresh and tasted good these last two times.   He likes the gumbo,  I do not.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 3, 'date': '2012-04-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ulwPQBaloxUSClqrNSiCiw', 'review_id': 'z812vJ2KpTkEAB-AItyAfQ', 'text': "We were in the neighborhood looking for something to eat and with the positive yelp ratings, we decided to try Flavors of Louisiana. \n\nWe arrived at 7:40 on a Saturday night and were surprised to realize that it closed at 8pm. In my opinion, that seems a bit early to close on a Saturday night.  The decor was charming with a wood plank-like floor and Burbon Street meets bayou decor. Upon entering, we stepped up to a window and ordered: fried pickle appetizer, I had the chicken and shrimp dinner and the husband had the crawfish po' boy. We also ordered the peach cobbler for dessert.\n\nNow a $6 appetizer seemed a bit steep, but when we received the food, it was enough for 6 people! They were full strips of pickles -- not little picke chips. And they were delicious! I love fried pickles.\n\nI guess when you get down to it, it's all just deliciously spiced fried food, but this was really good! It was not too spicy which is sometimes a problem with Cajun food.all of the accompanying sauces were very flavorful and added a lot to the food. My husband really liked his po' boy as well. Included with each meal is a delicious fried roll. I mean, really. Who knew that southern food had a doughnut equivalent. OK, so it's not a doughnut. it's a deep fried dinner roll -- crispy on the outside and soft on the inside. It's a really great invention.\n\nAfter chowing down on the generous portions, we ended up taking up the peach cobbler and ice cream home. Now maybe it was because we took it home, but I didn't really like the peach cobbler. I expected it to be more peachy and buttery.  My husband ended up eating most of it.\n\nSo my nutritionist will kill me when she finds out about this meal, but for a cheat meal, it totally hit the spot. If I am ever back in Goodyear, (which is not very often) I would love to eat here again. We will probably make a trip out there to take my mother-in-law, who LOVES etoufee. We are fans!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2012-05-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'U5TnaAf__Bn1wbe44T4c_g', 'review_id': 'RYsz6f9JudH8psaSj3yuug', 'text': "Despite the nondescript outside, the onslaught of the spirits of the South that assault your nostrils tells you a totally different story. Guess there is a deficit on gator at the moment until June which was a tad disappointing but the girl behind the counter, daughter of the owner and (from the accent) a transplant from the south, was the most accommodating person ever and made us feel like family with alternate selections. \n\nHad both the fried green tomatoes and the fried pickles. Each were excellent in their own right, with either a Cajun mustard or remoulade sauce. I had the Dunkin Catfish; 3 large strips of catfish, breaded by angels, and covered in crawfish entouffee. The amount of food was amazing.  If it's your first time there, plan on spending more than the one-$ listed, the more authentic creole dishes are a tad more pricey but completely worth it. \n\nWord to the wise, save room for dessert, the peach cobbler was amazingly over the top.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2012-05-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'FiCHEFsLY95Fuxi0UYdMJQ', 'review_id': '9bhei1yQxZk_huJzE4WUEQ', 'text': 'The food at Flavors of Louisiana really is spectacular and we look forward to eating here on a regular basis. Excellent Catfish, Gumbo, Red beans and Rice, Smoked Sausage. I am looking forward to trying other dishes. This is a must try!!  =0)', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2012-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Bz2igotNP00BeYeo32KaSw', 'review_id': 'Zcq5gSDw8pSNrVtJYDhSQg', 'text': 'Best food I have had outside of Louisiana. I took my mom here on her last visit. That was all she wanted the next two days she was here.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2012-08-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xZMxQPd6cqd3S1p3Rw4IYQ', 'review_id': 'ZTjArUupHd7snCSl1L4R4w', 'text': 'An amazing place to eat. I lived in the south for about 6 months, so when i first went here and heard accents, and obvious displaced southern folk, i knew this place was gonna be good. Everything i have eaten here is delicious, and the staff are incredibly friendly. Do yourself a favor and check this place out. and if you feel bad you can go burn off what you ate at LA fitness next door', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2012-08-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'RotG1z1ZxA--cfeR2EloVw', 'review_id': 'tyCN4C9g_hdNa59HWiqPqQ', 'text': 'Yum!  Best fried catfish I have ever had.  The staff is super friendly the food is great.  The desert menu changes daily but if you have the chance to try the bread pudding, go for it!  The shrimp etouffe is a great buttery, garlic wonderland in your mouth.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2012-08-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 5, 'cool': 0}, 'user_id': 'XeoAojoz5johV2MQ5ngNig', 'review_id': 'YMJeQf2K5zoUkJF-r_wcpQ', 'text': "I was not impressed by this and I really wanted to be. \n\nI got the gumbo and shrimp po-boy. I have had po-boy's in St. Louis which shares a lot of food culture with Louisiana and this one just wasn't up to par. It seemed like frozen popcorn shrimp on some bread with a ton of mayo and some lettuce. \n\nThe gumbo was kind of bland and reminded me of the stuff from a progresso can.\n\nI may be willing to give this place another shot but it won't be until after I finish exploring my other lunch options in the area.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 2, 'date': '2012-08-19', 'type': 'review'}
{'votes': {'funny': 7, 'useful': 12, 'cool': 11}, 'user_id': 'YLE6GoJ61fb0QBF7JTkaJg', 'review_id': 'L37E6itYQSTGF_khCn5PvQ', 'text': u"We are always loking for places to eat that remind us of places we've lived or visited.  On this day it seemed like a good day for a Louisiana roast beef po-boy. We've been to Johnny's and to Pakway's several times in New Orleans and they both serve these amazing hot roast beef po-boys, dripping in sauce (mixture of beef au jus and mayo) topped lightly with a little lettuce, a few tomatoes and pickles all wrapped up in a very crunchy baguette role. So we Yelped po-boy places and Flavors of Louisiana popped up.  At first we had a hard time finding the Flavors of Louisiana.  Its set off the very busiy road in a small strip center, so look for their sign atop the building.  The Yelp directions will take you right to it. \n\nWell we were hopping to find a roast beef po-boy like we would get at Johnny's or Parkway's in New Orleans but... not here unfortunately.  What we did find was an amazing shrimp po-boy and some excellent fried catfish topped with crawfish \xe9touff\xe9e.   Both were very good and very similar to what we would find in New Orleans.  We also had some gumbo, which was good but missing the roux was too thin and missing the andouille sausage but had plenty of shrimp and crab.  \n\nThis is a great place to eat if you're craving some southern fried catfish or even a fried shrimp po-boy!  You won't be disappointed!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2012-08-26', 'type': 'review'}
{'votes': {'funny': 7, 'useful': 5, 'cool': 0}, 'user_id': 'ma-7afsMYNnQkIGxRwPxdg', 'review_id': '5GMoGbVBlOBRs0KSkuAc7g', 'text': "I have no earthly clue why I haven't written this review before now... although it probably has something to do with my hands being busy shoveling catfish into my mouth. \n\nI can't say enough about how much I LOVE this place! I'm not much of a fish person, but I would smack my mama for some Flavors of Louisiana fried catfish. (Just kidding, Mom!) I'm also a huge fan of their shrimp po' boys, fried shrimp, peach cobbler and bread pudding - pretty much everything I've tried. A friend of mine swears there's nothing better than their dunkin' catfish (served on Saturday), but I haven't tried it yet. If it ain't broke, don't fix it, and I've been ordering the catfish, shrimp and fries for the last year at least. \n\nTip: don't you dare skip the dinner roll. It's delicious and worth every carb!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2012-09-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JKLMHItGlPy10-eUHvAIMQ', 'review_id': 'toOWYalIwJOC-91yA3HQBg', 'text': "Po Boys here are great. I switch between Alligator, Crawfish and Shrimp.  They're all tasty.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2012-09-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'TjIdgF0r4IUIEvMTYopfUA', 'review_id': 'Rwr0-QK5IKBCfmRUsQj19g', 'text': 'Mmmmmm mazing... Fried alligator po boy! Best service! Staff is friendly! Great environment! I love it!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2012-10-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8W80vBzP_SGTht0reRH4Mw', 'review_id': 'xhkDrKkIKulJdA-iACzGig', 'text': "I talked my family in to going there for my birthday. I am one of those people who can eat anything with out getting sick. This place did the trick! I was sick for 24 hours. If you take the fryer out of that restaurant they won't be able to cook at all. Even the dinner roll saw the inside of the deep fryer! I so wanted it to be good. Very sad it wasn't!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 1, 'date': '2012-10-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'i1tYKIBkqPny-dWx7ZPyvg', 'review_id': '1kLmVjhro-DqqxprK8P1PA', 'text': "The po boys were the best! Catfish and shrimp po boys are recommended! The jambalaya on Monday's are great that was a small portion but still good! The chicken strips also a great choice!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2012-11-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'wvSoHwvcMaZop922gaxwrw', 'review_id': 'djdr9db-X-7AN7TNOd7loQ', 'text': 'As always the food and service were exceptional. The Oyster poboy is flavorful and the red beans and rice is great. Great place to eat.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2012-11-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': '31OZmHva7Q0dTNqpM4TKug', 'review_id': 'YvqzFaYM7i6fYIgEAi2nvQ', 'text': 'Great food, great prices, amazing portions.. try anything on the menu and you will be satisfied.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2012-12-10', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'p8wp_2ecg7-Ns1uf-q6npg', 'review_id': 'bW8Y1berE0JG_Z7Rzw8vRw', 'text': u"We really enjoy going to Flavors of Louisiana. It is a very pleasant place to go to. The service is always very attentive, very nice, and clean.\nWe love that they have daily specials, but also, on Mondays our kids eat free, with a paid entre\xe9, what is there not to love. We are a family that enjoys eating, and going out to eat, and this kinds of deals are what we look for, plus, he food is great!\nWe usually get the Po'Boys, me the shrimp, my husband gets either the crawfish or the alligator, when he feels brave enough. I've also had the Chicken and Gumbo dish, with dirty rice and a side of Potato Salad, spicy and delicious!\nThey boys used to get the corn dogs, but have discovered that their catfish is delicious... I have to confess that when they can't finish their dishes, I don't mind at all helping them out with the tasty catfish. All of these with regular French Fries, or Cajun Chips, both are really good.\nI really do recommend this place! You have got to go!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2013-01-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_01X4a-sS1Oc2yZuMMuCEQ', 'review_id': 'bg3Xom7133zvpjcImgR7WA', 'text': "This is quickly becoming my favorite place to eat out! Everything I have had here has been excellent. The shrimp po boy is wonderful and the gumbo, wow! I tried the catfish for the first time today and it was perfect. Every time I leave this place I'm planning the next time I'm going to come back.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2013-01-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'VMpw_oIGTamcEkDPutll3g', 'review_id': '0WUzN4vBCJBRHY6CbVAZEQ', 'text': u'Absolutely delicious! Catfish, boudin balls, shrimp \xe9touff\xe9e, all scrumptious. Have never eaten Cajun before, I am amazed... Will be back!!!!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2013-02-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ky9pQ8AKufvZ63IxR41jGg', 'review_id': 'NcxHlxcSJZPXYgqLne93CQ', 'text': 'Cajun/Creole in the West Valley.....wow what a treat. Now while on this day I didn\'t have any of the food entree\'s.... I did have the dessert. The special today was peach cobbler with vanilla ice cream.....and let me state for the record it was THE BEST peach cobbler I HAVE EVER had served to me in restaurant. Now trust me when I tell you.....if it is on the menu the day you decide to visit this establishment......ORDER IT ASAP. The reason I say that is because it is not on the EVERYDAY menu.....that really needs to change by the way. If you have read any of my other reviews you will notice I am a bit of an expert when it comes to eating out and having great food.....well you can add this review to that list. I don\'t know when I will be passing through these neck of the woods again....but when I do "Flavors of Louisiana" will definitely be a "MUST STOP". Eat, Drink, and be Merry my Friends!!!!!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2013-02-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'bBvAAvcWeNTZrRJdCbt04w', 'review_id': '7g9Y_5PFeIseNpLRtz1I0g', 'text': "Husband and I went for dinner and we really liked the food.  He had a shrimp PO-boy and I had the Crab Landry.  The crab dish was good but a bit too much rue.  The shrimp that came on top is what made it good.  We both agree the best part was the red beans and rice he got as a side.  We took home what was left (PO-boy filled him up) and I reheated it and mixed it with my gumbo and it was great.  4 stars because I had to wait awhile for my plate while my husband was almost done with his due to mixup in kitchen.   Loved drinking from a mason jar too! Just like home!  Go here if you want Cajun fast food and Pappadeaux's if you want a nice sit down Cajun meal.  Either way they are both good.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2013-03-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'VLWnVAvyjBN1YscQU3UWLg', 'review_id': 'CdsQfMR100JRO5xo6PMlzQ', 'text': "Don't order the catfish...they are selling swai fish which isn't real catfish. The texture, color, and the taste aren't the same. Very misleading !!!!! This is Not authentic food! You can do better by getting a box of zatarans dirty rice from the grocery store and just add water!!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 1, 'date': '2013-03-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'V3L9wDDFR_1mbGJsic8Tzg', 'review_id': 'LOWH-KhrmfOWYRxVpQMdaA', 'text': 'Incredible food!!!!  Best Po Boy ever!!!!  Love all their specials!!!!  Cajun chips are the best!!!  This is a family owned and run business.  The owner is one of the best cooks in the country!!!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2013-05-14', 'type': 'review'}
{'votes': {'funny': 6, 'useful': 19, 'cool': 12}, 'user_id': 'lHPFFu5Hq2G1D17q1aU8Bg', 'review_id': 'REuLyfN87pPL2gByKcST6A', 'text': "I just can't.\n\nI can't write about the amazing po' boys. The glorious boudin. The succulent fried green tomatoes. I especially can't write about the to-die-for peach cobbler a la mode.\n\nI can't write about it because I can't eat it anymore. I'm a little verklempt, please give me a moment...\n\nAhem. Okay, that's better.\n\nTry the gumbo if you want to live dangerously, it's spicy! And the crawfish boil is one of the tastiest things I've ever eaten, if also one of the messiest.\n\nGo and eat all of the things. When you do, please have a shrimp po' boy for me.\n\nI'll just be over here, hoping for a miracle drug that allows me to ingest gluten. If that dream ever becomes a reality, Flavors of Louisiana will definitely be my first stop.\n\nUPDATE: I received the following message from the owner:\n\nHi Beth, Man do i have good news for you. We have a lot of Gluten free items on our menu!!! Yes i was a nurse for 25 years before opening my restaurant and Celiac disease was just becoming a known thing. So we can blacken any of our meats for you with our gluten free blackening seasoning. Also we fry in a mixture of corn meal and corn flour so no wheat flour goes in it. Just ask for your fried foods to be done in the cornmeal mixture instead of the flour. We have french fries, cajun chips, potato salad, cole slaw, dirty rice and red beans are all gluten free. Also if you come on Monday we have our Jambalaya and that is gluten free as well. So come on back and let us feed you some good and i mean real good gluten free food!!\nJennifer Goff\nowner", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2013-05-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8oynhBru4Ii21_icwxgNjQ', 'review_id': 'fGTdvmyzq1tdCfNJXo0qwg', 'text': 'Love the crab bisque, seafood gumbo and shrimp poboy.  I also periodically need an order of boudin balls...', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2013-05-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'X1KRjJOt6R811wXWyozfJA', 'review_id': 'drnSGnJoLKtP2jnIYAYEGQ', 'text': 'The food was actually quite good. However the service was the worst I had ever received. We were ignored for 15 minutes before we even got sat which was crazy. Then our server ignored us for over 15 minutes. We watched someone else get sat after us in the same servers area and she took there drink order, got them drinks and took there food order all before even talking to us. And our waitress was so clueless another waitress came over and asked if we had been helped. She then took our drink order and apologized that the waitress that had that table had been ignoring us.  Finally our waitress noticed us because someone else was helping us. So then in full view of us the waitress who had been ignoring us goes off on the other nice waitress. So the snotty, rude waitress helped us from there and the service just got worse. Later we heard the staff discussing how the manager was not there. Every employee in there appeared to be in high school.  The really good food does not make up for this terrible service...', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 2, 'date': '2013-06-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uYMIfx3M6RVuaUPwfeRZDQ', 'review_id': 'O-m7hcs5g_bz0-APTyA-kQ', 'text': u'Went here for the first time 6/21/13.  Lexie was our server and really made the experience great.  The sweet tea was really sweet and great.  Our glasses / jars were never empty the whole time we were there.  We had onion rings as an appetizer and they were crispy and the wife kept eating all the little crunchies.  Lexie brought us out samples of \xe9touff\xe9e and gumbo to try as well as horseradish mustard to go with the onion rings.The daughter really liked the \xe9touff\xe9e.  We ended up with 2 po boys, chicken strips and crispy shrimp.  The po boys were really good, even the son who doesn\'t like lettuce / tomatoes said the sauce made it, he had the shrimp. I had the tilapia and it was good as well.  The rolls were good but maybe just a little big for a po boy.  The 6 inch filled me up and the son brought the other half of his "stomach bigger than brain" 12 inch home.  The wife got the chicken and she liked it but it seemed kinda bland to me.  The daughter liked her shrimp but dipped her first into what she thought was a ketchup container but was like spicy cocktail sauce.  I also had red beans and rice as a side and those were great, I would go back just for those, over dirty rice as Lexie suggested.\nThe place is a little set away from the street, so slightly difficult to find the first time.  There was lots of take out going on the whole time we were there so that tells you it\'s good.  Not a whole lot of ambience and for some reason the table seemed slightly high.  We were seated closer to the kitchen and I could hear a beeping from my seat the whole time we were there, although the rest of the fam couldn\'t.  It helps if you like seafood, the wife thinks maybe a salad option would be good as well.  Never having been to Louisiana I can\'t say how authentic but overall tasted good to all of us!  I read on here afterwards that they can do gluten free for most anything, but didn\'t see that on the menu, should be a more prominent option there.\nThe service was really a highlight so ask for Lexie when you go, she\'s  a great steward for the place and knows her stuff.   All her recommendations were right on and I would trust her from now on. I would give 4.5 stars if I could.  We will be back.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2013-06-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PTXuXGoIcx0g6VoMWbY8wQ', 'review_id': 'SlPwvr_FNYNEeChPkvfIww', 'text': "My wife and I have been to Flavors several times. Great food, disastrous wait times. The food delivery process is clearly broken. They've managed to ruin a great concept with poor service.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 2, 'date': '2013-06-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'l7I6khaGzNsD0f3oykVtYQ', 'review_id': 'tbxFgfb01Vq67zWoLy4POg', 'text': 'Excellent food, reasonable prices, fast and friendly service. Highly recommend!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2013-06-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '5G3XlIIxUFtG03-5P6_FAg', 'review_id': '6n4bgd3SlrN7XyQYD0LHHw', 'text': "Great friendly little place. They have killer seafood gumbo and can't miss peach cobbler. Would highly recommend!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2013-06-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'F0upwq6ZXEUpIlhfZkQ5Aw', 'review_id': '7lOFWXEoJFO1z5HMRlRMqQ', 'text': 'This was not my first time here, but the first time we ate in since they expanded. It was really good. My husband and I shared an appetizer of fried green tomatoes, which were thick cut, battered and fried to perfection.  We shared the Crab Landry (6" garlic toasted French bread covered in crab stew topped with 4 fried shrimp)  and an oyster po\' boy. The iced tea, we did half sweetened half unsweetened, was perfect too. We finished the meal with some hot beignets covered in powder sugar. They were the perfect end to a great meal. We\'ll be back.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2013-07-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'n5I7B4JbC-priKvyiXsyDA', 'review_id': 'hjU-9Ee9SvwUqj0PQU_jkw', 'text': 'This place was surprisingly authentic tasting for being in Arizona.. The food came out quick and the service was good so I will definitely be recommending this place to anyone I know.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2013-08-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'omJn7cgDDrLCsaQ8GXeNdw', 'review_id': 'yBEZE5g_GzCs9-fKBDcHAQ', 'text': "This place has great comfort food! The service is a little slow but other than that it's definitely worth trying out. If you're ever in the area make sure you stop by and try the pecan praline cheesecake!!!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2013-08-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WDeRa1X8B1J4tTtAv47BIA', 'review_id': 'VzLqV58kXyoT8FFp3VxMXg', 'text': "I don't know how it took us 2 years to find this place!  The owner is from Baton Rouge, LA and so is my mother so it was a natural fit!  The restaurant is in the same parking lot as a Wal-Mart...don't be disturbed!  From the outside, this place looks a little sketch... GO IN!  They have everything you need for a New Orleans experience.  The Po Boys are amazing and so are the beignets!  The drinks come in mason jars; what more can I say? very authentic!  It was really busy when we were there so they were giving away free appetizers.  You wouldn't believe that a place like this exists in Avondale AZ so you MUST GO!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2013-09-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tYaqMWWtSBG5hIbOJ9nYvA', 'review_id': '2PkBc6eBr1OKJ1JDs3YMRg', 'text': "Wow... This place is great! Definitely try the alligator po' boy. Great service, great food! We will be back.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2013-09-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XHsWD63vpZoo_uOqEvcKtw', 'review_id': 'qP89mCjW8UEQzRP6meaBrg', 'text': 'Came in on on Friday night in September. I really wanted some good food and the full parking lot reassured that I made the right choice. \n\nSat down within 3 minutes, ordered food within 10 more minutes. Waited an HOUR for our food to come out!\n\nI ordered the 6" Shrimp Po Boy with dirty rice. Mom ordered the 6" Catfish Po Boy with Red Beans and Rice. A lemonade (yuck) and half order of Fried Green Tomatoes to go along. \n\nBottom line:\n\nAtmosphere : 2 stars\nFood: 5 stars\nService: 4 stars\n\nWill be back to try something else and a dessert.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2013-09-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'SoJNppQEXRCN5k6-9pQuHg', 'review_id': 'DTTcEr0NDlNPSgZxTbzuOg', 'text': 'I love this place everything is literally made from scratch it may be a little pricey but its worth every penny, the po boys are good & the gumbo is excellent.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2013-10-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'qSji9ZkGj2hu1G_cIi3rGA', 'review_id': 'HhH-Gkerpv6MY_DbLYRiDA', 'text': 'So unique! I have never been to LA but I am thankful that I have a restaurant near but recreating the food. We had Po boys and were in love! So yummy!!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2013-10-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lOKDxQs4WDCEE17c2n2HBA', 'review_id': 'UBbc6pS2_moypwHpVN0Gcg', 'text': 'Catfish, shrimp, red beans n rice were all great as usual. Always a pleasant time eating here.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2013-10-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'zdV9_QZOSpDN-XXSBqO_4w', 'review_id': '0Dpv3liHDO_sBolEV8tpgA', 'text': "Been a while since we've been back here as we decided to let our sodium levels drop back to normal. Certainly worth the wait.  Shrimp Po Boy was outstanding!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2013-10-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '7JgOZ-0EFtmUEQc0K4V-rA', 'review_id': 'lJ-zSTPK_baxi94-MY193A', 'text': 'A little difficult to locate FOL but SO GLAD I did! Had the shrimp creole the first time I went and spicy gumbo the 2nd time. Both were delicious. Once for dinner - once for lunch. Good service both times. Will definitely put this on my list of places I frequent .. well, *frequently.*  ;-)', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2013-10-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'qCMeBxolYg4-lt8u1fA7wg', 'review_id': 'FRuPvCAKmbIcqqd07YWPtw', 'text': "Has the best po'boy I've tasted (besides my dad's) hands down.  If you are ever in the mood for a shrimp po'boy then this is the place.  The Red beans and rice are pretty good, and so is the alligator.  All in all they have found a repeat customer with me", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2013-10-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vBvTK-Fqfhl_DACCNaNOWA', 'review_id': 'DrpZe2btJeiIWRQ8LTk72A', 'text': 'Have not eaten here in a long time and decided to give it a try and see if it was still as good as it used to be the last time we ate here.\n\nFirst, something on the shrimp PO\'Boys was WAY too salty. My wife and I could barely eat it and did not finish either of them. I think it was the sauce but can\'t be sure. Man I\'m suffering now.\n\nSecond, we had two sandwiches and two drinks. I had a 12" and she had a 6". Two sandwiches (came with red beans and rice) and two iced teas cost us $37. That is way too expensive for sandwiches, especially ones we couldn\'t even eat. My sandwich alone was $17 before tax.\n\nI\'m giving it three stars since it was so good in the past, maybe it was just an off night.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 3, 'date': '2013-10-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'MSEj4tK85f9gly8Upq-bGQ', 'review_id': 'J7frJcselbdWiULIe7NCDw', 'text': "This place is amazing. Family owned diamond in the rough. I always get the shrimp po boy and the potato salad. Here is a protip: put TONS of the their Cajun seasoning on the potato salad. Oh man. So good. \n\nThe wait isn't bad at all, keep in mind people, this isn't fast food. They make EVERYTHING fresh. Nearly everything is made in house. \n\nIt's always a pleasure coming here.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2013-11-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-c8Cqm6rC3ZPQXxUrAv0EA', 'review_id': 'bsRJABVJ6rrZXojBwsvfwg', 'text': "This place has some of the best food I have ever had. Their po boy may just be the best sandwich i've ever had.\nNice family run spot, with great service!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2013-11-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0tYlK-FieQXAdmTQ9DWTbA', 'review_id': 'NNMPFR4-qdy-t5LkVPZbJA', 'text': "I've been here twice, the first time was very close to when they had opened up and they had a special seafood Landry which I had never had before and it was really good. The second time, I was here I found out that the Landry was only available as a special and not part of the normal menu - so no Landry. I opted for the catfish with fries, but this was definitely not on the same level as the Landry. I wasn't a big fan of the cornmeal used on the fish.  Well if you are here and the Landry is on the menu remember to order it.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 3, 'date': '2013-11-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': '98ROyhBItvLregt75zSVLA', 'review_id': 'gejqW4dtuAu6slx9nUnaLQ', 'text': "My boyfriend and I were in the Avondale for the Nascar events this weekend and wanted to eat before hitting the road yesterday.  I found this place on Yelp and we decided to give it a try.  We were both very happy with our decision. \nI had a fried shrimp Po'Boy with Red Beans & Rice and he had the Jambalaya.  The shrimp in the Po'Boy had a light batter and was very fresh and the dressing had a nice flavor to it.  The bread was toasted and perfect.  The jambalaya had both chicken and sausage (huge chunks) and a distinct smoky flavor.  He said he was getting it from the rice, I felt it may have been more from the sausage or the chicken.  Either way, VERY good.\nWe will definitely return the next time we are in town and plan to take friends and family as well.  It was a great family run restaurant and we wish them a Happy 5 year anniversary on November 18th!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2013-11-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-WJ9HJiBLoUS9yNhiE6jbw', 'review_id': 'hGv5pxB0I6kbT82S3W-WEA', 'text': 'Located adjacent from Wall-Mart. Order at the counter. Servers will deliver food to the table. Must have: Drunken Catfish, Po-Boys, and Peach Cobbler. Also good are the Gumbo, Banana Pudding, Beignets, and Gator.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2013-11-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '164re1aEeq0rUqRVlwKwFQ', 'review_id': '27Yu5WSY0efFwIaxbGlMxQ', 'text': 'My boyfriend and I decided to try this place and were not impressed. The service was very slow for an almost empty restaurant. I had the Red Beans and Rice Bowl. It was cold and the Cajun sausage in it was very bland. No flavor at all!!!  My boyfriend enjoyed his meal but not enough for us to go back.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 2, 'date': '2013-11-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'zb5zawfuN9G6QU_R8NYVRA', 'review_id': 'LESCIqm21b_cfGqOS0a9kw', 'text': "I found this place online after looking for gluten free food in my area.  I visited New Orleans for the first time last month.  I loved walking in here and hearing the Cajun music blaring.  For those who have Celiac, nearly everything on the menu can be made gluten free, and without an additional charge.  I had fried shrimp, fried pickles, and cajun chips.  It was heavenly - especially after not having fried food at all in nearly 4 years!  My husband had an alligator po boy and gumbo.  He enjoyed it immensely.  I had a bite of his gumbo and it tasted just like the one that I had in NOLA.  This place is more authentic than Baby Kay's, and the service was great too.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2013-11-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3pGBYbC-00djVjkbb6DSfw', 'review_id': '0yrcq_sletFApIQDgQu9AA', 'text': 'The best cajun food ive ever had. ....happy 5th year \n\nI had brought my friend over there and he is from Louisiana and he has been in AZ for 5 years now and he always tells me how good food is back home and he can never find any real Louisianan Food so i tried the place out and thought it was amazing so i told him to come by and he drove all the way from the far east valley to try it out. This was my "Authentication Process" so he looked at the menu with a smile on his face and we ordered about half of the menu!!!\nHe told me a story about everything we ordered and how it should be prepared.\nSo by the time the food came and he started eating he forgot how to to talk and all that came out of his mouth was OOOOOHHHH and MMMMMMMM "its so good" he said and i asked him if it is the real deal and he shook his head and said YES!!! this is the real deal!!  \n\nThats my story of this great place!!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2013-11-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 4, 'cool': 1}, 'user_id': 'Yk37VAp452K7FwHWd1rrQw', 'review_id': '573CO1TUiKJdLxiZI_fSAQ', 'text': "This was interesting. Came here specifically to try the alligator for Mothers Day.\n\nPrices ok... not ridiculous. \n\nCheap down home tables. Didn't expect anything else. \n\nEasy dress code. \n\nAlligator is cool. Tastes pretty yummy.\n\nCan order your items blackened. But you can order the fried stuff with corn instead of wheat! Very useful.\n\nOwner is fully aware of celiacs and gluten intolerance due to having been a nurse. Can do low sodium and vegetarian as well! I was so pleased with that.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2013-11-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Pd8-OJ8JuVrEXhTSrnNDyw', 'review_id': 'c4h6qEaH6iKg2yFERSN1kA', 'text': "It's AMAZING! Their shrimp po' boy is delicious!!! And last night was my first time having their peach cobbler.... It was marvelous!!! Definitely worth the drive!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2013-11-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JK1pxDNMU9F5lr94g9tFNQ', 'review_id': 'vmkiibUW5bNxpcYf9_fPDw', 'text': 'Having the seafood gumbo with boudain and sweet tea... Like bwing in da Souf in da Wild Wild West', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2013-12-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1MujJ9hNKMo8trXI9I5gjg', 'review_id': '0Jm1HY9s0Xcd5cRKLqamfw', 'text': 'Food here is excellent, my favorite is the shrimp po boy. If you like good southern food, this is the place to go! I have eaten here many times over the last few years, and have NO complaints!!!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-01-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'V0FpHvMOsrtqURt18glAew', 'review_id': 'q6g1qf_DzruH7Uv2fbmDsw', 'text': 'I found this place simply by checking to see what\'s "good in the hood" on foursquare. I am Gluten Free however, my man will go weak at the knees for a good Po\'Boy... deciding to make his day I stopped in to get him one and upon walking in I see on the menu board the GF options. (Do you hear the angels singing???) The gal in the front was quick to offer a sample or two and they were delish! My order quickly expanded.   Now keep in mind, I DROVE the food back to Surprise, it was fabulous! I have not had GF food that enjoyable in some time! I absolutely LOVED it! He was thrilled to find there is a decent place to get some of his beloved southern favorites, he thought it was a great Po-Boy and the Gumbo was terrific... The GF fried green tomatoes with the sauce were wonderful and I absolutely enjoyed my GF catfish with the fantastic sauce! I have to say a smile spread clear across my face when the gal announced "Your order is ready Miss April!" I LOVE the South! Thank you for bringing that to the Westside! We will be back!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-01-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '9_kEO24cdf5cw9AVtqCXHg', 'review_id': 'pEJuwkAISDtX0Lhz9y9B8g', 'text': "Good environment. Friendly and quick service. We ordered fried pickles and crab Landry, both were made well and tasted good. The reason for the 3 stars was because I was looking forward to trying the jambalaya so I ordered that for myself. It was a complete let down. It literally tasted like someone poured a bottle of liquid smoke into the dish. Aside from the overwhelming smoke taste, the rice was mushy and the sausage was burnt. I won't be getting that again. However, I am willing to give them another try but I will stick to a po' boy instead.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 3, 'date': '2014-01-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HhOZZoj0Gfd8xnuwSgNZgA', 'review_id': 'C8C2mLz7ZzZKOlfaGBmWcw', 'text': "Very Nice place! I like the service! Very kind cashier! Food was good, I got the chicken sub with rice and beens! My friend guy the same! Their drinks come in a glass container! I will be back if I'm in this area! Good job guys :)", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-02-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cC9Q2WQsko4RclNxYdBfKA', 'review_id': '5oYho7327F1TOTnNOAcydA', 'text': 'We had lunch here today for the first time and we picked it primarily because of the good Yelp reviews.  We were very happy with our selections and by happy...I mean, that I talked about my Shrimp Po Boy ALL THE WAY HOME.  When my husband would change the subject...I would say "Mmmm, that was so good.  I wish I had bought another one to take home"....and I wish I had:(    My husband had ordered the Crab Landry which was very good but I liked my Po Boy better. Mmmmm, it was so good.  The Schweet Tay was very sweet but with a hug chunk of lemon to cut thru...it was delicious.  I took my Gumbo home (I had ordered the Po Boy and Gumbo Combo) and I have to sadly say that it was so salty and I mean SALTY that it kind of burned my throat.  I hope they read these things cuz you can always add salt but you can\'t take it away.  I think it would have been really good if not for that, full of little shrimps and seafood.  Someone else had mentioned the Table Seasoning and I think she might have meant the Louisiana Gold Green Sauce...yum, yum yum.  I am definitely one who doesn\'t care for burning hot things and this has a bite with tang...just right, I even bought a bottle to go.  I think by the time we got done with our lunch and the extra sauce and a tip we had spent nearly $40.00...kind of high for us for lunch but did I say how GOOD that Po Boy was?\nNot a fancy place and that\'s just fine with us.  The staff was very friendly and the music was catchy and happy.\nWe will definitely go back.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2014-02-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'x3w4dpes5ngumaIepCKzTw', 'review_id': 'GV9F3vVFrZ072mo6idSrhw', 'text': u"My first taste of Cajun/Creole food =) I came with a Louisiana-native, and she had the Crawfish \xe9touff\xe9e & Gumbo while I tried the Shrimp Creole & Fried Green Tomatoes. I never tried fried green tomatoes before, and this will probably be my last time. I didn't like the texture of the tomatoes being fried so it just tasted odd to me. I was also expecting the Creole to be more flavorful and even spicy, but the sauce just tasted like tomatoes and wasn't spicy at all. I personally would've wanted more seasoning, but I have nothing to compare this to so maybe that's how it's supposed to taste. Overall, I liked the food and would come back again. I should've yelped this place while I was there since it looks like the Shrimp Po'Boy is the thing to get here. Next time!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 3, 'date': '2014-03-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 't_9IOKqwGLEmyDE3VYPafA', 'review_id': 'O53MF7JEIwg6hQViQg_3LQ', 'text': 'Love this place, been going here since we found out about them, wonderful food, decent prices, family atmosphere. Makes me miss home but the food is the best Cajun that I have had out here. It is a family run place and is super clean and very friendly staff. All the desserts are scrumptious. My favorites are the gumbo, red beans and rice, fried green tomatoes, fried dill pickles, and shrimp po-boy. Be sure to ask for some of their remoulade sauce to go with it. Yummy. They also have some creole mustard that is good too. Not a big fan of their cocktail sauce, but that is my only complaint.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-03-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mn0XMB-HtbkZ-gbWfko3gw', 'review_id': 'm6pUN-oihhY_9il1iVSjHw', 'text': "Had dinner here last night.  I ordered the crawfish etouffee.  My wife had a chicken salad.  I am a big fan of cajun and creole food and had high hopes for FOL, but my opinion of the food is that it is only average.  The etouffee was a bit bland for me and did not have the rich savory flavor I have had in New Orleans.  My wife felt similarly about her salad.  The restaurant does not have a license to sell beer or wine so it's just soda pop, iced tea or lemonade for drink choices.  Personally, I love a good cold beer with my cajun so that was also disappointing.  Service was very friendly though.  They are very polite and attentive.  I might go back to try the gumbo.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 3, 'date': '2014-03-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BoyIX_eFdXSFsf7Sg2S06w', 'review_id': 'Vld1tVatovn1q_ucP52pTw', 'text': 'This place is AMAZING!!! Everything they make is delish. \nWe just finished a king cake and it was like we were back in Louisiana!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-03-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'C4QUa9iQc7K0erpyEiovbg', 'review_id': 'cNPVRQA6JaSV3g1PMyfXbg', 'text': 'I found this place on Yelp as I was looking for a restaurant in the Valley the served po boys and friend green tomatoes.  I was pleasantly surprised. The food was delicious, the staff was professional and friendly, and the ambiance took me back to Louisiana.  I plan on coming back to get my po boy fix and would recommend this place to anyone craving gumbo, fried green tomatoes and po boys.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-03-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hfeGGmw0Affb84I9s1YuxQ', 'review_id': 'yMC3EMvg48mH8x7Y8my3qg', 'text': 'We found this restaurant on Yelp. Visiting AZ for Spring Training and needed a place for dinner close to Glendale. Reviews sounded promising. We had a hard time finding the place but persevered. The place looked promising when we walked in because there were a lot of people there. A good sign. I had the muffuletta sandwich and husband had the jambalaya .  Both good. Serve was slow .  The gal said there was one less cook that day.  But the staff was very friendly and helpful and apologized. Others in the restaurant seemed to be enjoying their food, too', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 3, 'date': '2014-03-19', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'fAa_hTaR9FDuvDUCaGwbTg', 'review_id': 'UDZDht7GWQONy3rT1qaOaQ', 'text': "It's like the all mighty him/herself came down from heaven and delivered this place to us folk in AZ that have a love for Louisiana cooking ..  I spent a week vacation in The Big Easy for Mardi Gras and it feels food wise as if I was transported back there. My Co workers told me about this special place so glad i came for myself, give it a shot u won't regret it.  Just take you stretchy pants 1st..", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-03-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'PqKcnqRurarSsGBZUBQEcA', 'review_id': 'qzi4K2PntRipJK33E00ZHg', 'text': "This place is awesome! Great food great prices. If you're looking for something different while you're in Arizona them this is for you. It's a little hard to find but don't pass it up.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-03-25', 'type': 'review'}
{'votes': {'funny': 7, 'useful': 12, 'cool': 8}, 'user_id': 'diDUDx82VePOC1hObkHwMw', 'review_id': 's5qZqmai2KYRBVr8NHMm2Q', 'text': "This is a really nice family owned restaurant that is located on the far West side of town. It is definitely worth the drive. Good friend from Louisiana told me about this place and her food. So I got in my car and had to check them out right away.\n\nInside is very casual with a vibe that reminds me a eating in one of those smaller towns down south. Decor is very simple with touches of the bayou and it's critters sprinkled here and there. The smell of the food instantly puts me right into the zone.\n\nReally love the Cajun Food and the Cool Cajun Zydeco music playing playing in the back ground. They have both a lunch menu and a larger dinner menu. You can order off the dinner menu at lunch if you are really hungry. The portions are bigger and there are more choices.\n\nSo far we have tried the Dunkin Catfish, the Alligator and Crawfish Po-Boys and both of the Gumbos. How can you go wrong with Catfish placed on top of rice and then covered with Crawfish Etouffee. We also tried the fried Green Tomatoes on our last visit.\n\nThe food is cooked and seasoned with tender loving care. Everything taste fresh and the prices are very affordable. You can always add some extra heat by choosing one of the hot sauces to kick things up a notch.\n\nService is friendly and helpful. This is not a well polished chain restaurant with robots reading scripted dribble. Just great food with a fun and tasty menu.\n\nUse your GPS if you are coming from way across town. They are located in a large shopping center towards the back and the sign is a little hard to see from the street. PARTY IN MY MOUTH!\n\n4.5 STARS", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2014-03-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'b2burjDh3jFs3u1VC_OUHQ', 'review_id': 'IFp1AYHFgCdGv5i4srwgOg', 'text': 'All in all this was a very good lunch. This is probobly the best cajun food available in Glendale, AZ or the surrounding area.\n\nFried pickles were absolutely amazing and cooked perfectly\n\nShrimp Po Boy was done just right\n\nOnly gripe was the coleslaw which was too saucy for me, and a bit tart, it tasted like apple vinegar or something. Not so bad that I want to stay away...just something I wouldnt order again.\n\nVery nice staff and quick turn-around', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2014-04-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'tKG_g869VBcGxjg_jhpRrA', 'review_id': 'uev-3ibi_sObhhPwfBHDZA', 'text': 'Saw them featured on "Check Please, Arizona". Had to go. Glad I did! Funky little place in strip mall in Avondale. Don\'t let that keep you out. Food was excellent. Both my wife and I had the Shrimp Po Boys with cajun chips and shared an order of hushpuppies. There is no way you will leave hungry. Delicious and quite tasty. Do not miss out on this establishment!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-04-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4rbM1TH7THDFH-gTKZ64dw', 'review_id': 'Q3YayxzOfnka7mLDFAm_lA', 'text': 'I love Cajun cooking and this was wonderful! Great catfish, red over dirty, and crayfish. The peach cobbler was SOOOOO good. I highly recommend this restaurant. However, it is not for the "ambiance snob." It is like a family cafe (which is what it is) with very friendly staff. I will return!!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-04-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6x5LTeqgsaKZYYLYP7oUKQ', 'review_id': 'eMeqka_B0dAR5RL_Z7FgFQ', 'text': "I am only giving these guys 4 stars because I don't really have much to compare to. I have never had a Po-Boy before I had it from Flavors of Louisiana, but I absolutely LOVE them now. I got the Chicken Po-boy and everything from the bread to the sauce to the chicken is great! Oh and fried green tomatoes are THE BEST! OH Oh ohhhhh, don't forget to get some sweet tea too! I love this place. Enjoy!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2014-04-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZhCVoNG5dZuCvss_qAGKEQ', 'review_id': 'WAiTXOt5_Upy3S3jrxIZBQ', 'text': "Always try and hit up the unique local joints when I'm travelling.   Flavors of Lousiana has the bonus of being near my company approved hotel so boo-yah!    I was excited to see Po' Boys on the menu but disappointed that the genesis of the Po' Boy - the roast beef with debris gravy - wasn't on the menu.  Seems a little counter intuitive.   Nonetheless, I had the crawfish po'boy which was on a very solid role and pretty darn tasty.  The gumbo was the star for me though - nice rich broth that you can tell came from a nice brown roux.   It was full of flavor and made me wish I had gotten the next size up.\n\nGood place - pretty close to authentic but loses a star for not having the roast beef po' boy on the menu.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2014-04-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'Cigv45eDjDjYTDdzYPYRcQ', 'review_id': 'anBniDiDxpOscVEBlXmDEw', 'text': "What a great find!  Delicious food and great service from friendly, eager-to-please employees and owners.  The best jambalaya I have ever had and delicious sweet tea to go with it.  We were there for lunch but we will be back again soon for dinner as well (Can't wait to try the alligator!) Best cajun food in Arizona!!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-04-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'DDX7Y66KTB1teW7KEd62Cg', 'review_id': 'myjCgvK504ohRsc6cVRKBQ', 'text': "Being from south Texas myself (close to Louisiana) I had major doubts this little Avondale strip mall joint would be able to produce anything close to authentic Louisiana fare.. I was however pleasantly surprised :) their shrimp poor boy with French fries was amazing and the fried catfish with cole slaw was close to home cooking!! I have been back on my lunch break several times and the food is always consistent and fresh and delicious every time.. Service is friendly and fast too which is a bonus!! Go ahead and check it out you won't be dissapointed plus they serve alligator if anyone is interested in crossing that off your food bucket list!!!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-04-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'EzhG_h9FXmakXXz1VCQO2g', 'review_id': 'oIKCxjxfU03B6uudkbZmog', 'text': "This place came highly recommended by locals, so I was excited to give it a shot.  Shrimp po' boy, potato salad, sweet tea, fried pickles with a homemade remoulade were a nice touch.  \n\n- Potato salad was very dill pickle-y.  For whatever reason that was not a good surprise, when I usually love most types of pickles.  It did look ultra delicious though.\n- Shrimp po' boy... this wasn't bad necessarily, it just wasn't great; I would definitely not order this again.\n- Fried pickles were beautifully fried and the remoulade had a really nice kick of horse radish that balanced the saltiness perfectly.  \n\nAlso you can get a gallon of freshly brewed sweet tea for $5, which is a good deal.  I would most likely not return.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 2, 'date': '2014-04-16', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 6, 'cool': 2}, 'user_id': 'GrSixRnGIxNUJ1Cn5DNX9A', 'review_id': 'T1TT-SLJz6bu6jT7ZLXukg', 'text': "Sure it is way out in the west Valley but the drive is much shorter then a flight to Baton Rouge for those who want prime Cajun flavor.  The ingredients of the shrimp Po Boy blend together like the sweet sounds of Dixeland jazz and the offering here is akin to listening to that jazz performed by Louie Armstrong.  It's a shame this isn't more central to Phoenix.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2014-04-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'OZYsYnpjglZ2-UlJ3eXAYA', 'review_id': 'jTUQ5k92tZTu3sZ8AzWaMg', 'text': 'First time there\n\n WAS GREAT.  The waiter was great. It was great food.  I can not wait until I go back.  Must say food was a little slow coming out but, I was not in a hurry.  Still can not stop thinking about the food.  It was so good. Great family environment.   Great job guys.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-04-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MN14PqthqzXiBNA7ewar7Q', 'review_id': 'So97yh_SorZSbfgbJtMmcQ', 'text': u'This is bar-none our favorite place to eat in the Goodyear/Avondale area.\n\nThe food is great! If you are afraid to eat spicy food, don\'t worry! Many selections from the menu are not hot. This is authentic "Nawlins" eating! The stereotype that Cajun is hot food is not true. It is well seasoned. Garlicy, sweet, sour, hot, salty. The gamut of flavors depending on what you order.\n\nEverything is fresh and delicious. I have had the fried pickles, hush puppies, red beans and rice, shrimp creole and the shrimp \xc9touff\xe9e. My friends had the Po boys made with gator. All of it was fantastic.\n\nThe service is great, except for one time the staff was busy with a large birthday party and kinda forgot about us. However, as soon as they realized what was happening, they were very attentive. Otherwise, nice food servers who know the menu and can recommend with authority.\n\nOrder the Beignets. And sweet tea.\n\nNext time I want to try the jambalaya and peach cobbler.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-04-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '05-KgLRoGNccATkVzu6EDw', 'review_id': '2ZEqvgUaxCmBStSqV6eiAg', 'text': 'awesome food! been to new Orleans its about as close as you can get out here. peach cobbler was excellent!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-04-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'PA3-gbkiOAaNZL2skD6wUw', 'review_id': '-mp6dUBysp82P2p8d6OwZg', 'text': 'It was our first visit, & we had a great lunch there today. Will definitely make it one of our favorites. My blackened catfish po boy was sooooo good!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-04-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '272YBynZNP4y9dvuruTRpQ', 'review_id': 'mQSw6hnAyduNxdXm2D_sxw', 'text': "Had the chicken Sausage Gumbo, Shrimp Po'Boy and  Beignets - very good great French Bread.  Going for the etouffee.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2014-05-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'xdGw2Ud67Vg_EP2Ka789Nw', 'review_id': 'gXfxQVP0hF50sxR2voN9CA', 'text': "I love this place. As a native of Louisiana, I find my self craving a taste of home from time to time. The food is consistently delicious. I highly recommend the boudin balls with Cajun tarter sauce and dunkin' catfish. The shrimp po-boy is excellent, as is the gumbo. I used to go when it was more self serve for drinks, but they've renovated a couple of times over the past year and have table service, at least on busy days. I typically call in my order and either bring it home or eat it there. One of the best things about this place is the friendly, kind people who own/work at this restaurant. I'm so happy to find a taste of home so close to where I live now.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-05-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'xgZjsee8F6SNP7kMUHXngQ', 'review_id': 'bN6qCCA2nFZx4wW_Wap3gg', 'text': 'This place is awesome! My favorite is the shrimp with onion rings but all food is really good. The service is good so I will recommend it if you are into seafood.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-05-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'd1GQXkfct8wF-rk-7vypiQ', 'review_id': 'tIHO4gbpbT9H8zdhyDwUzA', 'text': "I love this place. I'm a huge fan of all things rice and spicy food, and this place has more than a bit of both. Anything with rice there is top notch, the hush puppies are amazing, even the gator isn't bad. I now come here often and even have brought some friends.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-05-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Cigv45eDjDjYTDdzYPYRcQ', 'review_id': 'PRr-YD7sNCBR5a5LwtiV7g', 'text': 'This is getting to be one of our favorites.  In fact, we ate here twice in the last six days!! Food is great - servers are very friendly and helpful and they really know the menu.  Kyle was our server last night and he was really exceptional - could not do enough for us.  Had one seafood gumbo and one chicken and sausage gumbo, a half order of hush puppies and beignets (with honey) for dessert.  Delicious!!!  A forty minute drive from Surprise, but well worth the trip.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-05-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'L-3kkmJTIHdmaBlk9mbJVA', 'review_id': 'xJ6SRgNR4NrXZ_1Cq5mPXA', 'text': u"We tried to eat here Friday night and it was horrible. Mine was ok but not special. I had the crawfish \xe9touff\xe9e.  My husband had a combination plate with shrimp, catfish, oysters, tilapia, boudin balls, onion rings and hush puppies. The catfish was fried in to hot grease, burned on outside raw on inside. Tilapia was cooked same way and smelled so fishy, nasty. Shrimp was fine. Boudin balls were ok. Oysters were fried black so the brought him some more and he took one bite and spit it out it tasted so bad. Hush puppies were still gummy inside while well done outside. Should have known that dinner wasn't going to be good when we ordered the fried green tomatoes and they were half ripe and burned but we thought we would try. Then the banana pudding well it was vanilla custard with sliced bananas and crushed vanilla wafers in top. Really there are at least a hundred recipes on the net for banana pudding, pick one. Wish I could give it NO STARS.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 1, 'date': '2014-06-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'wcxfeqUtlFOgpw2Bm1Zkjg', 'review_id': 'VM6G3CSwgzkbYRncclqMpA', 'text': "Only 3 stars for my first visit (5/31) but I'll go back for a second try.\n\nAgainst my better judgement, I ordered the boiled crawfish. Three things were telling me not to order it:\n1 - We're 1400 miles from crawfish country.\n2 - It's near the end of crawfish season and they're probably small.\n3 - 17.99 for 2lbs of crawfish is expensive.\n\nAs I suspected, the mudbugs were small. The flavor was ok but the crawfish meat was sticking to the shell which usually indicates the absence of lemon during the cooking process. The potatoes had black spots and the corn was shriveled. \n\nOn the bright side, the fried pickles and green tomatoes were delightful. The hush puppies were excellent!\n\nI tasted my buddies seafood gumbo and the roux tasted like it was burnt or scorched while it was being made. The rice was sticky and clumpy.\n\nI'll go back to try the other menu items and update my review.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 3, 'date': '2014-06-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tN0iYNawYiyMpTqC94Ce2g', 'review_id': 'iQgkAUUWtv6IYlJgVfJA4A', 'text': "Phenomenal. Absolutely phenomenal. Low key place that you wouldn't find unless you got a word of mouth recommendation. Easy going atmosphere with great service and even better food. In and out in 30 minutes feeling satisfied but can't wait to come back. Got the crab Landry and it was fantastic.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-06-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'OlPyUBeTTT8Z3hlECF9ASg', 'review_id': 'eR1x6SpsnIHpXpNJTHhE5w', 'text': 'This place is great! Food is amazing and they always have my food ready when I call it in. The employees are always very friendly as well. I highly recommend this place.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-06-03', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'Z7WLfuRHHdgDZg4chXnvgg', 'review_id': 'wNsUq7Sth0UU2S_3hGmMGg', 'text': 'This place is AMAZING. ...The food is delicious felt like I was down south..so happy I leave a minute away!!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-06-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'DbskgqCz6M24dNFi0ed0WQ', 'review_id': 'X1lo_xaTthZIgM-5Pr3tAQ', 'text': "This is like stopping into a joint on Bourbon St., I get transported back to Louisiana when I eat here.  The food is great. You will want to try everything on the menu like we did, but I worn you, there is plenty of food and you will be rolling out the door. \nIn AZ this is the closet thing I have tried that is like be in NOLA. \nJust go, Eat, and you will see for yourself. It's good!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2014-06-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Rtep3VNYoTnU64w3n3iDgw', 'review_id': 'ryr-EAV5tXpMmi3Kx8s8ag', 'text': 'Recently I was in NOLA for a few weeks and lived in FLA for 2 years and I do know good Cajun food and alligator. I was cookin\' with Paul Prudhomme back in the early 80\'s before he was Chef Paul P! \nFor almost $50 we bought the combo plate with two meats and sides, a shrimp Po\' Boy and an order of (3) Beignets with sweet tea. The Po\' Boys are very good. The Shrimp was lightly battered and well seasoned, fried golden brown, sweet and crispy with just the right amount of spice. The roll was fresh and crusty. The red beans and rice were very good - lots of meat, beans were toothsome (not mushy) and the rice was done just right and it was spiced perfectly. The french fries were good, fresh, hot and crispy brown and moist on the inside.The sweet tea was just right and freshly made. Unfortunately - The alligator is terrible and the Boudan balls are just plain horrible. Alligator consisted of tiny breaded balls of flavorless chewy meat ranging from the size of a pea to a large blackberry - not one chunk or strip mixed with a lot of debris from the fryer (fried crumbles of batter). They were mostly tough and chewy. This is supposed to be tail meat which is usually pretty tender and there was very little or no seasoning. The Boudan balls were a huge disappointment. The filling was an unidentifiable tasteless gray paste with very little powdered spice, rolled in bread crumbs and fried. I pulled one apart and could see not one piece of meat, vegetable or rice. My best guess is that it consisted of bread crumbs with powdered spices and some binder (don\'t have a clue what). That they call this a "meat" selection is really a joke and for the price, absurd. When I was in NOLA I had Boudan balls at a half dozen different restaurants and they all contained meat, liver, ground with pepper/celery/onion/garlic, spices and rice . I\'ve made my own for years and these resembled nothing like anything I\'ve ever seen. There was no tartar or other sauce for dipping.The beignets are tough and chewy instead of the moist ,airy,  delectable powdered treat they are supposed to be like I had every morning at the Cafe Du Monde in N\'Orleans. The combo plate contents and two of the three beignets now resides in my refrigerator, barely touched and will go into the garbage tomorrow....what a waste of money. If I wasn\'t so far away, I\'d bring it back and explain why to the manager. So, if you go - which you should as there IS good food to be had, stick to the Po\'Boys (NO ALLIGATOR!!!), gumbos, rice, fries and other selections. I will go back and stick to the above mentioned selections as they are the only option in this area for Cajun food. On VA s\'revoir!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 2, 'date': '2014-06-20', 'type': 'review'}
{'votes': {'funny': 6, 'useful': 6, 'cool': 1}, 'user_id': 'bp0WTnS6VAemBIWczJItYg', 'review_id': 'JPYanTM4o3Es39ykFS-9iA', 'text': "First, know that I was born and raised in New Orleans and know better than to expect much from remote places claiming to prepare authentic creole food.  Being in the desert of Arizona (business trip), I was predicting the gumbo to be tomato soup with hot dogs floating in it. The place didn't look like much from the outside (or the inside) but being a brave and noble soul I charged ahead and ordered the fried green tomatoes, fried pickles, a cup of gumbo and a shrimp Po-boy.  \nI can't believe how good it was! They might make the best fried pickles I've ever had. The gumbo was delicious...well, everything was delicious. But be warned, I ate too much and almost fell asleep at the table.\nGreat food.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-06-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '3Xdial3M7dbZkygA0L-Zsg', 'review_id': 'q8hfNHH_DccDTSaE0_u80g', 'text': "We tried out the shrimp Po boys. The flavor was unbelievable. The right amount of spice fused with this awesome Cajun mayo. The jumbo fried shrimp seasoned and cooked to perfection. I will definitely be coming back again. Two thumbs up. Best I've had in the Phoenix area.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2014-06-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fKGFE-40uZiBp63EYnXUxQ', 'review_id': 'GAvRXrdPqOkuhyicNRxiNA', 'text': 'First know I am from the desert SW so I did not grow up on this type of food and in fact this is my first experience with Louisiana style food. Tables seemed greasy and interior is old and worn. I had the fried alligator po boy sandwich which was ok, nothing great, and a half order of fried green tomatoes which were very thin, flavorless and swimming in a pool of grease. The waitress was very pleasant and I did have the unsweetened iced tea which tasted like it was made in the sun, very good therefore two stars for the waitress and iced tea.  This is not a place I will spend my money at again.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 2, 'date': '2014-07-11', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'L-3kkmJTIHdmaBlk9mbJVA', 'review_id': 'YCkEyW6Dk9b2px90-42JcA', 'text': "Contacted by the owner about my review. She offered to refund my money for our dinner and invited us to try them again. Since I don't live in that area she kindly sent us our money back. She was very nice about our experience and apologized that it was not what we expected. So I really hope it was just an off night for them when we were there.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 1, 'date': '2014-07-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'tKGmQQEYCKO7sFyoUA2mSA', 'review_id': 'wTiAzhhKB6MHdJib_5mLrA', 'text': "My fellow Yelper's have once again steered me in the right direction for tasty eats.  As another reviewer mentioned, the restaurant is a little hard to spot in the back of a shopping plaza, however now that I have found it, it is easy to get in and out of.  Upon entering you are greeted with the wonderful sounds of Louisiana jazz music. The decor itself, is not over done, simple and inviting.  The staff was friendly and I was immediately seated.   I ordered 1/2 Fried Green Tomatoes for a starter with sweet tea.  The sweet tea comes in a pickling jar and was delicious and had the right amount of sugar.  The Fried Green Tomatoes were crispy and tasted like what I was hoping for, tangy and crisp.  I ordered the Joliet Rouge, blackened cat fish on a bed of dirty rice, with crawfish/shrimp etouffee bathed over it.  It came with a side of beans and rice and garlic bread.  The dish was very good, I was pleasantly surprised that tastes of New Orleans could be found in a strip mall in Avondale AZ.  My only issue was that my ticket was shuffled or lost in the kitchen so my meal was late coming out.  When it did finally come out, it was hot and fresh.  The waiter apologized and offered a free peach cobbler, which I had to take to go as I was out of time and had to go to work.  I do recommend that they serve Cafe duMont coffee with chicory.  That would be a nice touch with a bengiet, since they served those, I would have expected to have the coffee to go with it.   The owner came over to my table to find out how every thing was,  I asked about the coffee since that is a true LA flavor.  She at least offered to order some!  I declined since I am traveling through but thought it was nice that she at least offered.   Bonus peach cobbler to go which I enjoyed later and it was very good.  I will be back, the Joliet Rouge was worth it.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2014-07-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZPiqMatolbzPr2LjjeGihQ', 'review_id': '_AVzC9dv7BmHAhVT4_mrWw', 'text': 'One of my church members told me about this place so we tried it last night the par ran was delicious, seafood gumbo was to die for. My hubby on his way to get more today.\n \nI sample the alligator taste like chicken, sweet tea was perfect. I will be back.\n\nSurprise,Az', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2014-07-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'mdPo5ojs2jOLZylsl9vBDA', 'review_id': 'osIC1VubwUFnCD50vjoj7g', 'text': "I have eaten here many times. Although I have never been to Louisiana I would imagine that the food at Flavors is just as good. It's always fresh and delicious and reasonably priced. The staff is very friendly as well. I have tried many items on the menu and everything is delish. They have a lot of seating as well so having a large party isn't a problem.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-08-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'ROJcbbrouHsaHlMW_8hN-A', 'review_id': 'ArQLzLbwo73uEBcecK75gw', 'text': "Excellent food and great freindly service. Very laid back with good music playing. Just come here and try it you won't be sorry.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-08-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'Rtep3VNYoTnU64w3n3iDgw', 'review_id': 'OZDGNN71IjCBN4KBloATXA', 'text': "Well, I've been back four more times as I like the owners, they are very nice and are really trying their best. As I said before, some of the food is very good but other dishes are still lacking (see review from 6/20). Unfortunately, they are so busy on weekends, the attention to details goes by the wayside. Rice is luke-warm and mushy, red beans and Rice Bowl with sausage is dry and sausage, although abundant is overcooked/dry. The side salad is wilted, shredded cheese is melted and stuck together and there are 2 very tiny slivers of a cherry tomato buried at the bottom. It really seems that the main dish chefs are very good while others in the kitchen are just going through the motions which is really too bad as it has the makings to be an excellent restaurant. I will continue to go and enjoy the dishes that they do best and hope that they continue to move in the right direction.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 3, 'date': '2014-08-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'voEyOJsqV3CW8qRQPBHoJw', 'review_id': 'Af1yvEPtLbTqSV5GsaUMPA', 'text': 'This place is amazing, I saw this restaurant on"Check Please, Arizona" and it lives up to it\'s standards. This is authentic Louisiana food and it taste so good it\'ll make you slap yo mamma! (figuratively) We all had the Shrimp etouffee  and it taste delish! Also, Had the red beans for a side and they were amazing! Yum, the service was great and so was the ambiance. Overall it was fantastic!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-08-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': 'ZALzZWz4dYHyTGuBS8tFrQ', 'review_id': 'A98RzlaSZTF6GItteW0xUw', 'text': u"Finally got to try this place after seeing it on Check Please AZ. We got the dunkin catfish, crab Landry and alligator combo. The fried catfish was a bit too salty for me but the crawfish \xe9touff\xe9e was pretty good. The alligator came in small pieces like popcorn chicken. Good flavor but wish they did bigger chunks like pappadeux. \nThe crab Landry was really good. Lots of real crab in it. Their potatoe salad was pretty good and I'm not one to like it usually. Tasted homemade with their own seasonings so flavor was good. Interestingly enough their side salad was good hearty greens and not that iceberg junk so I thought that was impressive that they spend the extra money for it. \nTheir sweet tea was really good. I don't like mine super sweet and I think they did a good job of that. Even better was that I asked for a to-go cup to pour the rest in and the waiter got me two new cups!  One with ice and one without ice to enjoy later.  Since it was the end of the day they were going to throw the rest away anyways but the fact that he thought to give me one w/o ice for later was ingenious! \nWhen I can't go to Louisiana, this is a great sub to satisfy those cravings.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2014-08-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'Ef2ye1S76ifCLvmA0QyERg', 'review_id': 'OzzC6I0sEbAIBaEnD2jvaA', 'text': u"Having family from NOLA, this restaurant was like we were visiting again. The food is spot on and fantastic, true Louisiana flavor in this little place. \nNormally we wouldn't go all out and order so much food, but we really wanted to put this place to the test.\nI started with an unsweetened tea and it was perfectly bold and my glass never went dry.\nWe tried the fried pickles as an appetizer  and they were wonderfully crispy and generous in size. They are not the little chips most places have, they are long slices, wonderfully paired with the Cajun ranch.\nEveryone in my family got something different; chicken strips that were huge and moist with a delicious breading, gumbo - the  small cup size which was perfect because the big bowl could have fed two or more of us! The crawfish \xe9touff\xe9e was truly authentic, generous in size and my mouth is watering all over again just thinking about it. I got the crab Landry, it was a huge portion, honestly like a whole loaf of French bread smothered in a glorious tasting, bountifully loaded with real crab stew and some jumbo sized fried shrimp on the side (it was two meals!) \nAnd lastly, but of course not least important, we saved a little room (by boxing up half our meals and taking it to go). We ordered the beignets and cheesecake smothered in praline sauce I share amongst all of us. Again it was amazing and truly authentic to the New Orleans flavor. It was like eating at the caf\xe9 Du Monde all over again. A little coffee to go with them and it would have been even better.\nWe love this place and will be back many times!!!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-08-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'Cigv45eDjDjYTDdzYPYRcQ', 'review_id': 'DApCBVljNzTGdfGTnanglw', 'text': 'This is getting to be one of our favorites!  Been here three or four times.  Each time has better better than the last. Great food - outstanding service.  One jambalaya and one clam Landry an order of fried tomatoes and one order of beignets (with honey). Spectacular!!  A forty-five minute drive but certainly worth the drive.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-08-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bzRR-h3wG7KPfx7B4amqfg', 'review_id': '7Ow9DHHHy5YSnYRFVlFjJg', 'text': 'AMAZING!!! The service was great and the food was even better!! Loved the family and very friendly environment! We will definitely be back for another PoBoy and desserts!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-08-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nUsPJtP6OLy3txM6oU_DDw', 'review_id': 'VxaLTHu-rg2gDuD5TF1niQ', 'text': 'Great friendly staff that know their food selection not too pricey me and the wife had the cajun cheese fries gator tail shrimp po boy all and all very good. Will be back', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2014-09-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fA98yGAru8atPRN2Lv5c1g', 'review_id': 'NYamPvauUbDfT16GsV0hpg', 'text': "The food was excellent as always but the service definitely has to improve, this was the second time in a row that it took long for refills and the appetizers came out at almost the same time as entrees. The food is so good that it's worth it though.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2014-09-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mi0f0-BRyOslrKm-sy90jQ', 'review_id': '0sfBKDUk-DnERldwo8JIqg', 'text': "Woo what a surprise! This place was awesome. Our waiter was a little goofy, but it was nice to have someone who didn't mind acting like himself. The food was delicious! I had the Blackened Hamburger, which was the perfect level of spiciness! The drinks were fantastic as well. Loved the atmosphere, will definitely be back!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-09-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'X_AVrEulqXkYIrvdaKkk0w', 'review_id': 'F47txNVY-kn1Cq8nlWdacA', 'text': 'Really good food, a nice ambiance and really attentive wait staff. Will be returning!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-09-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '3bOvhcmDfqSGFWZs1enygw', 'review_id': '53kg-lIwf7br1fTRRxRgPQ', 'text': "This place was amazing! I popped in for a bite while on business travel and I'm glad I did! The hostess was very kind, sweet and accommodating! For a weary business traveler, her attitude was a breath of fresh air!\n\nI wanted some gumbo and a po' boy and she recommended the perfect pairing, the chicken gumbo with a muffuletta.  Over hearing that another table also got beignets, I asked her to add that to the order, too. I've had all of these items in NOLA, but these were as good or better than I've had before.\n\nThe food was outstanding, but when I got to the hotel I realized I didn't have any cutlery... My fault probably but a reminder would have been nice.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-09-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xidFI0qJf9llyYpBDceSSw', 'review_id': 's8_2YJFguQrEkeJdJ-nzVw', 'text': 'Being a Texas gal with a truly Southern food palette, Flavors sends you reminiscing about walks up and down Bourbon Street! The food is undeniably tasty and true to its name. My favorites are the red beans and rice, fried pickles, and the catfish! And the peach cobbler and beignets are worth the extra calories! The customer service is outstanding and its makes me smile when they remember my face and that I want sweet tea! Love to promote small places who arent chains! Worth the drive from anywhere!!!!!!!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-09-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'sb6H6UEZheAU7wOqiNWVfw', 'review_id': 'P17LZP5TUm8TB7rf9ZtYCw', 'text': "The food is to die for,you can tell everything is made with love. I had the two meat entree which consisted of oysters & shrimp with red beans in rice.I don't want to start talking about how great the gumbo tasted.\nIf your ever in the west valley I would recommend you to stop in: to enjoy some home cook food and great customer service.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-10-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'ya1QEsrckH83-h996EzqCA', 'review_id': 'NAak3JRXmxMtF4DFpC5TbQ', 'text': "This is my spot! \n\nIf you're looking for one place that has good food, great prices, adventurous eating, and great staff, this is it. \n\nWhat can I say? The fried pickles, the muffuletta, the po'boy, the new cajun trio, the beignets, they are all pretty much outstanding. \n\nI love the way this place looks on the inside. It has this faux wood, gator lovers feel to it, and it makes me smile every single time I'm there. The staff is friendly, knowledgable about the food, and always willing to stop and talk. \n\nFollow them on Facebook for specials because the chicken stew is worth it's weight in gold! They also do crawdad specials and lots of great stuff for the kids! \n\nMy daughter loves the teas in the mason jars, you get a comfortable, well fed vibe with this place. \n\nI had one problem, one time, and they gave me a free lunch to make up for it (I never cashed it in, the food is worth it, and mistakes happen from time to time). \n\nCrawdad Pie? GET SOME! You've never had red beans & rice as good as this place either! \n\nTHIS IS THE PLACE YOU'RE LOOKING FOR!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2014-10-04', 'type': 'review'}
{'votes': {'funny': 7, 'useful': 11, 'cool': 11}, 'user_id': 'wuCszpVPMIMyOCualnZtaw', 'review_id': 'MVq7oihCWXHfJWv8wMfstg', 'text': 'Louisiana meets Arizona\n\nMy friends and I are always on the lookout for non-chain restaurants in the West Valley. After reading fellow "yelpers" reviews, we decided to give Flavors of Louisiana a shot and I am so glad we did. Flavors of Louisiana got it right. Fresh food, flavorful ingredients, large portions, modest prices, excellent cutomer service and  easy access parking out front.\n\nFlavors of Louisiana has a  laid back casual atmosphere.  As you walk in you see the front cashier where you order your food.  On the walls are some LSU teeshirts and logos , a bayou mural on another wall, and smiling and helpful staff. \n\nOn our first visit we shared, catfish Po-Boy, hush puppies, shrimp, fresh bread, and Boudin Balls. Everything was perfectly breaded and fresh. We also had sides of the Red Beans and Rice (highly recommend) as well as cole slaw which was also very good. Flavors of Louisiana offers great food for the money! (each sandwhich & side are about $10 for the 6").\n\nIf you ever in the area you should give flavors of Louisiana a try. You won\'t be disappointed.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2014-10-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'NAohdbmsThewbeUkMMBohg', 'review_id': 'N6Flte6Lsta_w5ZureOzlA', 'text': "I really wanted to like this place. I love cajun food. I was so excited that I got takeout for dinner that night and something for lunch the next day. My optomism was punished. The shrimp etoufee was overcooked shrimp with brown gravy. No spices, no kick, and not etoufee. I was plain. So the next day, I had gumbo for lunch. I couldn't even eat it and had to trash it. Someone had to have dropped the salt shaker in it and decided eh, it will be fine. I have never had anything so salty in my life. The flavor also wasn't there. The huge pieces of sausage were very chewy and rubbery. I was very dissapointed in both meals and probably won't be back.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 2, 'date': '2014-10-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'JiKXY5C30RL5l6E0XbpOnw', 'review_id': 'ZkcsHPC2v8Wob_KlGL8qFg', 'text': "It is the first time I ever left a new restaurant very happy and not too full, but perfect for my stomach. The atmosphere was great and the server there was phenomenal. The wait for the food was a little long, but trust me, it's so worth the wait. I had the crab Landry and my guy had the shrimp creole. First time eating here and first time had a different kind of food and man. I gotta say this place its small but the food it good. That's all I have to say. Give this place a try, if you want to try something new :)", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-10-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': 'UnR6CMa-1gg2ScRGfoZSdA', 'review_id': 'r_BFF8qHvRFWIzFtKNae_w', 'text': "This is my second visit to FOL and I have been dreaming of their fried shrimp since having the crab Landry the first time I was here. Can't wait to try the shrimp po boy.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-10-27', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'Lr6hbHj23X3q6m35mjMWOQ', 'review_id': 'ni8lcwZvlWHws4oggMTx-w', 'text': 'Readers of my review are going to have take it with a large pinch of salt ... just like the food here.  I readily admit to not having tried Cajun before so I\'m hardly in a position to make authoritative comments or recommendations, comparing this place to other such restaurants.\n\nThere are two important things to know:\n\n1.  Jambalaya, which was once only served on Mondays, is now served every night;\n2.  If you\'re not a fan of fried or smoked foods, this may not be the place for you.\n\nWe started out with the fais do do combo appetizer platter.  The onion rings, pickles and tomatoes were good, but all fried.  If you\'re not used to fried foods or don\'t like deep fried dishes, you may want to think twice, as they were deep fried with light batter and were VERY greasy (so much so, that when I picked up my unsweetened tea in the mason jar, it almost slipped out of my hand).  And although the pickles are full sours, combined with the fried batter, it was kind of salty.\n\nNow, to once again address the issue of salt, as I\'ve done in other reviews:  we NEVER use salt at home and have a much lower tolerance for salt than most people; so bear that in mind, when I tell you, that we found the jambalaya and gumbo to be pretty salty.  Did I bother to ask them not to add salt, if that were possible?  Of course not!  So, I don\'t know whether that would\'ve been possible; but at the very least, I can\'t complain about something I didn\'t bother asking about.\n\nPortions are large enough for the prices and the gumbo had a huge amount of meat in it; so don\'t think you\'re just getting a thick soup  (actually, more watery than thick, but no shortage of meat here!).\n\nDecorations are sparse, so don\'t come here for the atmosphere.  Service is fast and efficient.  Personally, I can do without the "Cajun" music in the background.  Sort of made me feel like I was having dinner on the set of Deliverance.\n\nIf you are a fan of Cajun food, I suspect you\'ll do very well here.  If you\'re going to experiment like we did, just remember:\n\n1.  Everything -- or practically everything -- is either fried or high in carbs;\n\n2.  Drinking out of the mason jars may be "cute", but not easy at times;\n\n3.  The salad that comes with dinner will leave you with the feeling, that, unless its fried, a vegetable is some fancy-shmancy foreign delicacy nowhere to be found in the Deep South;\n\n4. And if you\'re going to pick up an appetizer, DON\'T -- I repeat:  DON\'T -- touch any of your clothes, unless you intended to throw them away the next day  (if you insist, WD40 and baking soda will go a long way in removing those annoying grease stains).\n\nOverall, tasty, if not also salty; reasonably priced; different.; but not enough to make me go for a return visit.  Sorry, just not my taste.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 3, 'date': '2014-10-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KKVCWfFZT7OkvnewGebNmA', 'review_id': 'gkN01gM_JktuuHk497DQUQ', 'text': 'The Gumbo is to die for.  I have tried the sandwiches as well.  The Gumbo is my absolute favorite.   The staff is always friendly and even when the place is packed you still get great customer service', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2014-11-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BJugb9fNkRDNjlEs9Yp7kw', 'review_id': 'xyfGZFrWPz_kbtVplU-rIA', 'text': "I ordered the crawfish sandwich and a side of coleslaw. Sandwich was great, slightly dry. The coleslaw was not my favorite. I like coleslaw that is crunchy and theirs is pretty soggy and flavorless. I really didn't like the atmosphere; really cheesy and a little uncomfortable. Just not a place I think of going back to.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 3, 'date': '2014-11-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'kG8jkVFgOAOq6Ht6RvAjEQ', 'review_id': 'c5wNO-Pm2dywytFpxalAFA', 'text': "WOW what a FUN, interesting, tasty little gem in the Southwest Valley!  Our party of 4 gorged ourselves on fais do do (appetizer sample platter), shrimp etoufee, po boys and combination platters suited to fit even the most simple of palettes. I will tell you--as a healthy eater, this place does not offer many options for lower fat/lower calorie meals so use this as a 'cheat' spot. It'll be worth it. Loved the shrimp etoufee with dirty rice. It was perfectly done. \n\nThe place itself is a bit divey looking, but don't let the looks deceive you. It's super clean.  The food is really good. The service was friendly and competent. Drinks are served in mason jars which keeps things nice and COLD. \n\nDefinitely worth the drive from NorthWest Valley. :)", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-11-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'YYktZnGjs18fRKhIjnWx0w', 'review_id': 'TWoUtyKLU-yD7cUw7KYbBQ', 'text': 'Love this little hidden gem. The best thing my family ate was the shrimp po-boy sandwich, the hush puppies and the tea. Yum. We will be back.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2014-11-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'rrD0-pkWZvQGcXUUAFVyCw', 'review_id': '1hvgj6Gi9lfS8WqUbshhlQ', 'text': 'Very good food....a great place when you really miss NOLA food. Good service, fairly priced and clean.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-11-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'x5oJeWG_tKoM33OtGu4Bzw', 'review_id': 'XFqymB-nGmspmc-YQ8qqww', 'text': "This is our first time at this place and we were pleasantly surprised.  The customer service was excellent, which is a priority over anything for me.  The menu was a little overwhelming at first but the server was patient and helpful (Anna).   I ordered the crawfish etoufee,  absolutely delicious.  My husband had the Cajun trio, sinfully incredible.  We will definitely be back.  This place is better than driving to Papadeaux's on I17, waiting 45 minutes &  paying $$$.  \nPlease give this place a try, you will be more than satisfied.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-11-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HbKr6qM6id6XklxqQ9D4PA', 'review_id': 'qqkaIJRarsuz8pZJoGtUEQ', 'text': 'My husband has been craving Cajun food and happened to see a little review in the Arizona Republic.  All I can say is that I am happy we tried it out.  We ordered wayyyy too much but YUM!  We had fais do do (appetizers), boudin balls, dunkin catfish, crab landry and will be having the peach cobbler a little later.   \n\nThe people there were very friendly and customer service seems to be very important to them.\n\nWe will be back!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-11-15', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'ZQfpa181SafatpKx-ftNPw', 'review_id': 'n4QP6h7wWsucFlzmXpkDmQ', 'text': 'I only had the fried green tomatoes. The flavor was excellent but the tomatoes were sliced real thin so I mostly had breading.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 3, 'date': '2014-11-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'AlNdj8DigLSa4Meti8ybuA', 'review_id': 'xiZ98qJ1nbHbDFoK5EWnUg', 'text': 'My mom and I drove down from Wickenburg to run a few errands in "town".  It was lunchtime and we were hungry. Wanting to stray from the standard, I pulled up trusty Yelp! This restaurant is somewhat hidden, but in a nice strip mall. Having no idea what to expect, we went inside. The girl at the counter was super friendly and gave us great suggestions. We opted to order a few different things and share. We argued the whole meal about what was best part and not a bite was wasted. Delicious. We even opted to order dessert and an extra something to take back to the hubby. Double delicious. Clean, eclectic, and tasty, what else could you want? Looking forward to our next visit!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-11-19', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'Z1WXg9rmm06usYs-olyFaw', 'review_id': 'rkkm-0hKOFJQns3oEouQRQ', 'text': "As someone who grew up eating southern comfort food this place was pretty disappointing. The placed was packed and they appeared understaffed. Walking in the place made me feel like I ws on a future restaurant  impossible  episode.  If you come skip the red beans and rice and the gumbo... you would come out better practicing at home. The catfish and hush puppies were the safest things we ordered.  Overall  this place has a lot of room to grow , just because you have a niche in the desert doesn't mean you can get away with everything.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 3, 'date': '2014-11-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'dxfho1X694Gp_LDlZEH2jQ', 'review_id': 'i-pyQ6dGRkuEumOfTdjhXQ', 'text': "Simply stellar. We've been here twice and loved everything. The fried pickles are the best and the desserts are worth the trip alone. \n\nFriendly staff and homemade everything makes this place tops for our family.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-12-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bZlTG5cIExlIiqCL1IDvLw', 'review_id': '99Z6fwhT6kL8JadfrsLQqw', 'text': 'Food was delicious and at a decent price. We shared the lunch special with an appetizer and had leftovers!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-12-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lucCzbaNZOurMPtVYPMJ1w', 'review_id': 'Gm74UFLLXZA1lAdYn45vWQ', 'text': u'All the hype about this place is 100% understood now that my husband and I have tried for ourselves!!! Delicious food and all homemade!! So glad I found this little gem! Tried the blackened alligator which was neat! To eat, I had the catfish on rice with crawfish \xe9touff\xe9e which was amazing! Wiped my plate clean. I love that this place is family owned.. Our waitress gave us great hospitality and was very kind.. The sweet tea was so good too and we were able to refill and take to-go cups with us to enjoy! We will be back', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-12-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'AVDahKAn-Kiq076kXBvQng', 'review_id': 'JXL89Yn-Qb1fy9TBUt6Hjw', 'text': "The Po'boy was OK didn't come dressed like we're used to. But the crawfish etouffee  was very bland and let's not get started on the gumbo which was nothing but a weak brown water with a few pieces of meat. Being from the Gulf Coast if you don't know what its suppose to taste like than you might like this joint and then you're getting Flavors of LA but I urge you to visit NOLA and see what real creole/cajun country is all about.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 1, 'date': '2014-12-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'icyyn78ZjGU71Usdzu4icg', 'review_id': 'gxanF87xLCDxB7LNQcBY-g', 'text': "My wife is Cajun, so we're always on the hunt for places like this. The blackened catfish poboy is a must. The crawfish pies are wonderful as well. The beignets go without saying... do it! So good. The peach cobbler has a crust that is dangerous good. Try the fried green tomatoes with the mustard sauce too. Mix all of that up with a great staff that goes above and beyond to satisfy, and you really are missing out if you don't  give this place a try.\nAlso, like them on Facebook to find out when they are doing crawfish boils! So much better than any other crawfish we've had around here!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-12-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'C1v3GZEDBRzHJ-UK5cOd1g', 'review_id': 'v1j7DbGd_p-DuZHodgy18g', 'text': "Dunkin catfish and fried pickles - OMG!!! Better than the spots I've been to in Louisiana!!! This place gets 5 stars, service and food off the hook good!\n\nDessert - banana pudding and beignets!!!!! Just as good as cafe dumu!!!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-12-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0aPznUDkX2qyaLyvcrsbMQ', 'review_id': 'h0t8eJrVvsKJAiLcKpcfTQ', 'text': "Some of the best fried fish and oysters I've had in a while. A little pricy but good food.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2014-12-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'S_xhgB6GM0omQQ6PU2RkwA', 'review_id': 'UOINjKaFYIs4mPYGIhRI-A', 'text': "I come almost every Friday... I highly recommend the seafood gumbo - it is simply one of the best I have ever had. Also the fried green tomatoes are a great way to start things off. I usually get one of their Po'Boy sandwiches and the blackened alligator is hard to beat. Don't forget to try the sweet tea for a fully authentic down South experience. Can't go wrong here in my opinion.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2014-12-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 2}, 'user_id': 'W0_hMxyRBhT81qfoLxpg1A', 'review_id': 'mZmQqbRAYHlAViRpJgzuDw', 'text': "Just got back from lunch there and I have to say it was very good.  I agree about stop reading the reviews as I did and just go there!  \n\nWe ordered the fried green tomatoes and hushpuppies first.  They were nice and crispy but not greasy from being fried.  The hushpuppies were delicious and tasted even better with a little butter.\n\nNext my wife got the fried catfish combo with coleslaw.  Again the fried catfish was not greasy and crispy cornmeal batter.  The catfish was a little softer than what my wife would have liked but still tasted good.  The coleslaw was great as well, I had a taste of it and it was crunchy but not soggy from all the mayo.\n\nI forgot the name of what I had but it's one of the specials they used to have only on Wednesdays and it's like the Dunkin Catfish but the catfish is blacked and over a bead of dirty rice.  Then its covered in shrimp/crawfish etouffee, it was very tasty and I literally had every bite with either catfish/shrimp/crawfish with the rice!  They were not shy with the seafood.  \n\nOver the service was great and friendly.  We will definitely go back!  I've been to Pappadeaux and this is a great alternative especially on your wallet.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-01-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'FvBaISwoQ5BI7vYmMBJEJw', 'review_id': 'u2n0Bp9E-OIx2e4A4VQEkw', 'text': u"After reading all the reviews, I couldn't wait to try this place out. My fianc\xe9 is a huge fan of crawfish and all the pictures looked delicious. We were seated pretty quickly and ordered the dunkin catfish. My only disappointment with this place was the service that i received by my waitress. I don't know whose fault it was, but our food took over 45minutes and people who were seated after us were getting served before us. I understand that the kitchen could have messed up, but the waitress should have notified us / given us an update. For 45mins she didn't come by to our table at all. Anyways, a few minutes later the manager brought our food to the table and apologized, which was a good gesture. In the end, not sure if the experience ruined the taste in our mouths, but didn't really enjoy the meal as much. Maybe ill stop by one day and give it another try, but it won't be for awhile.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 3, 'date': '2015-01-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'P-HVItTJQhYZDYtWaSO3fA', 'review_id': 'kd45ptiSMM_DKxckmjCnww', 'text': 'Been here a few times with my family.  Food is  always delish.  Staff could be more attentive but nothing major.  Definitely would recommend', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2015-01-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'SYwT_XJT3kRyTRmLJiuFhw', 'review_id': 'jk5OJnEvX1HXT2R6DIc7jQ', 'text': 'Very good food and southern style sweet tea! Being from the South I was pleasantly surprised. I definitely recommend it!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-01-12', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 3}, 'user_id': '68oflLc7k0Ko2CxRTrugrA', 'review_id': '4c_KQrpMt3r67z2Ph8tNqA', 'text': "As good as it gets....in the Phoenix area! Granted, this is way out in Avondale but I assure you, it's worth the drive. The atmosphere is nice and comfy, and the servers/hosts make you feel welcome. They play a Cajun/Zydeco in the background which adds a cheery energy, and to which I also had to dance to! \n\nWe had a larger group and tried a variety of the dishes (Gumbo, fried pickles, gumbo, crawfish etouffee, po boys, jambalaya) with zero complaints and many happy bellies! I will definitely be going back, despite the long haul. The only complaint I heard was that there was no alcohol, so no beer with dinner.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-01-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'M-H1kOOQ4AnKCCS97cNdHQ', 'review_id': '4haVd_sGZF6izyD0m68IPg', 'text': 'Love this place! Great service and food. Although I get the same thing every time Basket of chicken with potato salad, the other foods I have tried have been wonderful. I would definitely recommend to my friends and family.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2015-01-15', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'qRGmGgunyyZWpR6HzHFoRQ', 'review_id': '2oBQRikGm-Qx3PMc_yks3Q', 'text': 'This is the real deal. I had the Catfish lunch special w/ red beans and rice. Yummmmy!  Wish it was closer to the house.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-01-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'AVdQgQdjglLsGSe4b_jJmg', 'review_id': 'gbL6_a1qdp83Is52vU_8rg', 'text': 'Going to keep it short because no need to elaborate when the meal you just ate was delicious.  Fried green tomatoes, oyster po boy and a crawfish mixed with alligator po boy, all was wonderful. Service was excellent and was told next time must leave room for dessert. I said I will', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-01-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'hxyv_TylvXyiWhLsA2UJyQ', 'review_id': 'TcMkNOmkirHl_N3YMRuVQA', 'text': 'We were in town from NY and looking for a gluten free restaurant for my wife. I love Cajun type food and gave it a try thanks to yelp reviews. You order from the counter when you get there. There is a decent menu with many options. Note there is no alcohol sold here. The food preparation and quality is outstanding. Prices are economical. Highly recommended!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-01-31', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 1}, 'user_id': 'VFVCx3Miezti52ZNuCeiEQ', 'review_id': 'mhUmGej-OupFPaU4Px8sTQ', 'text': 'I GOT SICK!!!\n\nI\'ve lived in Louisiana and love great Cajun cuisine, however "flavors of Louisiana" gave the worst tummy aches I ever had. The items I ordered was the crab landry, and hush puppies. Not sure if the base wasn\'t cooked enough, with the tiny pieces of shellfish, and the sauce, possible bacteria growth. I\'ve been sick for almost 2 days since, very painful. \n\nNot sure if I will be back.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 1, 'date': '2015-01-31', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'MI-uWv-pSrj448vzTrS4yA', 'review_id': 'vaSMaU7GtdVxOr0pgJHPEw', 'text': "Born & bred Cajun girl here.  This joint is a 30 minute drive for me, and it's worth it.  The music, the atmosphere, the staff--very much like going home. My partner swears by the chicken and andouille gumbo.  I'm a pescetarian, so I have to take her word for it.  The catfish poboy was fantastic, though I'd stay away from the seafood gumbo.  It was kind of muddy tasting the first time I went.  You can get things like fried alligator here, which is really fun.  And the beignets are excellent.  Overall, it's a great little place if you want to experience a little bit of Louisiana in the Valley.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2015-02-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zIOALMBazEfNlgAoRN7IZA', 'review_id': 'nwKgUsExopYspp7n-O1CyA', 'text': "The food here is excellent! Well worth the drive. The service was great too. Even though they were so busy our drinks never got empty. I'd come again. And I've had food in Louisiana several times and this is right on par.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-02-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fksrAfKZYrhCzOjUIoFudw', 'review_id': 'FwNBiQWawZ8sS5nCwf3dAA', 'text': "sooo goooodd!  my second time here and i'm glad.  servers were very friendly and attentive.  i studied the menu all day to figure out what i was going to order.  i picked the gumbo, dirty rice and fried oysters.  oh so good.  the oysters were my fav.  big and juicy.  the sweet tea was good too.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-02-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'Rd83fFF6LnftoR_k1noqVg', 'review_id': 'I7B1mwEkdwNz6Ns1umUYQQ', 'text': "Just ate there for the first time. Everything was outstanding. Had the fried pickles for the appetizer. The wife had the muffuletta with potato salad and I the catfish. Some of the best catfish I have ever had. Wasn't over cooked like I've gotten at most places. All the food was outstanding. Friendly staff. The service was very quick but this was at lunch on a Saturday. The waitress said we wouldn't get our food that quick on a Friday night because they are really busy.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-02-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'HJSpvuLj_DPdO-6eJ4fDpw', 'review_id': 'kXkVGYfWf5sMDgTledvIrA', 'text': 'I love this place....they have the best fried green tomatoes I have ever had. Their catfish is amazing.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-02-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'r00dx3XoywJlAahJKaXFVA', 'review_id': 'dontJgdAdk3hgH0iA3VJHg', 'text': "My friends took us here when we moved in, sort of an introduction to the area and wow this was the authentic stuff you want to eat, they live up to the name.\n\nCatfish, jambalaya, wonderful sauces and things you would expect the bayou to serve up fresh like they do here.\n\nI felt that funky mojo soul thang power-up inside me and you know it's good cookin when you get that goin' on. And the tea, have the tea. Oh yes.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-02-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '8yjybcx43CL6AI5Zd6p8Sw', 'review_id': 'xYq3o473Zu54cKcT9QvDVA', 'text': "The shrimp creole and seafood gumbo were delicious oh I can't forget the red beans n rice... Very affordable. Did I mention beignets...amazing. Highly recommend!!!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2015-02-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-bv34Z78B4MYmADsjtzkxw', 'review_id': 'YJ8_OQfOyd3dMN6U0EMtVg', 'text': 'This place is AMAZING! From the moment we walked we felt welcomed. Our appetizers came (fried pickels) they were great, as well as our course meal. Our waitress was very nice, not just with us but with my son as well. W will definitely come here again. :)', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-02-27', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'VH1WbmbrUvgvSWQr68QA6g', 'review_id': '7j1BqtcUtvx0Nu34lxVc6Q', 'text': "bomb dot com. Shrimp Po' boy cravings", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2015-03-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'S1Hj5Kszj4nv2dNsvuGa8A', 'review_id': '1Bbmt_n-CDp1nazM-PdDIA', 'text': 'Been here several times already.. This place is the bomb! Four of us came here today and polished our plates.. Yum!! The service was good.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2015-03-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'FW59autYmqwrPIWk_HJAhw', 'review_id': 'zeIjHzmcIzEU57GwKQ_Rlg', 'text': 'I have been a LONG time Yelp user; however, I am always hesitant to write a review.  Well, Flavors of Louisiana is one of those gems that you just have to tell EVERY one about!!  My hubby and I ordered a wide variety from the menu (fried green tomatoes, seafood gumbo, alligator po boy, joliet dinner) and everything was delicious.  The kids meals were reasonably priced and decent portions.  Our meals had very large portions and they tasted amazing!!\n\nEven though the food was superb, the wonderful service we received was what truly made the meal memorable.  Aaron was our server and was polite, accommodating, prompt and always had a smile on his face.  \n\nAll in all, we will definitely be back and will spread the word to anyone we can!!  AMAZING!!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-03-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Dh09y_notsVfFyZcnFaj_w', 'review_id': 'sKzCwvwdtIx_GYnGUVfZyw', 'text': 'Really good place for delicious Louisiana food. We always get the po boys whether it be shrimp or cat fish and the fried pickles are amazing too ! Everything you get here is pretty much delicious!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2015-03-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'j5IL5aFJoIZuk8fm4_chag', 'review_id': 'Xz8Gs5YEu3acfTKpSV38ug', 'text': 'Clean, family friendly with great service. Fried pickles were yummy!!! Seafood Gumbo has a little kick and was delicious. My husband loved his shrimp po boy and I loved the dunked catfish. We took home Beignets. Great again. Son got a large portion on kids menu. Oh yes, red beans and rice was very good as well. Nice to find tasty homemade food with good service.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-03-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'cC9Q2WQsko4RclNxYdBfKA', 'review_id': '-sSxoEAId1wFqbMSGC0IDA', 'text': 'We ate here this afternoon ...last time we were here was over a year ago!  It was SO good..again.  My husband and I both had the Shrimp Po\'Boys and I love the way the shrimp sort of "pops" when you bite into it.  I love the bread as well, it is soft but chewy and holds up well to all the fillings.   My father had the Cajun Trio which was Seafood Gumbo, Jambalaya and Crawfish Pie.  He loved everything but especially liked the Gumbo.  We all took bites of the Crawfish Pie and it was delicious....full of cheesy, crawdaddy goodness with a buttery, slightly sweet crust.  The JBLA was also very good and had nice smoky flavor.  We shared a platter of Fried Pickles, Fried Green Tomatos and Onion Rings...so good.  \n I am giving them 5 stars because for the 3rd time...we talked about how good everything was all the way home.  My only minor complaint last time was the saltiness and nothing seemed overly salty this time.  \nI was sorry to see that someone who had been a good customer had one bad meal and felt they had to write about that experience and refer folks somewhere else.  We think it\'s great and will be back.\nAlmost forgot:  we also had the Beignets and Sweet Tea.  The tea so WONDERFULLY sweet and you can taste the TEA!  The Beignets were warm and just terrific.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-03-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'ZnR8pEf1ULutAGUzA1p9HA', 'review_id': 'OFylHr0dk7oc6aSAt6Eavw', 'text': "This place is amazing. Good food, lots of good flavor. I don't eat sea food, so I had a chicken po' boy and loved it! Red beans & rice are also on point!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-03-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'keFnvFDYvXV2oPS7TifQCA', 'review_id': 'fAKzPyhyRyspEx8-_8mJdA', 'text': "I've been to this place a few times since discovering it. The wait staff is very friendly. The food is delicious and the sweet tea is awesome. I have had the fried Cat fish, the gumbo, and bites of other foods. I totally recommend it to anyone that likes a Louisiana type of food. :)", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-03-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 3}, 'user_id': 'V1y-B-8o_pAg_00umjg_2A', 'review_id': 'trbMtbOsrnfybWVSmQL1CA', 'text': "My wife and i came here for lunch. We had the Oyster Po Boy, Seafood Gumbo & Dunkin Catfish. I don't usually write reviews but the food was excellent and the staff were GENUINELY friendly! Its sad that quality is rare in customer service, but when encountered it should be acknowledged. The owners even served food and socilaized with customers. Ill definitely be back!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-03-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'hnkoQ7ObkXFWRV4asVZx5A', 'review_id': 'R_kWETmrfj0YlPkE-Ob5gQ', 'text': 'Amazing place. Great environment for all occasions. Friendly prompt staff were on point with their service and the food was delicious. I recommend the Cajun trio. Good stuff.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-03-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6TkmbkSP62RVz-Qacytbuw', 'review_id': 'ovhpqqh45skEoh7l-9Zprw', 'text': "O.....M.....G This place is AMAZING. We saw it on yelp and with all the incredible reviews we couldn't help but to try it, and I'm so glad we did!!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-03-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'j5IL5aFJoIZuk8fm4_chag', 'review_id': 'jTRMxm5xmii1YeIZVZxY_Q', 'text': 'Homey, warm service. And the food, "Off the hook!" according to my 7 year old. Kid portions are generous. Apps are fantastic. I feel like someone made me a homemade meal with love. A rarity now. Lunch menu goes until 4:00. It\'s a  really good family place.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-03-27', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'ussKl97BHYvVcUAQzaWVzw', 'review_id': '-X-01V1V3pnCRerWMzK1aw', 'text': u"Ordered some take out tonight. It was my first visit and was excited to try the food. I ordered shrimp po boy for my wife. I had the crawfish \xe9touff\xe9e and a small side order of seafood gumbo.\n\nThe food was decent. The seafood gumbo was very salty. Ive been to Louisiana several times and adore Cajun food. This gumbo wasn't right. I liked the \xe9touff\xe9e and my wife really enjoyed the po boy.\n\nThe restaurant was very busy and for a Saturday night. I think I'll give them another chance to be fair. I'll be hoping its better next time.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 3, 'date': '2015-03-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WyulRHNJIfat20lwt0a8ag', 'review_id': 'zG23pJzK5ReiH1heli8xAA', 'text': "This is the best Cajun food you will find this far west! The food is the real deal! They didn't change a thing to please people in this area, they kept it CAJUN!! I'm from Louisiana and I promise I will stop in on every trip to the west coast!!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-03-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'vW20sjO-hXONvDZIjmmbZQ', 'review_id': 'JaQ2YRsPkkQRWqwKZsYF2g', 'text': "FOL has got some of the best fried catfish I've ever had!  It tastes fresh and is always fried to perfection.  I keep wanting to try the shrimp, but I love the catfish so much I order it every time.  I've also tried their red beans and rice, dirty rice, and seafood gumbo.  All are very tasty and the gumbo has a nice dark roux.  Service is always friendly and the place is always clean.  They play non-stop zydeco music, which I must admit is a little mind numbing, but I can definitely deal with that as long as the food is this good.  Im really happy Goodyear/Avondale has a locally owned spot like this.  I love finding the non-chainy establishments with character and awesome food.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-03-31', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 2}, 'user_id': 'eEA6PtfeiwqqFOI2PaSl1w', 'review_id': 'UrSolcJTYKEFLiLEXVMcFA', 'text': "This was our second visit, the first was  about a year ago (?). I'd loved the crab Landry and sweet tea and trying to come back for it again.  \nFinally made it in today, ordered the crab Landry, fried pickles,  onion rings , fresh salad and jambalaya.\nThe crab Landry was good as I'd remembered , tho needed a bit of salt and hot sauce . The fried pickles dipped in Cajun ranch were a treat. \n\nWe give 4 stars instead of 5 cuz the jambalaya was dry. Our waitress came to check on us and when we hesitated she asked if it was dry and offered to bring a cup of their gumbo sauce. That did help somewhat.  Their sweet tea was perfect and she kept us refilled with a new full cup to take home .  Hoping to make it out again soon to introduce some relatives to FOL.  Looking forward to it", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2015-04-02', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'rNSdYi7zAuyCoqiZ-HhNkw', 'review_id': 'v5jHG5ELfh9JuyXvGbQSzA', 'text': "Eating here for a third time now.  Great food and service.  The seafood is all fresh ( You can get Tilapia, Shrimp or Catfish blackened or fried).  We've tried Po Boys, Catfish, Crab Landry and Gumbo and nothing here we didn't like.  The fried pickles, fried green tomatoes and hush puppies are all too die for.  None of the fried foods are greasy, but light and crisp.  Ambience is casual and service is very attentive. Prices aren't cheap, but good value for your dollar with dinner entrees about $14 on average. Lunch menu available till 4PM daily. If you like home cooked food, this is the place.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-04-03', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'rvTPyu2TQCfwsRkip2JIBg', 'review_id': 'XPxNUlXq8pOlsrBoYKpclg', 'text': "I had high hopes but was ultimately disappointed. Let me begin with the pros:\nFried pickles\nCajun ranch dressing\nAlligator Poboy\nFriendly service\nCons:\nCrawfish pie tasted like an oil soaked sponge\nMeat in the jambalaya was very dry and could use more flavor\nSeafood gumbo was more broth than anything else however good flavor\nFried crawfish was tough\n\nIt's over 30 minutes away too so I do not see us going a second time.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 3, 'date': '2015-04-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '4LVyamiX41CT-v3H1p-AlA', 'review_id': 'f5Sk4Kq_mb6rQc4RhWzJQA', 'text': 'Amazing!! Good time! Great food! Fried green tomatoes amazing!  Jambalaya is a must try!  I can only give 5 stars but worth 10', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-04-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UnxzNDPXWez_x9YyOwLUCQ', 'review_id': '3yfy4KHJOd0OUlOhWrCf8Q', 'text': 'Very good service, and the food was very tasty. The catfish and shrimp was excellent. Dine on!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2015-04-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '6tJTDKXJKOwvbJ-zH5EazQ', 'review_id': 'XE_09_--AxxrsDpshkhk1Q', 'text': u'Delicious food. Good portions and decent price. We ordered a half order of fried pickles, a half order of hush puppies (6), the Dunkin Catfish and the shrimp creole. We are leaving stuffed. \nNotes: the fried pickles are amazing and a must get. \nThe Cajun ranch dressing served with the pickles and with your salad (if you choose), is addicting. \nThe shrimp creole was a touch spicy for me. But the crawfish \xe9touff\xe9e served with the Dunkin catfish could have used some spice. \nThe service was amazing and attentive. \nI love this place and will come back for more.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-04-10', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': 'HLCxdv1O9MvyIUTXWaBopw', 'review_id': '7LvihK22j9qGSb52pWkwWA', 'text': 'Good food, everyone who works here is extremely nice. Support the troops. I suggest Duncan catfish, which is a lunch special everyday now! The peach cobble crust is infused with vanilla and love. But if by some chance they have the crawfish corn bisque... U will believe God created the earth and heaven to put this in your mouth. Not five stars for price and they do not spice it up as you would think they would (probably because of the local population)', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2015-04-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8QBgJrAVSrZiRj5A0LeoMw', 'review_id': 'dNGWjttLjdhDKNkmjUy9jA', 'text': "My mom and I decided to try a new place to eat for dinner tonight and we were not disappointed!! It was seriously all amazing and our waitress Jenna was the best!! We had their hush puppies, gumbo, shrimp po boy, and topped it off with their homemade cheesecake and banana pudding!! Sooooo good!! Can't wait to go back :)", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-04-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TxMORnlGhWPsPq-b2ZBF_Q', 'review_id': '0tqBOr1N8UTepIFSoIFGrA', 'text': 'Husband & I decided to try this out after going to the "Flavors of the West" Goodyear event. The seafood gumbo was watery but the flavor was okay, the jambalaya was a sticky dry mess on your plate and it came with a side salad that you can tell it was a grocery store bagged salad not fresh at all! At the end we were hoping for at least something to take the bad taste in your mouth and we ordered dessert, big mistake! The "Banana pudding" was boxed pudding.... the beignets were dense and had more powder sugar on them that if you exhaled while you took a bite it would go flying everywhere. I wouldn\'t recommend this food and you really don\'t even want to get me started on the ambiance... Seriously! Try it at your own risk!!!!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 1, 'date': '2015-04-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ERRTkzMmrjXfCXnMIyAKSA', 'review_id': 'bBpg39hQrxDOwCZwEHmT4Q', 'text': u"3.5 out of 5.\n\nI'm actually really surprised about the 4 out of 5 rating it has on yelp.\n\nI got the blackened catfish with shrimp/crawfish \xe9touff\xe9e sauce on top and dirty rice, which comes with a side salad and garlic bread. $15.95. The \xe9touff\xe9e sauce was okay, not too much seasoning, could be a little more seasoned. I feel like it wasn't salty enough. The catfish was ehhh, a little on the rubbery side. The side salad was blah. They use ice burg lettuce with some chopped tomatoes and some sprinkled cheese. I'm not a fan of ice burg lettuce (it's the most inexpensive, and has no nutritional value). I think I'd be happier if they used spring mix or romaine lettuce. The cajun ranch dressing was really good, though. Garlic bread was ehhh... wish it was more toasty and not somewhat chewy.\n\nMy husband got the trio: jambalaya, crawfish pie, and gumbo. Around $10-$11. The jambalaya was moist and decent. Crawfish pie was REALLY good. We both enjoyed that a lot. The gumbo was decent, but not the best. It was really broth-y and did not have a lot of stuff in it. Flavor was decent. My friend from Louisiana makes much better gumbo soup than here.\n\nI would give the crawfish pie a 4.5 out of 5. The gumbo would be a 3 out of 5. Everything else would be no more than a 3 out of 5.\n\nThe reason I give this place a 2.5 out of 5 is because of the atmosphere and setting. It feels a little dirty and it doesn't feel or look like a restaurant. The music they were playing was loud, obnoxious, in spanish? and didn't feel like it was a great match for cajun food. If they improved in these atmosphere flaws, I would probably give a 3.0 out of 5. \n\nService was good (family-owned).\n\nWould I go here again? Only for the crawfish pie, but that's all. You can find similar, but much BETTER food for similar prices at Pappadeaux.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 3, 'date': '2015-04-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'DZgvS_MluH6VDe7PbOx08Q', 'review_id': 'SQGlmARpT5IvySwrMWkDgQ', 'text': 'This place is just amazing!  We have been back many times now and have never had a bad experience.  Delicious food, friendly staff, fun atmosphere.  Great place to eat!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-04-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'XAKrYs8BCSMPrguHqq2nZw', 'review_id': 'W7stv8uzoBftFn-TaZwtKw', 'text': "I wish they had cayenne pepper with the black pepper on the tables cause they make their food for Yankees & I need more heat. But it's good authentic food, just too Mellow. I don't like adding hot sauce cause it makes to too much vinegar taste. \n\nI got jumbilia it has lots of meat in it. Love the tea. Fries are boughten crinkle cut, but palatable. You can actually get whole crawdads on certain days. It's great for a change every so often.. & its close to sprouts.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2015-05-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '33bHkdHNJKmZ90NJQZzmTA', 'review_id': 'U0UuxYF5Wt9xGg3aG7yzVQ', 'text': 'Rebecca brightened my day as soon as I walked in the door.  Finally found a really good Cajun restaurant in the valley .  Started with the standards - Gumbo followed by coffee (Community Coffee) and beignets!  Powdered sugar on my phone screen as I type this.  Coffee was served with the beignets as they are made fresh to order- no reheats here!  Completely stuffed but already looking forward to my next visit.  Thanks!!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-05-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 3}, 'user_id': '6Hfp0xb2QS1UReeRvVFLbA', 'review_id': '1EGZcbMkDaWywOGCnx5GoQ', 'text': u"It has been over 40 years since I lived in Louisiana and my fondest memories of the area was the food. Taste of Louisiana has brought back those memories for me. The Red Beans and Rice are excellent and are great as a entr\xe9e or a side dish. The Jambalaya was delicious...again those wonderful tastes from Louisiana.  I've eaten the oyster poor boy several times and they almost defy description. The breading on the oyster is crunchy and flavorful but does not overwhelm the taste of the oysters. The bread that is served is crunchy and perfect with everything. I love tomatoes and I always thought the flavor of tomatoes shouldn't be sullied with anything, so I was a little skeptical of fried green tomatoes.  I have discovered a whole new world of flavors with these fried green tomatoes. The crunch that the breading supplies to the tomatoes is subtle so the tomato flavor also comes through.\n\nAnyway I look forward to returning here a lot and enjoying their fine cooking.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-05-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'y6vUBdpvIdFB4jxtgFFFSQ', 'review_id': 'uMFNLnYzDNPIdnXP5uHaLw', 'text': 'Yum. A nice change from the standard restaurants in the area. I don\'t like seafood and they have plenty of choices that are not "fishy". Good portions, large dining room, quick service.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-05-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HqifipaGrkDMB-5dbRr7ig', 'review_id': '24-KUaLUPdVuAFcpTYLzPQ', 'text': "You can tell that this place make their food by order so don't expect the for the food to come in 5-10 min, especially during a busy time.  \nThe foods is well worth it as long as you have a buddy to catch up with. I ordered the Joliet Rouge and wow I would come back for it", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2015-05-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 4, 'cool': 3}, 'user_id': 'kAnLW4-62pnRfGuh_taW1Q', 'review_id': 'LdhgRwMqaENC2Zj1Ab3fFg', 'text': "So...I went to the Flavors of the West food festival this year and got a discount card for various places to eat at. Flavors of Louisiana was one of these places. A friend of mine had spoken highly about it recently...I happened to be in the area and figured I'd try it. \n\nThey open at 11a and I arrived 10 minutes early and figured I'd try and see if they would serve me and they were happy to place my order. Had a few questions about the menu and again...they were happy to explain what a few items were. \n\nI ended up ordering the Cajon Trio...a bowl of Jambalaya, bowl of Gumbo and a Crawfish Pie. I had a choice between the seafood gumbo or the chicken and sausage gumbo. I asked she recommended and she said the seafood gumbo was a little fishy. I went with the chicken and sausage. Have to say the chicken in the gumbo was a little dry but the flavors were on point! The Jambalaya was BOMB!! The most surprising item on the menu was the crawfish pie. Really delicious flavor and the crust was perfect!! Not to mention it was filling. I'm ways tempted to order more food than less and I'm glad I didn't order a second pie. The side order of catfish could hands down be ones do the best I've had in the valley. \n\nThe only reason this review is 4 stars instead of 5 is the chicken. I'll be back this weekend and I'll have dessert this time around.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2015-06-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 2}, 'user_id': 'uLl--7BS9Cj6qOY2IqoyiA', 'review_id': '4I7xzt17kTUmqNsDjsWe_g', 'text': u"Flavors of Louisiana\n13025 W Rancho Santa Fe Blvd\nAvondale, AZ 85392\n\nFour of us went for dinner at this venue. We were really looking forward to enjoying some real Cajun/creole food. In many ways we were not disappointed, and in a few ways we were.\n\nWe decided to try an assortment of items to get a real picture of the food here. We started out with some fried pickles and fried green tomatoes. Nice and tart with a good breading we were hopeful that it was the start of some great food to come. While some of us ordered soft drinks, two of our party ordered sweet tea. It was true to its name, being a real brewed southern style sweet (emphasis on the sweet) tea.\n\nNext on the try list was Gumbo. They have a seafood gumbo and a chicken and sausage gumbo, both of which we ordered. The seafood gumbo was pronounced excellent by all, but the chicken and sausage gumbo seemed overcooked and the chicken a bit dried out.\n\nNext were main dishes. The shrimp etouffee was wonderful. Flavor was right on and lots of shrimp in it. \n\nThe shrimp creole followed the same ideal, with great flavor and good spice in a rich tomato base. Next was a po-boy, the quintessential sandwich of Louisiana. Once again, flavor and fillings were spot on. \n\nFinally, came the Jambalaya, and our big disappointment for the night. Totally dry, with rice that was definitely from the bottom of the pot. We called over our wait person who apologized and said they were running out and had given us the last of the pot. I realize that they wanted to please us by not saying they were out of a particular dish, but in this case I'd have been much happier if they had thrown it out and not tried to serve it. \n\nThough we were getting full, we opted to try the desserts. The peach cobbler was a total winner. Warm with great flavor, it was true comfort food. The cheesecake was just ordinary, and our wait person informed us that it was brought in from an outside vendor.\n\nFinally came the Beignets. I felt that with some chicory coffee I'd be eating in Caf\xe9 du Monde. They were ethereal, and properly covered in huge amount of powdered sugar which promptly got all over everything as it should.\n\nOverall, this was a nice eating experience. Given the one blooper of serving the bottom of the pot, the rest of the meal was spot on in flavors and textures. \n\nThe restrooms and the restaurant were nicely clean and service as excellent.\n\n4 stars for flavor, quality of food, service, and cleanliness", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2015-06-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CUTy_wx60lP-rW1PLdwcQQ', 'review_id': 'zTI12t1Ka5bKRXTCB8-H0Q', 'text': 'Good Cajun food. Nothing stood out as great or bad, but it is nice to see a Cajun restaurant so far from NOLA that can make good food.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2015-06-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'WH0wY-VVfbmEvoxi6R-6Xw', 'review_id': 'lTCdABJAeeoKEXxScUXf4g', 'text': 'So I am giving them 4 stars on taste alone. I live in Dallas and have been to a dozen or so cajun places over the years. My complaint is no matter where I go they are overpriced. \n\nThis place is priced perfectly for the quality and portions. I had Jouliet Rougue it was very good. It also came with a side salad which was mixed greens not just iceburg. \n\nTheir ice tea is good which is not always easy to find. Came in on a Tuesday and service was good. Not to slow and not rushed. I would come back for sure. \n\nI also ordered the beignets. OMG good', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2015-06-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GP4EFm7MhX8u8e8annmJfQ', 'review_id': 'QjY-34FClRS08gc34fsPaA', 'text': "First time here, I have heard about this place for years and it didn't dissapoint. I will definitely be making this a regular stop of mine . affordable and great service!!!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2015-06-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UEecpbG7KjuBaTttkY4Wtw', 'review_id': 'H2ThVgPENDoDmmYxiySC8g', 'text': "One of the best restaurants on the west side. Truly a hidden gem. Delicious Creole! Fried green tomatoes were my favorite. Oyster po boy was on point! Cant remember the gentleman's name but our server was great as well! We will be back!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2015-06-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TvF4hX4oxExgEFS9jUXWBQ', 'review_id': 'Ft_MV35JeuOQGBvC6JhuyQ', 'text': "Love their food, they have the best Cajun food I've ever eaten. I don't get over there enough, these folks know their food.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-06-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 4, 'cool': 2}, 'user_id': 'Q0VuxHxMtoBgKr_hozBBNw', 'review_id': 'jl3bpl_AuMLcfVC3aYxvBA', 'text': "I never considered coming here until I saw the restaurant featured on an episode of Check Please Arizona. I had a bunch of family in town, very picky eaters, and the menu online made this look like a good option. It was! We were all really impressed.\n\nThe atmosphere is very homey. It's basic, and the tables have a lot of space so that even with the open floor plan, we didn't feel squished. Service was top notch, too.\n\nWe had the hush puppies as an appetizer. Like whoa. This are awesome, definitely up there with the ones I've had at the Fish House in Conway, Arkansas. Flavors of Louisiana servers them up with little sealed pats of butter, which I hadn't seen before, but worked out really well.\n\nI ordered the blackened shrimp salad. They use mixed greens (yay!) with a full variety of flavors and textures. The shrimp is packed with flavor. I had the balsamic vinaigrette and that worked out really well. My mom had the salad with blackened chicken and loved hers, too. She had to take half of her chicken home.\n\nMy brother tried the shrimp etouffee. He'd never had it before but enjoyed everything from the sauce to the garlic bread served alongside.\n\nMy dad went traditional and had the three catfish strips with potato salad. I tried a bit of his catfish--awesome! Perfect crispiness with a nice, light batter. He had a sweet tea.\n\nMy son, who has autism and only eats chips in restaurants, had their Cajun chips. He loved them. The chips are very thick, crisp, and fresh, and the flavor has a mild kick. We brought about half home and they kept well into the next day.\n\nMy folks are already saying they must eat at Flavors of Louisiana when they visit next, and I'm looking forward to becoming more of a regular there with my husband.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-06-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PKsfe9_Oyuozjc34g1W6RQ', 'review_id': 'Mt8-2HfzSLh9JqrrgKo8gA', 'text': "Takes forever to get your food but we ordered the gumbo and it was amazing! Atmosphere isn't elegant but it isn't awful. Small and quaint. It was clean when we went there. Customer service was superb! I have since learned that I can make some amazing gumbo so I am not sure we have a need to go back, but maybe we will go to check out some new foods one day.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2015-06-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'le_wyvYtVRP3iToNc8hmfQ', 'review_id': 'L8PJ9BmfxFodO3kSFkBesA', 'text': 'The food is Really good!!! One of my favorite restaurants. I took my mom and sister here as treat and they absolutely loved it.  The food is really good blackened and their sweet tea is straight from the south. I would recommend this places. The only down fall is it is pretty pricey.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2015-06-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'n3Jk5bX72a9_dWGekwqmPA', 'review_id': '5dpfoawQY0iUgtyvHRNkqA', 'text': "We discovered them last month using an Entertainment book coupon. The food was so good we had their trio combo of crawfish pie, jambalia, and seafood gumbo and the crab Landry, served over garlic bread,  we would order over rice next time. Both were very good however. Today we had the shrimp po-boy and lunch sized jambalaya . Beignets covered in powdered sugar with real honey. So glad this restaurant's here.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-07-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7JgOZ-0EFtmUEQc0K4V-rA', 'review_id': 'igAwZJOw-30msoS2ev5NBg', 'text': "I LOVE the food. And we had good service .. *except* I hate it when they don't take your plates when you're done. Our waitress came and went from our table 3-4 times and ignored the plates every time. I usually tip 20-25% but this time .. somewhere between 10-20% was all i could muster.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-07-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'vc3IjGgD1d992k2jYcsCQQ', 'review_id': '8ga1I0sLJKQGPWCWtr0orQ', 'text': 'Yup. Yes. YUM.\n\nOrdered to go and the food was great. I had the fried catfish and gator. The only thing I griped about was the forgotten side of tartar sauce. :(  Wah! But regardless it was delicious. Good portions, too. \n\nWe had an order of 5 adults and everyone liked their food. My husband had the gumbo and it was pretty good. When in Avondale, I will have it again.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-07-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'VFfDD0z2BxN-jM1C8Ka0BA', 'review_id': 'YvcGtnuP1u_7JVa6gv9_pw', 'text': "First, I am biased. A co-workers wife owns the place.\n\nBUT. Wholly crap I ate to much. We finally went after a year in Goodyear and my wife and I both had poboys. We will be back and I will stop here.  Hopefully my opinion won't change over time, but I think this place is now officially on the GOODyear list.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-07-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jAhVDQzc_H0aDQIVS7obhA', 'review_id': 'WSF0aTQUbZ_aELnaDfko4w', 'text': 'Best food in the valley. As a native of Louisiana from Baton Rouge and New Orleans, this is the real stuff. None of the garbage people pass off as "Authentic Cajun" around here. Food in Louisiana isn\'t blackened to a crisp and doused in hot sauce and pepper like people think. It has flavor and is sloppy with sauces. Nothing here is bad, and I\'ve had everything on the menu. Service is always good, again a wild difference from the usual AZ experience, and if you leave here and you\'re not stuffed, you did something wrong. If I had to change anything, they use pickle spears for the fried pickles unlike the typical coin sliced pickles I\'m used to in New Orleans. I think that\'s just a Lafayette versus New Orleans thing, and personal preference though. Quit reading and go eat!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-07-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'k1kbxGFR1cuVnc44pEyoxQ', 'review_id': 'OE6wx5oSyPT4dSuP-xrMoA', 'text': 'What a place. The food is incredible. I had the Jouliet rouge and seafood gumbo. The gumbo as great flavor, and full of crab, shrimp, crawfish. The Jouliet Rouge; Blackened catfish, on top of dirty rice, covered in shrimp and crawfish sauce.  Wow, this makes me yearn for my Louisiana trip to come sooner, however I will be back. On top of everything the prices are great, as well.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-07-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'iXGC38DrP7C243O-MHNYBw', 'review_id': 'p2jr2d4FRatVkkmu2Vbehw', 'text': 'Ok, I think I finally found a taste of home without having to prepare it myself!!  The onion rings were extraordinary!  Well, everything was excellent!  Go Tigers and Saints!!!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2015-07-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9sBe-C11IbaBgcXla3ZjZg', 'review_id': 'xGr4_ZS9az-q_OkZumO4Qg', 'text': 'The hush puppies, fried green tomatoes and alligator poboy was amazing.  I will be returning.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-07-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'yAeo2D5NdtGuGG2o1M1aGQ', 'review_id': 'MHyqzU6jfs7hpy356XPMDw', 'text': 'Excellent Cajun food! We were very excited to try this place out since my hubby is from Louisiana and we love Cajun food. We ordered so much food since and it was all so delicious. We got some hushpuppies and a cup of seafood gumbo to start and thought they were both cooked perfectly. I wished I ordered a large bowl of that gumbo.....it was that good! Then we had the red beans and rice and a catfish dish and we were both very pleased. Their sweet tea is refreshing too! We will definitely return for  great meal.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-07-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IzmZOOGJYetkast8cEyxCw', 'review_id': 'WEEHlHe1kiZ8eM8PrhUpPg', 'text': 'wow it was good!  we hadn\'t been here in a long time so it qualified for our try-somewhere-new nite.  party of 4 arrived 7pm Sat nite and it was busy (always a good sign - if a place is  not busy at that time on Sat nite, we\'re leary) but we got a table promptly.  great service!  ordered the trio appetizer of hush puppies (my fav), fried green tomatoes and fried pickles.  learned from our server that they hand bread everything there and the hush puppies are homemade too.  but the sauces are what impressed us - be sure to try the Cajun ranch in which the cayenne comes through gently.  then we had the large 12" shrimp po boy for the 2 of us to split - it was super!  tons of great crispy shrimp in a lovely roll with sauce and veggies.  we were stuffed but we wanted to try the beignets (famous fried donuts) so we asked for them to go.  Our waitress (Anna:  we liked her) suggested that they\'re much better fresh so we "forced" ourselves to eat 2 orders of 3 ea of them - and they disappeared in a flash!! so yummy.  totalled $70/4 but that was 3 courses. there\'s much more on the menu we want to try so we\'ll be back - much closer than going to New Orleans!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-07-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'gIEBnBWyRlspOJhYm2vLjw', 'review_id': 'sARzRJJ2zKUcUce0BiJjzQ', 'text': 'Attentive service. And my Louisiana friends won\'t understand this, but food prepared even a little better than you\'d find in the Louisiana heartland. Probably because this restaurant isn\'t constantly pummeled by tourists who just want "something Louisiana."  -- I think Flavors of Louisiana faces high expectations from an audience that knows what good Cajun food is all about.  And from I see, these boys and girls know how to deliver.  \n\nIf you were a Louisiana local, you\'d expect some special attention -- and the Flavors of Louisiana crew delivers.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-07-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': 'QhoDUAjEFohDRWkUkgsnrQ', 'review_id': 'V4QX9yX6sO2Ya4rg2DhS1g', 'text': "The hubby and I ate here for the 1st time.  We will definitely come back for more gumbo and po'boys! Amazing food and kind staff. We will be back for more!  Yummy!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-07-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WL6lsRw6COuvE2h2az13xg', 'review_id': 'HtQzskqQKtMZMg1sRExvNg', 'text': "Delicious fresh cooked Cajun eats. I love the shrimp dishes the best and the po' boys. Great sides and awesome desserts!\n\nFriendly staff, great service, clean dining area.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-07-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'AxQP1j-xkTSzG8Tyb0qElw', 'review_id': 'SqrbWREFJDxq3PeEL_gk2g', 'text': "We absolutely love Flavors!!  Anytime our family visits from Minnesota, we have to go to Flavors of Louisiana for dinner!  Shrimp Po' Boy is a fave along with the dirty rice and fried pickles, which are hand battered!  Their remoulade is second to none and your missing out if you skip the peach cobbler.  What makes it even better is the friendly staff--always attentive and ready to help.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-07-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5IzCvwVEb3SrVBFxa8wjYQ', 'review_id': 'ugrVul0H5eyzLGhc_2f0oQ', 'text': "This is my first visit to Flavors of Louisiana and it was great! I don't write reviews ever...but if your looking for a great Po'boy, this is the only spot in the Phoenix area. \n\nThe decor is a bit of like an office setting with decorations to highlight the streets of old Louisiana. But who cares?! The food is great!\n\nThe beignets were okay, but then again I wouldn't trust me since I have never been to New Orleans to try the real beignets.\n\nYou have everything to loose if you don't try these awesome Po'boys they make. Arizona is really scarce with places that serve really good tasting dishes, and FOL really restores my lifeless tastebuds. #DOIT", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-07-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'Wx3dUeJmnSUJEfXtpzkM2Q', 'review_id': 'OkMwpQNES8ABJhPtn8hZ6g', 'text': 'SOOOO good!!!! Couple of us grabbed dinner there last Saturday and I was blown away, its hard to find real CAJUN and CREOLE and this place was legit\nHad so many things from fired green tomatoes best I have had since Memphis Tennessee, Gumbo was amazing and it was my first time trying boudin balls and now I am hooked!. And the fried alligator well we ordered a pound to go, its that good!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-07-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'ClIGYx-w8Ll9REacfUMUzA', 'review_id': '90hm_OrofTnujSouKbonBw', 'text': "Continuing on with our United States cross country food tour, we stopped in to this restaurant, even though it was an unlikely location - in a strip mall next to Walmart. We were getting hungry and decided to look at yelp and stop at the nearest four star attraction, this is the first one that came up. \n\nWe had the fried green tomatoes and fried dill pickles, along with a sweet tea, cherry coke, the chicken and sausage gumbo 8 oz size over rice, shrimp creole over rice, a garden salad w/ Cajun dressing, the red beans n rice, banana pudding and prepackaged chocolate peanut brittle. Basically just ok - no superstars here, except the hostess/cashier staff who was very welcoming & accommodating, making sure we were comfortable w/ where we were to sit. Nothing exceptional about this food. Best part was fried green tomatoes, red beans n rice & banana pudding for me. Hubby really liked the fried dill pickles & after adding Louisiana Hot Sauce to his shrimp creole, enjoyed that as well. However, my husband is a serial plate scraper & there were at least 4 tablespoons of chow on his plate, so you be the judge!!!\n\nI've certainly waited longer for food, but it's just not that busy in here & let's be honest, they are just plating food, not making it fresh. Unfortunately, I'm pretty sure it was the waitress, who was really nice but not super attentive. Had to be flagged down for the bill. \n\nPrices weren't awful, but a lower price point would be appropriate for the quality of food we were served - see photo of receipt attached.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 3, 'date': '2015-07-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lbRuy4fwiL4Ltu7S63Dc9w', 'review_id': '3C7LlY8uMfqAD9Kvu1zTiw', 'text': 'Small place tucked next to a Walmart. The food was good and as authentic as you can get in AZ. Worth going back for sure.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2015-08-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'W-JHF6adr0bNKDs0OXIzGg', 'review_id': 'QkyklIu8YhPlQpJsbNVdpg', 'text': 'Flavors of Louisiana was quite a pleasant surprise. The food is very authentic, which is a huge plus! The hush puppies were delicious and the service was average. Overall, I give it 3 stars because the service could have been a little better, but the food was the best around if you want some authentic Louisiana flavors. Going back to try their Gator soon.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 3, 'date': '2015-08-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hmXwrR3ute6dbawYgchlUg', 'review_id': 'VZNa07JSltr11ySBc8b3Zg', 'text': 'Very good food and a lot of it. The staff is very friendly. Get there early on the weekend looks like folks come from all over the valley.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-08-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'DZgvS_MluH6VDe7PbOx08Q', 'review_id': 'zpgnlrDBPOrBrNz39cNIhQ', 'text': "We have been here a number of times now and every time it is amazing!  So much so that we hosted our Rehearsal Dinner here a little over a month ago and it couldn't have been better.  We had over 20 people which is a lot for this little place, but they had a table set for us when we got there and didn't miss a beat with their other diners while also accommodating us.  As always, the food was amazing and all of our guests agreed.  The biggest stand out of this place though is the staff.  They are so friendly and helpful, they even made a sign welcoming us and our party with congratulations.  We will be back for many meals to come, we love this place!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-08-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'UPpt3Ag25pBtuZcdnMvBkA', 'review_id': 'GOwGLeCtYJIZXfesKgxuSA', 'text': 'Today was my first visit to Flavors of Louisiana, but it certainly won\'t be my last. \n\nWhen I walked in, I was a bit confused because there was no one behind the counter at that moment and I missed the big and very obvious sign that said to order at the counter. So I waited a couple minutes until a young man appeared at the counter and asked if I\'d been helped. I said no, and said "one for lunch please." He kinda stared at me for a moment, then he realized I didn\'t understand the process. He explained they don\'t have servers until after 4 p.m.\n\nMy bad! Only including it here so you don\'t have the same thing happen!\n\nI ordered the drunken catfish - two nice sized strips of breaded, fried catfish on top of etouffee. It comes with crawfish, but I asked for shrimp instead and they substituted, no extra charge. It was all on a bed of white rice, and served with two pieces of garlic toast.\n\nI also had a mason jar of very good sweet tea.\n\nThey bring the food to your table when it\'s ready. The wait was long enough to convince me they cooked everything fresh (the taste proved that also) but no longer than that, which was nice.\n\nThe decor is okay. I felt the chairs in the dining room were uncomfortable, but everything was in good shape and everything I saw was clean.\n\nThe food was outstanding! The catfish was as good as any I\'ve had anywhere. Fried food that\'s not greasy is hard to do, and it\'s a rarity, but they obviously have it all figured out. The catfish was flavorful and flaky, and the breading was just right. The shrimp was very flavorful - you know how sometimes you order shrimp in a meal, and there\'s just not much of a flavor to it? Well, I don\'t know if that\'s because it\'s not fresh, or it\'s how it\'s handled, or it\'s where they get it from, but I do know the shrimp here was delicious and it\'s the kind of shrimp that makes me keep ordering shrimp!\n\nThe etouffee was also delicious, and the bread was a nice touch. I had considered ordering hush puppies, but glad I didn\'t because it would have been a little too much food, and I\'m a big eater.\n\nI wasn\'t sure how to go about getting a drink refill (refills are free, according to the menu). Shortly after my food came out, the girl behind the counter came into the dining area with two pitchers of tea (I assume one sweet, one unsweet) and refilled the glasses of 3 guys at another table, saw mine was still half full and did not stop at my table. I had hoped she\'d come back, but she didn\'t so I guess I was supposed to take my glass to the counter and ask for a refill. That\'s about the only thing I didn\'t enjoy about this experience.\n\nOrdering and paying at the counter in advance has its advantages - when you\'re done eating, you don\'t have to wait for a check, you can just get up and leave. \n\nAll in all, I truly enjoyed my lunch today and I\'ve already told my co-workers in the office that we should plan a group trip there soon. The person who does our food orders looked them up and is already interested in having them cater our next event.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-08-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kMQMy-JNQc0oIJIctACDOA', 'review_id': 'tHJh6ieaCmasV_6JD3vY1w', 'text': 'I lived in Louisiana for four years and this place rivals anything there. The food is fresh and the staff the best. The Juliet Rouge is a personal favorite!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-08-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KS77HJHcEq1XN7IwoJV-Wg', 'review_id': 'lPqZUs_cTtNs6NDptRD3Tw', 'text': "Great place to eat, the staff are wonderful and all the food is amazing. I normally get crawfish poboy and it's the best ever.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-08-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'rvnO3lq6CPJB4xxf0hkkbg', 'review_id': 'CJsCxHGlcDco6detkWtqOA', 'text': 'Pricey. We went for lunch. Had chicken strips and wife had shrimp basket (3 Shrimp), hush puppies and sodas. Our bill was $32. Food was good.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 3, 'date': '2015-08-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'gS49yXoLLugtuB9P8Phqbg', 'review_id': 'NAwLl9iG_MEWvw9oSUlaSQ', 'text': 'I LOVED this place. Staff was extremely nice. The shrimp and catfish are the best. Nice and airy and crispy and not too oily. I also love the Crab Landry. Red beans is also a winner. I could name everything on the menu!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-08-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2cf7Waq5YZWXCkoNUGKxMQ', 'review_id': 'BHjK_D8YxPD0oDGulQPBfQ', 'text': 'The service is excellent. They kept our drinks full; Donnie LOVED the sweet tea. Our waitress was energetic, helpful, and had a smile for us every time she came to the table. \n\nWe both loved the fried green tomatoes and remoulade, and our dinners were great. The salads were actual greens, not just iceberg lettuce. Donnie had the trio (the seafood pie was amazing), and I had the Crab Landry. We stopped eating half way through our meals to save room for beignets. Good plan!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-08-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Kr_dmU5gQeV5AqdDaIe4Wg', 'review_id': 'zjkUgC2BeMl24bssElnpdA', 'text': 'Food and Service is always wonderful!!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-08-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'HKByw2CQL1YHrzyrvv75UQ', 'review_id': 'JJ3rQISeHTfv07hGSGYm6g', 'text': u'So my wife and I finally got the opportunity to stop in and have dinner here. Needless to say, we were not dissappointed. she and I are from the south and we know how hard it is to find good southern flavors here in the west valley. We knew as soon as we tried the sweet tea that we were in for a treat.\n\nYou see, sweet tea is simple but you got to do it right. Every place we go to here that "try\'s" sweet tea don\'t get it right. This place does. Anyhow, she had the jambalaya, gumbo and this crab pie thing. I had \xe9touff\xe9e on cat fish with dirty rice. It was awesome!\n\nThe only thing that I personally didn\'t care for was the fried green tomatoes. With that said, being from the south, I\'m used to having mine fried in a pan and not a deep fryer. I will say they were okay though. \n\nAnyhow, 5 stars from this southern boy and his southern girl! Oh and the service was excellent!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-08-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MOYiViqnS68KCmHTUafBXw', 'review_id': '5Q6acXjaBxqXYzqVpQkCZQ', 'text': 'The service and food were equally amazing. The sweet tea is what you would call southern sweet tea, meaning so sweet it will hurt your teeth :). It was our first time there but the server was excellent in suggesting dishes and well as giving us a background of the food and restaurant.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-08-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vI0iWoZ91TIVzKzTUCSiZA', 'review_id': 'C46IjugLIpNCcI6B3LtMHg', 'text': "My husband's family grew up in Louisiana so they know Cajun food. We've been here several times and have never been disappointed. I try something different every time and love it all. Beneighs for dessert are definitely the highlight of every meal.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-08-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'IzmZOOGJYetkast8cEyxCw', 'review_id': '2hn2P4Pf7R5Z0CYuLxvzfQ', 'text': "went again last nite - had to order the hush puppies...sooo good!  but watch out they're filling. the po boys are standard favs among us but we've tried the creole and etouffee and landry - all good.  nice waitresses too.  also remember they are closed on Sundays and don't serve drinks.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-08-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '6qSpD-2u595Eh7IsEOaoRw', 'review_id': 'pwZWj3uB6a3rnE4NnslRNw', 'text': "A lot of the food is mostly fried.  \nYou can do blackened. Gumbo was good, but salty. \nShrimp creole was ok...but sugary.\nAlligator po boy was average. Mostly bread.\nWe didn't do dessert\nNo alcoholic beverages. \n5/10", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 2, 'date': '2015-08-31', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': 'dhiCl6dZpyD5QDprTtdcJQ', 'review_id': 'd_SKwl64NMl0u395IaRQMw', 'text': 'The food is absolutely delicious and authentic. The place has a fun ambience as well. I would definitely go again!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-09-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ja44aQfqIMBJPk7UdVR4wg', 'review_id': 'dBHbQqRwh7SKvEkQ0gf4FA', 'text': 'Why five stars? I debated but even though this is a very casual restaurant and table service is available only on weekends, this is a place you have to try if you like cajun & creole cooking. I lived in the southern Louisiana Bayou country, and this is the real deal! We come often. They can cook many dishes gluten-free. The menu is mostly seafood and the catfish is hands-down the best around. All of the dishes are authentic home-style Louisiana fare.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-09-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'iAhI_--DHEYFxYRbX-6rBg', 'review_id': '3DxXUrffzKFZB2NgEc3ktA', 'text': u'First off, let me say that if it were possible to put a zero star review, I would. \n\nMy buddies and I came out for a few days to play some golf, have some beers and enjoy the views. This place fit absolutely none of those categories. After using Yelp to find places to eat when I was out here last year for Spring Training, I downloaded the app again immediately upon plane touchdown. After doing some searching around, I came across a restaurant that was at least one star above others in the area, and with over 10 times the average amount of reviews of the competitors to boot! It was a no-brained! Put this granny rental car into high gear and point it east to Dieshart Road, straight to Flavors of Louisiana! Little did I know that I had just sentenced my colon to two days of hard labor! \n\nJudging by the reviews, I expected a standalone restaurant with ample seating, French inspired creole Jazz music pumping through the speakers and alligator tail coming out the wazoo...instead we were treated to the faint antiseptic smell that is unique to nursing homes and buildings that were a cheap nail parlor in a former life. The seating was top notch as well, and by that I mean it must have been made with the pleather from old, discarded school bus seats. It was obviously a Cajun restaurant though, it HAD to have been, I mean there was a New Orleans Saints and LSU flag on the wall, what else could it have been! \n\nOur waitress then arrived and in a voice as smooth as denim asked us what we would like to drink. In unison all of us answered with the only response we were capable of...BEER. We were APPALLED to learn that a restaurant that pays homage to a culture that can brew an alcoholic beverage from any substance known to man was DRY. THAT\'S RIGHT, I SAID THEY DO NOT HAVE ALCOHOL.  \n\nI began to slowly sob and my friend James was absolutely inconsolable. After we pulled ourselves together and were able to form coherent thoughts, we placed our food and drink order collaboratively in an effort to exit this establishment in the quickest manner possible.\n\nA couple of us ordered the \xe9touff\xe9e, because after all, how could you screw up a creole staple such as this? That would be like overcooking cereal. Well folks, I\'ll tell you how you can screw up a classic Cajun dish. YOU CAN SERVE IT WITH HUMAN HAIR BATTERED SHRIMP, with a free side of follicle at no extra charge. When you read this you may think, "hair in the food, it happens from time to time." This was no typical experience though my friend, this particular follicle flaunting shrimp hair was METHODICALLY WRAPPED AROUND THIS CRUSTACEAN, like some kind of sick, keratin preserved mummy. After bringing it to the attention of the waitress, she exited to find a manager, and upon returning asked if he would like ANOTHER MEAL. I mean come on. No thank you. \n\nIn summary, this place, if nothing else may have been accurately named. After all, I\'m sure Flavors of Louisiana could also include fish caught in Lake Ponchartrain and moss harvested from the Atchafalaya Swamp. \n\nWould not recommend.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 1, 'date': '2015-09-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XsVMkd5br6MhCk6meUly1Q', 'review_id': 'JKnt2t8oxofPE1_zr-ldJQ', 'text': 'Really yummy authentic creole food.Everything was fresh and tasty.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2015-09-05', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 5, 'cool': 2}, 'user_id': 'HzE3a0DZycfToavWhHm-Pw', 'review_id': 'BPaypEODXPW6pxjcheLkCg', 'text': "Phenomenal! The flavors of Louisiana fits their name. I've never been to Louisiana, but I can imagine what it's like by eating this food. Louisiana's got soul and flavor! \n\nFirst timer here and got our food To Go, so far I'm impressed with the whole experience. My to go order was placed conveniently and easily, the food was ready within 15 minutes and on my table and devoured in no time flat. I ordered the hush puppies along with the fried tomatoes. Those did not disappoint, recommend those puppies any day. Crispy on the outside soft on the inside. I also recommend putting malt vinegar after you take that first bite...can you say...Mmmmm?? It just soaks up all the yummy goodness and pairs nicely.  Also we order the chicken Po boy along with a Catfish entree. Both were satisfying and Comforting. \n\nI recommend trying this place out. Since I didn't visit the inside of the establishment, I'm not sure what condiments they have for the public. I do recommend Crystal Louisiana Hot Sauce to go with this type of food, it's the Original Louisiana hot sauce and tastes far better than their competitors.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-09-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'yVt-78pcrD5KD78TOvb5gA', 'review_id': 'E5NE8SJ8Cv20LLqauPfMxg', 'text': 'I have to say this place has really upgraded since the last time I ate here! .The food had a good change to it  better flavor and portion size. I had the combination plate with fried tilapia, fried boudin balls with rice and beans. It was quite delicious and enough to bring home and shard with my hubby (who also gave a thumbs up and he IS from NOLA) Kudos!!!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-09-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ZAwNUFMDbyMlEEG-wx8w0Q', 'review_id': 'j5LR8bNdu9g2b5y5_MdnrA', 'text': 'good, authentic, southern food. Was impressed all around. AMAZING DESSERT\n\ngo here.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-09-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dBtW59_lea94x9ff2VvZlw', 'review_id': 'lmhkStMMiQk7Yi_sQfwsyw', 'text': "Best authentic Louisiana food, especially here in Arizona. Never pass by this place without stopping. It's that good. My personal favorite is the shrimp po boy with extra sauce. Woo Wee", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-09-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'yyM4ATKXscwlHoZK1aCJ5Q', 'review_id': 'fP8k98DRtfLDvnDL5WQOIw', 'text': "Someone wrote a review pretty much saying that people love this restaurant only because they have never been to Louisiana and don't know what good food is, and pretty much writing a nagative review. First off, the food here is EXCELLENT! Full of flavor, and made to order coming out hot and fresh. So even if you haven't been to Louisiana, it really shouldn't matter if your looking for GREAT tasting food. My husband and I come here at least once a week and have never been dissapointed. I recommend the Fais do do which is 3 of their appetizers in one, which we get the hush puppies, fried green tomatoes and fried pickles which ARE THE BEST! You also won't be dissapointed in their po'boys. The fried catfish and crawfish po'boys are my fave! I suggest a side of the juice from the gumbo to use as a dipping sauce for your sandwich. The dirty rice is amazing, the red beans and rice is amazing, the gumbo is amazing, I just can't express how great tasting this place is. The sweet tea is perfect, not too sweet, just right. Like I said, you don't have to be a Louisiana native to enjoy your visit here. From what I have heard, the owners are from Louisiana and try to be as authentic as it comes. Give them a try. If you love you love it. If you dont, you don't. I give it 4 stars only because I wish they would stay open later! Btw- Jenna is my fave waitress! (They are all nice and welcoming though :))", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2015-09-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6tfkU-GYb8kIMVlyjBoVcQ', 'review_id': 'dqXV8Vr1LzvY2Z2bLpuR3g', 'text': "It was okay. I was surprised by how expensive it was. For three people for lunch, with a military discount, it was over $40. I have the alligator po-boy with seafood gumbo and a glass of sweet tea. The sandwich was pretty good, but the gumbo was really watery and mostly salty. My guests weren't particularly impressed. I wanted to like this place, but it didn't live up to my expectations.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 3, 'date': '2015-09-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 1}, 'user_id': 'f9BNbRLTGF6ogkCRE2oAbw', 'review_id': 'NvWKnEKJBKfF4U6NnZl-ag', 'text': 'Best Cajun food in the WV.  Excellent selection of some Louisiana favorites.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-09-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': '8-8tc1JQ-dnHNVxAogY0sg', 'review_id': 'dbpAjv4jThN27UDERZwadw', 'text': 'This place is like a little gold gem, we have been here a few times now and every time we go the service is amazing and the food is beyond yummy. I would definitely recommend this place for anyone who wants great Louisiana cooking. Definitely well worth returning and the price we paid.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-09-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-l1S0DUbkMRR5VPUyeVBpA', 'review_id': 'dwt5QaWAnlQkOPolw5Oktg', 'text': u'I am NOT familiar w/ what might be considered "real" Cajun food.  I had the Cajun Trio meal of jambalaya; sausage & chicken gumbo; and crawfish pie.  The pie could have had less pastry and more meat and fillings.  The jambalaya was primarily a combination of rice and chicken, missing what I was expecting to be a significant amount of red sauce of some kind.  I combined the jambalaya and the gumbo to create a satisfying m\xe9lange more closely resembling what I expected jambalaya to be.  The meal was flavorful, not overpowering, and the portions were more than sufficient.  The service was prompt and friendly.  The atmosphere is lacking, unfortunately consistent w/ the strip-mall location (I had hoped for more of a "Pappadeaux\'s"-type feel), but the canned Cajun music (CD I assume) was appropriate and enjoyable.  Overall, not QUITE deserving of 4 stars, but significantly better than 3 stars.  If I ever return to the area, I would eat here again.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2015-09-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'x168iHOVGc-Pvkqx5lfIOg', 'review_id': 'h2RJoZczy5-F4RcvmUz3xA', 'text': 'This place is sooooo underrated... the food is wonderful. The service is great. Came here by myself. The atmosphere is homey. Like you are at your cousins house for dinner. The location is a little obscure. The prices were very reasonable. You get ALOT of food for the price you pay. Definitely recommend it.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-09-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Z_cycioyms4ePI5h_FuRxg', 'review_id': '0UUeTbZmvEcmzuJtjexX9Q', 'text': 'Great great \nService easterly good. Fried green tomatoes where excellent and have a nice tang. The shrimp poor boy had lots of shrimp and a nice sauce.  My wife had the dunkin catfish which was really good.  Everything coming out of the kitchen look good.  Was busy and even had to wait about 10 minutes for a table.   Lots of takeout we noticed.  This is a hidden gem if you really like Louisiana food give it a try.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-09-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'Xkyhy9jCwIavbyk4rshXug', 'review_id': 'sL5Os_Zas4wF9OkTW4GOeQ', 'text': "This is one of my favorite places in the valley. This place has such delicious food..I often order the Oyster Po'boy...it NEVER fails to please. But if you are fortunate enough to be there for the crab stew special, snatch it up before they run out! It is so amazing...rich and delicious. My mom would be happy to come and eat just the fried green tomatoes. They are as good as my gramma's! (never tell her I said that) \n\nThen there is the staff....the place is family owned and operated and it shows. In all the best ways...they are happy and polite and they let me try some things before I ordered the first time...I tested the fried pickles, the green tomatoes , and even the crab stew! I then bought them all lol so it's a smart thing they let me try them and get hooked. \n\nCome and feel at home and eat an amazing southern meal like no other. I can't wait to go back! The only thing that keeps me from going is my empty wallet....but they are worth every cent.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-10-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'blOQ5A5T03JQq2RPWCY4xA', 'review_id': 'uPjCTRGBw1ghvWVr2Bbdtg', 'text': 'This place is amazing! They have a great southern sweet tea. Highly reccomnend to my friends.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2015-10-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'EyhmqBBePU5W6rFXINbgCA', 'review_id': '5Whzdk3MyW6m0zeKS2j_Fw', 'text': 'Food really good flavor excellent atmosphere is ok service is a little slower than I like server is very friendly would come back because my shrimp was excellent there peach cobbler is the best', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2015-10-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lK9G4XPSl4uLq_dKxf0GUA', 'review_id': '2XkojsvrGE20WzhROT5OwA', 'text': "So delicious!! Make sure you pre-game in the parking lot because there is no alcohol served but it's worth it! We had gumbo, alligator po boy and a crawfish po boy all of which were worth coming back for!! We would come back again on another visit.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-10-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_LhbPMtDR65rdUaFt49zbw', 'review_id': 'Jep-vYdKCeShM5hML-1lDA', 'text': "This food was absolutely AMAZING!! LITERALLY everything we ordered was SO GOOD!! if you don't get NOTHING else.... Get the Peach Cobbler and as for a corner piece!!! But only get ONE scoop of ice cream.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-10-10', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 's5iJ1BlvSibzs1MPv7RhPg', 'review_id': 'zIoMQk2sG49Utk6V0asX2w', 'text': "This was our first time there, even though we've driven by it 100 times. Should have tried Flavors of Louisiana after the 1st time passing by, but it was well worth the wait! Friendly staff! Clean! Amazing Food!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-10-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DoWoU8jfwCh9DyjEECTyGg', 'review_id': 'Fq0EHJaZylyNmPRigyZvQA', 'text': 'My husband and I chose this restaurant based on the existing positive reviews (4.5 stars with over 300 reviews), but we were sadly disappointed. \n\nThe decorations are quite tacky and the whole place lacks ambiance. \n\nWe broke tradition and both ordered the Dunkin Catfish. The mixed greens side salad with Cajun ranch was the best part of the meal. I will admit that the catfish had great crunch, but the breading was a tad too salty and tasted like a mix. The dish was served with garlic bread, which was just ok. How is garlic bread Cajun anyways?\n\nI will say that the staff were friendly and super helpful! For their sake I hate to say the meal fell short of my expectations, but it just did.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 2, 'date': '2015-10-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'Mv6N0T5OdsPZYx92jNemiQ', 'review_id': 'vIweu1l_VN3wkPVAQzpxHA', 'text': "I took my friend who was raised on Louisiana cooking, his father is from Baton Rouge and he didn't want to leave. He ordered the alligator po'boy and it was great.  The bread is light and filing while the tartar sauce was a wonderful compliment to the breaded gator.  So we could sample the menu we shared each other's plates.  I ordered the Dunkin catfish with crayfish etouffe.  It was spectacular, the etouffe was almost buttery it was so smooth, the catfish was breaded like a pillowcase, firm yet comfortable on the fish. Can't speak highly enough about this great place.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-10-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'BncUtrl2bphVTu12y5fTlQ', 'review_id': 'uIgfIRguXCk94h3sXF-TpQ', 'text': u"I don't normally throw out five stars based on one visit, but it was a heck of a visit. Very friendly greeting and equally friendly service (like, literally equal: it was the same girl), and the food .... my GOD the food. We got the catfish smothered in crawfish \xe9touff\xe9 -- incredible -- and a monster combo platter of normal chicken strips and fried tilapia strips. Chicken strips don't NEED to be incredible, but these were. Hand-breaded there in the restaurant, and spicier than your average frozen ones. Really flavorful. The same can be said about the onion rings. \n\nI'm not sure how, but I managed to reserve a corner of my stomach for some banana pudding.  I don't know when it was that I last had fresh, homemade banana pudding, but I'd forgotten how good it can be.\n\nThis place is the kind of authentic I look for in a restaurant. The owner grew up in southern New Orleans, and, according to our server, knows the difference between city Cajun and out-in-the-swamps Cajun. (Not that it matters, since I'd never know the difference.)\n\nNext time I'm trying the alligator.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-10-15', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'DZgvS_MluH6VDe7PbOx08Q', 'review_id': 'EGbvx0nliZ6_lO0ez38fTQ', 'text': "As always, AMAZING!  We love this place so much!  The Cajun fries are so good, and they never disappoint.  My husband had the alligator po' boy and loved it!  Everyone should give this place a shot, this is one of our favorite places!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-10-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rB1uHrrN4ehjT9WyIoNalg', 'review_id': '8TCeY5Fh1u46EExx9vQCeg', 'text': 'Amazing! This is one of the best places to eat ANYWHERE!!!\n\nThe staff is always friendly and the food is AWESOME! I always get blackened alligator, dirty rice, fried green tomatoes and Cajun fries, and the sweet tea is refreshing! This is a meal I dream about.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-10-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'A8Otn9AxypkoEVQnC7k0Bw', 'review_id': 'eiDxumxSG2E0Koc0jkQ4JQ', 'text': 'Oh my goodness!  A little taste of Louisiana here in the west side of the valley.    I had the Joliet Rouge and it was super Yummy!!!  My daughter had the Crab Landry and it was fabulous too. But the Bread Pudding was my FAVE!!!  It has a little hint of Apple and     YUMMY!   We will be returning', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2015-10-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'zX4ZuGIvZAXtMH087gombw', 'review_id': 'm7PGwxwr80ZdeVSyDuTjfA', 'text': "The only negative thing I can comment on for FOL is...they are closed on Sundays. Sad face, but I totally understand that. The boudin is excellent and the sausage Po' Boys are my fave! First class service!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-11-01', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'NYkmKylMI5J8dHk8I4CW8g', 'review_id': 'hPKgU88OJEzsXZRSEAINiw', 'text': "This place is more than good!  Great flavorful Louisiana cuisine.  Everything cooked to order and I can not say enough about the lightening fast service.  Last but not least our server Jenna was top notch.  She was friendly and very knowledgable.  I see this as one of my favorite new restaurants and can't wait to introduce my family and friends.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2015-11-04', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 2}, 'user_id': '9Dks5wGHKa8fHXQaZ9Xh5Q', 'review_id': 'cbqCZClHxbcTWB_8PXimUg', 'text': "Quiet and out of the way, I think you've really got to be looking for it to find it.  Once you do it's worth it.  I could have done without the pastry on my crawfish pie, but otherwise everything was excellent, including the prices.\n\nStanding out, though, was the jambalaya.  I have never had it like this.  Made with smoked brisket, with wondrous smokey flavor permiating the whole dish.  It certainly was a welcome surprise and a table favorite.\n\nI'll go back.  You should visit too.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2015-11-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vLFzS1aylFGgqABh-TbOJg', 'review_id': 'LaqErg3vsrpHNIMLNrLvGQ', 'text': "The search is over.  Finally real Cajun food outside of Louisiana.  Need more stars.  Had the Jumbalaya...Seafood Gumbo... Crawfish Pie and of course Hush Puppies.  Some of the best anywhere.  Flavors of Louisiana is one of my new favorite restaurants anywhere. Got to come back and eat my way through this menu.  Can't wait to come back.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-11-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6QcgQ3M-lj_Dti2WcyYHhA', 'review_id': 'o-Cg136LcgHEYT5-uJQb0w', 'text': 'Ok I have eaten here a few times. Never had anything I didn\'t like. I like Cajun food, so, I like this food. As for some of the bad reviews saying this isn\'t real Cajun, or drive to the Bible Belt, to get "real" Cajun food?! Seriously!! That\'s why they are so good and popular here! You don\'t have to drive a couple thousand miles to get good Cajun food.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-11-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BDwIiZ6yY-jUI5CBxapuLw', 'review_id': 'gOkJRWqYI5xA8pHs_TQM0A', 'text': "Really, really good. We are staying at Wigwam and saw the reviews. Worth every bite! Don't miss the hushpuppies (ask for garlic butter) and the Dunkin Catfish. We shared one entree and it was plenty. De-lish!", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-11-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'wbV5mCjQ5w-O95TcV2JwdA', 'review_id': '7uUmexHQUossBdlAIHTDug', 'text': 'Fun and flavorful! Definitely a must try in the Goodyear/Avondale area. I mean a soithern girl cant say no to some good sweet tea. Recommend the gumbo and fried pickles!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-11-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9duqfZ_OMMaeDVVeX2CIlQ', 'review_id': 'alKULWeRVQ1Ru9uUaXCjig', 'text': "Phenomenal dining experience !!! I have only been here 3 or 4 times but each time I dine here I wonder why we don't come here more often. Clearly my husband has been taking our son here more often than I was aware of because our son was an expert on each menu item! The fried green tomatoes and boudin balls were excellent and served with 3 sauces; the roumalade one being the tastiest. I had the catfish po boy with Cajun chips ( skip those, just a boring chip) and red beans and rice. There are pieces of andouille sausage in the red beans and rice making it extra flavorful.  We had iced tea in a mason jar and beignet balls for desert. Truly like being in New Orleans", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-11-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '6Kaejy_XcgJGm8jyZhXSkg', 'review_id': 'lfqTsI0B_cF2tloYI29ixg', 'text': "I finally got to try this place!  We stopped in for dinner tonight and it was great! We started with a mixed appetizer of fried green tomatoes, onion rings and fried pickles.  A hefty dose of fried goodness with the appropriate sauces to match!  It was really hard to choose main courses as everything sounded good but in the end we chose the Dunkin' Catfish and Red Beans and Rice.  Both were delicious and their servings are very decent priced.  You get a lot of food, plus a salad and bread.  Can't wait to come back and see what else they have to offer.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2015-11-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 2}, 'user_id': 'WrP60_4xzolbZ4J0jteLJA', 'review_id': '0I9bZSXBnelBrBbvCxEPDA', 'text': 'After seeing Flavors of Louisiana on Check Please Arizona, I had to try it! It was well worth the drive to Avondale from my Central Phoenix home. \n\nWe started out with a combination appetizer. They give you the option of ordering three different appetizers in the combo because it is nearly impossible to decide on just one. We opted for the hush puppies, fried green tomatoes and fried pickles. All three were fantastic but the hush puppies were probably my favorite with the fried pickles a close second. You can choose from the many different dipping sauces they offer or have them all! We had the remoulade and Cajun ranch. The Cajun ranch was delicious!\n\nMoving on to the main course.  We all had po boys. Several authentic entrees are offered at Flavors of Louisiana, but I am a po boy connoisseur. You can get your po boy about ten different ways there. I had the fried shrimp, my friends had fried tilapia and another had the muffuletta. I have not had a po boy this good since I was in New Orleans earlier this year!  Made in the traditional way with lettuce, tomatoes and mayonnaise on fantastic French bread. Served with a choice of sides such as potato salad, red beans and rice, cole slaw, fries, dirty rice, etc. or for $1.00 more you can get a cup of gumbo or jambalaya. I opted for the sausage gumbo (you can also choose seafood). Fantastic!!\n\nFor dessert we decided to try the beignets. They are nowhere near the ones you will find in Louisiana and have a different texture, but their version is still very good. We finished them off!\n\nDrink selection is simple, sodas and iced tea, sweet or regular. Best sweet tea I have ever had and all you can drink!\n\nOutstanding service!! Everyone who was working last night was very friendly. Our server Carlee was a gem. Outgoing, engaging and you can tell she really enjoys working there. The chef even came out to talk with us and to make sure we were enjoying everything. \n\nAll in all they do a fantastic job brining the "Flavors of Louisiana" to Arizona! I can\'t wait to go back!  Open Monday-Saturday for lunch and dinner. They are closed on Sunday. \n\nEnjoy!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-11-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'VAmX_4hMEidGwKHvkiOTjw', 'review_id': '9CsJZ5tJOIpQXy2VhTRoSg', 'text': "I really like the food but it is way over salted!  The apps, fish, rice, broth...everything has too much salt. We only eat there once in awhile so we don't have to go on blood pressure meds, lol. But seriously,  it's good. Service can be slow if they are busy.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 3, 'date': '2015-11-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'vBvTK-Fqfhl_DACCNaNOWA', 'review_id': 'QFywBq95MaB6eKxgpI5c3A', 'text': 'Food is very good and I love the Shrimp Po-boy and red beans and rice. \n\nThe restaurant is extremely clean and while in there tonight there was a young gal cleaning like I\'ve never seen in a restaurant. She was wiping off the chairs and getting in every crack on the legs. Never seen anyone clean that thoroughly in a restaurant.\n\nThe only negative and reason for four stars is the 12" shrimp po-boy sandwich is kind of spendy at $17 before tax.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2015-12-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 's429mqae0SZCe-cthrotBA', 'review_id': 'qPJQYuf4n9xmUDnVAKapGQ', 'text': 'Flavors of Louisiana is home to the most delicious and authentic food of Louisville. From crawfish pie to Shrimp Po Boy, you certainly have a smorgasbords of deliciousness to tame the beast we call hunger. The establishment has such a homie feel to it, when you come in you feel right at home. Pop a chair, sip on some thirst quenching sweet tea, and chow down on true authentic flavors. You will not regret coming here.', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-12-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KOTS0wdQOBCd4zEEufsmvw', 'review_id': 'xuOUEIrTTLNHndjw8DJufw', 'text': 'First time here.\nThe blackened alligator was way better then the alligator I had in New Orleans down in the French Quarter. \n\nI will definitely be a repeat customer!', 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 4, 'date': '2015-12-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'DTve41dpuW-l_Nw9SPCyjw', 'review_id': '8HpPG-gYDaPYl5yKcZnB6Q', 'text': "We love this place! I am sure all of their food is good since I have heard very positive statements from friends, but I can only recommend the shrimp po'boy. I had this on my first visit and haven't been able to order anything else. Each time I promise to try the alligator or oyster po'boy on the next visit, but I am afraid of regretting not having the delicious shrimp. Oh yeah - I had bites of the fried green tomatoes and the gumbo thanks to going to Flavors with friends. Both dishes were yummy. I guess the moral is take friends so you can try different dishes.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-12-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'V8rIx73Qp5VZEnBZ1uR3zQ', 'review_id': 'j1N_nxl0FRqpMyDG-rjuyA', 'text': "Love this place. I'm rather simple I usually get a po boy and gumbo,  but everything I've had there is awesome. The staff is friendly and always remembers us when we come in.", 'business_id': 'mwiNm868yAo8Xh8hO7Ke_Q', 'stars': 5, 'date': '2015-12-20', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 9, 'cool': 8}, 'user_id': 'lPaYMDmJbAnv_3pmZH_inw', 'review_id': 'fmZjmngTRMc0HnrYsBrkWw', 'text': "Over the river and through the woods.. lalalala, la, la.. Cave Creek, AZ is kind of a drive but I suppose no worse than driving to Gilbert from Scottsdale. Though this journey includes cactus, multi-million dollar mansions and the occasional coyote rather than tract homes and freeway. Once you get out there the entire area is sort of like old cowboy rustic charm. So doesn't it makes sense to open a BBQ joint way out in the middle of somewhere? The owners of Bryan's sure did!\n\nOnly being open just over a month, Bryan's was hopping busy and there is a reason why.. the smell. You can just about taste the pecan smoke as you pass by or pull up. Its an enticing fragrance that grips, strokes and pulls you in to see what's about that hopefully delicious smokey goodness. \n\nOnce inside you'll easily tell where you need to go.. it's all about counter service here. The menu is easy to navigate as its short and sweet. Its a greatest hits of BBQ and you'll be hard pressed just to order one thing. Go ahead, order as much as you like, loosen your pants and stay a while. \n\nOrdering for us was pretty easy though we did cross section the menu, pork ribs, pulled pork sandwich, beef brisket, olive cole slaw, baked potato salad and cowboy beans. Get your drinks then grab a seat in the modern, cowboy space. They do serve beer as well as Coke products though I noticed something strange, most people were drinking water. Is that how they are dealing with the economy? Spend a little on food and cut a couple of bucks on the beverages? Good idea I suppose, coke is coke is coke, right? Water cleanses the palette and pairs with anything, sure Ill go with it! \n\nOkay, they called the Mr.'s name, my mouth is watering, my sauces are ready, good to go! First bite, the brisket, smokey, juicy and perfectly tender, the white bread under the brisket soaks up the meat juices, good idea, why didn't I think of that?! Next, ribs, oh no.. I can suck the meat right off the bone? Its not like I can suck a golf ball through a garden hose (well, Ive never tried)  it's just that the ribs are that tender! Dip in a bit of the spicy sauce, hellish good (I don't think they serve BBQ in heaven right? Smoke and flame thing, eh?)! Pulled pork sandwich, is melt on your tongue tender, I can see why so many older folks were ordering these sammies, no teeth required. \n\nOddly the sides are in need of some tweaking. The baked potato salad was on the dry side but I have yet to have a baked potato salad that I like. Something about cold baked potatoes that don't do it for me. The cowboy beans had no real character and were only one flavor, a smokey sweetness that was good on the first bite but lacked depth. The olive cole slaw was different and while the Mr loved it, I'm just not a fan. However each plate was served with a bread and butter jalapeno, not only clever but addictivly delicious. \n\nOh the desserts, simple and satisfying. Homemade Ice Cream Sandwich and a Sarsaparilla Float. We got the ice cream sammie which was 2 huge chocolate chip cookies with vanilla ice cream. Nice crunch factor on the cookie with the cold smoothness of the ice cream, talk about a happy ending. \n\nOn the way out the sun was setting the moon was rising and all seemed right in the world. Perhaps for the first time in ages, a calm swept over me and all I could smell was pecan smoke begging me to come back some time soon.  \n\nOh yeah, me and my O-face!", 'business_id': 'KleJUKZjGFFhybrcpZIyHQ', 'stars': 4, 'date': '2009-04-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ac1sVXF5NQIrvYw7v5DeBQ', 'review_id': '8_jBStASPNSk8AF_KI6WDw', 'text': "Bryan's is now my favorite place to eat in Cave Creek and has ignited a passion for bbq that I didn't know I had. \n\nI work relatively close so I've been going in about once or twice a week for the last 3 months or so. The owner and staff are awesome and the service is great. I'm absolutely in love with the beef brisket, the sauce is amazing, the meat moist, tender and the bun is lightly toasted which just tops everything off perfectly. The beans are my side of choice, they have this wonderful smokey, whiskey like flavor to them, the coleslaw is also pretty tasty. The pulled pork and ribs are also very good, with the chicken just slightly below both of them. \n\nBryan is also a nice little selection of craft beer to go along with your bbq, such as Dogfish head and Deschutes brews, plus the standard fare of domestic beers.", 'business_id': 'KleJUKZjGFFhybrcpZIyHQ', 'stars': 5, 'date': '2009-08-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'zFhCkeNQcIeyGTwX_sWP4Q', 'review_id': '2lknhGeyXP1AegvMj0b9rg', 'text': "I am so depressed! I live in the town of Cave Creek and have held Bryan's as my little secret, eating there 2 times a week for the past few months.  Now, the Arizona Republic comes out with a rave review and the place is packed.\n\nGood news - the food is still made to order, hot (temperature) and lovely.  I have grown especially fond of the vegetarian version of a BBQ sandwich.  Even though I eat meat - I have died and gone to heaven every time I have one of Bryan's BBQ'd spaghetti squash sandwiches. Try one and you will see what I mean.  His sauces, especially the spicy one, are devine and the sides are tasty.  I always go with the fries but I love the potato salad too.\n\nI newer addition of the Big Pig is also great if my husband is with me. Imagine a BBQ version of nachos - trading the chips with Byran's delicious fries and then loading the plate with his BBQ meat!\n\nThe place is ultra clean - thanks to all of his dedicated employees and you will find Bryan himself either behind the counter cooking or walking the floor making sure all of the diners are happy.  \n\nOnly two complaints- Bryan's is closed sunday and the tv in the place is set to old movies.  If I could watch the Cardinal's play and eat a sandwich - that would be true bliss.", 'business_id': 'KleJUKZjGFFhybrcpZIyHQ', 'stars': 5, 'date': '2009-08-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'iVe2cQulgqO6UrD36fcQ0w', 'review_id': 'qE4rgU1Qtfovfn41e-5_uQ', 'text': 'Just past the DQ on the right.   Hard to believe you can get great southern bbq, in AZ.  Bryan is perfect.  Priced cheap too.  Super clean.  I agree teh movies need to go, maybe put on some SEC football!!!\n\nThe ice cream sandwhich was a perfect finish.  \n\nI had brisket and ribs.  \n\nThey close promptly ay 9PM', 'business_id': 'KleJUKZjGFFhybrcpZIyHQ', 'stars': 4, 'date': '2009-08-30', 'type': 'review'}
