{'votes': {'funny': 0, 'useful': 3, 'cool': 3}, 'user_id': 'JAeTwZWx5MUq2_h7fZLKIQ', 'review_id': '_uh6sMEnb25Hd3vQz3Ewtw', 'text': "We recently moved up to Sunnyslope, so the search was on for a new Indian Restaurant and India Palace was it.  We enjoyed it so much that when they moved over to the new location on Bell Road we followed.  \n\nThey have all the typical Indian fare, although we only eat the veggie stuff so I can't comment on the meat dishes.  Their Mali Kofta is wonderful with amazing sauce including cashews and raisins and they are more than willing to add Paneer to your Aloo Matter (if you're into that kind of thing).  Great samosas and pakoras, and if you go for dinner they will start you off with some Poppadums and salsa with chutney.  \n\nI think India Palace has one of the best Indian Buffets, but that is mainly based off the fact that their buffet always includes a large selection of veggie dishes, almost more than the meat selection! They also always have some interesting selections that you may not see on the menu like Chili Tofu and Curried Pasta.  It's all you can eat including the naan and hot Indian Tea.  Its always busy at lunch time and there is a reason why.\n\nIt is located in the corner of a strip mall, but once you enter you wouldn't know thats where you were, as the restaurant itself is very nice on the inside.  The staff is very friendly and if you go as often as we do you will get to know them all because they are always there!!\n\nThey also have restaurants in Sedona and Flagstaff, although I recently heard they were going to be selling those and just keep the one in Phoenix. \n\nEnjoy!", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2008-02-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 2}, 'user_id': 'r9g2UzNWWCDC8IKglOdUUQ', 'review_id': 'BjvH3t79aRhPEHmyQKK1VA', 'text': "It was a very hectic time of the year, i was packing, my room was a mess, uncertainty on my employment, and i am about to transfer to San Francisco. \n\nIt was another bored afternoon after an early day at work. I was driving around hunting for food and i realized this little hidden treasure within a small strip mall. The strip mall looks kinda run-down a bit, but once you enter the premise, you are greeted by a delicate aroma of curry and spiciness in the air.\n\nSo i decided to patron this restaurant for a heavy buffet lunch. I wasn't expecting much especially there ain't much good Indian cuisine here in Arizona. I went to the buffet lane.. :P and the first item was 2 choice of rice... Regular basmati rice or bryani rice, which is very rare that they offer 2 type of rice for buffet. Next there are plenty of choices of daal and vegetable curry. The cauliflower and potato masala was great. Then the typical serving of chicken tandoori and chicken masala. To my delight, they actually serve lamb curry which is very rare for Indian lunch buffet.\n\nThe flavor was decent for a buffet lunch, but it seems like a great deal for a lunch they serve. As usual, i stuffed myself with 2 full plates of masala and rice, then end with a plate of lamb curry and chicken masala with the naan that they served with the lunch.\n\nToo bad that i have just relocated myself to the Bay Area about 4 days ago... if not i will surely return to the restaurant to fulfill my craving for Indian serving and masala.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2008-03-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 1}, 'user_id': 'deEtVfAWacIYLdx7PcuOnQ', 'review_id': 'id0x03Yw2PoVeefdjPamTQ', 'text': 'The food is great, fresh and delicious.  An authentic Indian Cuisine Restaurant with an unbelievable lunch buffet, the service is excellent and is priced reasonably.  This experience is worth the drive.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2008-06-30', 'type': 'review'}
{'votes': {'funny': 5, 'useful': 5, 'cool': 4}, 'user_id': '3sJ62Mkavx69FBec71agYg', 'review_id': 'GXhCVzS14jGRpwusofxFIw', 'text': "Being Indian, and having grown up in London, I have been pretty spoilt for Indian food. Imagine my dismay when I moved to Phoenix! I've tried many different places here in town desperately trying to recapture the memory of a good London curry house but each time I've left either disappointed or clutching my guts fearing what may come.\n\nCouple of friends introduced me to this place a few months ago and I'm stoked. It's not as good as the stuff back home. And I'm sure you can get better in San Francisco or New York. But if you are looking for something closer to home you can't go wrong.\n\nPlus its got the real live Indians eating in there too. Can't be bad!!", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2008-08-01', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 3, 'cool': 3}, 'user_id': 'GubdNFoDAsiwE6bWIr97cQ', 'review_id': 'tjhbYoBuphQtG0l9UUrBeA', 'text': 'I am not the person in my family who would ever say, hey lets go have East Indian food. Not that I do not like Indian food, I just never had good Indian food here in the USA. In London yes and go first thing when we arrive. But my mate a friend out voted me and we went to India Palace tonight.\n\nIt is located in a dingy sad strip mall but the actual restaurant is nice inside. It is clean and comfortable but does have some odd looking chairs at their tables.\n\nWe ordered a plate with a variety of meats on it some naan and rice, my friend ordered some chicken thingies and soup.. It all was very tasty with some of the bites hiding a bit more heat than others. So it is good enough that I would go back.\n\nThe service is very friendly but very erratic in getting dishes out to you and need a reminder that you did indeed order more than brought out. If the service could smooth it self out, it would have been a great meal.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2008-08-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '9YcqKqs7xFH2tMOuqoUsQA', 'review_id': 'aEUxY13HNWSJzp0dPWqHxg', 'text': "I was never a fan of Indian food until I found Indian Palace, now at their 3rd location in less than 10 years, and despite that the location keeps changing, the food stays consistent (which is a rarity).  \n\nTheir lunch buffet is one of the most diverse I've ever seen from an Indian restaurant, with 2 rice dishes (bryani and basmati), several vegetable dish choices and several meat choices.  small tossed salad and dessert as well at chai round out the offerings.\n\nMy favorites are the Chicken Tikka Masala, Bryani and spinach, but I eat almost everything there.  It is the best Indian food I've had...ever.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2008-11-18', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 6, 'cool': 5}, 'user_id': 'n_lAaNGeWgspbbCJc0DqRg', 'review_id': 'E6hYpA2fjH0InoZ2w9w25Q', 'text': "In grade school, one of my best friends, Pranav, had me over his house a couple of times for dinner.  His mom cooked the most bizarre, yet flavourful food my near-virginal midwestern tastebuds had ever yet encountered.  At the time, I remember not really being sure I liked it, and at the same time craving to go back and have some more!\n\nWhen I recently began to work nearby to India Palace and saw their sign for the lunch boofay, I thought back to those days in Pranav's stinky house and marched right inside with my 9 bucks in hand.\n\nThey are a little more classy than the pay-first boofays, as you are seated and served drinks by waiters, and will get your bill later.  \n\nAt first glance, the bufett table seemed smallish to me, but once I started scooping out the various gloops onto my pile of rice & veggies, it really added up fast.  There were plenty of choices labeled as Meat/No Meat, and with the dishes' names, although I still had to consult the menu to decipher what gloop I was scooping.\n\nFor the non-adventurous in your family or group, there is some nice almost-plain jasmine rice and tandoori chicken (simple skinless barbecued chicken pieces that taste like the best picnic cooked-over-a-charcoal-grill chicken you can remember).  For those a little more adventurous, just try it all.  They do not stock the exact same items each day, so it is a must to go on different days to sample all you can.\n\nYou can round out your meal with some fresh veggies, although not really a full fledged salad-bar (not like the veg-heads don't have plenty to choose from here), and I loooooove the mango chutney, mint/cilantro/whatever sauce, and tamarind sauce.  I get a big bowl of each and use it all up -- NO WASTE!  Goes great with the freshly made naan bread that you get with your meal.\n\nMy grade school friend Pranav is a big-shot doctor now in Boston, but I'd love to have that chance to take him here and find out if it's as authentic as it seems to be.  Judging by the large volume of Indian clientelle that I always see here, it probably is.   I always find that to be a great way to judge any ethnic eatery or grocery store.  \n\nWatch out for the (anise?) near the register.  It's not as close to an after-dinner mint as I was led to believe.\n\nPS: not sure if others would have the same experience, but my 12 y.o. did NOT like this place at all, and since they stop the 'Kid's Price' quite young,at like 9 or so here, I learned to save my cash and not bring her.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2009-04-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'c8MROMPH5S7niGWbVpF-RA', 'review_id': '6zYEF-Re78tYwf0t3RPADQ', 'text': 'This fabulous restaurant is tucked into a corner of a shopping center just off of Bell Road.  Once inside, the decor is inspiring and the waitstaff personable.  The food, from appetizer to dessert, exquisite!  The spices in each dish were well balanced and unique.  While enjoying dinner, plans were already being made to share this place with others.  It is just too good to keep to yourself.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2009-06-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'usQTOj7LQ9v0Fl98gRa3Iw', 'review_id': 'GYp3yTmwxzgLrX1MmJDGyA', 'text': "Stopped in for the lunch buffet at about 1:30 on a Wednesday.  It was pretty quiet. It is one of very few business left in this less than stellar strip mall.  But don't let it fool ya or discourage you.  Inside is clean and colorful, with plenty of room for larger groups.    I would have to say there was a lot to choose from and all was hot fresh and full of flavor.  The naan was nice hot and fresh off the griddle.  I was very pleased and thoroughly enjoyed my lunch and can see myself going back in the near future. Yum!", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2009-06-14', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 5, 'cool': 4}, 'user_id': 'C6IOtaaYdLIT5fWd7ZYIuA', 'review_id': 'VWAPJK2sw7H6Url9_DgVwg', 'text': 'Ryan C and I enjoyed a nice meal here today. It was only the second time ever having Indian food. I thought the place was very clean, the staff helpful and the boofay, good. \n\nI could eat rice, chicken and bread all day but the rest of it was good too. \n\nDo not eat the trailmix/spice looking stuff if you hate black licorice.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2009-07-10', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 5, 'cool': 5}, 'user_id': 'WWxCMDn8rVHIrIFoKRcRDg', 'review_id': '5TxhmYgHcV2dJcOz2U5-WA', 'text': "Nice! An excellent Indian food restaurant in my hood.\n\nThe food is delish, the staff is super friendly and the decor is appropriate.\n\nWe enjoyed the garlic naan, a peas & cottage cheese dish and a cauliflower & potato dish. All were super tasty. Lots of vegetarian options.\n\nI'm really glad we popped in to try this place out. We'll be back.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2009-07-11', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'GkWuTgewni9bzPM4HUCO-g', 'review_id': 'eAJfAnhtthni382EjnkcHw', 'text': 'For those who are confused. this used to be the India Palace on 51st and Greenway and prior to that it was on 7th avenue and Bell. It seems the quality of the food changes with each new location. The quality of the food has changed..and not for the better unfortunately. I stil think India Palace is one of the better Indian restaurants in the valley and would recommend it for the casual Indian diner. But for an Indian person or a non-Indian who is used to eating Indian food and has more discriminatory tastes, I would ask you to go elsewhere. I recently dined here and it had the same problems it had last time. It\'s curries are too watery. It\'s naan are too small and "dish rag" like and pala/saag was also very runny and had a baby food like consistency.  The nice thing about this place is of course it\'s ambience which is beautiful, contemporary and new. The service is also pretty good here.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 3, 'date': '2009-10-09', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 4, 'cool': 4}, 'user_id': 'm7vtKWpZ9wdEQ95wJxrMrg', 'review_id': 'uYIxrGoFRo-eHyTE6NFvNg', 'text': 'Have you ever had one of those dining experiences which end with your taste buds telling you "Gimme more, more!" but your stomach says "Stop already, there\'s no more room!"  Well, that\'s the experience I had today at India Palace Cuisine. Spurred on by the reviews of Rand and other yelpers, I decided to try this place for my weekly boo-fay excursion.  \n\nGetting there was no problem: it\'s just a block off I-17 at W. Bell and parking was no problem because it\'s in a strip mall which is mostly empty. The place is clean, a bit dimly lit which is great for a more relaxing experience, and the staff was friendly - and they remained so even though they were dealing with a lunch crowd that included a cricket team when I went there. I was seated in a comfortable booth and immediately served a basket of piping hot naan bread fresh from the tandoor.\n\nThe buffet selection was not huge, unlike in Chinese buffets, but definitely more than adequate. The biryani rice was excellent, as was the basmati. The curries (I just had to try them all) were very flavorful and spiced on the milder (for me) side, but there were also cooling condiments for those who might find the heat level of the spices a bit daunting. There were more than enough delectable vegetable selections to make vegetarians very happy. And the tandoori chicken was good though not great. In all, the quality of the food was such that I kept going back for more until I grudgingly gave in to my stomach\'s pleas to stop already. Nevertheless I still managed to sneak in a tiny taste of the desserts - a spoonful each of the two puddings and just one ball of ladoo in syrup.\n\nGoing back (or was it waddling back) to my car, I decided that I needed to do something to compensate for having eaten so much, so I decided to proceed to the Rio Salado Habitat Restoration Area and walk its trails ... and that will be the subject of my next review ;-)', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2009-10-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'wWVKB-Yl2WrKB19CPTC-mQ', 'review_id': 'ppmf2hqNuKDdwSp1mhXedw', 'text': 'Good Indian food buffet for lunch. Food is a bit above average compared to similar places in the valley. Spiciness was good for me (mild-medium) but the food wasn\'t as flavorful as I\'d expect for Indian food. Some of the vegetarian dishes and naan were bland. \nMy favorites were the chicken curry and the paneer based dishes - they had enough spiceness and spice for my indian food fix. \n\nAlso, staff is friendly and they have rice pudding - so I\'m sure I\'ll be back. \n\nJust a quick note though - the sign from the street says "Cuisine of India" - not "India Palace" but it\'s still the right place. Just look for the Good Egg.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 3, 'date': '2009-11-10', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': '5-2JHDnSsoSaoRKDHPeTtQ', 'review_id': 'Bd0V0J99OxKZat7VsLuL2g', 'text': "I've only eaten the buffet here and it was good but nothing special.  To be fair, most Indian buffets are pretty similar, it's only when you order from the menu that you see if the restaurant is really a stand-out.  So, I will update this review when I've gone there for dinner", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 3, 'date': '2009-11-11', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 11, 'cool': 10}, 'user_id': 'n_lAaNGeWgspbbCJc0DqRg', 'review_id': 'Smy7cp6qHGrwGY1dG-NNEw', 'text': "I just had a wonderful conversation during lunch with the friendly owners, Mr and Mrs Dosanjh.\n\nI commented that I always see them eat their own food right from the buffet table (unlike the staff at many chinese boofays), and he was happy to proclaim that he and she eat lunch there everyday -- his son two meals a day!\n\nAnd why not?  It is delicious, wholesome home cooking, after-all. \n\nWhen the people who created -- or inherited -- all of the recipes tell you that everything in the restaurant is made *from scratch*, while literally breaking bread with you, it really has a special meaning.\n\nI got to share my story about my grade school buddy, and let them know about Yelp.  Their friendly interaction is something I've already come to expect from the rest of the staff, so it was nothing shocking.\n\nToday's assortment of dishes was excellent, with all of my favorites, a spicy bean sprout dish I'd never seen before, and also more fresh veggies now than in my original review.  \nVeggie-potato fritters (can't remember the indian name) were zesty and not greasy at all.  Chicken curry had so much savory flavor without being spicy at all, it literally made my mouth water just sniffing it.  \nThe Tandoori chicken aroma grabbed ahold of me in the parking lot where I first smelled it as I stepped out of my car, and had me floating through the air like a cartoon riding on the scent vapors, all the way into the front doors.  \n\nWhen the people who created -- or inherited -- all of the recipes tell you that everything in the restaurant is made *from scratch*, while literally breaking bread with you, it really has a special meaning.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2009-12-02', 'type': 'review'}
{'votes': {'funny': 9, 'useful': 8, 'cool': 7}, 'user_id': 'du6KeE54IFbPiXpU3LOd1g', 'review_id': 'YmzO18gJyks-gSrgZtWqmg', 'text': 'Fellow Yelpian Ryan C. organized a little luncheon at India Palace yesterday (see, it\'s not only ladies who lunch, sometimes it\'s us manly men, too:)\n\nI made the pilgrimage from OTowSco to the near reaches of NW PHX and met up with Ryan, Rand, Norm, Daren and Wes and we talked and laughed and we hit the boofay at India Palace pretty hard:)\n\nPretty good boofay...not terribly extensive as far as the food selections go...but the available items were all well prepared, well seasoned and my lunch ended up on the happy end of the "Crap to Quality Ratio":)\n\nAs we dug into our first plate of boofay, Ryan said "I hope everybody filled up on bananas and cheese"...a humorous comment about lubricative effects of the food at India Palace:)\n\nIn a happy coincidence, he almost exactly described my breakfast yesterday morning...4 bananas and a  1/2 pound of Tillamook Sharp Cheddar:)\n\nWhen you get to be my age, the adage "never trust a fart after 50" isn\'t just a funny thing to say...it becomes one of the guiding principles in your life...so, bananas and cheese...all the curry\'s and tandoori\'s  and vegetarian squash/potato stuff and vindaloo\'s with basmati rice and naan in the joint aren\'t going to break through this particular firewall:-)\n\nOatmeal would have just been throwing gas (no...gasoline, not GI tract methane) on the fire (oh wait...that would work too:)\n\nAlthough I\'m not generally a fan of boofays (I really do think the "sneeze guards" seem to be just a suggestion to many of the people that I see rooting around in the boofay) this was a pretty clean and well maintained boofay...I had 2 plates of pretty decent Indian food and got a chance to relax for few minutes with friends and have a little light conversation:)\n\nThings stayed sealed up tight and I sailed through the rest of my day with the confidence, dignity and demeanor of a man who knows that everything is safely locked down:)', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2010-01-16', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'f2aH-hqBtQLMGegUsJvi9g', 'review_id': '1H6L0az2P0rqD1-T6BjVOg', 'text': 'Best Indian lunch buffet I have had while living in AZ. Dishes are flavorful , staff is very attentive. Their Nan is sooooo fresh. I try to come her once a week for my Indian food fix. The selection changes every day and everything is good. I never leave here disappointed.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2010-02-07', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 3, 'cool': 1}, 'user_id': 'EoTooNBcxu0Hy0-XeZI8aw', 'review_id': 'o613LzlPDVj6eD65ksvdpw', 'text': "It was beautifully decorated, but I really wish the food had been a lot hotter. My friend and I were starving, but l have issues with food being tepid. I'm surprised that the Indians we saw there would actually stand for it - the Indians back in India had no problems with returning food if it wasn't piping hot...which is how I like my food.\n\nThe naan wasn't bad, but it wasn't the best I've had, either.\n\nToday's features offered some lovely eggplant (*purrs with happiness*) and good vegetarian dishes as well. I had their chicken curry, but it was the veggie dishes that did it for me.\n\nI'd like to take hubby to this place to gauge his reaction.\n\nBonus? The food wasn't salty and I didn't guzzle 2 gallons of water an hour after having eaten there.\n\nFor now, 3 stars.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 3, 'date': '2010-02-11', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': 'YPk47NcyWSkk-541OxyzMQ', 'review_id': 'lfUJwmwS6Fxo1A4AHeVFCQ', 'text': 'I\'ve been eating vegetarian for the pat few weeks, so my my restaurant options are slim. We decided to try the Indian Palace. My friend ordered the Masala, hot and spicy. I ordered my meal medium.  Everything was great....except next time, Ill order my meal "hot". The medium spice just didn\'t cut it.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2010-02-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': '0VptqMr6enVCnqRjVYs4NQ', 'review_id': 'OkwUKPhspXJW2jHjMdRZtw', 'text': 'So I know it\'s cliche`, when talking about a certain ethnic dining establishments, to refer to the food as " it\'s good, but not as good as indian food in India! " Although lame to say all the time, in some cases it is true. I have been to India and the food was probably the best thing about the trip, seriously. Luckily India Palace does a pretty good job - for being in Phoenix, AZ anyway.\n\nThis is on my lunch rotation as it\'s close to the office. A few of us hit the buffet every once in awhile and I must say it\'s always very consistent quality wise. while changing up the menu items every time we dine. \n\nThe buffet is small as others have mentioned but I think this has an appeal. I feel it helps keeps the quality, flavors, etc consistent and everything fresher. They always have more then a few vegetarian and vegan items to fill up on and service is always prompt and friendly.\n\nThis place is easy to miss tucked back into a hard hit(read lots of open, leaseable space) strip mall in NW Phoenix but worth stopping in for some almost-authentic indian grub.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2010-02-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'tve9aUdKff_CWW-6fn1T1A', 'review_id': 'DoGSWQlx40no0qsnQom2IQ', 'text': "This place is amazing. I love their food and I love their service. The staff are so friendly, they come over and chat with us every time we eat there. They reccommend new thigs for us to try and it's always so delicious that I can't stop eating. It is by far the best Indian food you can get in the area. Try the spinach fritters and the mango lahssi drink(don't know how it is spelled, sorry). The prices are also very reasonable.\n\nThe atmosphere is also nice and there is a Sunday brunch whic is decent. The brunch food is not quit as good as the freshly made food, but it is a good value.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2010-04-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '6G8vLJUi1Ees2qC3RGA3Nw', 'review_id': 'NpF5vgHqswkedquouGumYA', 'text': 'Firstly, this is the best buffet I\'ve found in Arizona. I haven\'t done too much looking on the Scottsdale side, admittedly (since it\'s a little too far from Surprise), or in fact anywhere else except for the West Side, but I have been to Maharaja Palace and Sutra and you just get more variety here. As for the quality of the food, it\'s fairly middle of the road. I didn\'t hate anything, but I didn\'t particularly drool over anything either. I\'m impressed that they have lamb curry in the buffet though - being an Aussie I\'ve grown up with lamb as a staple meat and love it (it\'s WAY too rare to find in the US though). But when I say "the best", I\'m only ranking it in a comparative sense. Read on..\n\nI got a-la-carte take-out from India Palace for the first time last night. I\'ve done this several times from Tandoori Times II and the smell has always assaulted my nostrils with deliciousness for the entire thirty min drive back home - enough to strongly consider pulling over and wolfing down a few mouthfuls before continuing the drive. With India Palace, the "travel smell" wasn\'t as overpowering.. not exactly a good thing since that pretty much means they don\'t use as many, or as strong, spices. I like strong spicy food. On the other hand, my car didn\'t retain the smell the next day.\n\nNext, I compared apples to apples taste-wise. I ordered their chicken tikka masala and the lamb vindaloo - my standard choices. TTII\'s dishes were simply more flavorful. I mean, the wife and I both LIKED India Palace\'s versions but it wasn\'t worth more than three stars. Also got the aloo gobhi - it was a-ight, but I\'ve ~made~ better. And that\'s saying something. The vindaloo wasn\'t actually spicy at all, despite me asking for all dishes to be prepared "medium" spicy. I didn\'t need a drink for the entire meal.\n\nAmount-of-food-wise, you do appear to get a LITTLE more food for your money with this place - more solid meat in the containers than sauce, whereas TTII rips you off with 50/50 sauce/meat ratio. A 10oz container of food for over ten bucks (such as those from Tandoori Times II) is beyond highway robbery, especially when you can get enough good Chinese food to almost give you a hernia carrying it out of the store, for twenty bucks at Chen and Wok.\n\nThe naan was plain old average. And IP\'s naan completely failed the microwave reheat test. I nuked half a naan for about 20 seconds today. The resulting cracker had all the juicy softness of a frozen dorito. Hell, I wasn\'t expecting sponge cake but I ~definitely~ wasn\'t expecting a crunch that made my teeth hurt and my ears ring.\n\nSo, I\'ll probably go back, and I may even get takeout from here again, but I continue to lament the quality of Indian food on the west side. Would some enterprising business person PLEASE open an Indian restaurant somewhere west of the 101 (and north of the 10!). I\'m so sick of nail salons, pizza places and dentistries being the first, second and third businesses respectively to open up in any new strip malls. SIGH.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 3, 'date': '2010-05-04', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': '6G8vLJUi1Ees2qC3RGA3Nw', 'review_id': 'yDSH6HKp24RtPM68QcpDyA', 'text': "closed!!!!!!\n\nEDIT: 20100716: Wait a minute. This place is still open! I think they must have closed for some renovations - went there today and it's definitely open for business with buffet and everything. Didn't look like it was renovated either. Please ignore my previous indication of it being closed. Still one of the better buffet on the west side, too. Looks like they got a new website..", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2010-06-18', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 1}, 'user_id': 'V6rhoTCw7S6H8eHwv2M6Vg', 'review_id': '8OhsAagXpknngLyT71UPfg', 'text': u'Veggie Korma.\n\nThe best veggie korma ever. \n I have dreams about thier veggie korma.  Beautiful dreams.  And naan, I\'m always a big fan of naan, they do not disappoint.  The fianc\xe9 and I have tried a variety of their meat dishes during our visits; have yet to find anything we weren\'t a fan of.  \n We have since switched to only enjoying this fine establishment during their buffet lunch, because hey we are in a recession in case you haven\'t heard, and even thought their prices aren\'t bad my Indian food habit was getting a little pricey.  The lunch buffet is very inexpensive, and you have enjoy all the delicious fluffy naan you can handle.  It\'s a great way to try out different dishes, especially since the hubby claims that he "doesn\'t like lamb" this makes it possible for me to indulge in Marys little friend without battling it out with him.  I do however wish they would serve veggie korma during their lunch buffet more often, because once again, delicious.  Though when I\'ve called to ask if they had it in the past they did put some out, so I think they are pretty much the nicest people ever.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2010-06-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'EJpeLUvQ00sDzhtsjMyS2Q', 'review_id': 'MDP39NpX2q-lEqxKrkmr2w', 'text': "Excellent service, great food, reasonably priced. I've been to several Indian restaurants in AZ and this is definitely one of my favorite places.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2010-06-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'zn81QpflLDUaGZkCMUowCg', 'review_id': 'vDvcZ19MDXxokZr_br05cA', 'text': 'What I liked about this place was that it was not as greasy as most Indian restaurants in the U.S.  Unfortunately, the flavors were somewhat bland.  Palak paneer was average.  Naan was ok.  Vegetable pakora was good.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 3, 'date': '2010-06-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '5zzokpA0YVKltOEauBOTbg', 'review_id': 'fufX9eCmCiRojTgOY5PU0Q', 'text': "I am new to Indian Cusine having had it just once before in London. I was looking for something approaching good Indian food in the Phoenix area, and must say I've found the place. I first called to find out if the restuarant was open as a few other revies had mentioned it had closed. I was pleasantly surprised to hear it was open, as it isn't to far from work. I wanted to order ahead and take out for dinner. When I arrived, the food was done and I was on my way. The place was empty at the time (Wednesday at 5PM) so I was a little nervous, but the food was really good. I had the Chicken Curry and the garlic naan. I would recommend both!", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2010-07-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'V3tKShhytJ7CflF3vqureQ', 'review_id': 'nfk2VvEua2c4qRdaimybrw', 'text': 'Thank you so much for the good reviews. I went here for a business meeting 8-13-2010. I ate soo much I hurt myself. Everything was great I especially loved the lamb and chicken curry. The staff was excellent and very kind. I will recommend my new favorite Indian food restaurant to everyone. ;)', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2010-08-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oyXrEZiPZBvrTok1oYLPNA', 'review_id': 'qlw0hmDQ2QfjTTrJdjkk-Q', 'text': 'Great vegetarian selection, great prices. Awesome buffet, very friendly and hard working staff. Overall a great experience every time', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2010-08-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'YZ82I51Zedr9U6e13DO82A', 'review_id': 'k57_KX9zNH69X_3cOJKDNA', 'text': "Having read all of the rave reviews, I decided to drive out to India Palace for some good Indian food.  I just moved to Phoenix and was really looking forward to it.  I got there about an hour before the lunch buffet ended, so I didn't expect everything to be perfect.  The food was pretty good, but not like I expected given the reviews.  The mango lassi was excellent, and the rice pudding was good, too.  Everything else was okay -- several dishes were spicier than I am used to, which was good.  The naan was good, too, and the service was prompt and friendly.  But the rice was either not fully cooked or had been in the pan way too long, as it was a little crunchy, and some of the sauces seemed watered down.  The buffet lacked the variety I was looking for.  I may be back if I'm in this part of town, but I wouldn't drive there again.  Decent food at decent prices with good service, though.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 3, 'date': '2010-10-03', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'V6rhoTCw7S6H8eHwv2M6Vg', 'review_id': 'B09ei4lfrccMPHVN9X5ehQ', 'text': 'They now deliver.  I really love them.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2010-10-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'lBWuBoFMQsrayHxzazTQ_A', 'review_id': 'aHiebBTlLCoH1QnnSk92JQ', 'text': "Coming from the bay area where we seem to have an infinite supply of Indian buffets I can only give this place 3 stars because it wasn't bad but there are some things I did not like:\n\n- The naan was too thin and they have mostly garlic naan.  I asked for plain and they said ok, but they brought out the garlic naan again.\n\n- The selection isn't that great and they don't put out that much food.  I only got two pieces of Tandoori chicken which I had to dig out from the rest of the stuff.\n\n- Also, the spices seems a bit lacking.  Not only am I used to food being a bit more spicy, but just flavor in general seemed to be lacking.  And some of the potatoes dishes the potatoes were undercooked (hard).\n\nAfter reading all the reviews, I guess I expected a lot more.  I'll try something else next time.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 3, 'date': '2010-10-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'SJncNINSwj_hTWIdflgb0A', 'review_id': 'ZvJjRgA8WQq1qXvnzH26gg', 'text': "Very pleasant ambiance. I did'nt care much about the food but maybe it was what I ordered", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 3, 'date': '2010-11-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'dhVqzZ-D0GDYT65MGADqTw', 'review_id': 'Stx3rZEGmK9pNlin4u9Njg', 'text': 'In some circles, referred-to simply as "The Palace," this place has a solid lunch buffet and good service. Priced at about $10 per person for a variety of good Indian food, it\'s a lunch-time slam dunk every time... although adding a couple more dishes to the mix would be ideal. It\'s an OK value for dinner, although, in my opinion, slightly overpriced for good, but not out of this world, Indian.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2010-12-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Hi7VohxSS5OBt98w4j8t4A', 'review_id': 'Y8rzR9eosUMQr7v53jQrkg', 'text': 'Soooo good! They used to be located on Greenway and 32nd st, 5 minutes away from my work. I only have a half hour lunch break so I used to rush over their and stuff my face with as much of their delicious food from their lunch buffet as I could in 15 minutes. \n\nBut sadly they relocated. We go there for dinner sometimes, not as often as I wish because it is a 15 minute drive. Most of the time the service is very good. The men that work there are very nice but the one lady that works there is kind of grumpy. \n\nThe food is mouth watering and delicious. I feel they get the spice levels right. A medium IS a medium. A little bit of heat but you can still taste the food. Favorite dishes are the palak paneer, mali kofta, and the garlic naan. We like to wash it all down with the Indian beer, Taj Mahal.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2011-01-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '8iCgFpk2UHBYYw1aIbE6Lw', 'review_id': 'pjU5h8HwRPHleNvWhpeRzQ', 'text': "Had the garlic naan bread and Lamb Korma, spicy. Spiciness level was perfect and the garlic naan was very good. I'll definitely be returning.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2011-01-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'bswV-wIGU9Bw4mbxSPdykg', 'review_id': 'aNn44hmwX27bVm2f2Pbz9g', 'text': 'Consistently the best Indian food experience I have found in the Phoenix metro area.\n\nWonderful Chicken Tikka Masala, splendid lamb  Korma and delightfully spicy Lamb Vindaloo are not to be missed.\n\nAll in all a great experience.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2011-01-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': 'RL9-QudgjWYw9l78d__uyA', 'review_id': 'k_Mox_tRHfynEDd41YNQ4w', 'text': "Reviews for this place are really misleading.  We went there today, and we were very disappointed.  If you're looking for more authentic Indian food,  this is not the place.  We noticed that the chicken tikka was sweeter than usual, when we asked the chef if it had ketchup or bbq sauce, he mentioned that they did use some ketchup.  \n\nWe ordered 3 other dishes, biryani, lamb chili, and chicken karahi.  The biryani was not fresh - the chicken was sub-par, the lamb chili was OK - a little bland, and the chicken karahi was relatively the better dish of the night.  Again, there was only one other table that was occupied, so maybe they weren't prepared?\n\nWe went there because we were at an event where they catered food from there, and that catered food was much better than what we had at the restaurant.   \n\nNot going back there.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 1, 'date': '2011-02-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '_GVAV2LjUWEs9fGjslex_A', 'review_id': 'hudZlLORnvd9g5z6VKGN0Q', 'text': "This place has a great lunch buffet that run about $8.50... The food was excellent and the staff was very friendly and fast... I'll be back soon.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2011-02-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'z06IHGXI_ofBc2DkAbCgnA', 'review_id': 'X9H1vG-eSAejyq9-iegU9g', 'text': 'Great place.  I\'ve had the buffet lunch here three times now and have never been disappointed.  The naan is delicious, all of the lamb dishes are incredible, and the veggie curries are top-notch.  Everything is always fresh.   The staff could be a bit more attentive, but for $8.50 a head, who could possibly complain?  Having never dined in India I can\'t comment on the "authenticity", but I have eaten at several Indian buffets in the Phoenix area and this is most certainly one of the best.  Nice modern atmosphere too!', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2011-04-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'slJrbI92rtg04ybQmOiEcQ', 'review_id': 'QCX0tJkHeLJurEWN8q1Hvw', 'text': "No idea how authentic this place is but regardless, the food was good. The nan bread was a little on the thick side and chewy but everything else was very good. We had an assortment of appetizer plate which was nice plus the chicken korma which I thought was real good. The other thing we got was an assorted sizzling plate of various meats like chicken and lamb with veg tables served like fajitas. The prices were very reasonable and the service was good so that's good enough for me.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2011-04-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'vJkL15o_3W8_LBOTn6VBqA', 'review_id': 'GmhESbNxS_JhCRNV6B8eYw', 'text': 'We decided on a whim to dine here after ordering take-out the other week. My husband chatted with the owners and found they were from England, which they both had in common, and they seemed keen to have our repeat business. Translate: they know the English penchant for a weekly curry and they wanted us to become regulars. And I sooo wanted to, I really did. But Alas. Compared to other Indian restaurants we have been to, in England in particular, the flavors were just ok. The decor was better than your average strip mall location and was very clean inside. The servers tonight lacked quite a bit in the attentiveness department. On the one hand, they were quick to bring pappadams and an assortment of the usual dipping sauces, and the main entrees we ordered were delivered quickly, however waters were left empty and we had to remind the servers of a couple things we had requested such as eh-hem our Taj Majal. My advice, never stand between a man (my husband) and his beer, particularly when you are offering up some spicy dishes. All in all it was a good meal but certainly not my best nor most memorable Indian meal.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 3, 'date': '2011-04-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'F55sgaqHq2KE1LsixSKxAw', 'review_id': '6SetJYf9DurnDijaSxzX2A', 'text': 'Had a very nice meal in there on 5/10. Bengan bartha was tasty and the only poor part of the meal were the nan breads, they were not at all fresh. Good prices though and good service and Fullers ESB to boot!!', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2011-05-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'CgsVdvkEAC3aQnQEFOl2hg', 'review_id': 'RZNt_p4cWbXYRBaaAJx1CQ', 'text': "I've tried this place about 6-7 times so far.  Love it!!!\nI've tried the lunch buffet here with my family the day after Thanksgiving and take out is great.  The buffet variety is fantastic and different daily.  \nMy favorite dish here is chicken saag and i always request it extra spicy.  \nI love their onion naan and mint chutney.  i also like their raita dressing on salads.  I've always experienced wonderful service here.  They have always been really nice.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2011-07-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Ul6AkalZ_IJMdg27H9UPwg', 'review_id': '7TKVe6RW-irsfl9_UoWT4g', 'text': 'Ewwwwwww, so disappointed!!!  DO NOT EAT HERE! I truely think it is a heath hazard.  My wife and I were excited to try India Palace since we have not found a good Indian restaurant in AZ yet.  We read the great reviews on Yelp and went in expecting to have a new favorite.  We ordered the Somosas as an appatizer and they came out cold, almost frozen in the middle.  We had to ask for new ones, which came out steaming hot.  Problem sovled right?  Wrong.  Next we had the chicken tikka masala, chana masala, rice and riata (yogurt dip).  I was the first to find a hair in my rice and then a minute later my wife pulled a 6-7 inch dark hair off of her fork TOO!!!  The Chana Masala was bland, needed salt and the Chicken Tikka Masala only had about 8 small pieces of chicken, for $10!!  To top it all off, I used the restroom to wash my hands and they had no soap in the dispenser, only a dirty bottle of softsoap sitting on top of the dispenser.  Safe to say, we will not go back.  Even with the $1.50 yogurt sauce being comped due to the cold somosas, wouldnt you comp the problem item not the least expensive??  :(', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 1, 'date': '2011-08-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'A3r8QWYpddabr6ug8s_IwA', 'review_id': 'wjua6XvxmWXgok3iRsHnPA', 'text': 'We have been here a couple times food is usually ok, on our last visit we found 2 hairs in our food, one in the rice and one in our sag chicken... we will not be going back. I would not recommend.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 1, 'date': '2011-08-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'eXiHAxrnvE64j4wTEOTEMQ', 'review_id': 'aStN28IkxSCWXVJqWdGcQA', 'text': 'I used to like this place but unfortunately India Palace has slowly gone down hill. Waaaay down hill. Plus as I  learned, they have zero loyalty to their customers who eat there fairly regularly. Last night was the last straw. In fact my meal was like chewing straw and inedible. I ordered the Bhindi Masala which is a vegetable okra dish. I have had this several times before but tonight the okra was so tough that if I were to actually swallow it (rather than spit it out in my napkin-sorry gross but true) I guarantee my throat would have been scratched. Also our Roti bread was burned.Not once did anyone check to see how our meals were. When the waitress offered me a box for the uneaten meal at the end , I declined and explained the situation: I have had this dish before but it was like chewing wood shavings (explained it nicer than that) and she just said ok and brought us the bill with no offer to either replace it with another item or take it off the bill like 99.9% of establishments would do. So, they have lost our business and managed  to tick off a yelper over a VERY simple customer service issue.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 2, 'date': '2011-09-05', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 2}, 'user_id': 'Aaafbip-U2aeTXbvinBLiA', 'review_id': 'pM4LH-9QX201yHIrr3boJA', 'text': "Hungry at lunchtime? India Palace has a great Indian buffet for around $10 pending on your beverage.  Since it's a buffet, you can enjoy eating rather than waiting to be served.  Staff has always been friendly.  Besides the buffet, you do get a basket full of Naan bread.  It's a huge restaurant so bring your all your hungry co-workers!  Tandoori chicken is spicy and tender.  I do like the potato and cabbage dish, rice and the spinach saag.  Some of the reviews say it's not totally authentic, well it pleases my palate therefore I will be back!", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2011-09-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': '1FGW3CCgLZiXdj_jUw0dNA', 'review_id': 'Oesq9xGgWUkS9zjnW-pIRw', 'text': "Never really ate here in the restaurant setting. However, we had our food catered from this restaurant for our wedding. The food was really good. There were some dishes here and there that were not perfect, but who's perfect anyway? They still get 5 stars. The owner really listens to you when it comes to how you want your dishes to taste. Not many places do that these days. The quality of food at the restaurant is not the same. We did eat a taste-test at the restaurant and told the owner what minute changes we wanted made. The owner did mention that catered food is all freshly made to order which was great. They added extra paneer and chicken at our request. All our guests really did rave about the food from here. Would definitely recommend for dining in (as the restaurant food itself was still very good) and if you're having a party or wedding, this is the place to pick for catering.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2011-09-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': 'sBqEuMZAa6XXGNzfM4ogyA', 'review_id': 'NLuHyf_pMJdv5KvUN3ysaw', 'text': 'Definitely will come back again!\nThis and Tandoori Times 2 are super good Indian cuisine in this area.\nI was a little skeptical when my boyfriend and I were seated. Right away they bought 2 dips (I think one was cilantro chutney) and poori (thin crispy bread - almost like chips) and poured 2 glasses of water. Super tastey! But it took a good 10 minutes for our server to come up to us. I finally asked someone if we could order and he thought we were already taken care of. Despite that the food was really good. We ordered Raita $1.95 and 2 orders of Vegetable Samosas $2.95 each. Very yummy! I ordered the Vegetable Korma $9.95 so good and my bf ordered the Lamb Curry $9.95. I think the prices are really good for the food. We also ordered 2 orders of naan which were $1.50 each. Overall great Indian food for a good price - will def return!', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2011-10-01', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 1}, 'user_id': 'nr5-g3HCSidJ9fBoAP39jA', 'review_id': 'Ar7RHlRk0pIuyZ4iF0s6WA', 'text': 'Great lunch buffet. They have numerous vegetarian options and free chai. The food tasted great without being overly spicy. I almost had to eat at in n out and found this place only 1 exit away. It was at least as fast as fast food but significantly better food. I was very grateful to find this place!', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2011-11-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'eBi9f5_3BvnOO23F7w1Emg', 'review_id': 'THtXtxk2e1HoFLGMuyg0Eg', 'text': 'Sooo good. We had the chicken masala,  naan, and karahi lamb. The food was delicious, owners were nice, and prices were great. I highly recommend it!', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2011-11-27', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 2}, 'user_id': 'buHELZEJ-1KqQQI8_C8Kfg', 'review_id': '6SV-3aiDEk_RVVDKI5QJpg', 'text': "Too bad I had to give even one star.  This place is obviously in a very bad financial bind.  We had our living social voucher and were using it last night on our anniversary.  The place was eerily quiet.  There was a note on the door-they decided they were no longer going to honor Living Social, Groupon or two other pre-purchased coupons.  We went inside and there was no one in the place but the hired help standing around.  I asked about why they no longer honored the voucher and the guy said something in a very soft voice which I am assuming was a reason.  I don't care how good the food supposedly is---let this place go under which it will undoubtebly be doing soon.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 1, 'date': '2011-12-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'YaQWTJ5644fh2wZ66GhWTw', 'review_id': 'C789XyYMS6fVP1us53iEkg', 'text': 'Upon arrival I was surprised that there weren\'t tumble weeds blowing across the floor or the distant sound of crickets because it was a ghost town.  So expect to feel like you\'re being watched. The decor was a little much, but I guess it was "modern". ALSO, the food is not great as others may have said. I am a VEGETARIAN REVIEWER, so I got the veggie korma and a mushroom dish.  the veggie korma wasn\'t anything exciting. though the cheese cubes were not bad there were massive pieces of cauliflower and the most prevalent flavor was peas.......little spice.....no flavor......and the mushroom dish was terrible....but the roti was good and the service was awesome, yet these dishes made my insides hate me and I recommend that you should be wary once entering the ghost town of India Palace.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 2, 'date': '2011-12-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'UcHOd5cRwh0NTeqRvklzog', 'review_id': 'EXbZdpG2Mt_1e9Z2g9HNVg', 'text': 'Food is tasty; however, food establishment REFUSED to honor purchased coupon from Living Social.  DO NOT spend your hard-earned money at India Palace.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 1, 'date': '2012-01-03', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 7, 'cool': 3}, 'user_id': 'n_lAaNGeWgspbbCJc0DqRg', 'review_id': 'cJqNFa97hESo-lCVmFv5Ig', 'text': "Lunch boofay the other day with my brother and his coworker was one of the best tasting lunches I've had here.\n\nMy recommendations: \nask for Garlic Naan instead of plain, but be ready for fresh garlic breath all afternoon.\n\nGo several times, since the about half of dishes they have out vary from day to day.  I've discovered that sometimes I'm not a fan of the items, but have been glad to try new things, since I've also found some unexpected gems. (don't expect me to remember the indian name, though)\n\nDon't worry about crazy gimmicky coupon sites that just want to spam you all day.  This food is superb at the fair price they charge normally.  The owners are great, and staff is friendly and eager to serve.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2012-01-12', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 4, 'cool': 2}, 'user_id': 'm2T71nxPgzrmXi-cKE3U2w', 'review_id': 'Xw4IIaqjwBJWlH7ekwgabQ', 'text': 'This has got to be my favorite Indian Restaurant in the valley. Super clean and welcoming plus the staff is very nice. I went for the lunch buffet and it was absolutely delicious. The options include vegetarian and meat dishes that are well prepared.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2012-01-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': '_FU448lj8RUeTbMulGMZdQ', 'review_id': 'Qf1VvIhrHoPMgllkfqK_cw', 'text': "Went here because we had bought a coupon off of LivingSocal.com. First the service was lacking. There was only two other tables seated yet it took 10 minutes for someone to acknowledge us.  The food was mediocre tasting. The chickpeas were hard in the channa masala, the chicken tikka masala tasted burned and the shrimp in the shrimp kadahi was overcooked.  We ordered the food spicy and I found the food to be bland with just spice (heat). We did complain about the chicken tikka masala and they did switch it out for us.  The worst of it all was that they didn't accept the Livingsocial voucher. The manager gave us some lame excuse and claimed that he had a sign up stating that. It wasn't up that night for us to see. Frustrating!  I won't be going back.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 1, 'date': '2012-01-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'XaNWrqDedf2u-GT2aCOEUw', 'review_id': 'e3mUw7Hlx88GOL1ByAWc7g', 'text': "I love this place!  Though I will say I always get the same chicken tandoori (spelling?  Don't worry, they'll know what you're talking about).  Plan on drinking a lot of water if you order it hot!", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2012-01-31', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'pc8eP2wubvev2XnbZyzQMA', 'review_id': 'v8OPmxxUzp9f7kI06ffo4w', 'text': 'I am a pretty good judge of Indian food and this is probably the best Indian food in the valley.  I really like the restaurant decor which is unusual as Indian restaurants usually have awful looks to them.  The food is delish.  They even served Mango chutney without charge-love.  I personally get the butter chicken and lamb biriani and really really liked it.  The service is great when we go on a Sunday night.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2012-03-11', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 4, 'cool': 2}, 'user_id': 'DzD2p4Ec87NQvVwlpEdhJg', 'review_id': 'R9DCsG7c0ub5p0pgcDQW0g', 'text': "Came here for dinner and was satisfied with my meal.  At 8:30 PM I was the only one in the restaurant so that was pretty odd. I got some lamb vindaloo, garlic naan and a lager. The lamb was good but a little on the tough side and the vindaloo was nice and spicy as I wanted. rice wasn't included in the dish which was somewhat of a letdown considering the vindaloo itself was not on the bargain side of pricing. But overall the waitstaff was good  and the food was satisfying. Would definitely eat here again if in the area and needed a hit of Indian.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 3, 'date': '2012-03-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'ohRev2g3tvXpV3gBnhC-og', 'review_id': 'jeDPDqjkzRUU4o-aHioeBQ', 'text': 'Had lunch here today with fellow yelpers Arlin B. Norm R. and Rand H. The food was was all pretty good,but not as great as I have read in many other reviews of this place. There was a couple of dishes I did not like. The monkey balls did not have the syrup,and the veggie marsala had a weird taste. There are lots of Indian buffets in town and to me this one is just average. I will add that the decor is nice and our service was ok.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 3, 'date': '2012-04-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'lD-p9WrzgbE3dWcTBOYtIQ', 'review_id': 'm_uKJswe5ztsiylr6JIriA', 'text': "While not inedible, I don't think the flavors were at all authentic. We tried the chicken curry, eggplant, vegetable korma and tandoori chicken. Of these, the chicken tandoori and v. Korma were best. The nan was decent. The food, even at medium, is not at all spicy.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 2, 'date': '2012-05-02', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'n0M0KZlYM5FwB4j8_nFAlA', 'review_id': '1ej3gFV2PJQmzNGrlVRZzw', 'text': "My husband and I simply love this place. We have been patrons here for over 10 years and although the food is pricey since everything is a la carte, it is well worth every penny. The restaurant also offers a lunch buffet which we have taken advantage of once or twice, however, we mainly love their dinners. The wait staff is extremely friendly and attentive. I highly recommend their chicken tikka masala, the curry sauce is to die for. I also love the chicken korma, again fantastic flavor. You can order the dishes mild, medium or spicy. They have recently really ramped up the spicy, so it is very spicy indeed. Can't wait to eat here again soon.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2012-07-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'mmZk-DnajPfiCDu67CWrKg', 'review_id': '65mXdkaKhO50KyMtDndaOg', 'text': 'I have the lunch buffet here often with my daughter and with friends. I love to bring in new people to share the deliciousness of this amazing little Indian restaurant. The service is friendly and helpful and the restaurant is always clean. If you are not familiar with Indian food a server here will be happy to explain your options. I recommend this place to everyone and those who make it in are always pleased. \n\nMy favorite dish here is the paneer masala, but everything is wonderful!', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2012-08-30', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'OcR-H4PiO31PE5Pb5mqQKQ', 'review_id': 'srr6IXb0y4o8U7YOlpogTA', 'text': "I just moved into the area and am delighted to have tasty Indian options nearby.  I've been here twice so far, with different dining companions each time.  We've all been happy with our meals (definitely order the garlic naan *drool*), and they were happy to omit an ingredient from my dish per my request.  There is nice selection of vegetarian options.\n\nThe staff is polite enough, but the gentleman that I assume is the owner is very friendly.  They're open late so they're a great option if I'm desperate for good food at the last minute.  The restaurant is clean and nicely decorated.  Both times I've visited, it was rather late and there weren't too many other customers in. \n\nPrices are pretty usual for Indian food.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2012-09-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 's24elOQta2qQ6YPpbJu6Iw', 'review_id': 'NyxkAwhgO_wLAj57c2xVPA', 'text': 'This place is really good!  For years it was the only Indian Food resturaunt my boyfriend and I would eat at, we have recently moved to Scottsdale and have since found another place, but if ever near bell and I17 again- will def go in for another visit.  I once had food catered for a birthday party from here and it was great (not too pricey either).  Once they forgot to put rice in our to-go-bag and when we went back for the rice- they gave us a complimentary rice pudding for the mistake.  It was well appreciated.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2012-10-04', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'WESBNCIvswTWh-Ak2uGf4g', 'review_id': 'sxL6fVyhpExqFd4eOioP6Q', 'text': "4.5 stars!\n\nSO FAR (I've been living here two months now) this is the best indian food place I've tried. Makes me wonder why the reviews are so average for this place? The service is so-so but the food was great! Had the tadoori chicken plate on a bed of onions and bell peppers, lamb curry, and garlic naan. Chicken was perfect, moist on the inside and had a nice grilled flavor. Lamb curry was perfectly spiced with tender pieces of lamb, and the potatoes were a nice touch. Naan came out hot, crispy and garlicky, great for dipping into the curry. Mango Lassi was not watered down and was the real deal. I actually had to ask for extra ice to dilute it because it was so thick, yay more lassi for me!\n\nPrice is pretty standard for a indian restaurant, but I'd want to come for the lunch buffet and try out some other dishes (chicken tikka masala, biryani).\n\nCan't wait to come back!", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2012-10-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mmZk-DnajPfiCDu67CWrKg', 'review_id': 'LHHopMcD13gi9RyHYpB9AQ', 'text': "In the past few months, maybe since September 2012, this place has gone downhill. The quality of dishes served on the lunch buffet is not the same as it once was. Because I always make it a point to eat here during lunch this is a huge issue. The difference has been noticed by several people that I dine here with who now refuse to eat here anymore. The first time I noticed it I thought maybe they were just having an off day. I came in for lunch 3 more times over the past few months with other people because we were in the area but it was unmistakable, the food here is not nearly as good as it used to be. I noticed that there is one gentleman that always worked here that is no longer here and I suspect this has something to do with the change. I truly hope the food gets better, but I won't be back in to find out any time soon with so many other options nearby.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 2, 'date': '2012-12-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'OcR-H4PiO31PE5Pb5mqQKQ', 'review_id': '8WCeNfv-TX73L6rzG_ZfvQ', 'text': "Came back today and was very disappointed.  I forgot to order rice, but my veggie meal with garlic naan still came out to nearly $15.  Of course, the naan disappeared fast, so then I had nothing to eat with the rest of my baingan bartha.  Which was unfortunate, because it was extremely salty - as in, I can barely taste anything but saltiness.  \n\nWhat happened?  This is my usual dish, and it's always been yummy before.  Looking at the reviews, it looks like a few others have noticed a decline in quality over the past couple months.\n\nConsidering the price I paid and the fact that I won't be able to finish my meal, I feel pretty ripped off.  I doubt I'll be back.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 2, 'date': '2013-01-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4CgusCZkipvUhvBZrRD46w', 'review_id': 'ZKOj1VsTzZuHlBf6Yb2tjw', 'text': "So sad to report that my favorite indian place has declined to the point where I will NOT be returning.  This was my all time favorite place and my husband drove the 19 miles to get there because we could count on a good meal.  I think a good restaurant is worth the drive.  Unfortunately, I will not be returning.  Can any Yelper recommend a good indian restaurant in Phoenix/Scottsdale area?  I don't mind driving.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 1, 'date': '2013-02-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'mVKUH3FfBKE9qm4Xd6pIGw', 'review_id': 'Dqc9FX-rGrJMxXSdyhbukg', 'text': "We've eaten at the best Indian restaurants in major cities like NYC and San Fran, and this place is a hidden gem in Phoenix.  The food is amazing, authentic-reasonably priced given the high quality ingredients they use.  The women that run the place treat you like family and are simply delightful.  It's non-descript location in a strip mall could be easily overlooked but definitely should not.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2013-05-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'OjPIIkeQF9umjTzEHR_BHA', 'review_id': 'Z7fPGcP8XWeiB2lAf8abLg', 'text': 'Great people - perfect food!\nThank you!', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2013-05-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'P_P1G0hZEp8Jg4arZaAJxA', 'review_id': '_CflgLmmX9X7cIODHoyeVw', 'text': "This place was awesome. It is back in the corner of the plaza, and potentially easy to miss while driving by. Boyfriend and I came in about 11:45 am Sunday looking for some lunch. After brief deliberation we decided to do the lunch buffet. \n\nWe tried a little (or a lot) of everything they had out. They also provided a basket of naan, which was refilled when we were out at no additional charge. All the food was hot (minus the cold/dessert items, of course) and tasted good. \n\nThe women working that day were extremely pleasant and helpful to us in making a decision on what to have. Neither of us are experts on Indian food, so it was great to have someone willing to explain what everything was and make suggestions. They were also very good about making sure we had enough to drink and promptly removed our empty plates when we had finished our food. The inside is kept very clean and is nicely decorated.\n\nNot sure what the people are talking about who said this place was closed -- it is definitely still open. \n\nThe only annoyance/confusion we had was navigating through the parking lot, which had large sections closed off for resurfacing. This is obviously only a temporary situation so it's no big deal.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2013-05-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'r9MwRHUxISubGVLE3n7WgQ', 'review_id': 'Qg_V_2wB8jn-Egi-jjRLrA', 'text': 'Impossible to take pics of this food since as soon as it hits Our table we inhale everything.... BEST INDIAN FOOD EVER, Great prices, always has a groupon for 4 bucks off (buy for $4 get a groupon for $8 off order,,,)  CHICKEN TIKKA MASALA (now I can die knowing I have tasted heaven)', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2013-06-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'Wh5pL_iTBOj3R4W7cJWEkw', 'review_id': '0-NoQeEzpTCMCTJ5BH7O-A', 'text': "It's probably not fair for me to review this because I'm really not a big fan of Indian food so it's probably better than what I'm giving them credit for. Oh well.\n\nMy friend and I came here for their lunch buffet. We were seated immediately by a nice lady. And then we went to do some damage. I don't know the names of the dishes but I really liked the mushroom masala and them tandoori chicken. They also had a spinach dish that wasn't too bad. As for the rest, it was eh. The food was spicy but not to where you can't eat it. I have been to some Indian restaurants where I wasn't able to eat because of how spicy it was. The bread, naan, was freaking amazing! i was eating it alone. thats one of the main reasons i would go back here Anyway, the desserts were limited. There was rose pudding which was a little too thick, some other type of pudding which I called feet pudding because that's what it tasted like. And there was the gulab jaman which is this round ball of cake that's soaked in gods pee because that's how sweet it is. I felt myself becoming a diabetic immediately after eating it. \n\nPrices were cheap. Service was ok. I'd probably go back.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 3, 'date': '2013-07-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'qDAA2cyOGanV5Z_vP4QS1g', 'review_id': 'drn-NPppsxd3JZIlHzC6gw', 'text': 'We really like this place. We have only been here for the lunch buffet ($9.99) and it is always really good. Some days are spicier than others (we prefer it spicy!) but they always have a nice choice of items.  The garlic naan is our favorite part..it smells so wonderful when they set it on the table!\n\nThe waitstaff and owners are very sweet and friendly. They are right on top of the water, which we really appreciate!  The place is nice; not over the top fancy, but not divey either.  They do a really good job on checking on us to make sure everything is fine which too is appreciated.\n\nThis place can be hard to find. It is tucked in the corner of the strip mall. The Good Egg moved out and is now replaced with US EGG, so look for this place on Bell Rd, and India Palace is right down the way from this.\n\nWe are definitely a fan of India Palace.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2013-08-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ihvoGlLIc0JZR2A-ZpMTxA', 'review_id': '-4qzO7gnvaNfw2DI2VbTEg', 'text': 'Service is good, staff friendly and food was delicious! We went at dinner time, but at lunch time they have a buffet!! Try it st lunch so you can taste all the flavors. Great find.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2013-11-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fg9LctYzhlgN1omONTFPyA', 'review_id': 'jXEPFWr29ZpWCJZtI1e4Mg', 'text': 'Best indian food we had! Ordered three different lamb dishes - all great. Papadam is wonderful, not too salty. Service was very good. Our waitress gave us suggestions for different dishes and all were right on. Definitely will be back and suggest to everybody to try this hidden gem!', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2013-11-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Nyv8xJJd6ObzkIBBVqIT6Q', 'review_id': 'CrtTH1CapnxSsGKaGIqo9Q', 'text': 'The food is amazing; complex spice and always prepared perfectly. The staff is amazing and the prices, although not cheap, are not bad at all. Easily my favorite place in the North Valley.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2013-11-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vPEjwADjt-ZRw6swdMf7EQ', 'review_id': '0Yh07kjK-nMtz_lum1qK8A', 'text': 'First time coming here and LOVED it! It is very clean and authentic. We were quickly served and our waitress was really nice. We started off with the fritters (came variety of dipping sauces) mango chutney, sweet tamarind, and two others that were also really good. Also had the garlic naan -yum!!! For main course I had the medium spiced chicken vindaloo. The only downside is that you have to purchase rice separately (thought the dish comes with automatically) but other than that it was delicious! Definitely will be back.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2013-11-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'd32U_cG9yOc8m8SwBYBCNg', 'review_id': 'Bc5VcN8DBNnqGu2MK13OUg', 'text': 'Make food Indian way but do not have a clue about flavor or the way some things are cooked.. Tried it couple of time but was disappointed', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 1, 'date': '2013-12-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Av-N3ZuDo6t9GACXvEXHmA', 'review_id': '2Idw_M1s8IeP0v1ab1_TgQ', 'text': 'Excellent lunch buffet.  Amazing food.  Great service.  Clean.  Reasonably priced. Kids had never tried Indian food until today and LOVED it.  Will definitely be back!', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2013-12-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'xm47wfTVHLq8-72HR5nPmw', 'review_id': 'sLQwjU81lwJ75qyrNUnXfA', 'text': 'Best Indian food in Phoenix. Originating from England, I have experienced a LOT of Indian food and am a fan. India Palace makes some great dishes, LOVE their Bombay Aloo, staff and friendly, atmosphere is good.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2014-01-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BK2r-60FMUlxq4X-ICP3Mg', 'review_id': 'ysKOcWG_P9PJh45pnADmPQ', 'text': "Great food. Great service and friendly people. I'll definitely be back. The lamb curry was my favorite.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2014-02-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Cnz5MG6ei6EFotekIvMJHA', 'review_id': 'bxzgrgpWiVJgfUZ6SDfBtw', 'text': 'Best chicken Tika masala hot you can find and I dated an Indian boy 15 yrs ago and was introduced to the food from his mom and take away in England. Thank you India Palace!', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-02-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PtGzpgWFu-Ns9Bz0YthHdQ', 'review_id': '-koSUdFP5L0ZwnEJSK07_Q', 'text': 'i have read the review that lamb curry is good and went for it..I went for pick up for a lamb curry and dal.I felt very bad after picking this to home.. i thought it was curry ,but with piece of  mutton with just  little curry .I think they just dumped all the leftovers as i was the last customer there. The curry was not good at all. Even the dal was not tasting good . I would never repeat here.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 1, 'date': '2014-02-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rnqv2DT-yo0HRIn6VOZ5Gg', 'review_id': 'bo7a8x8xuWJdUTUAaYOFgA', 'text': "Ordered here for the first time and we had madras lamb at least that's what we ordered... Anyways it was take out so I guess they messed up our order and gave us beef instead of lamb. I really wanted to like the place since it had such good reviews but the taste just wasn't to my liking. This could have been due to the disappointment of eating beef instead of lamb, but the madras just didn't have the same balance between the spiciness and the coconut that I've tasted at other restaurants. The naan bread was the only plus.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 2, 'date': '2014-02-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Bmzq_nkjYqp8aWn12RJdhA', 'review_id': '1_2smgWZruuuz8LUm-c63g', 'text': 'Wow, really great meal from the buffet that I had here. Service was great!', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-02-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qDAA2cyOGanV5Z_vP4QS1g', 'review_id': '0YBWrmg5FuzSG-t3Aow5CA', 'text': 'Love, love, love this place. The staff is so set and nice! Always happy when I leave.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-02-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Yoc-nNfQ_FutnQXbuaCHvw', 'review_id': 'Za96LEn0Nslm_nUSRbBndA', 'text': "This place is open pretty late. Tucked in the corner of the center, India palace is a good place to go to for Indian food. I ordered the chicken tikka masala plate with a side of rice. The rice is well cooked and the spice in it is very fresh. The chicken tikka masala is different from the usual ones I've had. It's sweeter and the part of the chicken is different than the chunks you get elsewhere. It's very soft and retains the taste of the chicken well. \n\nThe sweetness is kind of odd but it is interesting. I don't have a big sweet tooth so I would prefer it to have had a stronger spice taste instead. That being said, the sweetness did complement the sauce well. \n\nPros: \n- They give you a lot of rice. \n- You can choose how spicy the dishes are. I love that. \n- It has a really good Indian feel to it. It doesn't feel fake or a front. \n\nCons:\n- The fans!!!! Holy Molly.  The ceiling fans spin around under the lights. So you have a shadow of the moving fan moving in a strobe like effect. Gave me a headache. \n- Not really a con but could be annoying to some: the TV was quite loud and distracting with Indian music videos. I don't mind myself. I feels like it gives it a homey vibe. \n\nBottom line:\nGood food and wonderful service. They came up to my table just enough time to show me that they were attentive without feel like I was being smothered. Honestly it would be a five star if it weren't for the strobe light effect. It's not just good you have to take into account but the surroundings as well!", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2014-03-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vAQRCkPTbZATOzZyD33nzg', 'review_id': 'wZuZyhUW-DqHw-LHf185iw', 'text': "We are from Salt Lake City, UT and wanted to take our host out for Indian food.  He never tried it before, and he really enjoyed it!\n\nWe ordered samosas, garlic naan, chicken tikka masala, chicken coconut korma, and saag paneer. The favorite at the table was the masala followed by the coconut korma. The saag paneer had a bit too much spinach flavor and not enough of any other flavor.  I love the saag paneer at Bombay house in Salt Lake!  \n\nThe rice we chose was the one with onions, peas, and cashews. If I lived here and visited again, which I would, I would choose the plain basmati.  \n\nThe atmosphere was nice as well as the server.  She was very helpful and gave suggestions.\n\nWhat I really appreciated was that when we arrived, an Indian family was leaving, and while we ate, two other Indian families arrived for dinner.  If they like it...it's where I want to eat!\n\nOverall, a nice place with great food. I would return. If you visit Utah, try Bombay House!", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-04-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'EvLjGCcQ2gXyRqSWJ8NT_Q', 'review_id': 'AlamYHCsFZJE0gkpPRjRZw', 'text': "I was just here yesterday because Tandoori Times was closed. I was disappointed about it until they brought out the food. The presentation was lovely! The paneer tikka was sizzling and gorgeous. The paneer was a perfect level of spice and unlike Tandoori Times, not dry. The veggies in it were delicious and juicy and crunchy. My mother ordered the paneer masala, which came out looking just as good. Medium spice was perfect and the peas and bell peppers in it were abundant and delicious. The waitress had a vibrant personality, very helpful. The entire restaurant was empty, that was surprising for 6pm on a Monday. It is rather large, nice atmosphere, weird Indian videos on the tv. Oh and the Chai tea is superb.\n\nI'm eating my leftovers right now as I write this. Still good! Highly recommend this place.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-04-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bkOG20eXhoS0qTEyjP_nUg', 'review_id': 'wZlJH-OQxuNdxbBxknlZzw', 'text': "Was hesitant at first as I don't have great experiences with (Indian) buffets. Went for lunch, the staff was friendly and had a smile,   Something the Indian restaurants usually lack. Food tasted great AND...Fresh! They keep refilling small portions, so it stays fresh.  The chicken curry and the lamb curry were really tasty! Only downside on our visit was that we wished they'd check on our drinks more, that would've made me rate it 5/5, but thats no big deal. Price is I believe 8.99 a person. That is a GREAT deal. Added this place definitely to my bookmarks. Will be visiting again soon.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2014-04-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6mDVrmm7Wp0NMijWbRHpjA', 'review_id': '9OyQuShaUCrIdboe-tNIdg', 'text': 'By far, best Indian food anywhere. We drive from fountain hills to come here. Staff is friendly and knowledgable. Lamb, lamb, lamb and more lamb. Try the curry, saag, and vindaloo. Try them all.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-04-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QPwTjDdnuivTaFz8vkYoWA', 'review_id': 'EJiyt9fB1dAsCM4-FZoyAA', 'text': 'They have a great buffet for $8.99 and open till 3pm. The ambience is great and the staff are very courteous will definitely visit the next time', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2014-04-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'Cnz5MG6ei6EFotekIvMJHA', 'review_id': 'RUy4CA1i3Wx8uhohjbVXTg', 'text': 'Never again. My husband brought me food home the first time. He told me they got food off the buffet but I didn\'t realize the buffet was closed! It had just been sitting there. Well, this time, they did the same thing. Hubby\'s plate was dirty and he told them ( the place had 2 other tables on a Friday night) and the lady took it and walked over to paces and washed it with a dirty rag she was cleaning with and then gave it back to him! We bought samosas ( served over a tiny big of ragged brown white lettuce) and three other meals plus rice. After the Appetizer, when we asked for a new plate, the English lady said "we don\'t normally do this but okay" . THANKS! And they don\'t give free refills on any drinks, even coke and iced tea! I spent almost 60 bucks there, paying extra for rice and nan bread. The food was good but I hope u go under just like the place I heard the English lady ran before. You deserve to go under. U don\'t know how to treat your customers. I wish I wouldn\'t have given you a tip. Shame on you. 60 dollars for that service. Goodbye.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 1, 'date': '2014-04-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kmLjttqFkbvwaxQ51PyFRA', 'review_id': '4leDjcXnB78DJPsaVs1Eew', 'text': "I was very excited to order from here.  I am giving a low rating because of the service used to deliver my food.  AzMealMan.  I ordered my meal and it was delivered; after the girl left I noticed that I was missing a dish and there were no eating utensils or napkins.  I immediately called Azmealman...already closed.  I left a voicemail and I even wrote on the facebook page.  They responded on the fb page by telling me to call...which I already had!!!  I called again tonight.  Nothing yet.  OH...and now they don't allow comments on their fb page.  So.  Two things....missing dish, no eating utensils, no follow up, no facebook posts/comments from public...thumbs down.  AS for the food I did get...it was ok.  RIce with peans/nuts was generous and tasted good,, tandoori mixed plate was good...and there was alot of it.  The naan was not worth $1.50 at all.  In fact...it wasn't worth the $41 at all.  I might try it again by actually GOING to the buffet...perhaps I can recoup some of my losses then.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 2, 'date': '2014-06-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Jke6FOn6K6WQ8DI_WvjFnQ', 'review_id': 'F8HL2DzSWZtYXQGjGMuL6A', 'text': 'Amazing food!!!! We had the chicken misala, butter chicken, and beef curry. We will definitely be back for more.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2014-07-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '75PeeOPFu-DKEZJWfQ7LqA', 'review_id': 'oTBRS07ZY9LNKP4BZIDAkw', 'text': "This is the closest indian place to our house so since we are new to the area we thought we would give it a shot. Let me tell you, this place did not disappoint! I had chicken korma and he had chicken tikka masala. We also got vegetable samosas and garlic naan. The food came out promptly, the decor was beautiful, the restaurant was clean and best of all our server was an absolute delight! It is in the back corner of a strip mall so don't be deterred when you can't see it from the street! It's in the same strip mall as US Egg. We definitely will come back and eat here again.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-07-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mQOIeSTOlsTRKTVWLyFsSA', 'review_id': '3Sa6wJBV-J9t4-XvqTfWtA', 'text': 'Heaven on earth if you like Indian food.\nBeen going here 5 years for lunch and dinner.\nBuffet is super, ask for garlic naan.\nTandoori chicken is the best around.  They\'ve been consistent in their food since I"ve been coming here.  Not worried if the buffet is going to be cold (other Indian buffets I\'ve had have been cold or cool, the food hasn\'t been completely heated)\nINdia Palace is Amazing, fresh, yummy, a kaleidascope of flavors.  \nThese guys get 6 STARS.\nThe anise seeds at the bar/cash register is to aid in digestion and/or bad breath, and yes, it tastes like black licorice. It\'s very strong.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-07-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jAbMoSzOg4obtFzFKP9JKA', 'review_id': '7K8vBh0E_E5_PoeTQ3px5g', 'text': 'Excellent food!  We had the pompedoro, chicken tikka, chicken tikka masala and beef korma.  All the meat was delicious and tender and the naan was excellent too.  Great service!  We will definitely be back.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-07-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DeEl8Wv1AF8oFTBKazp5Mg', 'review_id': 'qH-rgwaKA-sQfuVnS0YwqA', 'text': 'We have been coming here for three years and the food is always amazing!  everything is delicious and prepared deliciously!', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-08-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tFwk-OIlS4mOAjW4QRhRgA', 'review_id': 'PcCkTz0EIe0GYWz2fRhfDQ', 'text': 'Love love the food, the services super nice and the favors right on.  I suggest you guys try it out.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2014-08-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UHz42Lqwadin2L2wj5MuEA', 'review_id': 'XQ0vL7PqUu3Wm3SqkChHMw', 'text': 'Great food here! I enjoyed the Lamb Korma and of course a cup of Mango Lassi. This place is a good place for groups. They also have a lunch buffet 7 days a week. Oh, and great customer service!', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-08-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QCmeUHsVaFsPTmVG8uVJBw', 'review_id': 'E4K-TJ0NVmuKZVukoVcMuA', 'text': "I would give it five stars but for some reason I can't turn the star rating portion on.  But it's worth of FIVE STARS in our book!!!  The food was marvelous and the leftovers that we ate for two days were just as wonderful.  If you like Indian food you do not want to miss this place.  The servers were gracious and helpful, the iced tea was yummy, the meal was simply to die for, and even the rice pudding for dessert was a wonderful treat.  I'm sorry it's taken us so long to try Indian Palace but believe me, we will be back!  We highly recommend this delightful place.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-08-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'NjcHcAq5iT-7B-Ka_WLKgg', 'review_id': 'Gti-8u2760uQdFj5Mq0RRg', 'text': 'My husband and I have tried a lot of Indian food restaurants and this is by far the best.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-08-07', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'bswV-wIGU9Bw4mbxSPdykg', 'review_id': '1J7_ntAmOAdBYGrQbx8Vsg', 'text': 'I needed spicy food after returning from some travel to a location with bland food.\n\nI went back to India Palace upon my return two weeks ago and was impressed by the improvement from solid good to very good across our favorite dishes (chicken tikka masala, lamb biryani, lamb vindaloo and chicken curry).\n\nToday I picked up carry out expecting a similar experience but was surprised that what had been good to very good now was great to amazing.  \n\nThe chicken tikka masala was the best I have had in years.   My lips are still burning from the spiciness of the lamb vindaloo which was just the way I love it; very, very spicy and flavorful.\n\nI do not know what the difference is but India Palace has impressed me, a long time customer. \n\nWhile the biryani was not as spicy as the lamb vindaloo, it was the most flavorful biryani I have had in probably ten years.\n\n\nAll in all a splendid experience.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-08-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tacn4MVqL1P-AJbEQohOMw', 'review_id': 'BatpZ3YVf8Nfe0dkS7jKDw', 'text': 'One of the best indian food Ive had. Even better, its all you can eat. The garlic naan is delish! Every item in the buffet line was delish and fresh! Only Indian restaurant I visit in AZ.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-08-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Y7pxAbYxakzFh_nOFGWyhw', 'review_id': '8CoNgiZfAqknRlq5_NJ78g', 'text': "This place is great. Why? Simple:  the food is consistently delicious, the people that work there are gracious and friendly, and the prices are reasonable. It's my favorite Indian food restaurant in Arizona, hands down.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-08-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'dw-0cmGg8vM6M5Pd7kBhCg', 'review_id': 'ivrWlV_nVourdqdOdB6oEg', 'text': "Wow is all I can say! If I ate there the previous night, dreamt about the food, and woke up craving more, that should tell you just a little something about the food there! Had the Aloo Matar and the Chicken Tikka with basmati rice,  I literally was scraping my take out box for the remaining sauce like a fat kid who swears he sees just a little bit of cake batter still left in the bowl. Didn't get delivery, got take out. Everyone was super friendly, it was quiet in there, but then again it was like 930 on a Friday night. I will most definitely be going back there, maybe even tonight, you don't know! Well I'm sure you'll know, as I'll write another review. Derp!", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-08-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QE_Swh76QFdzRQpYf2Jz3Q', 'review_id': 'GpRoVtJuYEEOmvRcsyHXDw', 'text': "I love this restaurant! It is my absolute favorite Indian restaurant in the Valley and I've been coming here for years! Very friendly and always accommodate my crazy requests. They have the best naan in town and I haven't had a dish that I wasn't crazy about. It is a little far for me, but well worth the drive!", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-08-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JCX9zQDIXubEHGBDtj551Q', 'review_id': 'eXawy1I-_siyK67amnhbUA', 'text': 'I LOVE this place! The food is varied and the flavors and quality always consistent. I always tend to lean toward anything vindaloo with extra spice but have tried other dishes and they have always been excellent. The lunch buffet is awesome too for $9.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-08-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Wmozhe28Jeyw4vHlud2aFA', 'review_id': 'YvGTfnbefiGYgmP_u98HLw', 'text': "I enjoy this place regularly. Food is always excellent. The staff is attentive and very pleasant to chat with. The lunch buffet is $9 and has many selections that are all delicious. I've tried many dishes and they are all awesome. Vindaloo, masala, chicken korma. Garlic naan. Love them. Glad I found this place!", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-08-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'NlHI2lMyLFGxGsohRlBWwQ', 'review_id': 'EKP0xSF5bqnPi4HffRrkYA', 'text': "While they do have a few meat dishes I have to say as a vegetarian this place is awesome. I've been to Indian buffets in the surrounding area that have a larger selection but this is quality vs quantity. I do enjoy the occasional dish that sets my tongue ablaze but this place uses the flames in moderation. Great customer service, atmosphere and most importantly the food was delightful. A pleasant experience that will have me coming back for more.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-09-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'eaYqU5Jky2gJyV93mo6CZw', 'review_id': 'k96YpzjBOJ5TCRdniTWLqA', 'text': "First time - won't be the last!\n\nI like to rate businesses according to their competition, what you would expect there, or other comparable businesses. We decided to try India Palace because of the Yelp reviews (don't know how I didn't find this place sooner) and I was REALLY in the mood for some Indian food and (thankfully) my boyfriend has begun to appreciate it more and more so we decided to try a new place. I had only been to 2 or 3 other restaurants in the Valley since I moved here and I thought I had found my go-to...well, turns out, I have a new one. \n\nWe learned that this was a new location for the business, that they had moved recently from a location they had been in for years. We thought it was decent, well decorated, we were comfortable there. It was really slow and we wondered why, but whatever - better service for us eh?\n\nAnd it was! Besides the food being SPOT ON - the service was so attentive, personal and friendly we not only had our tummys warmed by the culinary loving but also our spirits by just having some nice conversation with our server (whom we didn't get her name but she had just moved to Phoenix from Flagstaff where she worked for their location there which we are definitely making note to try next time we go up North!). \n\nFor our visit, we stuck with some of my usual Indian faves - Shrimp Curry (medium heat) w/ Garlic Naan and Basmati rice and then the MIXED TANDOORI GRILL (OMG, best I have had, served on a sizzling plate with vegetables and onions, tender and not dry). We had a little RICE PUDDING with some INDIAN TEA to finish which was a perfect combination. \n\n(Sorry, I CAPITALIZE the food I had/recommend for the skim-readers.)\n\nWe cannot wait to go back and bring some other family and friends who want to try Indian food, probably try the buffet!", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-09-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'F9IxNNFDAHvl2RBPSdQx7A', 'review_id': 'jDzv-BkwpLkkCRZRLv7m_A', 'text': u'If you are looking for Authentic India food, then this is the place you want to eat. I had a great experience dining in, as not only you get excellent Indian food but the restaurant has great staff and a beautiful d\xe9cor. Everything served at this restaurant is extremely fresh and hits all your taste buds. I recommend having chicken tikka masala, mix grille platter, palak paneer or paneer masala. Ive been to other Indian resturants in phoenix area, but the service, food and the whole dine in experience at this place exceeds any other in competition. I give this restaurant a 10 out of 10 for great service and food.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-09-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'livoX869fKCaDrBFbxqxNA', 'review_id': 'RppgfuoRuIwoLZsNccEt9A', 'text': 'Have been coming here for years. The food is consistently great as well as the service. Palak Paneer is one of my favorite dishes and I have yet to find a place that does it better. Even got my wife to try it!', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-09-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qaCjZrVXKXYPUMCVKsd2HA', 'review_id': '71BLoHz7t0P1j4k2NSBo7g', 'text': "Good food good service  :-) Will go back when I'm craving Indian food. It is buffet so you get rice and a bunch of toppings. They have a small salad selection and rice pudding with sweets. Staff were very attentive.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2014-09-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JwAwswVYDklU1IiGc7ikfg', 'review_id': 'flvsupsLC86HCF4JLIeUBg', 'text': "My wife and I have been eating with Manjinder and his family for about 18 years and we love this food, their garlic naan is delicious. And the variety is awesome. There chai tea is always available with the meal and we love that. They always have a friendly smile and welcome. And I think it's important to note that in 18 years we have not gotten sick at this restaurant even once. And I mention that because I have had food poisoning from a number of other places. I hope many more folks give this place a try, you won't be disappointed.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-09-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'Uiq7P5GWIL5Wk8S5tsY0SA', 'review_id': '7VlkE3d4nOvjNBRwmE09kA', 'text': "We have been eating at India Palace for about 12 years. They have fantastic food and we haven't found any other Indian restaurant that even comes close. They are open every day and offer an excellent lunch buffet as well. The staff is always friendly. Try the Chicken Tikka and Paneer Masala along with some garlic Naan.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-09-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dIF2pPsztYwaQ9w5IqiIrQ', 'review_id': 'EpZDimy-OVA17eC39sDrqw', 'text': "We came here based on the reviews and we weren't disappointed. I was a little worried at first because the buffet wasn't that large, but I shouldn't have worried. When I first sat down, they brought water and naan right away. The people there were so nice and service was great. I tried almost everything on the buffet. My favorite was a smoked chicken that I can't remember the name of, but it was so good. Everything was so flavorable. This was our first visit but not the last.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-09-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qrP-3Esz736WEdffc_Ny8g', 'review_id': 'CbdbnHLq9fp1nRIjGI1NcA', 'text': "Best food!!! Staff is so warm and friendly! I come here all the time and love bringing new people with me also!! The secret thing to get is the iced tea!! They brew black tea with cinnamon, clove and cardamom.... So amazing!!!! Can't say enough wonderful things about this place!!!", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-09-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wNr9WSj2ZC0S2KPNgm8vpg', 'review_id': 'ih3PE0cHvFiOvi0mhC0RTw', 'text': 'The food is amazing. It feel like in India and the best part is that you can order the meal mild, spicy or super spicy and they will do it for you. Totally worthy and succulent', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-10-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'T9oVkcc76ZzLZw3rRhmruw', 'review_id': 'HRqkIAW0ZFz0GfjwlkyDog', 'text': 'Unbelievably good Indian food with warm hospitality. Try: samosas, malai kofta, mutter paneer, lamb vindaloo and the amazing rice pudding (kir)!', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-10-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'RE4eKnsR7MxclhYu-d7ksA', 'review_id': 'O_2xj37SnU3F5v_1otuTbw', 'text': 'This place was Amazing! This was our first time and we were so pleased. The food was flavorful and unique. The beef and chicken was so tender and so well cooked. The sizzling plates of food make you taste buds water. This is a place we will come over and over again. The staff was so helpful and kind. Great experience!', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-10-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'sDRoUZ6-6ag7t-estkVmkQ', 'review_id': 'HRtRwqXkoB3ZUd7i5oR_2w', 'text': "First time here for lunch today.  Definitely coming back.  Great buffet.   Good food. Not greasy or oily at all.  Nice selection.  Clean.  \n\nJust wish I'd found this place ages ago.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-10-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Tn3oXnMcJDIXyoEuy58rfQ', 'review_id': 'nZnTPU7lnGp5WivtHwbqmA', 'text': "I'm upset that I have to even leave 1 star because my experience doesn't even merit that. But I was incredibly disappointed by my visit. The reviews were great and I was excited to experience the buffet. It took me all morning to decide if I wanted to go to my normal Tandoori Times 2 or if I wanted to try this place. Well the reviews were great so I made my decision. Unfortunately it was a bad one. \n\nMy son and I arrived for lunch. We were greeted and shown to sit at a booth. We sat down and waited... and waited... and waited. We waited approximately 15 minutes while we watched the staff not help us. No water, no service, nothing. I wasn't exactly sure if we were supposed to just go to help ourselves at the buffet so I waited and observed another table that just arrived and was seated. Nope sure enough they were given water and menus!  I was astonished that we were completely forgotten so we just walked out. \n\nNormally I would say to give a second chance. You never know what the true circumstances are. But how can you after being completely ignored and forgotten?!  I really don't think I'll be returning.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 1, 'date': '2014-10-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'okavoz-MCZnHgX7hYDedzg', 'review_id': 'FO8_hXRARQJac7ridB6PaQ', 'text': "Fantastic food and service! I have multiple food allergies and my server went above and beyond with helping me choose food from the menu. She was amazingly attentive and helpful! I think it's the same waitress that was mentioned in another review, a relatively new server for the restaurant who had just moved from Flagstaff. I can't remember what I ordered, but I had a total of 3 meals (two were takeout for later in the week, I was traveling for work and didn't have access to a kitchen) and everything was outstanding!!!! Fantastic flavor and spices! I can't explain what a relief it is trusting that my food has been prepared in a way that won't make me ill...it frees me up to enjoy my meal in a totally different way! It feels great knowing that my dietary restrictions are truly understood and being met. It did take a while for the food to be prepared, so it might not be a good choice if you're in a hurry and it's not buffet time. But if you do have the time, it's DEFINITELY worth the wait!", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-10-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9yYQXeSALR17vAXjpOPRkQ', 'review_id': 'HuPTFWfA3_Ncvc15O0cW_w', 'text': "India Palace has an authentic atmosphere that never feels too loud or cramped. The food is fantastic, portion appropriate and deliciousness renditions of all types of cuisine from India. Though it is a simple gesture, I absolutely love getting complimentary papadom and sauces with every meal, and then their rice is amazing (I don't even like rice) with a refreshing touch of cumin. \n\nThe staff and hostess are always incredibly friendly and personable.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-10-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3WbEqfm35B93itMxz1tMbQ', 'review_id': 'OgGSqmCQkfSB6UBFJCTkrA', 'text': "Soo many good things to say about here, they are an established restaurant, the cooks are actually Indian and know how to cook Indian food, the staff are super friendly and most importantly the BEST Indian food my husband and I have ever eaten(this is out of the 3 major cities we have lived in)  Good flavors and good selection.  Delicious.  Go soon, you won't regret it.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-11-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '83c8TUcYRBBo7zgiUOhPaQ', 'review_id': 'E9VmP5c1K1BZwy77gNADXA', 'text': 'Was just passing through town and stopped on a whim.  The food was excellent and a full serving.  The service was great.  Clean and friendly.  I wish I could visit more often!', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-11-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'aDIPznL7ji5jFjbOMi2iBw', 'review_id': 'S4xcdfmuWgaFtjKiWgTXcA', 'text': 'Best indian food on this side, not greasy and authentic with the flavoring and the service was great. My water was never empty.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-12-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5vhVP0zaS97iIvjRfbPn8A', 'review_id': 'FneMfmgYOBNxbZ3BWoM9UQ', 'text': 'First time was very impressive. They bring out fresh baskets of naan . We are excited to bring our kids back.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2014-12-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'odJW1if_imBi1cUHv-_w2w', 'review_id': '7gYd500Eoiivebd6mHJpsA', 'text': 'Best Indian buffet in the valley!  Was definitely worth the drive from Sun City West.  Tandoori chicken was moist and the vegetable pakoras outstanding.  Will definitely be going back!', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2014-12-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bkOG20eXhoS0qTEyjP_nUg', 'review_id': 'PywLPYC_SDQc3_ChixwSrQ', 'text': "Food still good, however I feel like it's quality declining gradually... Maybe update and change the buffet menu sometime?", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2015-01-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'I_kPq3uiVfAAe7SWJmclgA', 'review_id': 'IUsyw1YS_il2meufhuZ9lg', 'text': "I got there right before they closed not realizing it. Not only did they stay open, they were super friendly and welcoming. The food, awesome! Super flavorful and full of spice like I'm used to. They brought a large basket of naan to the table as well. Will definitely go back again!", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-01-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'smJA4D29WZIUl4uj4B6DUg', 'review_id': 'x-6ZJxwwzkKBxOOo6yMmGQ', 'text': 'The food is amazing.  The service is warm and personal.  The garlic naan is a must.  We are hooked!!', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-01-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5im_I7GWJn846TYsYZA4Dw', 'review_id': '9IuK-LPxYm4OpZj3yn2w4A', 'text': 'Great place! We were welcomed in right away and seated. Nice atmosphere, great friendly service and amazing food. I highly recommend this place.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-01-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'M0KNo8mrnl199pPmjNeYIQ', 'review_id': 'm5_kpO52FX5DU52rMXmtxg', 'text': 'We finally found some good Indian food in the North Phoenix area!  The staff is so pleasant and helpful.  We enjoyed the samosas, chicken tikka masala, chicken saag and garlic naan.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-01-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0FtlTCPyKB4rjuM7mK02Kw', 'review_id': 'g6ieg6any8BuWIKrTJSsUQ', 'text': 'Passed by here a thousand times before I decided to try it out.\n\nIn the corner of a pretty average strip mall, the interior of this joint was super decorated. Service was professional.\n\nI had the naan bread, chicken tikka massala, and tandoori chicken. All were great. Very tasty.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-02-06', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'U2hsXmiTnaE4u46iLhLToA', 'review_id': 'UlusveBeov0W_GPzYAXSRQ', 'text': 'I\'ve eaten Indian food all over the world including the famous curry mile in Manchester, England and India Palace is some of the best I\'ve ever had. My mom and I shared the  onion naan (slightly spicy?), paneer masala, Murgh makhani (butter chicken) and the vegetable pulao rice. Tons of food, even took home leftovers, and very reasonably priced which is great as Indian food tends to be pretty pricey generally. I had a glass of Malbec and she had lemonade. We walked out for $22/ea and they even brought us a couple of small complimentary deserts to share! \nService was exceptional, I think our server was one of the owners. She checked several times to make sure we were enjoying the food. I told her it was some of the best I had ever had and she said "if there is ever anything not to your liking please just let us know and we will fix it"! The only drawback for them is they are in the corner of a strip mall and a bit hidden. Well worth the "hunt" though! Also the restaurant was very clean, including the restrooms (way important to me), and had lovely colorful decor. They even show Bollywood movies on the very unobtrusive tv :-)\nI live in Charlotte, NC but my family is in AZ, I will have a hard time not making them take me to India Palace every time I visit!', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-02-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Z1s3Zb4lMmyqyxyHWHRkEg', 'review_id': 'HaHG6omXyzZlE3f8ziiKRQ', 'text': 'I haven\'t had the pleasure of sitting in but have ordered food to go from this place. It\'s become a reliable "order out" restaurant in my book (considering the many places we\'ve tried so far) \n\nI always order Chicken Tikka Masala along wtih Basmati Rice and Plain Naan (What can I say? It\'s my favorite and what I use as a comparison for Indian restaurants) Their Vegetable Biryani and Garlic Naan are also worth considering although the garlic naan may be too flavorful.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2015-02-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZMPBOnET8-E67LKVCGh5-g', 'review_id': 'gd0yUWxxH1AtgIWT2Cw1sQ', 'text': 'We go here at least once a week & have always been welcomed by a great staff serving the best Indian food in town. Highly recommended by my whole family ranging from food allergies to extremely picky eaters, everyone always leaves here happy!', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-02-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GWDhY5T5VI2Uctk5defIaw', 'review_id': 'WsMtynURCoyOeHCRostzOg', 'text': "Went for dinner rather than the lunch buffet.  Service was a little slow but they were pretty busy (Valentine's Day) so it made sense.  The lamb curry and chicken vindaloo were very good.  The basmati rice was delicious.  Both the garlic and plain naan were excellent.  The portions are large.  One entree and one rice dish would have been plenty for two.  Otherwise, there's enough left to take home for lunch the next day!", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2015-02-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qrP-3Esz736WEdffc_Ny8g', 'review_id': '_Xfk4-uYD24uRK4ctHlDcw', 'text': "When I tell you this is the best most authentic Indian restaurant I mean it. Best part is it is a family run place and they truly go out of their way to make sure your experience is amazing.  Now let's talk about the food.... Aaaaammmaazzzinnngg!!!! I crave it when I am not here, and bring everyone I know!!! Great environment and good portion sizes... Let's not forget the chai iced tea!!! I love all the employees in here!", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-02-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'u1KC3T_bQmszug7ynHp4Yw', 'review_id': 'yhSpmtMfqXukpKmd-9LIEQ', 'text': 'This place has amazing food to say the least! The chicken tikka masala and mongatawny soup are my favorite! The restaurant is always clean and the staff is kind. If you are looking for great authentic Indian food this is the place to go!', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-03-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JwAwswVYDklU1IiGc7ikfg', 'review_id': 'e-zIgEa8j7XjabalFVm38A', 'text': "My wife and I ate here today and the food was amazing the service was great. they serve chai tea and naan with the meal. I'm heading back soon!  Thanks for a great meal.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-03-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'd6J19F9Zi4G-IErOdiujJg', 'review_id': 'Sg47jIZC1qCM5G3aB4Bpbw', 'text': "India Palace has great food. I've tried many of their dishes and they're all very flavorsome. I like much spice and it took them a few times to get the spice to a heat I was happy with but I wouldn't count that as a negative. Their samosas are fairly nice. Sometimes a little too well done but tasty nonetheless. \n\nTheir chicken is fairly consistent as far as tenderness goes in their masala and Makhani dishes. Their lamb is a little overdone when I've ordered vindaloo but the spice, taste and service makes up for these minor things (which may not even be an issue to others.) \n\nOverall the food, service and price are fantastic. My only complaint would be that the location is not so great and it is easy to miss if you're not sure where you're looking for it. I really like this place and the setting is ambient and service is always happy. Our boys love the food too - especially to gulab jamun and chicken makhani.\n\nI've also had their buffets recently and I have to say that the buffet is fantastic. It was about an hour before lunch closing and I was a little skeptical that I'd get the last of the food with it being dry and crusty. I was pleasantly surprised to see that even then they were still bringing out fresh hot food. Tandoori Chicken was great, their chai tea was great and their tikka masala was awesome. This restaurant is my favorite Indian restaurant in the Valley at this point.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-03-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IwZOgI1tdEbP_V_59A7QeA', 'review_id': 'XkJvp3DR5hfwjmrDJXZgig', 'text': 'Best Indian food ever the friendly environment you should try the lamb korma and garlic naan deal will get addicted to it', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-03-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZkQiXgDYt4MAvvyruBkchQ', 'review_id': 'gy5KYQAS75bFSAYobewXOQ', 'text': 'I love this place. I have a habit of ordering the same thing because its so good. We order the Lamb Korma. Its tender an flavorful. Then the bread called garlic naan. It has lots of fresh herbs on top. Its close to pita bread but much better. I come here a few times a month and its always a hit.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-03-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JVsYiMclNeyFYYBIHKzt-w', 'review_id': 'Hk4BcsIK_jw4CmwkR3Riow', 'text': 'My family and I have eaten at a lot of Indian restaurants in the valley and this one is the greatest by far!  The service is great and the food is wonderful.  When we want to try different dishes they are very accomodating and give us a sample to try to see if we will like it first.  I highly recommed it!', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-04-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'BEJDT6vzTlBHlkc7S9CSzA', 'review_id': '4ODjsl9Z0p2ic6yKzGYIwQ', 'text': "Tips:\n\nAsk for garlic naan!\n\n$8 for lunch buffet. Super cheap!\n\n-------------------------------------------------------------------------\n\nThe lunch buffet is pretty limited to about 3 curries and a bunch of sides, but overall I think everything tasted very good and very filling. The curry was a bit more liquid-y than I expected, but that didn't take away from the taste.\n\nThe naan is brought fresh to your table and you can even order garlic naan!\n\nOverall it's a very good place for some cheap indian food to curb your cravings!", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2015-04-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Z4B3L730S41dC_B_Q7MYlg', 'review_id': '36jv-yCUTbmN3LciAXgNzg', 'text': 'Great Indian food! The Baingan Bharta is sooo delicious!  The have some really excellent meat dishes as well---the Tandoori chicken is marinated wonderfully.  \n\nThe staff is super friendly and the prices are very reasonable.  Love it! I will definitely be going back.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-05-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'x6JK_aPCw6-y0mCo1YQgHg', 'review_id': '-GWuoHpmCWt6UWVrr25MEQ', 'text': "Been here for dinner a few times and lunch once. The service is good. It taste amazing. You can pick how spicy you like. I personally love the chicken saag. I am addicted. Before coming here I never know that you could change the spice level of Indian food and hated it because I can't do spicy. After this I know why so many people love it. One of the best on this side of town.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-05-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PEaEBmZ47jq3fNEPICx68g', 'review_id': 'zNVbl1W7uzIgtzbay79xNg', 'text': 'Pleasing and gentle people serving delicious food in a relaxing setting.  This place is worth checking out.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-06-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'izmEJgGMfVrDOgZe3gaRZA', 'review_id': 'JDRcDg39TSBowVJkontcFQ', 'text': 'Eat here about once a week, service is good and the food is great. Do yourself a favor and get the madrasi chicken, you can thank me later.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-06-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BaBewotuTrEglcIhiDlWsA', 'review_id': 'RMrYnuOQijAdL9KJHLboEQ', 'text': "This restaurant was delicious. I can't recall the food I ordered, but I know that I ordered an appetizer, main dish, and tea. I was able to taste all the spices that was in the dishes. I would eat here again.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-06-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'OhHyZ9AvPjC13K5wOFk2Rw', 'review_id': 'vjwwKy-NQjlKbNNrUUytvQ', 'text': "I have been eating here regularly since I discovered how amazing their food is a few years ago. It has been one of the few Indian food places I've found in Arizona that compares to my favorite place from Seattle.\nI cannot speak highly enough about their food and I love the staff.\nMy favorite dish is the malai kofta.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-06-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tajKpgD_Wo2HeN5Zs_byzw', 'review_id': '_vtCRMEv2yg939zGr8INPA', 'text': 'We went for the lunch buffet. After reading reviews we thought this was our place.  After eating there I suggest you try some of the other places of try a different food.  Our party of 4 all experienced Indian food eaters had stomach issues. I also had the MSG dry mouth and head ache I get from Asian buffets.  \n\nThe selection on the buffet was smaller than the place I eat at in Arkansas.  And the spices were bland. Not what I have come to expect from Indian offerings.  The service was good and the restaurant was clean.   \n\nMy friends that live here said they would not be back.  Overall a big disappointment.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 2, 'date': '2015-06-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'M-EcA8_nxganvK2EMDHOEA', 'review_id': 'VRl1Jr8PE1a4qEdvsMYgIA', 'text': 'We love this restaurant. We enjoy Indian food and decided to give this restaurant a try this year and we have gone several times since. We especially enjoy the lunch buffet. It has a modest selection but we have always enjoyed the quality and really enjoy all the vegetarian options. Their naan is also always fresh and delicious! We definitely recommend trying this place for quality Indian food.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-06-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vXgM5MBseQu0me2b2D7Y6A', 'review_id': 'mpd1UU2gInBZIVbx1m54JA', 'text': 'The food was alright. I went in for lunch buffet. Service was great but food not so much. Being an indian i guess i am more aware of the flavors and thats exactly what was missing. Desserts were terrible their gulab jamun was hard as a rock and the kheer was missing its main ingredient SUGAR. I give this an average go.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 3, 'date': '2015-06-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5UeLl2AZsS2M8pD6oXQMKg', 'review_id': 'Qp1Tio8_4nWa7lvBL1-hkw', 'text': 'Great lunch buffet at a very reasonable price. It is very clean in my opinion compared to all the other Asian buffets. I also really like the taste of their Indian food. Very delicious. \n\nVery impressed by how friendly their staff is and attentive they are, even during lunch buffet (filling waters, refilling naan, remove used plates).\n\nSome people address that there is not enough variety. I think ~6 different curries (and this is just curries, they have other dishes) that they have at one time is a lot but to others it is not. I somewhat understand that but this is not Las Vegas and it is $8.99. I still give it 5/5 because I am one of those people who go to a buffet and eat platefuls of what I like. They have all the essentials so I am a very satisfied, happy, person. \n\nThey rotate the curries out but have not been able to really see a pattern.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-06-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pI8_qiRoAAi_rLhNHh6-Rw', 'review_id': 'r0DX4Jc76-SMCcKCKUlF0g', 'text': 'Come here for Indian buffet. Food is flavorful. Somewhat cold.... So I recommend stirring the food a bit before putting it on your plate. About twelve different items. Very common dishes you see at most Indian buffets. Half vegetarian section, half meat section with lamb and chicken options. Complimentary naan is offered.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2015-06-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CKQ80IH1tKmZy3VyDwOApA', 'review_id': 'hnerkqKFmkxAG1o9ACRaDQ', 'text': "One of the best Indian restaurants I've been to in Arizona. Love there buffet. We travel over 40 miles to go to this restaurant. I would definitely recommend this to anyone living/coming to AZ.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-07-01', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 6, 'cool': 4}, 'user_id': 'CYHX8nnPoqclfWSsl1JWnA', 'review_id': 'IeDmAYTW8j4jrGTRESAVhw', 'text': "I seriously had no what to order when I came here. My friend and I just stared at the menu for the longest time!! Haha. Of course at the vegetarian menu. Great selection, so much to choose from. Just didn't know what to order. So I LITERALLY close my eyes and pointed to one.\nI got the chili vegetables. And the palak paneer. And....I forgot the other name of the dish. But oh my gosh. I love all my dishes. Different texture for sure, not use to it. But i like it. :D\nThe staff was great, slow with our drinks, but overall it was a good place for dinner.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2015-07-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'b4B3WRaCciSPUfGXJyTrnA', 'review_id': 'vTcPhYStPRXUTGJ72OiAqQ', 'text': "Really good for this type of Indian buffet. Plenty of selection, they keep the naan coming, and there are enough people eating there to turn the food over. We actually walked into another local place offering a buffet, just to try it, but after taking a look we turned around and came here. There's no need to try and upgrade!", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-07-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wWAOIfEZkkbmgYSKhxJOjg', 'review_id': 'ul28Uzv0byZ4YhAbMrXA0g', 'text': 'This place offers the best Indian food I have tried in Phoenix. Food is always fresh, service is top notch, naan is made fresh to order with your choice of garlic or regular and the buffet price is great at 8.99! They have good options for vegetarians and meat eaters alike. We have been coming here for the buffet at least once a month since we first discovered India Palace a few years ago.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-07-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'O-YcjnqoLd2m2OS725t_6w', 'review_id': 'KvgfXoipdlKZ0aD2B_wh9w', 'text': "The lunch buffet is the best. You can try a variety of foods and everything is fabulous! My favorite is the chicken Tikka Masada, Naan, and the rice pudding/gulab jaman (that's probably spelled wrong). Best Indian food around!", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-07-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'aqJgqqtYWZkauMeF56P31Q', 'review_id': 'sJ_cXRURfELXvujZDba3Cw', 'text': "Amazing. I keep going back for more. I'm in love! The ladies are so sweet and always give us a small dessert sample after our meal. One of my favorite restaurants EVER!", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-07-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bjCb7x10oUXbNJw84M7Rsg', 'review_id': 'EvQc4nT4WS87ojfIdoWjnw', 'text': "Dang. This was exactly what the West Valley needed. It is well priced, food was good, and service was very much on point. They visited our table constantly to refill drinks, and food was pretty good.\n\nThe Tandoori chicken was a bit smokier than I'm used too, and the smoke tasted slightly artificial, but everything else was delicious and as expected. \n\nThe chai on the buffet was a really nice touch, and helped break up my normal water and lemon.\n\nAnd 8.99 for a weekend lunch buffet? You don't see that much anymore.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2015-08-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xU7n0NjHdui0VQShuxEXJw', 'review_id': 'CAoj7aULeidm03o2m0M__Q', 'text': 'Fresh, prompt just good!', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2015-08-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WBtf7q_9DL_hkQX41uHvoQ', 'review_id': 'cLSCuzW3Jc-s-c3Ffycy8w', 'text': "Their food reminds me of my childhood. Grew up eating Indian food daily and I love it all. I've been on a curry binge lately and late night or lunch time at work I'll come to them and get reminded why I come back everytime. Thank you for the great service.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-08-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VFQAyEFfq_CS3Vud_8anCA', 'review_id': 'Z3fJcxN--53o0t4ZXCt9yQ', 'text': "Wasn't great by any means. Three stars at most. Tandoori chicken tasted like it was from a day before. Burnt smell. Was a little disappointed. Not too many choices for buffet compared to other competitors.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 3, 'date': '2015-08-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pQlQ5B6rkPjPdinD1BjuIg', 'review_id': 'frCHdQrKOndY8l-bUG-h0Q', 'text': "I wasn't a huge fan of Indian food, but the Chicken Tikka Masala here made me a believer.  It's so creamy and buttery, and is perfect when paired with their delectable garlic naan.  We also enjoy their fried vegetable samosas.  Great place to go for dinner, especially because it's never crowded.  Give it a try!", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-08-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'gsIB0BIiG_kaX8__0Lf3uA', 'review_id': '39rUi1v5Pydk3Msmt-Jx4g', 'text': "This is a nice atmosphere representing the country of India. Reasonable pricing for the food. I went with a few friends and was able to have a satisfying meal. It was good food as agreed upon by all three of us. The staff although friendly and courteous, didn't know what was in some of the dishes. Not sure if she is new to the restaurant but it seemed like a question that should be answered by every employee. Nonetheless it was a good find.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2015-08-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rr5fm2An-xn_fEHT8ojJcg', 'review_id': 'g6js1INLSA0T4SWBlWx9Kg', 'text': "I've been eating here regularly for a few months now and I absolutely love it! The food here (I've tried quite a few dishes) is phenomenal! Some of the best I've ever had. The staff are welcoming and it's a nice quiet atmosphere, at least when I've gone. I would recommend this place to anyone looking to try some authentic, delicious Indian food.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-08-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Oiaiw9ybMq0cPHlt3xR1HA', 'review_id': 'V6-tBchz6tnVLxHVVoxGgQ', 'text': "Love love this place, great food, great price and wonderful service. The lunch buffet is $9.50 comes with naan bread. We went in for the chicken tiki marsala, it wasn't on the buffet, the server asked if we would be staying, I said we really wanted the chicken, he went to owner, he said no problem we will make for you. GREAT customer service! We enjoyed the lamb curry, and tandoori chicken, lentils and spinach(I forget what the actual names are) the garlic naan is fresh and hot! We go at least 2 times a month.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-09-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FpGnqjuguSGj0HU90oY1HQ', 'review_id': 'YWPgoVVl-f31dRCHSuaGEw', 'text': 'Nothing great to say about this restaurant.. I felt okay with the food... Only thing I liked is, they serve water and lassi in bronze utensils..', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 3, 'date': '2015-09-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WEM_ou56bjh4g1xgTfGwlQ', 'review_id': 'NLYOtpkLrOZp_QB3SQlizw', 'text': 'My new favorite go to Indian restaurant. They offer papadom, Indian crackers which are gluten free. The madrasi lamb was delicious but I should have asked for a spice level of hot. The basmati rice had good flavor. They offer more of the authentic Indian dishes. The staff was very friendly and offered good customer service.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-09-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Rn54DBAt98WcNZQPK4pe8Q', 'review_id': 'SGs_1aVKMV2yDSqJ2OeF9w', 'text': 'Perfect place for Indian food. Great service,affordable price nd amazing food. Love this place.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-09-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9qrey_kl_L6Jn7o2D67xeQ', 'review_id': 'a6qYo_Mb3DRouWcy5P_lHg', 'text': "This place is soooo tasty and good variety! Def one of the better Indian food places I've been to.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-09-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IvF-CraQY8hXT6iaKumxZA', 'review_id': 'nekDra-s5XM3UrTrUyurZg', 'text': "We had lunch buffet for $8.99/person - and it was awesome!\nEverything we had was delicious and perfectly prepared. The tandoori chicken was moist and had a smokiness to it. The Lamb Curry was very meaty and tender, but my favorites on this visit were the Vegetable Pakora [sp?] - some of the best I've every had - and the Chicken Tikka Masala. I think they were making the naan fresh as we ordered it. Service was good and attentive - they kept our glasses full and were very friendly.\n\nHighly recommended and we will definitely visit them again.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-09-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'aYyV8pOOk0zBE6gsDqAjPA', 'review_id': 'F8zmbGAKmjkFvG_JUT5b8Q', 'text': "I have  been visting this place  from couple of years after I moved to  phoenix. Very good place for indian food. Options in the buffet for the price of 9$  are very good nd selective  . Food is delicious. Every time  I visit here I'll have buffet( chicken tikka Masala,  nan ,tandoori chicken,  malai  kofta , pulaf  rice, end up vth gulab  jamun ) vth side of pakoras  nd mango lassi (served  in bronze cup) .  Service is awesome  ( they serve water in timely manner nd always they remove used plates from the table vth in no time) people who  work there are very friendly  to the customers. \n\n I love this place . People who visit phoenix  nd looks for indian food can try this place .", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-09-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'C5ZV_Yrqzalcho2Frti82Q', 'review_id': 'JUNR94kI9oorlzwjAcodvQ', 'text': "I love this place! Seriously can't get enough of the customer service ,hospitality, and most importantly the food!!", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-09-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CrQ-nnCQvW0qJi8vtF5jyw', 'review_id': '1gQlNf3sQBXTPoxnk-SLjA', 'text': "I have been here twice for dinner recently and the food is insanely delicious. They start you off at dinner with Papadom, these wafers that are simple yet tasty. They have an onion appetizer, onion Bhaji, that is deep fried with garbanzo flour, which is gluten free, and it was almost like eating onion rings, something I really miss being GF. The onions have a wonderful flavor. The Chicken Tikka Masala has to be my favorite dish but the Lamb Vindaloo is a close second. I went there for lunch the other day since I work close by and it was a buffet with a good variety of dishes. There was also a hot chai tea that was very flavorful and spicy plus a rice dessert that was pretty yummy. The buffet was just under $10, a very reasonable price for a buffet.The service is attentive, the food comes out pretty quickly and it's a good experience all around. This place gets two thumbs up in my opinion.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2015-10-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JdNERlRX2ghg3v_rNSt8Hg', 'review_id': '8cqnzyTDUQvUehbCXOzxww', 'text': 'By far one of the best Indian cuisine in Phoenix! Authentic, Service is great! Defiantly coming back.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-10-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DvNtfrbk_kl4JDM-9kGBrA', 'review_id': 'kVKBHZd0wEeeQt9idpr0aA', 'text': 'The buffet has all the staples of Indian food. My fav lamb and chicken tiki. They also have garlic nan. Food was freshly prepared and tasty. Was not overly spicy. Restaurant it self was clean and decorated nicely. Will definitely come again. The owner stated they have a better buffet on weekends for same price.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-10-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '8wSMBrUzEw8WLoJAIUTpww', 'review_id': 'q_YniElyBgdkuKeqOWf6ww', 'text': 'Better avoid. Worst restaurant in Phoenix. Last I ordered chily chicken and they gave chicken curry. Chicken biryani was very bad.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 1, 'date': '2015-10-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'elUUeKD9rkk2R6iaAVV8fg', 'review_id': 'nu3Dgp9WoQ9j-dNuO2_GYw', 'text': 'Terrific food, good service, nice menu selection make for an outstanding experience at this restaurant. My new favorite Indian food restaurant in the Phoenix area! The selection of naan breads is particularly good. Also impressed with the wait staff who were always refilling our drinks and checking on us. Will be back again and again...', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-10-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZtffFG6vR3_HdCIeUpIJTg', 'review_id': 'CX0ke1_heKk0-gWelN2ajQ', 'text': 'My husband and I LOVE India Palace!!! We eat the buffet every weekend. The food is consistently great- our favorite is the chicken tikka masala. Recently they started serving halva (sorry spelling)- a pudding with nuts, dried fruit, and coconut, which is amazing. The service is great and the people are so wonderful and friendly. Highly recommend :-)', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-11-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'gFRp0Lm8dtvvCFLz6AAS5Q', 'review_id': 'OvmRBxxgcCKI4koD_HUL8g', 'text': "This is my go to spot for delicious Indian food. They have amazing sauces and tons of options. One dish I have never encountered at any other place is malai kofta. These are a veggie meatball in a yellow sauce. I feel it's important to mention that I am not a vegetarian. These things are amazing, I order them every time I go. Whether you eat meat or veggies I highly recommend you give this a try. In addition the service is great. The staff are always helpful and courteous. As a bonus they play great Indian soap operas that are fascinating. The only reason they don't get 5 stars is because I do feel the biriyani could improve.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2015-11-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UxGsUdGyI8VZK7VOtw-eLQ', 'review_id': '5PibsWz437i8o_Pj2iDvXQ', 'text': 'As far as Indian goes this is by far the best I have had this side of the Atlantic Ocean.  My mum makes good Indian but I think this is great indian.  Very filling, just the right spices and curry to make the meal taste just right.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-11-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KR_S74bsIYBFNl5_aepZIw', 'review_id': 'Kpt-I9rh5dZWXs9J60BNig', 'text': "The place is clean, the staff if very attentive and the food is tasty. They'll spice it up or down to suit your desire. I'll stop there whenever I'm on the west side.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-11-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qryQ8WAyqFq4oQ8KbtpuSQ', 'review_id': 'IHdNGVowi7xzaStGpyLNXA', 'text': 'How\'s their food? Who knows, they wouldn\'t give us any. We were seated. The place didn\'t have many customers as the whole center of the restaurant was empty. Our order was taken, and then we waited. And waited. 50 minutes after being seated, a waitress came out with a tray and headed for us, but then turned and gave our order to another table, who started eating. We got up, tried to pay for our drinks, which was declined, and went down the street to "Touch of Thai" where we had our food 15 minutes after sitting down.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 1, 'date': '2015-11-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cviE72K7t3WNocb4Den0aA', 'review_id': 'BJBK1Cn-ypfnYsrhbvXEag', 'text': "We have eaten here several times and never disappointed. We took the kids, one of which is very picky. She ate an entire order of chicken tandoori. I was a little disappointed with the palak paneer, which is my favorite. Just didn't seem the same as usual. Service is always great. We will definitely be back.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2015-11-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4Rsjxa0_CKDn7Wy4LkybGA', 'review_id': 'mDmQH8u4d7BcAsJa0uusDg', 'text': "So I come here all the time and I love it. It's always clean and everything tastes great. The mushroom masala is to die for. I would recommend this place to anyone!", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-12-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'b8MLnurBJ9mVOX2RZtUhhQ', 'review_id': 'ZPfNSyrf5cRH0osXSinDrw', 'text': "Best Indian food I've had since living in India! Amazingly friendly waitstaff, fresh ingredients, and the spices were out of this world mouth watering good!\n\nI would recommend this place to anyone looking for REAL Indian food experience.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-12-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ui9XaLbkVTUMoE2Boy5tQA', 'review_id': 'Jzk_wLHj7bk6D3YmQJ--bw', 'text': "We stumbled upon this place by accident.  And what a treat!  The food was exceptional.  The best Indian food I've had in Phoenix in the 18 years that I have lived here!  We will definitely be back!", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-12-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tE7zTA54-NpKwVYTU4domQ', 'review_id': 'v5v4Z8szky1zAoaT0WpI2Q', 'text': "I'd love to give India Palace 5 stars but the food isn't always consistent. Some days it's a 2 and other days it's some of the best in the Valley. We typically order the samosas, garlic naan and chicken tikka masala.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 3, 'date': '2015-12-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'i2tPzoLvDzUu7qdcZ7zfvA', 'review_id': 'OyelgnwfB7B7FzJOu5rUpw', 'text': 'Tried the Indian Palace last night for the first time and found it to be very good. We had vegetable pakora, onion bhaji, mixed tandoori grill, matter paneer and a Peshawari (Kashmiri) naan. All the dishes were very good. The paneer was especially good with very good seasonings and spices. The only minor grumble was the amount of onion and green pepper (!) with the mixed grill - it was like a Tandoori Fajita - but still tasted very good. Will definitely go again.', 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 4, 'date': '2015-12-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8a8nqmb5x6SnHBX-vcukIQ', 'review_id': 'VCURIo6ZERizPjVxO89Upw', 'text': "Best Indian food I've had in a long time! The chicken korma is fabulous. You can tell that they put a lot of work into perfecting the flavors and seasoning. Fast, friendly service as well. Highly recommended!", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 5, 'date': '2015-12-12', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': 'OgF3ZL2aDJhzCj9uLRpyQA', 'review_id': 'fhr-q1tsQdLEqCi9wkrw0Q', 'text': "When is the best time to go here? Lunch time! I absolutely love the luncheon buffet. It's such a great deal - $8.95 per person, all you can eat. Like with any other buffet, you have to finish your food there. You can't box up your leftovers and take them home. It's perfect for lunch with a big group. There are a lot of big tables that can accommodate a large party size. The place starts getting pretty full around noon. \n\nIt's such a relief that there is a nice balance between meat and vegetarian dishes. I can bring my vegan friends without worrying that they will starve. They usually have three vegetarian curries and 2 meat curries along with various desserts. The tandoori chicken was very tender and flavorful. The ground lamb curry was delicious and didn't taste gamey at all. Remember to ask for the garlic naan. I love dipping the naan with my curry. I highly recommend trying the white rice pudding, one of my favorites. There are also warm chai tea available that is wonderful for chilly days around this time of year. \n\nService was friendly and efficient. The servers promptly removed our dirty plates and continuously refilled our waters. When it came to checking out, they were very chill about splitting up the bill for each individual.", 'business_id': 'NCbHGtOP5yJBJsPPaE3X5g', 'stars': 3, 'date': '2015-12-16', 'type': 'review'}
