{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'nqVtMpEJQV81UXIlyg7PNw', 'review_id': 'MnYBCsEG_SAl0MxMGHi3TQ', 'text': "Great food and really good service, thank you Molly! Plus, you're allowed to bring in your own food if someone with you doesn't like delicious spicy seafood.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-04-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'XplIvxgxN3F9k3FXwJ1Mug', 'review_id': 'W9Jg-fFLSr5JNCSVbq2YVg', 'text': "The shrimp was very large, juicy, and fresh!  We also go the crawfish, both hot  n juicy style spicy.  I liked the tasty sauce, it was nice and thick so the seafood was well coated.  The sausages were better than any of the other seafood boil places I have been to.  I just wish the hot n juicy style was more lemony but that's an easy fix- just squeeze more fresh lemon to your taste.  Great service for the soft opening.  Can't wait to come again!", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2014-04-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ya1123yY6PHEKw8pipRmVw', 'review_id': '3gPWV1GwCVry3AQX6vSaeA', 'text': "If you come here you're in for a treat. Ordering may take a while because you're trying to decide what to have. \n\nI ended up trying the snow crab, shrimp, and calamari. They were all very good. If you want something spicy then you've come to the right place. \n\nIf you have no problem peeling your food and getting your hands a little dirty then you wouldn't mind eating here. I had to clean my shrimp down from head to tail. It'll take some time to get use to but you'll get the hang of it. \n\nThe service was excellent, but it would've been nice if they picked up some of the things off of the table. Another thing that bothered me was how many flies or gnats were around our table. It was pretty disgusting having to guard my friends food while he went to the bathroom. \n\nOverall food was good and so was the service.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2014-04-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': '1XQhT1xQnqOS2WnUci2DCA', 'review_id': '4GqscCa9x4RD3TTGS9yldA', 'text': "I was so excited when I heard they were opening a Phoenix location. I absolutely love crawfish & would intentionally make a trip just to visit boiling crab. Hated the long trip there but food made up for it lol then I tried Angry crab shack in Mesa thinking it would be a replacement for BC but was utterly disappointed. Then came this place :)\n\nFirst off, the crawfish at Hot & Juicy was delicious! Very comparable to BC, maybe even better. I had 2lbs of crawfish (hot& juicy flavor, spicy hot level), it was perfect. The menu is very easy to read. It pretty much comes in steps where you picked your seafood, pick which flavor, and how hot you want it. Couldn't have been easier right? Two thumbs up for food! \n\nService.....was FABULOUS. We had Jasmine, who was very friendly, attentive, and there soon as something was needed. All the staff regularly dropped by to ask if we were ok or needed anything. Service was wonderful. \n\nThe place itself is spacious so there's plenty of room. Atmosphere was relaxing. Overall, I loved the food & service. Definitely will be back!", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-04-22', 'type': 'review'}
{'votes': {'funny': 19, 'useful': 18, 'cool': 18}, 'user_id': 'IDHrwv_RCildFvmfWTkj5Q', 'review_id': '9QBAtaEch50Z5Z6Ykc3sOg', 'text': 'This Southern girl was good and satistifed when she left Hot and Juicy Crawfish!  \n\nWhen I saw this restaurant flash on the Yelp front page,  I thought I would give it a try eventually.  As I looked over their website, I realized, this is the same resto/company that I have had on my Vegas bookmarks for years.  The second I realized that, I bumped up my visit to "today".  \n\nGoing on a weekday at 4:30p has its bonuses - parking on Mill is much easier and Mill is not as crowded. So, I park and walk toward the restaurant.  The one thing I want to warn the Yelp community about is that the address says 740 S Mill Ave, the restaurant is actually facing 7th street and is west of Mill Ave (west/around the corner from Mellow Mushroom).  \n\nSo I went alone as this was decided an hour before I arrived.  I am so disappointed that you can\'t order a combo boil.  So I made up one.  I ordered 1lb of crawfish with the Hot and Juicy sauce served Spicy Hot.  I also ordered a half pound of shrimp (the only thing that can be ordered by the half lb) with the Lousiana Style sauce served Spicy Hot with sausage and a corn.  Each order comes in a plastic bag with enough seasoning to cover, but not drawn your crustaceans.   I couldn\'t eat it all, so I saved the shrimp order and ate the crawdaddies.  In general, if you like southern food that is spicy and full of flavors, my advice is to completely bypass the any other sauce option and go straight to the Hot and Juicy - trust me on this. (Order a different flavor as a side, thank me later)\n\nSo, I pull my first crawfish tail off and put that head to my mouth and sucked the head and out flowed the the hottest and juiciest crawfish deliciousness I had ever had in my life.  Sucking dem heads and pulling dem tails is how you eat crawfish.  But what I LOVED about these crawfish the most is how juicy they were!  So much seasoning and juice flows into your mouth out of those heads!  And the tails were tender and not overcooked.  So many places muck up crawfish by overcooking them!  They were also so tender and just right because they had not been frozen.  Yes, fresh, ALIVE when they cook them fresh!  Someone help me, I could have slapped someone it was so good!  I have eaten crawfish my entire life and I am pretty sure these were definitely seasoned the best because the Hot and Juicy sauce is so much thicker than the typical crawfish boil juice.  So the flavor just coats your mouth really good.\n\nThats it folks.  Get yo\' self on over there and enjoy it.  Get over there, roll up your sleeves,  put on a bib (very important!) and get a beer! For Pete\'s sake, don\'t look like an amateur and wear the gloves they offer!  And always  remember to Suck dem Heads and Pull dem tails.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-04-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'eJUgbLK6cjhytvsHx5_JvQ', 'review_id': 'ZwWUU15zC3_uBufKVsf3ag', 'text': "I am so happy that Hot N Juicy came to Phoenix!\n\nI've never been to it in Vegas but while I was at work, one of the trainers came in and told me about it (she was getting lunch for her team.)\nI'm not going to write a lengthy review, I'm just going to touch on the important parts\n\n-We waited for about 10 minutes before we were seated, which isn't bad considering it's a small place.\n-The customer service is wonderful! Our waitress (it was her first day but she did well) helped us pick out our food while a manager and other server hovered over her, which made me kind of nervous.\n\n-The food. The food. The food. We all got shrimp but I will definitely the crawfish later. They were fat shrimp, the Hot N Juicy sauce and I thoroughly enjoyed eating them.\n\n-I actually received the wrong order (I think I received Garlic Butter?) but they were happy to bring other 1/2 of what I wanted while I ate the other order. They never ended up bringing it (I did received a tub of Hot N Juicy Sauce to dip with) but we told them it was no big deal. We couldn't spend any more time peeling shrimp anyway!\n\n-I used lemons in my water and later noticed little flies in my water... so that was disturbing.\n\nThe grand opening isn't for a few weeks, so I understand that there are issues. \nI will definitely be going back then and writing another review!", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2014-04-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'infC_5J8sA4NiL_QBJpWag', 'review_id': 'KUL-OxjtU4S_fgq_id8b2Q', 'text': 'I often visit Hot N Juicy when I am in Vegas. I was ecstatic to see that they opened a location right by my school! so I came here with a bunch of my friends, about ten of us.\n\nThe restaurant wasn\'t too packed but had a decent amount of people. \n\nSo the french fries came out in about fifteen minutes after ordering.. We all patiently waited for our crawfish/fish/lobster.. but it never came out minutes after the fries..):\n\nIt took about a range of an hour and half for our big orders.. Not only did we wait that long, everything came out in the wrong order. I got my shrimp way before my rice came out. Half my friends got their food and half of them didn\'t get it until thirty-fourty minutes later. Oh and they forgot about three of my friends orders, as a result, my friends had to reorder and wait even more! The manager apologized after seeing our annoyed faces and promised a "discount." Well she forgot to include our discount in our checks.. Oh and checks can\'t be split more than three ways so bring cash.. \n\nAnyway, the food was good but we all had a sour feeling because of all this mishaps. \n\n\nYes, we did have a large table but this is very unacceptable and did not set a great impression. This review may change depending on my next visit. I hope front and kitchen service will be better.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2014-04-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'Gk0SY4KT9sg8keYN47iLUA', 'review_id': 'e9nI_fXwKAbktPXDTDb5Qw', 'text': "So excited to hear HnJ opened a location in AZ! Of course we had to try it out! We've been to one in Vegas and it was good (sorry we still prefer BC, but we'll take what we can get in AZ). We've been going to Angry Crab in Mesa since it opened a few months ago to get our seafood fix but their crawfish are so tiny that it's just not worth it (however, their shrimp is fantastic though). \n\nOkay, back to the HnJ review. We waited over an hour for a party of 5 on FRIDAY NIGHT. Another party waiting for a table even went and got Jack in the Box to snack during their wait, hilarious! So be prepared for a long wait because the place is not very big, plus they haven't even had their grand opening yet. I'm sure it'll get even busier so just know it's going to be a while to get a table. \n\nFood was AWESOME! At our table we got crawfish, shrimp, clams, snow crab, corn, sausage, and fries. All of them HnJ style and a variety of mild, spicy, and extra spicy. Crawfish were nice and juicy as well as the shrimp. They don't serve headless shrimp so be aware if you aren't accustomed to shrimp with heads on them. Snow crab was decent but the clams were a disappointment. Definitely add sausage and corn though and you'll be wanting more. \n\nService was pretty bad but we kept an open mind that they had just opened so I'm sure they're still working out the kinks and trying to keep up with the crowd. The table next to us (that was seated after us) was greeted, waited on, and ordered before anyone even came to take our drink order. When a server finally asked if we'd been helped we put in our drink order and food order altogether. It took forever to get our drinks and all of the food. The food came out staggered so not everyone in our party had their food at the same time. The clams took forever to come out and we had to ask the server about them 5-6 times. Finally we were done eating everything else and I decided to just cancel the clams because we were ready to go... Well that's when the clams magically appeared. The clams were definitely not worth the wait. \n\nOverall it was really tasty and we'll be back for sure. Hopefully the service will be more on point next time. Just make sure you don't have any other plans because it'll take a long time! Oh and it's really loud in there and mostly Asian diners. \n\nTimeline: \n7:05pm - Put in our name for table of 5, was told it'd be about 30-35min wait. (We walked over to Slickables for pre-dinner dessert to kill some time)\n8:30pm - Seated at a table \n10:05pm - Paid the check (we didn't sit around chatting or anything either, we pretty much ate and paid. It's because service was so slow and the clams took forever).", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2014-04-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8V7NKO0jo_kMTSwVl-I_cw', 'review_id': 'KZaNXg-mSoBuwljfagt6Bw', 'text': "Its great that there's finally a Hot n Juicy here. We came on a Saturday before the lines hit. Service was good, food took forever! However they did just open an the cooks are getting familiar. I will probably re-rate this in a month but for now I don't think waiting 1 1/2hrs for 2 Dungeness crabs is acceptable. Even if your an inexperience cook! The sauce was a little different from the Hot n Juicy's we go to when we are in Vegas, \nAt the end they did take care of us ( Thank you Nickyjo! ) and apologized a lot. And because of that we will definitely try again in a month.  Overall food was fresh and good.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2014-04-26', 'type': 'review'}
{'votes': {'funny': 8, 'useful': 12, 'cool': 10}, 'user_id': 'hjJPKQ1Ah91h3fVbc8GsOg', 'review_id': 't6ICmW4SVh3UryKMbtuGCw', 'text': "All I have to say is: It's about...damnnn time! My friends and I always, always make a stop here when we visit Las Vegas.  But to finally open here is pretty much a dream come true.  \n\nThey are the best in the business of crawfish and other cajun style seafood.  I can finally say there's a great place in town I can take visitors to if they never had Cajun food or even a seafood boil for that matter.\n\nLet's start off by talking about their crawfish! They are consistently fresh.  They pretty much perfected their secret recipe to a science.  The temperature and sauce is spot on.  I love my seafood HOT and SAUCY.  The garlic and Cajun spices truly pack a punch.  \n\nIf you are new to this, I highly suggest starting off with the crawfish since that is what they are known for.  If you just hate digging your nails into hard shells, then shrimp might be your next best option.  The beauty of eating this type of seafood is to taste the freshness from the sea.\n\nI always, almost order 2lbs worth of crawfish.  Why? You get free corn, potato, and sausages fused with heavenly Cajun flavors. \n\n A trick I love doing is to order a side of rice and making a poor man style gumbo.  As you are peeling your seafood, take the juices, like guts or brains from your seafood and dump it into you rice and let it build.  At the end, tear up some sausages and pour in your left over Cajun juice from your boil onto the rice.  Voila! Enjoy!\n\nSince they just recently opened, now is probably a good time to get your crawfish fix before the word is out.  There is a bit of wait during dinner time.  First come first serve.  Don't worry its worth the wait.  I hope they will open more around the valley.  I will probably eat here atleast once a month.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-04-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'EsIEU68lnuf3NvSzm7wbjg', 'review_id': 'fZvIXz3NHYGBNckovMqNtw', 'text': 'Yum!  The food was awesome and messy.  \n\nWe had crawfish,  boiled shrimp with 2 different seasonings, snow crab,  soft shell crab, fried shrimp, corn fritters, cajun fries and mozzarella sticks.  Everything was really good.  It was my first time trying crawfish and I was shocked at how good they were.  The shrimp was so good and really big.  \n\nWe will definitely be back!', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-04-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'IXuKjVb0F7t7T-BTpwLqKQ', 'review_id': 'y3-jZh9y-bYo6x5HsJrelg', 'text': "I was finally able to visit this place after all of my friends have been talking about the location in Vegas. This was my first time and it was pretty good. We ordered a pound of the king crab legs, pound of crawfish and half a pound of shrimp. My bf love the crab and crawfish and the shrimp was cooked to perfection. I got the Hot N Juicy sauce with my shrimp and it was okay, nothing too special but I enjoyed it. We also ordered a side of cajun and sweet potato frieds. OMG, so good! The place was clean and the service was good. It was a little bit of a long wait for the food but I was with family so it didn't matter. They even gave us complimentary calenders for HnJ. Really nice! I will come here again but because I live in Chandler it won't be as often and the parking sucks but that is understandable because it is on Mill Ave.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2014-04-27', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 4}, 'user_id': 'oBcK0Pigltd-jlTmrkN46A', 'review_id': 'lbq6rKa3JKlQ7uuauNCAaQ', 'text': 'When I first heard that the place was opening in AZ, I wasnt as excited as my fellow foodies since the Vegas location was not so impressive. \n\nHowever, that all changed after I took my first bite into their "Hot and Juicy" seasoned seafood. I shared a lb of clams, sausage, shrimp, and corn. This place is DEFINITELY better than the Vegas location and will happily refer anyone here. \n\nAfter all is said and done, I still have to give a 3. I hate to give 3 stars if the food was perfect but you must understand that service is just as important as the food itself. We were told that it was a 30 minute wait but it turned out to be a 2 hour wait. I dont mind the waiting but setting realistic time frames are important. \n\nAnother issue we had was getting the incorrect order... 3 times... each 15 minutes apart... all 3 times with 3 different servers. With the 30+ staff members on board that night, it might be a good idea to designate servers to specific areas so we dont have to repeat our order so many times... Felt like a bad game of telephone and was surprised that we werent served a purple monkey dishwasher. \n\nI can tell the servers were just as frustrated and without direction when someone dumped sprite into my water cup. I politely told her I didnt want sprite in my water cup but she smiled and walked off. \n\nAlthough I dont plan on eating here anytime soon, thats not to say that I wont call in for carry out. I will give them a few more months to work out the kinks before I go again but great job for getting the flavor right the first time around and beating out your Vegas counterparts', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2014-04-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'infC_5J8sA4NiL_QBJpWag', 'review_id': 'uwkreYMnW0VsohS2PFMJ3A', 'text': 'Service improved greatly! Kitchen also kept up with our table and the food came out at a decent pace/time. FOOD WAS FRESH AND WAS GOOD.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2014-04-28', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 5, 'cool': 1}, 'user_id': 'DGTip0-KD3Rr39Oafz3ncg', 'review_id': '6qOVV3SO6D905S7ds3orXA', 'text': "This will definitely be my go-to alternative for Cajun seafood until time permits me to make a trip out to Cali for Boiling Crab. There IS a distinct difference between BC's and HJ's sauce - BC's is more buttery and garlicky which I like (but I just love butter and garlic in general).  HJ is definitely less greasy and I can tell there are some big differences in the spice/seasonings they use.  \n\nThe overall flavor was pretty good, as I killed a whole lb of shrimp in the 'Hot N Juicy' Medium sauce by myself and wanted more, still. The shrimp were big and succulent.  The clams were not so hot... I felt like we paid for all shell and no meat, and what meat there was at the bottom of the bag were very small and unappetizing.  Of the two lbs of clams I ordered, the second which was supposed to be a garlic butter seasoning finally came out after 3 different servers asked if I had gotten my order yet and if it's correct. And when it finally came, it looked and tasted exactly the same as the traditional 'Hot n Juicy' seasoning, not garlic-butter.\n\nThe service was not so hot either, but I understand they are still going through their soft opening and their servers probably didn't expect all of Arizona's Asian population to show up at the door, and some.  With that being said, I was pretty annoyed at the 9 different servers we had.  Though most were nice and polite, we only really needed 1 server.  They should work on re-organizing table assignments.....\n\nOverall, I would definitely come back, in hopes that they are better organized and that they have non-anorexic clams.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2014-04-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'P7Zcg73x8FzszGEiC9YPfw', 'review_id': 't_-TPWrRdCyxfZbT0iLIIw', 'text': "Glad I didn't have to drive to cali or Vegas for some hand dirty crawfishes. Love the head on shrimps and their spicy Cajun fries. However some crawfishes were not as fresh", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2014-04-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'NYQ18g37GvCN3TQ09z3nqg', 'review_id': 'd2wF7SePUCuVYDNmWDWeBg', 'text': 'Great spot for peel-n-eat seafood. Be sure to get their classic "Hot n Juicy" seasoning! It\'s messy but a blast with friends! \n\nPros: Great cajun (rare in AZ), fresh seafood, not too crowded\n\nCons: Blarring rap music makes it feel like a club (said they couldn\'t change the volume)', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2014-04-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wJzMpk54FF2jeENqMBJ24Q', 'review_id': 'spjaSy0bCIdO5Eb8sDDmWw', 'text': 'When our friend posted a pic on instagram, we thought he was in Vegas.  Read the comments and was excited to see that the location was in Phoenix!  After reading that, my wife and I looked at each other and said "LET\'S GO!!"\n\nWe went a couple of days after they did their soft opening.  It was nice to see that there was no lines to wait in since we know it won\'t be like that for long.  The staff had high energy and very welcoming.  The service was on point with regular check ups and water refills. \n\nThe food was delicious like always.  We (party of 3) ordered  2 lbs of shrimp, garlic butter, mild (spicier that usual) with bowls of rice.  My wife and I usually share 1 lbs of shrimp and we leave full.  I\'m looking forward to trying new item on the menu now that we have a location here.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-04-30', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 7, 'cool': 2}, 'user_id': 'nd1fUvOyAM2CrrtDshOM6g', 'review_id': 'm2JH3LNKgdZLErPfzuBU6g', 'text': "Love the food, hate the service.\n\nToday was my second time coming here, the first time was over the weekend at night and it was bad.  Orders were messed up left and right.  I was dying to give it a second chance.  \n\nThe shrimp came in a timely manner along with the rice.   I went for the rice and it was hard, like uncooked.  I'm usually understanding but.... ANYONE scooping that rice from the cooker to the container must've struggled enough to realize this should not have been served.  I called the server over and they took it back.  She came back and said that something was wrong with the rice cooker and that it may take 15 minutes for the next batch to come out.  I didn't really have a choice.\n\nThen some lady came and offered us hawaiian rolls.  Keep in mind that while waiting for that, we did not touch the shrimp.  We're asians so rice is really important, lol.  15 minutes passed = no rice and no rolls.  I was starting to get irritated and I was hungry so we just ate again, without any of what was promised.\n\nWhat you'll notice about the servers:\n1) They hover by the kitchen... trying to avoid or delay the bad news they have to deliver\n\n2) They'll ask how you're doing but very few genuinely care\n\n3) They'll say they'll check on it and will only remember to tell you their findings WHEN you call them over again.  Aren't you supposed to return from your mission?  Lol.\n\nThe rolls finally came - only three by the way for two people (which was supposed to make up for the uncooked rice we both bit into??  And have been missing since??). This was on the house so that was generous *sarcasm*.  Rice was 1.99 each and we ordered two.  That's $4.  Rolls are $1.75 for three.  Whatever.  They were just like the kind you buy at the store, except warmed up.  I don't know why it took that long.\n\nBy the time we were told the rice was on its way, we already finished the shrimp.  So the rice would have been useless.\n\nIMO:  Food is good.  Customer service sucks.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 2, 'date': '2014-04-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 5, 'cool': 1}, 'user_id': 'WzJanlIrowPGR0hbkBl1mQ', 'review_id': 'NSLn8LHPsrP6qCIPf-z76g', 'text': "Been to: Boiling crab in OC\nKickin crab in OC\nAngry crab in Mesa\n\nI'll compare this to Angry crab because let's be honest we really can't compare food from Az to Cali. \nSeasoning: in comparison to Angry Crab, it has more of a Cajun flavor. Less butter and garlic. \nSpice level: it's ONE step higher in spicy level. For example: angry crabs 5 is a 4 at hot and spicy. \nSides-\nSausage: angry crab = 4 large pieces for 75CENTS!! (Steal) \nHot and spicy = 6 small pieces for $2.75!! (Def not worth it) \n\nCrawfish- \nAngry crab: small\nHot and juicy: prob double the size and juicier. (Def worth it) \n\nShrimp- \nSame size. \n\nService- \nI understand Hot and Juicy has been open for less than a month and they're still working out their kinks... But there's no reason every single employee needs to rotate every 5 minutes to ask if everything is okay. \nNever asked us if we wanted lemons/limes and salt/pepper like most other places. Didn't offer to place the bibs on like other places as well (not that I need it but hey, it's a nice gesture) :) \n\nI'm giving it 3 stars and hope to give it more once they figure out the kinks. Will def come back because the flavor is there. A bit pricier than most, but still worth going.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2014-04-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DVqigFeLodiysUezvQRkGA', 'review_id': 'zCjD1eh-BFIQ9eADA3k6ow', 'text': 'My friend got a bad batch of oysters and became ill about 20 min after eating them. the service was really disorganized but I understand they\'re still new and getting new servers trained but we had several servers come try to explain the menu and multiple people constantly stopping by to ask if everything was ok. it got a little annoying but whatever. my friend didn\'t get sausage in her bag and one of the servers acted as if we were lying about it saying "I saw sausage in your bag, it\'s in there, let me check again". sir... I\'m looking in the effing bag and there is no freakin sausage. I ordered a pound of mussels and they were tiny! but their Cajun fries were pretty bomb, crispy and really well seasoned and the seasoning was spicy and had a nice kick! overall, nice place but I prefer Angry Crab in Mesa.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2014-05-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WJgAr6Sh-QbPFj1L_EdAeA', 'review_id': 'FqYxX8-CScy1Egqt4EqFlQ', 'text': "Finally HnJ in AZ, the food was good like always, the shrimp is bigger as well as the crawfish! But what really sets this place apart from the rest is the SAUCE (hot n juicy special); its really good.\n\nThe place is cozy and clean...forget about the horrible parking (you'll need to walk a lil bit after dining here anyway  )", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2014-05-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TCSxETyZ1tpo0RcUqd3s-A', 'review_id': 'iR7EiCiOffybrbZauK4Ucw', 'text': 'I LOVE HNJ as I always have since the original location in Las Vegas many years ago. I came here with my fiance for the "soft" grand opening while visiting this dessert state as I call it. LOL. And I still prefer HNJ over BC.  Glad to see them expanding to other states, so others can experience the great taste of seafood. OH, and make sure to say hello to my favorite person who works there, Jesse Sanders!  Give him a big hug for me! ^^  This guy works his butt off! \n \nThough, I am always skeptical of new locations because sometimes the flavors are not consistent as what I remember from the original spot.  They were pretty spot on for the most part.  It all comes down to the sauces.   All their sauces are really really good. By far, I like it much better than Boiling Crab (too buttery if you ask me) .....:/   But,  I felt the extra spicy HnJ sauce could be an little spicier.(hint hint ;))  The medium HnJ that I usually get was very good, and garlicky.  \n\nFood: What did we eat?...We had the king crab legs of course as it is my favorite, shrimp, and clams with the HnJ medium, and crawfish etouffee.  Very good and well cooked and seasoned.  This stew of yuminess and butteriness of a lot of crawfish and veggies over white rice is soooooo good!   Also, the raw oysters on the half shell were deliciously sweet and fresh! :) \n\nService: OK, so here is where I have to admit they do need some brushing up on.  Understand that opening up a new joint and mind you, this place gets PACKED and I am sure the servers had no idea of the kind madness this restaurant can bring, b/c of its POPULARITY, so give them a break if they messed up on your order. I do think they need to organize better on who is serving who and assign them to sections of the restaurant, so they know what designated area they are to service, and have them memorize tables and such. Only 1 or at most 2 servers should be assigned to a table, instead of having random servers b/c everyone gets confused. I am a high believer in service, as I am in the service industry myself, in other ways and customers should be a little more understanding on newbees b/c this place causes extremely HIGH traffic for a good reason-for the damn FOOD!  Service will definitely follow in place as time passes, and for those of you who bashed them on the food, let\'s be real...these guys are still in training and getting to know the product more and more each and every day.  Obviously, they are doing something right..b/c YOU are eating here, have already ate here, have thought of eating here, wish you were eating here, and wanting to eat here. So EFF the reviews and see for yourself why this company is EXPANDING. :) Yummy!!!\n\nDefinitely, one of my favorite grub and grind kinda place.  Love how they give you a bib to wear and they have gloves if you need. But, we always bring our own surgical gloves because they fit better on my tiny fingers. Xp\nAnd do not wear your finest threads as you may get sauce spashes on you and stink like garlic.  I don\'t even bring in my purse for that matter.  Otherwise, enjoy the silence while I grub.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2014-05-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vVixuWo0ZqG0KV5cHvbS4w', 'review_id': 'dKsVfl9UdBnodVZluXs61Q', 'text': 'Better than the Vegas location! Servers are very friendly and they all help each other out', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-05-03', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 0}, 'user_id': 'P7Zcg73x8FzszGEiC9YPfw', 'review_id': '4OZBHhEBIVmzdw9Ely_tTg', 'text': 'I came back the 2nd time craving for some shrimps and I didn\'t get any!!! Horrible horrible service. I ordered one pound shrimp along with crawfishes. The crawfishes came out but not the shrimps. Our server seem to be avoiding eye contacts. I told her the shrimp never came, she said they back up in the kitchen, alright then. Then I notice they bring out shrimps for this couple that show up after us. I asked three servers and they all said they\'ll check on it, yet avoiding my eyes when am waiting for them to come back. We done with our crawfishes and still no shrimps!! The check came out and I told the girl I still have not get my shrimp, she can cancel it, her response was "ill see what I can do". Came back and says that she was able to remove it from the check, well shit! Of course  am not paying for something I didn\'t get! As if it was trouble to ask her to not charge me. One more things, they decide to pull out a bin of trashes and instead of going thru the front door, they made my friend get off from her seat so they can pull the bin across, how rude!!!', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 2, 'date': '2014-05-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GvCth6sFdpH607ePiCZlaA', 'review_id': 'GXgkLpMLVLy440ZPCqZn0Q', 'text': 'was told wait for 20 mins for to go , but finally it took 50mins to be ready....tastes fine.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2014-05-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'thpo8_zVAb5Dmsosmz7rOw', 'review_id': 'd9A_kWnVTyFe2Auec51GVg', 'text': 'Came in on a Monday afternoon,  no wait and almost empty restaurant.  Yesss. Good came out quickly and was sooo good. Great place to get down and dirty with your family.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-05-05', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 0}, 'user_id': '1ZBEYNkb43eK4KaJFI_i-g', 'review_id': 'VeOwz7CC5qhTuu7ZYH-X5w', 'text': 'This place is right there off of Mill Ave. Let me say....If it lasts 1 year....wow. This place sucked. The service was lame....for example....The manager talking on some stupid headset to her employee who was 10 feet away. \n\nAll I had was calamari, it was flat out gross. Lots of fried stuff except for crawfish. I dunno.....As of today I have no plan on ever returning.....\n\nSad.....I wanted a nice seafood type place in that area....lunch at PF Changs can be crazy sometimes.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 2, 'date': '2014-05-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JPkRvteUUcd9VZQL94HfXg', 'review_id': 'POR60q5CAFtYW5_3CA23qw', 'text': "I've been searching for a good crawfish place for a year now. I'm from California and I absolutely LOVE the BOILING CRAB!!!! It's even difficult to find a place here in az as good as that one. Based on the reviews I saw I tried this place. It took forever for my grandmother fried catfish to get to the table about 20 mins after my crawfish did. The seasoning was watery( I like my seasoning thick) lol. It was ok. Idk if I'd recommend it for those who enjoy the boiling crab.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2014-05-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 5, 'cool': 2}, 'user_id': 'wUEp87FqOB9ew27Iz6zk_w', 'review_id': 'srY0m03VuF0ZI_fpnePr9g', 'text': "The crawfish here lives up to the hype!  The waitress warned us that their spice level is one level hotter than other places.  I don't know if I'd agree with that.  I ordered the medium spice level (which I usually order at other places) and it was about as hot as expected.  Definitely not too hot.  What I really liked about their crawfish was that they were HUGE.  the crawfish were so big that we even decided to crack open their claws bc there was actually meat in there too.\n\nWhat did not meet my expectations was the oysters.  We ordered a half dozen of the raw oysters and they just weren't tasty.  The flavor was weak and tasted watered down for some reason.  The only way to salvage the oysters was to pile on horseradish and cocktail sauce, which was a shame.  I usually love to eat oysters raw with nothing else to take away from the great oyster flavor.\n\nI also tried a pound of the green mussels.  They were good, but not great.  I was disappointed that in my bag of about 15 mussels there were 4 empty shells.  Also they were slightly overcooked and ended up being a bit more rubbery than I would have liked.\n\nOverall, I would still come here again, but I'd stick to the crawfish!", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2014-05-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'fIweOt1L5GIAnfV6IG5RAw', 'review_id': 'BX7iaLkfUhm7b50t219C4Q', 'text': "This place is amazing! Prepare to get messy (don't worry they will give you a bib and gloves)!  The food was awesome and cooked to perfection!", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-05-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': 'GqRU2dQzm2rBMYLb2Dx5Uw', 'review_id': 'C90AOqnoNK7SwElDqrdw5g', 'text': 'First off, food is good.  Table of 5, we all ordered an assortment of crawfish, crab, mussels, and shrimp.  The shrimp here are probably the best you\'ll have in Az.  Seasoned well, great flavor.  Also, all pint beers are $3 (even for 4 Peaks beers!)\n\nWhy only 2 stars?  To say the service was disorganized is a compliment.  First off, when we were sat we told them we would have a party of 5.  The two of us who arrived first were led to a table and were asked if it was ok if they added a chair to the end of the small table we were led to. No, its not ok.  I don\'t want to be eating on top of each other.\n\nNext, after our party arrived, we ordered some drinks.  Nothing was wrong other than we were asked by THREE other servers if we would like something to drink while our? waiter was getting us drinks.\n\nThen, after looking at the menu, all crab, shrimp, mussels, etc. say "Market Price" for the price.  I get it, this is how most local seafood places work.  HOWEVER, the prices aren\'t posted anywhere in the restaurant.  When we asked one of the servers how we would go about finding this out, he said to just ask.  So you\'re telling me I need to ask the price of the 15+ items that say market price? What?  A chalkboard would be fine!  The Salt Cellar and Angry Crab seem to be able to handle this.\n\nAlso, god forbid you drink two drops out of your water because you will then be swarmed by three kids with water pitchers.  I get it, the food is spicy, but if my water is more than half full it doesn\'t need to be refilled.\n\nThen, our server told us he was leaving for the night.  Ok, fine.  But after he left, nobody came and told us who our new server would be.  We had to ask.  Of course the first kid didn\'t divide up the check like we asked.\n\nLet me be clear.  I\'m not blaming the servers.  They are on a captain-less ship.  I highly doubt they were trained at all.  A manager is on duty, but what is he doing?  I won\'t return or recommend.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 2, 'date': '2014-05-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'FMUdVddLXnaW5rkL-nQJ2w', 'review_id': 'OpgC0FWoyBC_QPV7RBAbHw', 'text': 'This place is fantastic! The food was delicious and I thought the service was great.  Yes the servers rotate through but they are on top of everything.  They initially screwed up our order of crab but they felt so badly they discounted our bill.  I would go back in a heart beat.  I thought the crawfish and crab was delicious.  Highly recommend!', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-05-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'Uc5uB2Q5PbybXyZihY58iQ', 'review_id': 'blOShDBxYWkIrZ0j7llsDQ', 'text': "Pretty awesome spot for crawfish, shrimp and sausage.  As other reviewers have suggested, you are going to get dirty, as will your sleeves if you're wearing a long sleeve shirt.  The crawfish at this place are huge.  I got a couple pounds of crawfish with half pound of sausage added in- that was just the right amount of food. I ordered it medium hot with the hot n juicy sauce (would like to try the Louisiana seasoning another time).  It wasn't overpoweringly hot and the corn/sausage helped cool it off.  I would put it between 2-3, closer to 2.  I also ate a few of my buddy's shrimp cooked in the same sauce.  Honestly they were kind of bland after peeling them, so I just ended up dipping them in the crawfish sauce which helped a lot with flavor. We sat at the bar and got great service from Jasmine.  Highly recommended if you love crawfish and don't mind getting dirty!", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2014-05-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LcsCcXFX9v1rG-KL7BIjrg', 'review_id': '2DBqWgO1hNfU6gXU2d8OQQ', 'text': "The service was rocky at first, because our initial server was leaving after we were seated. It took a while for someone else to finally come, but we finally got Tiffany and she was was great! Can't go wrong with garlic butter shrimp and crab! Keep in mind they just opened, so they have to work out all the kinks! We'll be back!", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2014-05-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '74Tpb9Lz4SBAQ8AB6vJQ_g', 'review_id': 'kJs189g5UBSLPLibCgm56A', 'text': 'Came here before the grand opening and everything was great! I think Greg was our server and he did a fabulous job. (The receipt had the wrong server name) My boyfriend had crawfish and I had fried shrimp. We shared corn fritters and cajun fries. You could taste how fresh the seafood was. We will be back!', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-05-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lof_lTQFwKFHvsn66DMqtQ', 'review_id': 'PAEPnVCyQ8A77iVGj3xY5Q', 'text': "I've been here a few times for the soft opening and it was really good. Staff was nice and courteous and the atmosphere had that vibe like I was in Vegas. So, this past weekend a group of us attended their grand opening. They had this buy one get one with their crawfish so I'd figured, you can't go wrong with that. Spoke too soon.\n\nThe other times have been great, food was on point, but the grand opening, it was lacking. Sauce for the crawfish I ordered was very watery, not thick as it was before. On top of that, my friend was waiting on his free crawfish for like an hour. They kept telling us it should be coming out, but never did. \n\nSo, then it was the very next day group of us decided to eat here again and this time, it was on point. My pound of crawfish came out really good!! I mean for the most part it has been consistent. I'm going to always come here when I get that craving for it because it is still better than driving to Cali for Vegas for it. Overall, food has been good and staff has always been helpful and courteous. So, if you have a bad experience one time, give it just another try. \n\nSide note: The fried fish and soft shell crab basket has been great every time I've ordered it or when my friends ordered it, lol.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2014-05-19', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'gx3ZRjh43OOuavKl_rXvrA', 'review_id': 'z5sq7eNz0xZcLxavb5J28g', 'text': "As a long time fan of Boiling Crab and Kickin' Crab in Northern California I was very excited to try Hot N Juicy Crawfish here at the AZ location!\n\nAfter my party was seated, orders were made. I, of course, wanted to try their crawfish in the Hot N Juicy style (their signature sauce), Medium, 2 pounds of it since it comes with corn and potatoes.\n\nLemons, salt and pepper was provided along with bibs and gloves, the latter if needed (but where's the fun in that?) The crawfish came out and looked very generous for two pounds. Yummy sauce, I would say very similar to Boiling Crab but sweeter, more buttery and the spiciness was just right. The crawfish were good in size, not too many dead ones, but I could tell were frozen by the texture and flavor of their tail meat. The potatoes and corn were good dipped in the sauce however. I tried some shrimp which tasted fresh in the Garlic Butter sauce which was good and the calamari was kind of lack luster.\n\nThe service is a bit strange, they do attempt to refill waters almost every 2 minutes and each order comes out one at a time which is awkward for large groups. What do I do with this large bag of food while everyone else is waiting on theirs? Of course, wait ... but still it's awkward.\n\nSame pricing as back home, but definitely isn't a crawfish place that can hold a candle to any of the previously stated two.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2014-05-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'NiT7UZ6CVF03MY4lw0ALiQ', 'review_id': 'RCOYr8-wOgaM489K9dq1ZA', 'text': "This place was an amazing experience for me! The waiters were really nice and caring!! Although the wait was pretty long it was well worth the wait. The crawfish were by far the best I've ever had. Although their other seafood are nothing to die about their crawfish is. Overall, delicious and friendly service!!!?!", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-05-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '40-dPni2cbqyYZ21OHN63w', 'review_id': 'nDCUOq2V-bf_SGDdbxLnQA', 'text': "Here's a tip: While perusing the menu, order a side-sized sausage or 1/2 lb. shrimp with the sauce and heat you think you'll like to try it out. That's what we did, getting the medium-hot Hot 'n Juicy. The sausage was very good and the sauce spot-on what we wanted. Then we ordered crawfish, shrimp, a soft-shell crab basket, a catfish basket, and a side of corn fritters. The crawfish and shrimp were fun--you dump them sauce-and-all on the table and have at it--but what I'll order again for sure are the baskets and corn fritters, which were all lightly battered and cooked to perfection, and the sausage. There's a nice selection of beers at $3 (happy hour, I presume), service was really good and friendly, music was loud but complemented the ambiance, and there's a parking garage within a short walk. (I forgot to ask if they validate parking, but I should have: parking was $8.)", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-05-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'GzOZ2iuyzT3cwYk49Vb8dA', 'review_id': 'ntf6ICbqqnqtqUFwGqFZdg', 'text': "Sooo pumped H N J is in AZ!  Same great food as Vegas! We loved the outdoor seating option'. Trent was awesome and made our dinner even better.  \n\nHNJ medium shrimp is the way to go!", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-05-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LcsCcXFX9v1rG-KL7BIjrg', 'review_id': 'N5lEP7Vf10txdk1YREIcfA', 'text': '**Update 5/23**\nWe went back only 6 days later and you can tell the world has gotten out about this new location. It was a lot of people, and we were quoted a 30 minute wait, but we were seated much sooner than that. All the servers were hustling to get people seated, fed, and tables cleaned. They were all still polite, even though it was clearly packed wall to wall. I forgot our waitresses name, but she was from the Vegas location and she was great. We saw our server Tiffany from last week and see remember us! Good service and good food!', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-05-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'uBQLQB9qSb6btjVECQhHzQ', 'review_id': '8z9IAmR7cQy5SAmJJKEW4A', 'text': 'My husband and I went for the first time today!!!!!!!!!!!! I had the snow crab w/ Hot N Juicy Mild and my husband had the shrimp (huge shrimp), same sauce.....My o My were we in heaven!!!!!!!!!!!!!. The service was phenomenal and the food was even better. We are definitely returning .......', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-05-24', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 3, 'cool': 0}, 'user_id': 'ahJLpA_HOw7jirf18anovA', 'review_id': 'YA6HZEaOndOQHZNPekYWxg', 'text': "I will not be going back. Angry crab shack is by far & no question about it SO SO SO much better!!! The service and quality of food is below average. The server took forever to do anything, just to close out the check was over 20 minutes. The music was way to loud!! I couldn't even talk to my family members I had to yell. The ambiance was awful and not somewhere I would recommended to anyone. If you want awful service and bad heartburn because of the over seasoned low quality food then this is your place.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 1, 'date': '2014-05-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 4, 'cool': 1}, 'user_id': 'oN-upmHL_CoPpBeoC8D55g', 'review_id': 'RmNX9H6yiQz3aIhtALk2KA', 'text': "Finally another crawfish place in AZ! I've had boiling crab from Cali and angry crab in AZ so I was excited to try this place because I never had the chance to while in Vegas! It has pros and cons\nPros: the hot n juicy sauce is so good! The shrimp and black mussels are good as well! Only had a few mussels that were not opened which was good!\nCons: service - sometimes it's good, sometimes it's not. Having different servers help can be good and bad.. Nice for extra help when u don't see your waiter, but sometimes it's a nightmare to and takes forever to get the bill and pay.  Also location, it's nice it's in Tempe, but the locations is horrible and the space is SMALL . Parking is a nightmare as well. \n\nOverall I will go back again because it's all we have in Az.. But I will not go on a weekend or night! Only for lunch when it is not as busy and parking is a little easier..", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2014-05-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '9Y1_KSrodMF5xyt6ee4n4w', 'review_id': 'pXgt0au7lUUOTMRjL7-jeg', 'text': "I went twice in one week, so I figured it deserved a review.  I'll start by saying it is simple ordering. You can customize eats with different flavored spices as well as intensity level.  \n\nI recommend shrimp or muscles for a first timer.  I enjoyed the shrimp with garlic butter flavor and baby spice level.  Don't let baby spice fool you it wAs pretty flavorful.  I couldn't even taste the garlic, however my husband could tell I had eaten it for the next few days.  The muscles I had were hot and juicy style again with baby spice and was pretty intense.  The corn that I ordered on the side was great.  \n\nMy second round that week I figured I was ready for crawfish.  I was pretty disappointed-I hardly got any meat out of them and especially for all the work that needed to be done.  That was my first time ever having crawfish so it's not like the selection was bad it's just more for the people who enjoy the tearing of the head and sucking the intense wonderful flavor that comes out of the little guys.  \n\nIf that's not your thing they have wings,fried calamari who my 10 year old loved, fried soft shell crab as well as catfish.  Every thing was really great however my daughter said the wings were really greasy.  \n\nMy family enjoyed the experience of eating with our hands getting messy and sharing all the different options.  Well for sure go back  soon.\n\nRemember shrimp with garlic butter as well as clams with baby spice are really amazing and what I will be going back for!\n\nEnjoy", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-05-31', 'type': 'review'}
{'votes': {'funny': 10, 'useful': 13, 'cool': 11}, 'user_id': 'ODhV53XhesCBLJVfGsJGNA', 'review_id': '4OQEO_nz77jflZJQ65yVCA', 'text': 'Although Hot N Juicy has been opened for a few weeks now, yesterday was their official grand opening!  Hearing that there\'s an amazing "buy 1lb of crawfish and get 1lb free," we decided to put off our visit until yesterday.  Being patrons of their Las Vegas location for years already, we were pretty excited to have our very own location here in Phoenix.  Too bad metered parking on Mill Ave sucks butt but oh well!\n\nFor their grand opening, there were balloons, a red carpet, a cheesy Hot N Juicy backdrop, and people giving away swanky Corona Extra t-shirts and necklaces.  We arrived exactly at noon and was told there was a 30min wait that ended up being an hour wait.  Oh well!  We got to stand around inside enjoying some sparkling cider, A/C, and being photographed by this sweet gentleman.  After being seated, everything just flew by!  We each ordered 2lbs of crawfish [Hot N Juicy seasoning, medium spice] with an extra pound free and 1lb of shrimp [Lemon Pepper, medium spice].  I never felt so full after eating 2lbs of crawfish in my life!  I barely even touch the shrimp and it had to be taken togo with my extra pound of crawfish.  \n\nThe Hot N Juicy seasoning has always been my go-to even after all these years of going to Hot N Juicy.  It\'s the perfect combination of spices, garlic chunks, and herbs.  I like being able to see it coating my crawfishes.  Lemon Pepper is my second favorite because it\'s a bright sauce with a nice bite of black pepper.  This stuff coats the shrimp well too.\n\nI\'m not sure if it\'s the gratification of not having to drive five-hours to get to Vegas but the crawfish seemed to be even better in this Arizona location.  The service was great, the wait staff and managers were really friendly and checked-up on our table frequently despite how busy it was, and we even got to see the owner!  It was like being on Man v. Food!\n\nI will DEFINITELY be back again.  No more having to drive to Las Vegas for crawfish.  Cheers!', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-06-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Y1xgjgxdId1uIMzgnmkg3w', 'review_id': 'PW-NISESeGjR1Auqc-7ttA', 'text': 'Great crawfish, best in Phoenix! Great service too, felt welcome as soon as we entered. Ashley (waitress) was amazing! Will definitely be going back!!', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-06-02', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 1}, 'user_id': 'rx2w-qyAY6Yi56K1r1MReg', 'review_id': 'P9132S8ZwQo857mvdgGRXw', 'text': "Solid, but could have been better. Service was great, and their hot n juicy sauce is quite possibly better than angry crab, but there were issues. While the wings were hot and crispy, they won't put sauce on them, and make you pay for a side of sauce. The shrimp I had were inconsistent. Some were very mushy and some had large veins of shrimp poo in them. While the service and sauce were excellent, overall I still feel angry crab is superior.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2014-06-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 3}, 'user_id': 'Oj6HjjL9DqI_o10TbUO8Wg', 'review_id': '1fD1Ck4noN8X9Er7dLNi4w', 'text': 'I personally did not like their "signature" sauce which is their hot n juicy, ummm yuck, it was alright if you have nothing to compare it to but I did and seriously if you\'re craving this style of food, go to Angry Crab Shack in mesa and get the trifecta sauce, now THAT\'S amazing! On top of the sauce being just alright, I asked for mild and it was way too spicy to be considered mild, like nose leaking, mouth on fire, had to wipe off the sauce from crab legs spicy, and I grew up in Asia eating spicy foods so I\'m not a whimp. What a waste of 2 lbs of crab legs and $40. Ugh needless to say I\'ll never get food from here again, I\'m willing to make the extra miles to go to mesa to get the real deal!', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2014-06-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Aq23-C-vFts-Zj2pXQqvWw', 'review_id': 'NuWHgCbyG-IygZg6Uv3O1w', 'text': "Overall,  good experience.  We went there on Saturday around 1 pm and the hostess told us eta wait time of 15 minutes. The place was full and there was only one other party waiting before us.  We waited for about 20 minutes and our table was ready. I've been to boiling crab in cali several times,  so I was familiar with the drill but my party wasn't.  Our server Jazzmin right away asked us if this was our first time and kindly explained the drill and thoroughly went over each item on the menu and how much we should order.  We ordered half dozen oysters,  assorted shrimp (half lb Louisiana spicy,  pound hot and juicy mild,  and lemon pepper baby spice), corn,  and a catfish basket in case my girl doesn't like the spices on shrimp.  I'm not a huge fan of crawfish, so we skipped that.  When I visit my family in cali,  we always go to boiling crab and one of my favorite things is to order raw oysters as an appetizer before I start devouring my shrimp, so naturally I was looking forward to getting my Oyster first. I even asked the server if they could bring out the oysters before anything else and after she went to check with the kitchen and told us that it couldn't be done. I could've sworn oysters were on appetizer menu.... Anyway,  The first thing they brought out was the lemon pepper shrimp.  My daughter who can't eat spicy seasoning started digging in. Shortly after,  they started  bringing out other shrimp but still no oysters.  I asked the server if we could have our oysters asap as we ordered them for appetizer and she said she'd go check with the kitchen. She came back and told us oysters were still not ready.  By the time we were almost done with our shrimp,  they brought out the catfish basket.  The fish was hot, fresh,  and juicy and the side of sweet potato fries were also fresh.  My girl really like the lemon pepper shrimp,  so we ordered another pound and it came out reasonably quickly.  We were getting too full to finish the extra order of shrimp,  so we asked for a box.  By the time our server brought the box,  we were totally stuffed.  By this time, STILL no oysters.  It's not like our server forgot to put in my order,  she kept on checking with the kitchen every 5 minutes and I don't even know what the hold up was.  We ended up canceling our oysters but of course by the time another server brought our check,  we were still charged for the oysters. So additional 10 minutes or so spent unnecessarily to have the oysters taken out of my check.  \n\nAnyway overall everyone in my party was satisfied with the flavor and the amount of food ordered. I was bummed out about not getting my oysters and that's why I give 4 stars but by the time we were done,  I was so satisfactorily full,  it didn't bother me that much that I didn't get my appetizer.\n\nPeople started pouring in by the time we were leaving  (around 2:30 pm on Saturday) so I think we made it just in time.  Shrimp was plump, seasoning was flavorful (except the Louisiana one.  I mean it was ok but wasn't the best), plenty of drink refill,  our server Jazzmin was attentive,  friendly,  fast,  and knowledgeable,  so overall,  a good experience for us.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2014-06-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '25bDpDD6-0vo1WbGPQHQbQ', 'review_id': '2YIcThbSDJ83Ing-HZNwUQ', 'text': 'Been to Hot and juicy a couple of times. Service is very good they always make sure you are having and good experience.  Each time I have the Catfish basket and A pound of shrimp and its been great each time. Love this location and I think Tiffany gives the service in the whole place.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-06-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'gASl2HoS9uMsxSFC7rHoPg', 'review_id': 'dXWtQ0niHAMz0W-pJw2o0A', 'text': "Hot N Juicy is a really cool idea.  I love that there are no plates, silverware, or f*cks given.  You order the seafood you want, the sauce on it, and the spice level.  They bring it to you in a bag and each table gets its own roll of paper towels.  You just dig into the bag, eat your food, and toss the leftover shells on the table, again very cool and fun.  However, the sauce I got, Hot N Juicy flavor, was EXTREMELY salty.  Think Ramen Noodle flavor packet salt....  And I got Spicy, and it was barely spicy.  Had the crawfish, mussels, lobster, and crab.  All the seafood was very good.  Wait staff was hit or miss, they did not come around much.  Also they are just starting a full bar, so if you have a margarita, and it tastes good, you're welcome I told the bartender what to do different.  Atmosphere was all over the place.  The music is loud and all over the place, not that it's a bad thing.  Also there was no soap left in the bathroom...  After getting my hands completely covered in sauce basically up to my elbows, I was hoping for some soap to help clean off.  Anyway, I would saw give it a go because their seafood was tasty,  but just be weary of the sauces.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2014-06-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': 'lof_lTQFwKFHvsn66DMqtQ', 'review_id': 'fSVyMJd79J8xNy9zUm-Whg', 'text': "I'm becoming a regular here, lol. There was a lot of people for Saturday night and I expected it. So, me and my friend went to the bar across the street (Zipps) for a few beers. I think they told us the wait was 45 min. to an hour so we thought we came back in time, but we didn't and our spot got taken. It wasn't a big deal because 5 min. later we got seated. \n\nOrdered the usual crawfish, hot n juicy mix/spicy and then also got the half pound shrimp with the same seasoning mix with a side of rice. Everything tasted very good!!  Also, our server was Tiffany and she was awesome! Her customer service was very exceptional and wouldn't mind having her as my server next time I eat here!", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2014-06-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'eiZVvbulAs0WaJdf5FM5uw', 'review_id': 'ktl_RDPf7iqld3XYaipAnQ', 'text': 'I had 2 lbs of clams, 2 lbs of shrimps, 2 lbs of crawfish, 1/2 dozen of oysters, a dozen of sausages, 4 sodas, and a sweet potato fries. The bill was about $100. The food was good, meter parking sure was not worth the trouble. I had garlic butter seasoning and I thought they were a tad salty. Oysters were fresh and yummy! The sausages were definitely very salty. The service was ok. There were only 2 tables when we got there, around 4 pm. The whole time we were there, there were 4 tables with customers. Nobody bother to come by to ask how did we like the food or refill our drinks or if we needed anything else. They never brought gloves over when we asked for them. Such a bummer!', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2014-06-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3qZWlbG4x7GGVq7KUWiXvA', 'review_id': 'NQ5jApLKqhH9H2bhdVyZFg', 'text': "I'm not a huge crawfish person but this place is good.  I got the 1 pound of shrimp and that's seriously enough for one person because I couldn't finish it.  The service was good I was just confused to why their trash cans are located right outside of their entry way.  I think that's pretty gross considering they having people sitting outside and walking in.  I understand you have to dispose of everything for the guests seated out on the patio but don't place it directly in the front where everyone can see it.  Also, the beer on tap was warm which is not too pleasant so hopefully they figure it out soon since they only have been open for a few months.  Other than that, the food was bomb. Greg is a dope server.  He's personable, polite and has a positive attitude which I value in a business.  I'll be back again!", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2014-06-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'Y_MGR48ZUlUouQrNQrEeVA', 'review_id': 'EhMBoygW7sQ8HeBF609twQ', 'text': 'They charged us more than market listed price by a few dollars food was average tasted like everything had too much celery salt on it ... Not a good experience ... I would rather eat at angry crab any day way better food and this place only gives you one wet nap for real lets not be cheap now ..', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 2, 'date': '2014-06-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'j-kShDJgp5acGhqJAkJHnA', 'review_id': 'p1D42i7WNAXvsMqtxhKblA', 'text': 'Did not expect to like this place.  No plates or silverware, everything covered in plastic, bib on the table, offered plastic gloves to wear to eat dinner.  The whole concept just seemed off putting.  \n\nI was wrong.\n\nIt was great!  I enjoyed every messy bit. \n\nWe had clams, crab, shrimp, potatoes and corn all served to our table in plastic bags fresh out of the boil.  \n\nThe service was excellent as they made us feel like we were their only customers.  \n\nThe only downside is that parking on Mill is a challenge so we parked in one of the pay garages and it cost $8.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-06-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'KtEXoizf08uNrACct1ETGA', 'review_id': 'gq7_ZWgtSYjGKX1MwbfrTw', 'text': "The crawfish wasn't very fresh.  Half of the crawfish in both of my orders were very mushy as if they were previously frozen or precooked the previous day or something.  The sauce in both orders were too sweet, lacking the Cajun flavor that I'm used to eating.  Our waiter recommended the Cajun calamari, but when it came out, there was no Cajun spice added to the dish at all. We informed our waiter that perhaps he placed the wrong order and he told us he would check with the kitchen staff.  We never saw him after that, and we were still charged for the dish.  Overall, I feel that the crawfish was not up to standard, and the staff didn't seem to care.  I'm not sure why the Food Network featured this restaurant.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 1, 'date': '2014-06-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3Iwhqw19SfTp-gCCZe0uaw', 'review_id': '8DA1nC36HnhPtwzle0YKPA', 'text': "Today was the first time I had gone to this restaurant. It was lunch time so we were seated immediately. My problem with the entire experience is although the food was fairly good it was so salty we could barely eat it. I've gad creole seasoning before but somebody went overboard ! Also it is supposed to come with one corn and one potato but we got neither until we were ready to check out. I prefer my meal to come out at the same time and I had to watch my mom almost finish her crab legs while I waited for my meal to come out. As I am writing this review, I am drinking tons of water to flush out all that salt!", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2014-06-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'kMwq6s0ROH4Zjn4mHCxejw', 'review_id': 'PvsmitaOZ7WIq0Kso5Vyiw', 'text': 'This place is VERY good. I went there for the very first time today and overall I had a great experience. The staff was super friendly, the food was actually very good, when I was on the website to see what they had it did not seem appealing; but the food said it all. It was interesting the fact that the food comes in a bag but there is a reason why that is; the food is super messy ! But VERY GOOD!  \n\nThe only complaint I have about this is the fact that they open up at 12:00pm which I wish they open up earlier for lunch.\n\nOverall, if you have not been here, you must go !', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2014-06-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yJsOUvbBKmxprlZs8xHomg', 'review_id': 'iIMfY5T9gwm3tLr0QCV0ZQ', 'text': "This place is delicious!! The only regret I have is I should have gotten the hot instead of medium. The service was excellent and a great location! Can't wait to go back.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-06-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZWKbVUzYh-z8-AcITkUMzw', 'review_id': 'v8plFgMZjUA6EyAHC293zQ', 'text': "Great food but terrible parking. I called in a To-go order and spent 20minutes circling attempting to find parking. I love the food and will go back but if you think you're going to quickly get in and out you might be disappointed.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2014-06-24', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 1}, 'user_id': 'uMxGricI_UKn9gB38i5Awg', 'review_id': 'Vx8MQPJBKaVD2VgafYQYIA', 'text': "Don't head over for an early business lunch since they don't open till noon. Here is a hint for a restaurant owner in Arizona. It's hot outside. We start work early. We eat lunch early. You are losing a lot of business if you don't open by 11. 11:30 at the latest.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 1, 'date': '2014-06-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VCGnCv4q_lyLaIzlDsiWMg', 'review_id': 'ckhcyRVvtj_LlWIvNgejTw', 'text': 'Food was good. Very good. Service was friendly and helpful. Only reason it not a 5 in the music was real loud. i ask to have it turned down and its was but right after that a really loud and annoying trap/dub step song came on. The song was very distracting and it felt like I was at a rave. Over all Good.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2014-06-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'J5XFTWCDpFTG7Fn-JAd_wA', 'review_id': 'oYgtfbWhSfsLtyOGzB5UDw', 'text': "Been there 4 times already and Hot n Juicy has not disappoint our family!!!! Awesome service by Myra and Trent and great seafood. We will definitely be back. Great job !!!'", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-06-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'RGCHoFd5ND46cLtdyJHKjg', 'review_id': 'mpfJYfat2xpv7_ltgM1Axw', 'text': "I like the place but since it's still new the service still needs work.  Always ordering at least 2 lb crawfish and mussel (green) fries are always good.  I tried the etoufee was cold.  So that wasn't good.. But slightly satisfying the cravings", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2014-07-01', 'type': 'review'}
{'votes': {'funny': 6, 'useful': 4, 'cool': 3}, 'user_id': 'XqMkm-DD9VsdcKx2YVGhSA', 'review_id': 'm91e3txCz70X0g_sL887qw', 'text': "(Lyrics - Katy Perry - Hot N Cold)\n\nYou serve your food\nIn a bag, while it's warm\nYeah your, crawfish spice (stings!)\nLike a bitch, I would know\n\nAnd I over think\nAlways order the dungeness\nI should know\nThat you're so good for me.....\n\nCause you're HotNJuicy\nI'm Yum then I'm Ohh\nI'm in then I'm out\nI'm up then I'm down\n\nA well respected establishment that has a reputation from Vegas to LA and now PHX!\n\nI came with a couple of my gal pals since one of us attended Angry Crab about a month ago and was delighted. We ordered pretty much the simple things, 1lb of crawfish with the Hot N Juicy sauce at medium, oysters, dungeness crab, and some wings and cajun fries.\n\nFirst off, I went for the oyster; definitely not the freshest, but hey we live in a desert! Then the crawfish; much larger than I'm used to so kudos on that.  The sauce is what makes the crawfish boil here.  I thought it grainy and thick and probably could be a little more watery.  The wings, well I had better else where since they were quite soggy. The cajun fries were good and crunchy and finally based on my friends take, the dungeness crab was pretty good. I'd say the sauce was okay at best, but nothing too WOW!\n\nIn the end, I guess I don't get the rave about these crawfish eateries, but can appreciate them. My overall service was excellent. The ambiance was tacky as most crawfish joints, but I would recommend a hand cleaning station outside the restrooms. - Enjoy!", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2014-07-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dmzr3qGjuK0LXZAp6IYVcQ', 'review_id': 'OG7T8JFfY9B9nCC25h-RdA', 'text': "Food was excellent. Not as good as the Boiling Crab wholeshebang but seafood was just as fresh! I'd recommend it for all seafood lovers!", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2014-07-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '7kt8Nsy1pSh4iPQCJk64Cg', 'review_id': 'DTqnd6XKjYqZ6cUbmSaMPw', 'text': "Hot N Juicy should be renamed Slow N Sorry!!!!\n\nThey can't remember orders, they make excuses for their incompetence and worst of all, they over cook the seafood, which makes it come out slowly. How do you forget bringing 2 lbs of Crawfish when that is the main thing you advertise in your name? \n\nThey need to really re-think their business model and consider some professional leadership and server training.   Don't be surprised when you walk away disappointed, insulted and confused on why something so good can go so wrong.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 1, 'date': '2014-07-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'FIJrphuHLbEccoMFAHkwpQ', 'review_id': 'lfUgq97errY4OMOdHSAaCA', 'text': "I have been here 4 times always get the shrimp lemon pepper w/ Cajun fries which comes out great! Service is a hit and miss so don't be surprise on a busy night things are missing. Can't beat the Vegas location", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2014-07-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DGlyB4-qPjG731LOt0J2SQ', 'review_id': '0nHCyhVomGZLx4NMx39hKQ', 'text': 'This place has amazing customer service and the food is amazing. The only problem is the food is very spicy so go easy on the spice.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-07-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'y9R1oAWuZKPtaDm_6lMtag', 'review_id': 'Qs7vfv1AKQDimapsva1fwg', 'text': 'This place is amazing. We have 2lbs of crawfish, 1 lb of shrimp, 1 dozen oysters and two beers for $60! The seasoning was fabulous. Wish it was closer to my house so we could go every week. This is a must try restaurant.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-07-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': '1i0uJk_rOBo-jzDaGCph2Q', 'review_id': 'B3-LPrrLxeZ9HES36uhrIg', 'text': 'I hope you guys can use fresh crawfish for the customers!', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-07-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MuEXJ6Uq-ltxUi-u2Qb9SA', 'review_id': 'ENJMyqipbJZqO9tH4m4UbA', 'text': "The hot juicy in Tempe have plenty of great reviews but when we went our waiter Billy ignored us and myra the manager came to assist us she was very helpful and noticed that we weren't being properly served, its weird how they charge you by the pound for lobster  but half of its unedible, so you pretty much spent $33 for a lobster tail and also the shrimp is not deveined!, that is probably why they are so popular in Vegas and other places where alcohol is prevalent because people do not notice what they are eating!", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 2, 'date': '2014-07-24', 'type': 'review'}
{'votes': {'funny': 8, 'useful': 10, 'cool': 8}, 'user_id': 'IDHrwv_RCildFvmfWTkj5Q', 'review_id': 'hzT97pr7ODoEPbWouzAoJQ', 'text': "This visit - 2 Stars.\n\nThe quality of the crawfish I ate last night was terrible.  I do not think I will return to this place after last night's experience.  I brought a family member to try this place out and she barely ate the crawfish because she felt like they were frozen and tasted horrible.  \n\nI inquired about the crawfish because they were not good.  When I came in April, they were fantastic,  they were delicious, they were Hot and Juicy.  I wanted to know where they came from.   I was told Lousiana.  I asked if those were live when they cooked them... I was told Yes.\n\nHere are a few more questions I asked the manager.\n\n1.  Do you sell crawfish year round?  ANSWER: Yes.\n2.  When out of season, do you get them live?    Answer: Yes.\n3.  Wow, where do you get them from?  ANSWER: From Lousiana.  They have farms that grow them in the off-season.\n\nMe...  dumbfounded.  \n\nI have lived in the deep south a good portion of my life, eaten crawfish since I was old enough to pinch tails by myself and never... not ever have I had crawfish in the off-season.  Places that sell crawfish in season stop selling them in the off-season... because it's the off season!  HNJ has an interesting distributor that has resources and access to things I've never heard of in my matriculation in LA. \n\nWe also ordered a shrimp basket.  Excellent fries, but cornmeal battered shrimp?  if you are going to do that, please make sure the corn meal batter is the best on the planet because cornmeal on shrimp is unusual and is not so great.  Did someone in the kitchen forget the recipe?  I don't know.\n\n1-star for the good fries and the attentive service.\n\nReturn Factor: 5%.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 2, 'date': '2014-07-25', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 2}, 'user_id': 'HnqzojvN3AyZHjslUlxiJQ', 'review_id': 'ffmJTFcwTR4NE480QPp7kQ', 'text': 'Never in my life had I ever had crawfish; so when my friends recommended to go here one night, I was down! Also, what is better than putting a bib while eating. \nI am happy they have something like this in town. This place is new so definitely check it out. There might be some bad reviews in here, but my experience was pretty good.\nAnyway, the 6 of us got a table relatively fast since 2 of us got the table first. :P\nI wasn\'t sure if it was happy hour when we went or if that is the standard price but the shocktop was like $5 and we were like "Yes, please!" \nAnyway, we did know how much we would eat so I let my friends who were experts at eating crawfish and shrimps picked it out. We first ordered one lb crawfish and 2 lbs shrimps. We heard that crawfish does not have much meat and shrimps would be more satisfying. I really did not know how little meat the crawfish had. It was basically like paying for the outside shell. You can totally tell we were noobs because we had gloves on when they offered it. I wouldn\'t use it next time, I rather dirty my hands with yumminess.\nWe also ordered cajun fries and calamari. I didn\'t think for the price, it was worth it. It was gone before we started! Well from that, we ordered more because that was definitely not enough to feed 6 hungry people! Anyway, they have really spicy flavors; I wouldn\'t recommend it unless your taste buds can handle it. \nWe ended up ordering 3 more lbs of shrimps and one more basket of calamari. \nAt the end when our bill came, it was about $103; which was not too bad especially with the 6 of us. We all split and came to about $20 a person which includes tip. I would totally come back, but stay away from the crawfish and just stick with shrimp.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2014-07-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'l8Pvmx3bIUL5Gr7MEgPOiw', 'review_id': '2aNWMT-I5uT2vvCgLBEYQw', 'text': "Come to this place once a week. I'm addicted and can't get enough. The lemon pepper sauce is my favorite. The service is always amazing and greeted with smiles.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-07-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mAlZkwWBYwT1Jyz00JIPkQ', 'review_id': 'cEsb5S5Q9K9Jq3rnqFVSyQ', 'text': 'We went here for the second time this last Friday night, the place was packed, despite this the wait staff treated us wonderfully!  The food was great, crab mussels shrimp and crawfish were all great.  \n\nBoth of our visits to this place were fantastic.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-07-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'zscvqPBjDrj6TbX9LtDp-g', 'review_id': 'YS329lSCa_s8OpxNDfYOZg', 'text': "Excellent seafood place, especially for a desert city. Its so new, that it's not even posted as a location on the franchise webpage yet. so it's crazy that they're already this busy by just word of mouth. The service was good and responsive.  The crawfish are not as large as in other yelp pics. I'll skip it next time, but thats just bc I'd rather eat their other stuff. The oysters were large, but just ok. Shrimp and king crab was good. Most impressive, they don't skimp on the spices and seasoning. There's plenty for flavoring, and re-dipping. It would greatly help if there were better (written) descriptions of the flavors, maybe even offer samples of the sauces.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-07-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Qi2u6I_VY1WiGJ60tu_AfQ', 'review_id': 'pd_a7N1sazB9Yhx9izLctw', 'text': "Downright awful - shrimp were way overcooked - total mush.  Spice blend all water - nothing flavored the meat (makes me wonder if shrimp were pre-cooked and dumped in bag of spice soup)\n\nAnd we had a lot- of people - not just one bad batch\n\nMussles were ok\nCorn fritters didn't have much fritternessx- chunks of corn fried\n\nNot at all pleased\n\nMushy shrimp = bleh", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 1, 'date': '2014-07-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4fUqlhL22e8jFkB33ptN_A', 'review_id': 'A5iO3a7qLvot_k0qomMnFQ', 'text': "This is the Best Place to go to in Tempe, if you are craving Cajun Style Seafood!  I can't get enough.  I have to come in and get my fix, at least once a week!", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-07-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'eiZVvbulAs0WaJdf5FM5uw', 'review_id': 'r3sHgvMTADMZn5tSYkw99g', 'text': "Came back last night with friends. The service has improved, servers were more attentive than the previous experience. I was recommended the clams with lemon pepper seasoning. It was really salty, I wouldn't try it again. Before that I had the Louisiana style and that sure tasted better. This time around, I gave the hot and juicy seasoning a try, and it was pretty good. I recommend everything in the hot and juicy seasoning bc it wasn't salty.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2014-07-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'rx2w-qyAY6Yi56K1r1MReg', 'review_id': '_iy0zogxJK4xOKYs8O_1gQ', 'text': 'Wow, decided to give it another chance after the manager reached out to me. This time we did dungeness, snow crab legs, and motzerella sticks. The crab was some of the best I have ever had. Ali, our server, was friendly and prompt. Great experience. Will be back!', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-07-31', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': 'GyeV0fMvhbL84pYy9ntI4g', 'review_id': 'FE7MNBX7YYGU5Rwsv9avAA', 'text': "Worst place for a first date. You get messy, gross, clumsy. Your food is looking back at you. You have to somehow find it in you to rip off this creatures head and suck out its brains. Its hard to walk out with not at least getting some stain on you even with gloves, a bib,...a hazmat suit. Saying all this.... I love this place.\n\nI hadn't had more fun going to a restaurant with a group then I did going here. The experience was new to me since I never had crawfish before, nor had to break open my own shrimp. But it was a hilarious time and conversation starter just trying to get to your food. \n\nThe service was epic, our waiter was so courteous and and cared so much to make sure we were all having a good time. \n\nThe food was delicious one I got a hang of learning how to break the damn things open to get to the meat (I don't recommend going here if your really hungry, treat this place like everything your putting in your mouth is a delicacy because getting to the actual food is kind of a mission, so takes time and some effort to grub, which again makes this a great place for social gatherings and conversation as your eating is actually done very casually as most the time your spending breaking open shells and talking). \n\nThe prices are reasonable as well, maybe a bit expensive for a meal that you can't quite get very full off of but I feel still worth it as your paying for the experience of being there as well.\n\nOverall I would recommend this place to anyone and would totally be back with others to show them the novelty of what eating crawfish is like.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-08-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DjC5qZXdaW70tLNeYGd9bQ', 'review_id': 'jBtKwwBcvsdYNrUObymdHA', 'text': "It was really great when it opened but every time we've come since, the flavor and quality has gone down\n\nThe crawfish is very salty and the service is very inconsistent\n\nWe came in and more then half the restaurant was empty.  We went in to get a table first and the host refused to seat us until half the party arrived, even though I told him repeatedly I was ordering for everyone and they were just parking.\n\nI understand policy but common sense people!\n\nUpdate to my review from earlier this evening.  Myra a manager came out after reading our review and asked for feedback. I definitely appreciate a business willing to listen to their customers.  The servers were also super friendly and helpful tonight as well.\n\nI hope they're able to maintain their consistency and service.  We loved it when it opened and we want to love it again\n\nThanks Myra!", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2014-08-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'MiApu1_03YUaFpKWhZndjg', 'review_id': 'hQnD7d4xh5sNCAnKmsQNcw', 'text': 'If you love seafood just as much as i do, you wont regret coming here.I kept it simple, ordered  a pound of crawfish with a side of cajun fries, which were delicious.I highly recommend this place for my seafood heads.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-08-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'DV7XGdZZT-7nOIF2cSXoWg', 'review_id': '9WdseT3z1_UuqrIMYKEVLA', 'text': "This place was pretty awesome. Service is great. Our server was Ashley and she was very attentive! Now, nothing against this place, but my family and I were comparing to The Boiling Crab the entire time, And really nothing can compare to the boiling crab!!! But Hot & Juicy can stand on their own for sure! We ordered clams, shrimp, and crawfish and everything was amazing. We added corn and potatoes and sausage and mmmm!!!! I'm craving to go back! Hits the spot when I don't want to drive 6 hours to LA!", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-08-11', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': 'OOxLwlNadygUwL_aG8KnSQ', 'review_id': 'o1p4EJiXj1QqJyUVN5GR3A', 'text': "I'm just not a fan. I came here once with my buddy and it was just plain messy. I do love to eat seafood and crawfish but clothes and hair smelled like fish after leaving that place.\nI'd rather go to my go to seafood place I've been going to for many years. Unfortunately, I will not be back!", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 2, 'date': '2014-08-12', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'FUMdzARf71drXyDZ7lkpWw', 'review_id': 'IZRWqItH7qT-b5qwLS-aig', 'text': 'My first visit, I was confused a little about the concept, but the food cleared that up. For how busy it was on a sunday, I was a little concerned, but was immediately sat, and served, crab legs came out quick, and hot..the spice butter stuff was AMAZING, I ordered medium, and it was hot as fuck, so be careful with that shit. Prices were more than fair! I got out with about $20 in damage, and was overly satisfied.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-08-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'leCRchr3W3TEcVgmEOpuUQ', 'review_id': 'CnPldgWWbPMGMKJFeY3K9w', 'text': 'Loved the boiled shrimp. The king crab legs were great. Pleasant atmosphere with cheerful and up beat staff. Prices were a little higher than expected but other than that, everything was great.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-08-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'pNvoNTu6U7Ek2w_xe4QO-w', 'review_id': 'PItmlwGDFVbwsct2zKH7jQ', 'text': "Went last night with a group of friends. First time. I'm from NYC and spent summers in NJ catching and preparing fresh fish, clams, and crab with my grandparents. I've also eaten seafood on both coasts and here in AZ. This restaurant is way over rated. While the gimmick of no utensils and serving seafood out of plastic bags is different, I cringe at what type of plastic bags they are... Now on to the food review:\nI ordered a 1.6 lb lobster, garlic butter, baby spice. It was WAY overcooked. So rubbery and chewy I could barely eat it. Couldn't get any waitstaff attention to save my life so I ate most of it anyway. They gave me 10% off which was only $3 off. Wow.\nI also ordered black mussels. While they were cooked properly, they were so small you'd have to order 3 lbs of them to satisfy any hunger. \nMy friend ordered boiled shrimp and they were cooked nicely. \nStay far away from the fried shrimp, though. Way too salty and the cornmeal breading was not done well. \n\nSo- stay away from the lobster is my tip. I've seen reviews that say the same about over cooking them. If you're gonna pay $30 for a lobster go where they know what they're doing.  \n\nAnother low point- the waiter had a table of 10 of us and barely checked on us the whole time we were there.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 2, 'date': '2014-08-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'RjgZ0d_WJpdwuN7a51wF_w', 'review_id': '19Z5S_aKRrPcS9I8sfTCZg', 'text': "I'm southern. I love seafood. This is NOT southern seafood faire. I ordered fried shrimp. It was covered in a cornbread BATTER... No no no no... There is no such thing for shrimp in the south. Its JUST cornbread but not on shrimp! A meal mate ordered crawfish. They were TINY... Not enjoyable.  If you like the food there.. don't go south and expect to find the same.  Its really much better at Angry Crab.. but even they are not true southern seafood pleasure.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 1, 'date': '2014-08-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wzRRWPxEFx4XVBvdxjvdng', 'review_id': 'FmirW1sT1WToEqiWuG4Fsw', 'text': 'Yummy! Loved the Snow Crab.  If you like spicy definitely go a notch UNDER your regular spice level. I normally do hot but the medium was hot for me. Definitely going back. My friends loved the boiled shrimp too.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-08-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tapowpemeuVdBOB8NFN3Qw', 'review_id': '5XJ85J16cK6T9hvBRszcDw', 'text': "I am definitely a fan as far as fresh seafood goes in town.\n\nWe came here for a friend's birthday lunch.  I thought it was odd that there was no sign for the business but the reviews were good so we figured what the heck.\n\nInitially I was skeptical because we were slowly filtering in for a large party and the server bypassed me a few times before I finally was able to get some water and a beer.  After that though it was a good experience.  The server was pretty attentive the rest of the time.\n\nWord to the wise - be prepared to get a little messy.  This is fresh style seafood so they sell it by the pound and toss it in seasoning so you have to pick the crab or crawfish or shrimp depending on what you get in order to eat it.  If shrimp heads gross you out, this may not be for you.\n\nMy girlfriend got the crawfish Louisiana style with medium spice which was pretty good but if you haven't had crawfish before be prepared for more work to get to the meat.  It was still pretty good though.  I had the shrimp cajun style with medium spice and it was outstanding.  You still have to pull the heads off and peel the shrimp but the  shrimp were a good size and the price was good too for the amount that you get.  We ended up getting another order cajun style with mild spice.  The birthday boy had crab legs and enjoyed those as well.\n\nGranted, I have had fresh seafood in New Orleans and in D.C. but this is pretty good for being in Arizona.  I would have no problem going back here when in the mood for fresh seafood.  Just make sure you aren't wearing white when you go :)\n\nDefinitely recommend.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2014-08-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'ZgTmDSSkIWNxZLH5q235AQ', 'review_id': 'op9R9GZXcSiX7cZVMUr1IQ', 'text': 'Came here a few weeks ago with my family. Service was eckkk. They made us wait for half of our party to be present in order to seat us. Oysters were no good, they were fat, way toooo big, and no flavor.\n\nCrayfish has decent flavor if you order the hot n juicy. Shrimp was delicious. \n\nReason why they are getting 2 stars is services from being to end was horrible. Eating spicy foods and having no beverages sucks. Waiters rarely came by to check up and you have to ask for re-fill as they were not attentive at all to their customers.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 2, 'date': '2014-09-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'x2i56RYMtZ8SdpA4XDzXdQ', 'review_id': 'G4MqhXIcb3moUVKNuxUN8Q', 'text': '$1 Sapporo beers??!!! \nCount me in!\n\nHusband and I went walking mill ave looking for something new for date night. \nI\'m from CA and loved Boiling crab, seeing this was a similar atmosphere. I was in. \n\nHusband isn\'t big on seafood, he was obsessed! Talked about it for days \nWe got 2lbs of shrimp \n1lb of snow crab (which was about 6-7 pretty large legs) \nAll in "hot and juicy" flavoring.\nNo spice, however it was pretty spicy!!!\n & some Cajun fries. \n\nService was excellent, our server took the time to explain everything on the menu \nMusic & crowd was great! We were expecting a lot more chaos being it was the first week of school at ASU \n\nAll that plus 4 beers for around $50!! We were stuffed & happy!', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-09-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'flYl_hKWMNiTKhA6k_V48Q', 'review_id': '2x2-RlBCSf3CYckkYevdqg', 'text': 'We arrived at 7:45 on Friday evening for dinner for a party of 20. My husband and I were the first to arrive. We were sitting at the bar for a least a few minutes, completely ignored by a "team lead" before someone finally took our order. The bar area is really small with seating for only five, so they were in a hurry to cash us out from the bar before we even received the appetizer we ordered. Hubby ordered a peach ale which still hadn\'t arrived 10 mins after ordering since they needed to change out the tap - I appreciate they told us at least, but it would have been nice for them to get a move on! We received it after asking again. Cheese sticks were average. I asked for more sauce and received it quickly. This place obviously hasn\'t been open long - they\'re still figuring things out, working out the kinks. Another woman at the bar said the place should be twice the size - like they underestimated demand. Of course that\'s how it looks on a Friday night, but this is in July when everyone evacuates the valley so I can only imagine what this place will look like in November or (God help them) March. \n\nAll of the above would have been mostly excusable if the food were good... but it wasn\'t. Even mild was way too spicy for us to eat. And I\'m not the only wimp - so are all my Asian and Hispanic friends. Time to eat some cereal at home... Also, plan to work really, really hard just to get a tiny bit of crawfish. Not nearly enough payoff for the effort. And they did NOT validate parking, so we had to spend an additional $12 on that. And then more for dry cleaning our clothes... Even if you aren\'t a messy eater, the person across from you will get you covered with sauce. I asked the waitress how to get it out of my clothes, and she said that\'s why she always just wears black... thanks (not).', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 1, 'date': '2014-09-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7exXauH4E6Vs9bcjQ_tS1A', 'review_id': 'UCONrRIrRNcGuUuLRcXZIA', 'text': "Inexperienced service, slow, unorganized. The food comes out in odd orders and it may be a spread of 45 minutes before all of your food gets to you. They always say they are working on getting parking compped for the garage but that has been the case ever since they've opened.  There's no team work in their service and our servers hardly ever comes around. \n\nIf you're like me and fell in love with this restaurant in Vegas, you'll be disappointed by your experience here in Tempe.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 2, 'date': '2014-09-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'J6bF6kHsx0_kQNURas8-Cw', 'review_id': '0QiVlin5QavUn8V-B95M0g', 'text': 'Ordered hot n juicy shrimp, there were three in our party. Two of us were served while the third person got served the wrong shrimp. The waiter quickly apologized and took the wrong shrimp back to the kitchen and assured us the corrected order would be out in 2 minutes. After 20+ minutes the correct order arrived. Needless to say the other two in our party were done eating. The waiter assured us he would discount the delayed meal. Hahahaha he discounted it all right -- we got $1.80 discount!!!! Seriously.....will never return. Customer service sucks!!!', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 1, 'date': '2014-09-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'qHtZ4nsa9SgdXU3QusWtlg', 'review_id': 'nL3u_qoV4y6oh--kPC0wMA', 'text': "I've never heard of this place (Hot n Juicy Crawfish) until my bf had suggested to check the place out. I went with a couple friends and the bf today to give it a shot. I wasn't expecting so much from it due to the past experience of another place with the same style of food (Angry Crab) that we tried and turned out quite a disappointment in the end. \n\nSurprisingly, Hot n Juicy Crawfish turned out better than I expected. We got here around 3ish so it wasn't busy at all which was perfect cause we didn't want to wait for hours just to be seated. As soon as we were seated the waitress immediately got us started with our drinks. I was pretty impressed with how fast service was and how quickly they got our orders out. The waitresses/ waiters worked as a team and I thought that service was just excellent. It didn't matter who our waitress was because every now and they all took turns checking up on us asking if we needed anything else. \n\nThe food was GREAT! We ordered 2 lbs of hot n juicy shrimp, 1lb of snow crab legs, corn & cajun fries. Our friends ordered oysters, clams, and crawfish. They definitely give you good portions of the food; definitely a lot more than what we would have gotten if we went to Angry Crab. The food was fresh and delicious! We were so stuffed we almost didn't finish our food. The place was also very clean. \n\nWe had a great first experience at Hot n Juicy. I would recommend checking this place out. :)", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-09-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZINVVmKRRUDdkTnyx5MhNg', 'review_id': 'ziqEEA5_V60xVOA7xISNyQ', 'text': 'Love it!!!', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-09-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'eaxYF7pnrBAq6tZMS45xYA', 'review_id': '-aux3befW__DJ3D_qOm1UQ', 'text': "Pretty good seafood and is very comparable to the boiling crab in California.  I didn't like the hot n juicy sauce but the garlic and butter was rich, flavorful.  Will definitely come back because it is by far the best crawfish place in az.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-09-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WBZXNbaf1hmID5VgGAIX0g', 'review_id': 'bdo1qMy-sZMa_WTKHxVaHg', 'text': "Stopped here for the first time the other day and was pleased. Love the concept of peel and eat seafood served sauced up in plastic bags by the pound. Although the seafood in the desert can be somewhat small, the shrimp and crawfish we had were full of fresh flavor. After tying on our complimentary - and much needed - plastic bibs, we tried the hot n juicy (our favorite thus far), Louisiana style, and lemon pepper seasonings, but there are a number of others you can try, as well, along with setting your own spice level. Your server will also ask if you want salt and pepper, gloves, and lemons. Don't be afraid to crank up the heat...but do be prepared to leave garlicky!  Although there aren't many side options (rolls, short cobs of mushy corn that mostly serve to absorb sauce, potatoes, and a few others), there are a lot of good local beers on draught to wash down all that seafood. Our servers, who were all friendly and attentive, made sure to check that our pint glasses never ran empty. Definitely prepare to work hard for your food here - don't be in a rush and expect to leave messy! But enjoy the experience. It may not be the best seafood you'll ever eat, but it sure is fun.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2014-10-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '-V3CXSxnUzjkLVqi1xGrkA', 'review_id': 'Vozz145EW2Y35BXbAdC4Dg', 'text': "The Excellent: \n* Nothing\n\nThe Good: \n* at 4PM it was empty\n* The Hot 'N Juicy sauce was good\n\nThe Bad:\n* Crawdads were tiny, and didn't have much flavor other than the sauce they were drowned in (which was good, but the fish should have flavor also.)\n* The shrimp was disgusting. It was soggy, and tasted very bitter. \n\nI came for the good reviews on yelp, but I won't be going back. I didn't even bother finishing my $30 dinner. \n\nP.S. Parking sucks. Even at 4pm on a Monday. I can't imagine what it would be like on a busy night.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 2, 'date': '2014-10-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': '7EXXpFB46Y53hampKpITEQ', 'review_id': '2EP6AP5rjkgpybvU1dqdQQ', 'text': "I've been wanting to try this place out since it opened. So when the opportunity presented itself I was all in. It was a Friday night around 8pm. The wait was close to 30 minutes. Which I didn't mind. This place was packed. My friend and I ordered almost everything on the menu. lol 2lbs hot n juicy crawfish, shrimp, crab and black mussels. It was all delicious. You definitely have to work for a little bit of crawfish. lol but I wasn't in any rush. The clean up is simple. Leave all shells on table and the waitress ties up the whole tablecloth and throws it. Oh boy did we make a mess. I do recommend using gloves when eating. And maybe trying a variety of sauces not only hot n juicy. My overall experience was pleasant.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-10-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 3}, 'user_id': 'Pef1PbO6MlDPcaw6KUfA7A', 'review_id': 'IrSVoa0Y4bscUbsGBIBpiA', 'text': "Pretty decent price for seafood cuz they make u get down n dirty. I really like the Louisiana style broth bc it doesn't leave you smelling like garlic all night. Service has always been great here n it's a fun stop before the movies.. Great for high  protein low carb diets.. High sodium tho", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2014-10-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lACiC7m5p-Jjrc5IVtEs5A', 'review_id': 'NaNZJ9VLa3i2_xWoMfFexw', 'text': "Okay so this was a great spot to grab a bit with some Cajun flare! \n\nServers were friendly and quick. They had minimal knowledge about things- but really with such a basic menu it didn't make much of a difference.\n\nSpice level- medium is definitely hotter than tabasco so use that as a spice level measure! \n\nSpice choice- we loved juicy Cajun \n\nFood we ordered-\nShrimp- peel and eat. Order another pound it was so good. Ordered Juicy Cajun medium.\nClams- won't  order again. Ordered hot and spicy level spicy. It was just not what we thought. Very heavy for little clams.!\nOysters- good. Hubby will order again. Priced right.\nBeverage- can't go many places for $3 beet on non happy hour! They have great options at great prices !!!", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2014-10-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'pLwC-U6UQ0uw1xAQ0tAEhg', 'review_id': 'YQSHwAO70B8cyxJX2FC5XA', 'text': 'If your in the mood for some good Cajun food at a great price I would recommend.\n\nI came her for my first visit because me and my Wife were craving some shrimp and oysters.  We good both and were surprised at the great price.  It a no thrills type of place.  The shrimp came in a plastic bag and its peel and eat; so be prepared to get messy.  No worries because they supply bibs.  They also have a slew of different sauces and spice levels you can choose from. \n\nOur server was great.  She was very relaxed and took the time to explain the menu and give some recommendations.  \n\nWe got beer because that what sounded good and at $3 a cup their pricing was great.\n\nParking is a little bit of an issue, and they do not validate the garage that is next to it.  So be prepared to probably pay for parking.\n\nBottom-Line I will be back; and do recommend.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2014-10-26', 'type': 'review'}
{'votes': {'funny': 11, 'useful': 14, 'cool': 5}, 'user_id': 'etv5A7qkeWE8dw6uO2TRLQ', 'review_id': 'dPvyCuKSZ4RXbW4QZK72LA', 'text': 'What the hell is this sh*t?\n\nFirst off, this crawfish place goes off of market prices so they are subject to change (the prices are on a separate menu). \n\nI ordered 1 lb of crawfish, 1/2 lb of shrimp, and 1/2 sausages (6 pcs).  \nYou can choose the level of spice which goes from baby spice to extra spicy.  I myself opted for Hot N Juicy Special(mix of Cajun, garlic, lemon pepper, Louisiana) in mild and should have heeded the warning from my buddies about the inconsistent heat levels.  Whoever is in the back mixing the seasoning needs to be re-trained.  My shrimp came out very spicy and my crawfish came out blazing and painfully hot.  By the time I finished, my eyes were watering and I was sniffling up and down.  Even my friend\'s "baby spice" was pretty hot.  The crawfish tasted like rubber!  I found out it was because it was frozen (wth right?)!  The shrimp and sausage were also very, MEH.\n\nMy buddy ordered Clams and Mussels, 1 lb each.  They left hungry!  I would avoid this since the weight of the shells really put a damper on how much food you actually get.\n\nThe service here was horrid at best.  They forgot to put the sausages/corn/potatoes in the bag.  They didn\'t know what we ordered and mixed up the 1/2 pound things with the pound things.  The food inconsistently came out, it was a good amount of time until we all got our food.  They even forgot the things we ordered and we had to do a recap at the end with the waitress when asking for our check.  Once we finally got our checks, is it weird to have "tap water" as one of the things on the check?  Damn, never again.    \n\nThis is the most rubbish Cajun crawfish and shrimp I\'ve ever eaten and the only saving grace is that, this is the only restaurant of it\'s type in the area.  Otherwise I would have definitely given it 1 star.  Aw, you poor people of Tempe, Arizona, you guys are totally being gyped of what could be great. *Sigh*', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 2, 'date': '2014-10-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HIjr47HcsZQvmwYe7pW5-Q', 'review_id': 'DikDyLfmdmh9ILJIqK-IDQ', 'text': 'I want to first say this place isn\'t bad, I just didn\'t find the experience worth the cost. My wife and I went here on "Date Night" and waited for well over an hour and a half for a table only to have our table given away due to poor management. Of course after they realized what they did we only waited another fifteen minutes to be seated. Now the crawfish is good but I don\'t like getting only 1/2 piece of corn per order that\'s a little ridiculous at these prices. My wife and I have never been back and probably won\'t because their are other sources of crawfish in the valley with much better prices who don\'t misplace your name.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2014-11-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BfXajsGElIDU5FX-BN0t9w', 'review_id': 'R6tR2ar57q0TNJqjeP2c2A', 'text': "Service was horrible, craw fish wasn't worth the money. Meal not served all at once. Half our party of 8 did not get their food until after the other was finished. All in all I give it a minus one star, if you went that lw. Refills of bev r ages was non existent.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 1, 'date': '2014-11-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'zJ1Lx4pTYD93LySmtDLCUA', 'review_id': 'Z59U0tRxRrEg9WeNioAkJw', 'text': "I was always a fan of the HNJ chain in California, but tonight was just not their night to be representing their chain.\n\nTonight was my brother's 24th birthday and I already called in advance that a group was coming in to dine in. Our waiter, who I will hold the name from this review, took our orders, served us water, and left his shift giving it to another young man who took over the table. Granted, I knew it was about 70 mins from Last Call and we were a big group, you would assume attention to detail is most important.\n\nFirst we order appetizers, which were mediocre at best (the calamari breading was too salty and saturated from the deep fryer oil). Next, the orders of clams came out and within the first two clams I ate, I felt like I almost split my teeth because I bite gritty sediment in my food. Seafood should've been washed properly and rid of the rocks and grits of the clam. I had to send it back. By now, my appetite has faded because of the quality of the food I expected from such a reputable chain. As everyone one around me got their food, multiple bus boys/girls brought food out to the table. Unknowingly more people came to join our party, the late comers who ordered food after my brother and I received their food first. Granted, most of us ordered similar dishes, it should have been the staff's responsibility to figure out who's food went to who. I ended up not getting my 2lbs of shrimp with potatoes and corn, sending back a pound of clams, and not even enjoying my appetizer.\n\nWhen the checks came back, none of the orders were organized in the way we set it with the first waiter to left serving us. I almost feel bad, which is why I'm donating a half star to the review, for the new waiter because he got bombarded with complaints from our table. Beers from one side of the table were charged to the other side of the table's tab, and one of my friends ended up paying $95 when he barely at half a bag of shrimp. It is just ridiculous, and what made it worse is that it was closing time, so pressure to get up and leave was felt. I've worked in the restaurant business and I know how staff get when the last few customers don't leave.\n\nThe only reason why I'm donating another half star to give this review of Tempe's Hot & Juicy a whopping 1 star review, is because he gave us a free pound of shrimp 'on the house' from the kitchen. I honestly don't know what is wrong with this chain but from what I remember at my experience in Cali's HNJ, it was a night and day. I'm leaving this review still upset and disappointed at the professionalism of the staff and food quality tonight.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 1, 'date': '2014-11-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Pj8FpGP26SfTjtnt-8HdKA', 'review_id': 'RRaEZBERNkIR0vWYfKk-Ww', 'text': 'Food was good, very flavorful but took a long time to get to my table. Service was average.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2014-11-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'YqKICSe9EhNQZBG2nVJuUg', 'review_id': 'zV34q49jv9raRyWJLt-6cQ', 'text': 'Went to this awesome place with my daughter and was served by the most amazing customer service giving guy named RICH...he was amazing and took great care of us. I will now come and ask for him because he knows the value of giving great customer service and made sure our visit was amazing. Written by a highly satisfied customer...RICH you rock keep up the great attitude!!!', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-11-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'GzOZ2iuyzT3cwYk49Vb8dA', 'review_id': 'JYREw5UfHmxxBEmV5jckgA', 'text': "Back again and just as happy!  Trent was awesome again and we were so happy to see him!  So friendly and went out of his way to take our initial order even though he wasn't our waiter.  He is awesome!!!  Rich, our waiter did an amazing job!  Super attentive and kept our drinks refilled and our other requests on time!  The manager (I didn't catch her name). Was very interested in our experience and took her time listening to us.  She was really good too!  Overall, another great experience, we can't wait for the west side location!!", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-11-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vwbfseooeyYzIiio4YXkPQ', 'review_id': 'ABr4HzydlSoJj1w0Lo8sUA', 'text': "Love the food. .. don't like the parking situation.. i would go more often if the parking wasn't too costy :/", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2014-11-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 3}, 'user_id': '-kIvLyWpY17aRa0vPp-RmA', 'review_id': 'Unz2B_B3NJJuIbES1x0hWA', 'text': "I'm so happy a place like this is here in Phoenix!  I've heard so much about HnJC in Vegas but never experienced it till it came to Mill Ave. we came here on a Friday night and surprisingly it wasn't too busy. We sat down right away and were explained the process. Basically everything was served by the pound, then you pick your spice level. Med was good enough for me! \n\nWe ordered a pound of crawfish. We were warned that it had been frozen and not fresh so it was only $7 a pound. I haven't tried actually eating crawfish whole before so I had to order it. We also had shrimp, and clams,,\n\nI was a little surprised when we got our food. It was basically a bag and they provide you a bib and gloves. Make sure you use the gloves or you will get spic all up in your fingernails!  Went for the shrimp first. You have to de-peel them but they were outstanding! Clams were great too but the crawfish was just ok. I won't order frozen crawfish again so hopefully next time I come they are fresh!! \n\nAll in all we really enjoyed this place. Food was great and it was very reasonable prices. Even the craft beer was only $3 so you can't beat that. I just saw they are going to open up one at Westgate in Glendale so that will be closer to me but I'm sure we will find our way back at this location before the west side one even gets finished.lol.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2014-11-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '5yYB5_BOqB5YNj8oJZJ2HQ', 'review_id': '9UtDug8YP72lIwXmUG9OYQ', 'text': "I've been here twice and both times I had a pretty good experience. I've tried just about everything on the menu and  the crab with lemon/ garlic is AMAZING. If you like spicy food then you'll love this place, because when they say spicy they mean it, we ordered two pounds of spicy shrimp and I could barely eat one without needing to chase it with a cup of water. If you don't like the burn, stick with mild. My boyfriend also got sauce in his eye... if your tongue is on fire from a bite imagine that same intensity in your eye. not pretty.\nI'm a big fan of rice so I always order it as a side with corn.\nI would say this place is comparable to the Angry Crab  and by far better than Joe's Crab Shack.\nWhy I'm giving it 4 stars instead of 5:\n1.The service both times I've been has been okay, I just hate chasing my waitress around for water especially when your mouth is on fire...but I've been a waitress and I know how it can be.\n2. I know the whole concept is to eat with your hands and that's fine, my boyfriend doesn't mind it BUT I do lol. I just hate the idea of tons of hot sauce and butter getting all over my hands and under my nails. Luckily for me they provide gloves. to eat with.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2014-12-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FHyoJm_hETe69YQcaz-cHw', 'review_id': 'hYATo6aCzkDyIIQQckhP3g', 'text': 'I came here with a group of my friends and I loved the concept of the fresh Seafood in a bag.  I was a bit skeptical at first but, after I dug into it I couldnt get enough of it.   My servers name was Rich and his recommendations were awesome.  We were a needy group and he went above and beyond for me and my friends.  The rest of the servers were friendly upon arriving and when I left.  I look forward coming back here soon.  The Lemon Pepper seasoning was by far the best with the Shrimp.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2015-01-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yqBI9dKXTVrJ2F8HYnXe3g', 'review_id': 'hD0c8evNSCyTECulYLwm9w', 'text': "Comparable to Boiling Crab, but not quite there yet.\n\nI've wanted to try a Hot n Juicy for a long while now and finally got to pay a visit to this location today. In all, we got 1lb shrimp, 1 order of snow crab legs, 2 sweet potato fries, and 3lbs crawfish. All of which with the Hot n Juicy spice and mild/medium spicy.\n\nThe sauce is slightly juicier than BC and the portion of sweet potato fries is smaller. However, the crawfish were tiny and overcooked. The shell was basically falling apart at my fingers and and the meat of the crawfish stuck to its shell. I'm used to bigger, better-cooked crawfish but perhaps it's because LA and San Diego are close to the ocean or crawfish farms or wherever these little critters are from?\n\nCocktails were $2.50 each and beers were $4.00 each! \n\nThis location is obviously pretty new. Friendly service, but they asked us if we were doing ok every five minutes and forgot to give us our lime and salt. \n\nIn all, this place is good but I wouldn't return. I am, however, looking forward to trying the other locations (Vegas one is supposed to be reallyyyy good)", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2015-01-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Yb0ttswiSpsEw2Z_9CaN3g', 'review_id': 'J5Dor5UcwH6c2tF3WoB-Pg', 'text': 'I ate here last night and wow it was very tasty. i got the pound of shrimp hot n juicy style, i told them spicy but it really didnt bring the heat until it got to my colon. At 12 bucks for a whole pound it was a good deal. \n We also got the ettoufee, which if you didnt have an authentic cajun as a roomate who made the best crawfish ettoufee ever then you wouldnt know that this was mid grade. They really didnt hook it up too fat on the crawfish it was mostly just liquid and rice. They do let you add a dozen sausage peices to the steamed bag of shrimp for 4 bucks. Now these were pretty solid. They did a good job of soaking up the juice. Now the shrimp didnt really do that. I would of had to slurp the juices out of the shrimp head to get that flavor.\nSo overall it is a pretty solid joint. It wouldnt be anything special in louisianna but for tempe arizona its not too bad. The price was solid, the food was respectable and the service was very good. Now i didnt drink last night but i saw they had 2.50 well mixed drinks. So because of its location and chicks enjoy it because they get to were bibs and gloves and take pictures and stuff.\nIts also very close to the amc movie theater if your trying to do that. \nYou could get tanked on two dollar fifty cent wells and then go out and get blasted as well.\nDownside is that its next to a pay as you park garage that charges 5 bucks even if you are there for a few minutes, and the restaraunt does not validate parking. So tack that on to the price you expect', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2015-01-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'huPliQ7CbVNNCxEJlxlBzg', 'review_id': 'WEe2cGuIx3iRDeYdXeNozg', 'text': "Great cajun food! The food is served in bags with your choice of different seasonings. It's a messy and fun way to enjoy your meal. The prices are fair and I'd recommend this place to anyone who loves shrimp, mussels, crab and crawfish.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2015-01-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'IUvUnkJizBwJCwi-hjLCMg', 'review_id': 'Qal77q7X1PF6vW3ycrnuMA', 'text': u"Here's a plastic bag of small frozen mud bugs.\n\nI ordered a pound of crawfish, cajin fries, and \xe9touff\xe9e.  My order came out one item at a time with very poor service. The crawfish were literally in a plastic bag that was dropped on my table, no plate, no potatoes, no corn, no presentation.  The crawfish were clearly not fresh (which I could understand in AZ) and were smaller than I have enjoyed in East Texas.  As I was finishing up my crawfish my fries were delivered and later my \xe9touff\xe9e.  The food was about a three star, but the poor service and horrible presentation cost it another star.  \n\nComparing this meal to a Louisiana Crawfish Boil is a bit unfair, but the Juicy Crawfish didn't even make an honest effort.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 2, 'date': '2015-02-06', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'uZbTb-u-GVjTa2gtQfry5g', 'review_id': '4ugwZKWC7t7Ak2KlKKMAnw', 'text': 'Today we gorged ourselves on a bounty of seafood. At noon on Sunday, it wasn\'t too busy and there were only a handful of people in the restaurant. In addition to the sauce-laden seafood they also serve fried baskets and sides such as potatoes, corn, and fries. \n\nWe ordered 2 pounds of shrimp, 1 pound of clams, 1 pound of green mussels, and 1 pound of snow crab. Quite a feast! We also had a corn cob each, which was thoroughly soaked in the hot and juicy sauce for maximum flavor. We ordered each seafood in a different sauce, with the hot and juicy sauce being my favorite, and the cajun sauce my second favorite. Out of all the seafood, the snow crab and shrimp were the best. The clams were large and had a lot of meat to them, but they were a bit chewy. Same could be said for the mussels. We ordered every item as "medium" spicy which was just right for us. \n\nService was good for refilling drinks and providing extra gloves. The kitchen was on the lethargic side though as it took some time to get various parts of our meal out.\n\nOverall a good experience!', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2015-02-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bf6KwPQhDkAv-DVPXy-LSQ', 'review_id': '7Dz4xPdb8byr3k30yHCCJA', 'text': "Had dinner here for the first time tonight and our waiter was helpful.\n\nWe ordered Calamari, King Crab, Shrimp, Fried Fish, and Cajun Fries and reg. Fries\n\nI had the Calamari - Lousianna - Mild. I was thinking ok mild is not that bad but omg it was a weebit spicy for me and wanted to dip my tounge in that cold dr. pepper soda lol but that louisianna sauce was yummy!\n\nI'd wanna come back but as I got home I had an allergic reaction. My neck started to itch and the top of my left hand was getting swollen. Ugh. Well, I'll wait awhile to go back.\n\nWe got free t-shirts though. They were made during the superbowl and had extras so we took 6 (free) t-shirts. That was cool!", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2015-02-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'wyWFMbqbhuFBB_1xUaLLaA', 'review_id': 'vYgs6lCL3PJEba07BT9Gsw', 'text': "So very disappointed in this place. We stopped in last night for dinner. We wanted something different. We ordered crawfish, shrimp and crab legs and beer. The beer was great. That's the only good thing I can say about this place. The crawfish were so small there was nothing in them. We never received our shrimp or crab legs. Did I mention that the beer was good?  Do yourself a favor and go around the corner for pizza. It was really good.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 1, 'date': '2015-02-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qkRpqbS2j9OGLYpR4np69A', 'review_id': 'viItnhQurg6qnz_HIGmlgA', 'text': "Been to this place a few times now since check in.  Whenever I am in the mood for seafood I think of here.  I like the very simple menu and choices of sauce you can eat with.  Of course not their fault but I wish some of the crab wasn't seasonal.\n\nThe location is in the heart of mill and can be crowded in that area but it's great that one is pretty close by.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2015-02-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'WESBNCIvswTWh-Ak2uGf4g', 'review_id': 'zzgWixql3H4Yajo093eTWQ', 'text': "3.5 stars. \n\nSince we've been to Angry Crab several times now, we wanted to try Hot N Juicy to compare! Right away, we loved the location and energy in Tempe. They played fun music and the floor to ceiling windows let in a lot of light and was ideal for people watching haha. The location is much smaller than Angry Crab and the closest parking was in a parking structure behind the movie theater. They don't validate parking so we had to pay $12 to park there, yikes. I guess its expected to pay high parking prices in the heart of downtown Tempe but you'd think there would be a discount for dining close by at least? \n\nAnyway on to the food. We ordered the shrimp, snow crab, etouffee, oysters, and cajun fries. They let you order half pounds of shrimp (only for shrimp) here which is great but overall the prices are higher than the other place. Seafood tasted fresh though. The oysters were tiny so we were disappointed by that. The corn and potato we ordered with the shrimp was mushy though.The etouffee was yummy, kind of like a hearty seafood gumbo with peppers and crawfish, but for 8 bucks we got a container filled with 70% rice and maybe 30% etouffee. Not cool. They were nice enough to let us sample the etouffee before we ordered it though since we've never had it before. \n\nI think what kind of ruined this visit for me was how runny the sauce was on the shrimp. We got the Hot N Juicy Special which was a mix of Louisiana Style, Juicy Cajun, Garlic Butter, and Lemon Pepper. Overall it tasted diluted to me... We ordered the same sauce on the snow crab but the sauce was a lot thicker. So we would peel our shrimp and dip it back into the sauce crab bag. Not sure if its this inconsistent all the time but I guess only a second visit will tell. \n\nOh FYI if you don't know what kind of crab to order, there are 4 options. King crab is more meaty and saltier, the most expensive, and a harder shell to penetrate. Snow crab (our favorite) is the second most expensive, with a thinner shell and sweeter meat. Dungeness crab is the whole crab, harder to break through and also has sweeter meat. They were out of blue crab so we didn't get to try it, but this was the cheapest option at about ten bucks a pound.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2015-02-21', 'type': 'review'}
{'votes': {'funny': 5, 'useful': 6, 'cool': 2}, 'user_id': 'Z-CzXzybqAozxF2_lrgDHQ', 'review_id': 'ajD6WQZH1klUQ1WKn6PQJw', 'text': 'I\'m visiting Arizona and I\'m not from around here. I went online to order food to go. I called the Tempe location but was unaware the numbers listed were for both Tempe and Glendale. I placed an order for 2 pounds of crawfish and the lady advised me that they only had frozen crawfish and it was $7.99. I drove to Tempe and the server at the front named Kristina was not able to find my order.  Come to find out, i placed my order at the Glendale location.  One of the male workers was kind enough to call Glendale location to cancel my order. \n\nI told Kristina that Glendale location advised Me their crawfish was frozen. Kristina and the male employee looked at each other and said,  "Glendale may have ran out of live crawfish but our crawfish is alive and fresh."\n\nLIARS!!!  They charged me $10.99 for a pound of soft shelled, broken, tiny frozen crawfish.  \nI\'m originally from Houston TX and is a hardcore crawfish Lover. I know my Crawfish. I should of asked her to show me one live crawfish to prove it. \n\nNote to Kristina:\n1) it is NOT crawfish season\n2) Dont lie and tell someone your  crawfish is alive and fresh when it is really frozen. \n3) you can easily tell frozen crawfish from fresh crawfish.  No need to lie, it just makes you look like a pathetic liar. \n\nHow to quickly tell frozen crawfish from fresh live crawfish:\n1) Frozen: shell is soft, Cracks and beaks easily.  Shell  can almost be paper thin. \nLive: shell is hard and firm. Color is dark red and vibrant. \n2) Frozen: meat breaks apart in pieces. \nLive: meat is like fresh shrimp. \n\nI also ordered lemon pepper mussels, which were extra salty and punched a stack of high blood pressure and stroke if I ate any more. \n\nI advise people to go to the Glendale location vs  Tempe. They are more honest and will charge for the correct product they sell.  They are not devious and misleading Like Kristina at station 5 working at 7:52pm on 2/23.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 1, 'date': '2015-02-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FUMdzARf71drXyDZ7lkpWw', 'review_id': 'gVtpkKtI7cv_Pr7Q6cr0QA', 'text': "I think they forgot how a restaurant works. Let me refresh your memory. The menu says what you have, I choose, you cook, I eat, I pay. This was like,  your menu is just suggestions as to what you may and may not have,  in portions you may or may not want. I order, you check and see if it's okay with the cooks, take a while, forget, come back and tell me what I want is only available in 2.5x the size I want ( on the menu as 1lb). Then argue with me, then call someone on your headset as I leave.  Strange concept.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 1, 'date': '2015-03-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'l99DXQE7wXYx1pk1BLdMbQ', 'review_id': 'A2lvUz4dQbGdxAcloAJ56A', 'text': "Food was delicious, my boyfriend and i had oysters, crawfish, shrimp,  calimari, and soft shell crab.  The hot and juicy sauce was soooo good.  The soft shell wasn't worth it, it was $13 for 4 tiny little balls. We waited a long time for the calimari and even longer for the potatoes.  Service was crappy :/ they apologized but it was still annoying.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2015-03-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ocs06vKHlDYqEOsyoIz1pA', 'review_id': 'w1n5NKinLifZZE7uGkWGQQ', 'text': "Great set up for a restaurant. TVs, music, but no seasoning on the food. Sad face. If you don't get it spicy it comes bland. I won't frequent this place again. On a good note, my server Michael was fantastic!", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 2, 'date': '2015-03-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1m1G24sTI-k5Uvf15OPnYQ', 'review_id': '-_VjowqijJT_lxTiJgYKpA', 'text': 'Stumbled upon this place when walking down Mill Ave. Food was delicious.....and fun. Kids had a blast mutilating their dinner. Lol Service was excellent. He was very attentive and informative. Will definitely be coming here again.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2015-03-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'V5PfDx_SJdcog2y4Vq5sFg', 'review_id': 'QTbC0USsAlfQBLVgaerXsA', 'text': "This place left a bad taste in my mouth, along with service. I'm a little spoiled being from Texas, and near New Orleans where you get real crawfish. This was a $50 lesson, which I am not upset about, I just will not be returning. My guess is I will be seeing something different there in 3 months. 2nd star is for convenience to where I live.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 2, 'date': '2015-03-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'fPufe63Szi5n9x5j9OtZUg', 'review_id': 'DbFGVnO-g9AEikwPrvgH9g', 'text': 'We have eaten dinner here twice.  The first time in August of 2014 and the second time in February of 2015.  It is a little hard to find and the parking requires a little walking, a few hundred feet.  Both times we visited were Friday evenings, little early before the dinner rush.  The resturant and area have great young college town vibe.  Music is fun and the hostis are friendly.  \n\nThe food:  Yes, some seafood is seasonal so there will be quality variation.  Overall the crawfish have been good out of season.  The shrimp were excellent.  The oysters were in season and excellent.  The beer is cold and the view is good.  \n\nDuring the last visit it appeared they were having some staffing issues.  We arrived around 5:15 and started with one server who was very friendly and professional for a college town.  Our dozen oysters came out and while the plate was organized, one oyster was not opened.  We sent the one oyster back to be opened.  It did not return.  While dining we saw staff rushing in, either late or had been called in.  Our waitress changed with a hand off.  The replacement waitress was also good.  We asked about our lost oyster and they came out with it within moments.  While it was not "flawless" the flaws were inconsequential.  \n\nWhat we saw at the table next to us during our meal nearly made us cry!  There was an elderly mixed race couple, appeared to be in their 80\'s wintering here from NY.  They ordered crab.  The waitress listened and conversed with them graciously as they told her they have wintered in AZ for the last 32 years.  She shared that she was a student and studying accounting (I think).  When their food came, the gentleman did not have the hand strength to tear apart his crab.  He was embarrassed.......  The waitress was so kind and with great care and tenderness tore apart the crab and made up his plate.  While doing this she conversed and her body language was so tender she could have been their great granddaughter.  The couple enjoyed their special meal and my wife and I promised to still live life when we grew old together.  \n\nIn essence:  Good food, great location, and a work culture which is friendly to the local students and the snowbirds.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2015-03-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_O451-7MZ507UEKRqdUSyA', 'review_id': 'T5wKfhll24ANoGNMUiOcoQ', 'text': 'This is the best place ever. I love this place!!!! The food is amazing, the service is incredible!! I would come back here anytime!', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2015-03-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'tEAxVMZFUAi4mdGMuYopIw', 'review_id': 'khcCc4uzxLdP7tBDwbUbHQ', 'text': 'I grew up in new orleans and consider myself an AUTHORITY on seafood.  The crawfish at this place is nothing short of INCREDIBLE!!!!  I felt like I was at a neighborhood restaurant going to town.  Spice level was perfect,  heads perfect, pealability perfect...', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2015-03-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rC9JWoJ2Jy2GB32Wh-QfoA', 'review_id': 'IzpLXpg-ezu76YUvCk90uw', 'text': "Perfectly cooked & perfectly spiced soft shell crab (no sauce necessary) & crawfish (Louisiana seasoning) \n\nMy boyfriend is from New Orleans and he said it's the best he has had in AZ and for that matter many places in NOLA. \n\nService was beyond great and super friendly. Love it so much we will likely come back every Sunday.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2015-03-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Wh4MXndOJFw4bC4bDideHQ', 'review_id': 'Z4U-Ub94eDGybvh4KeN3lQ', 'text': "I am torn on this Hot N Juicy...\n\nMy first experience here was amazing, great service, great drinks and amazing food.  I couldn't compliment this experience enough, I was crazy excited to come back and have a similar experience.  \n\nMy second... not so much.  The service was still great, the drinks were still great.  The food... bland. Lack flavor and wasn't spicy like I ordered it to be.  It was Hot but definitely not JUICY this time.  It was a night and day comparison from what I had experienced just weeks before.  \n\nThere was no consistency in the food from the two experiences.  \n\nI doubt I will return for a while.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2015-04-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QiI73966zZ0H6-ojFdbcOw', 'review_id': '-HUejbiSqedGB6J70PLT1g', 'text': "Great service. Good flavors. The crawfish is just puny and expensive for what I'm used to in TX.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2015-04-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_debyG-A4ksZCVk2ltd4kg', 'review_id': 'iKKHiKWi_xsDN90EByYWWw', 'text': "An awesome seafood restaurant I love their food especially the shrimp cooked in medium or hot sauce with garlicky sauce!! It's delicious I can come here and eat their shrimps for daily basis!!", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2015-04-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LXa0ZOQZaEfUHl2idyIACA', 'review_id': 'lxJ-d-mG2XRtpN-wjtbbEA', 'text': "Great staff and even better food! They don't open until noon and we came at 11. They gave us a table and water and let us order 15 minutes before opening. Then the food was outstanding! Best shrimp I've ever had!!! The atmosphere was relaxed and fun. Great place for any seafood lover or someone willing to try new things!", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2015-04-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'iLqeyvOJTokJDNYbcRaUMA', 'review_id': 'L7rY9SaP7TUFcs-u_vyVfw', 'text': 'Very poor service. I try to order a pick up by the phone. And the they told me to wait for a second for the answer. Then there is no voice or respond from the other side for 4 minutes. I tried to hang up and recall. It always busy signal from the other side. !!!!', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 1, 'date': '2015-04-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'GB0iGHDWo3Vxuzsqy6BOpA', 'review_id': 'uK0V9W0Nt0XzhSR_zGrxdA', 'text': "Coming from Los Angeles, California, there's many restaurants of this style. So I've had plenty to compare from. Many LA residents know of THE BOILING CRAB.... This place, I can honestly say tops it! The flavor their shrimp has is very balance NOT overwhelming! I always have shrimp of the all mixed flavors, so this place is definitely a place I'll be coming back to for Cajun style sea food! It would have been 5 stars but I feel their service can improve. Time I was here wasn't so busy so there shouldn't be an excuse for poor service. Now it was horrible service but could've been better. Definitely try the PURPLE HAZE beer with Cajun food, being that Cajun comes from Louisiana and purple haze is a Louisiana beer it just goes perfect together.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2015-04-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nrNg85EzUaU_PPIjtBEvHQ', 'review_id': 'nNob2UlI-v_cs-Z9_46fTg', 'text': "Omg this place is delicious!!!!! My boyfriend had a crawfish Louisiana style, extra hot and I had the snow crab legs hot and juicy extra hot. The sauce was amazing!!!!! I couldn't get enough even after my mouth was on fire. Also the well drinks are only $2.50. They don't have a full bar but at those prices, I'm not complaining. The service needed some work but other than that, great place! Will definitely be back for more!!!", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2015-04-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IotvWOAuVVXpedTLki2oDA', 'review_id': 'v7PlBhT7Qhce27Lm7EPpbw', 'text': 'Food was good, seafood was high quality but device was rather sloppy.  There was a lot of staff but they seemed to wander around without direction.  It took way too long to get drinks and the entrees came out about 10 minutes apart.  Not sure if we will return.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2015-04-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jzYXfLdqGQqM0Y-QkD1b5A', 'review_id': '-jl4vIS6_wpjwLQV-eYyGA', 'text': "Honestly I'm just really happy Tempe has something like this. The crawfish was mehhhh... But then again I wonder if crawfish are actually yummy... We got shrimps which were large and very spicy and a bunch of snow crab legs which were very good albeit very salty.  Everyone in our group had a great time eating with our hands. The calamari was some of the best I've had. Service was okay. One waiter left in the middle of taking our order to grab a check from another table (awkward) and another jumped into our conversation (like literally jumped from one table to ours. So awkward. And yes, I'm kind of a hater). Overall, good not great. Recommended if you're with a group of people in the area but not worth making a special trip for.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2015-05-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'HFBX3tgVOIhw9XQchevOdQ', 'review_id': 'Yx9nllbHepRAYBQ0DXt-Yg', 'text': "I really enjoyed the prawns, soft shell crab, and yam fries. I'd return. Excellent service.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2015-05-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '04aw34GmfroCyme7oCNjPw', 'review_id': 'ul3Jrh-JbDYFSNIpWFyqCg', 'text': "Soo I'm pretty picky (no pun intended) about my crawfish and shrimp and seafood in general... However I came here and my food was awesome my server Ali was great also. Food was a 10. Price is good and I can't wait to come back. Even though last time I was here and it was also amazing... This time I didn't get my super hot server Alex but that's ok. We can't always get everything we want. A + hot n juicy. A+ \n\nSincerely super full happy customer", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2015-05-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'wVWv6KK77rBS1BZX4lQybQ', 'review_id': 'SLIkiDq85XWrstU7SahT5Q', 'text': "Service was awesome! Good drink selection and prices comparable to Angry Crab. Flavor was so-so. It was good because we were hungry. But if I had a choice, I'd choose AC", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2015-05-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KkpvgZTXpRsh8J1-K6EESg', 'review_id': 'frgPXogKeMj0RzyRG0egdA', 'text': "The service sucks today.. This is one of my favorite places and after coming here today I may just find somewhere else to go EVERY SUNDAy...  After sitting here for about an hour I ask about my crab legs. 2 servers say the shrimp (my girlfriend had) has a shorter cook time than crab legs. Why would they start cooking her shrimp at the same time as my crab legs of that is the case? Also that's a lie because a table came in after Us and got their crab.. Smh the manager was notified and this bad manager for the sake of this post tool 2.40 off my bill? I wipe my ass with 2.40 he can keep that and they can find another regular.. I lost me.. Oh yea and I ordered a cat fish basket and I've been waiting 25 minutes.. Lmao this is an abusive relationship if u ask me.. I give u my money and u don't give me good service and expect me to be ok with that. #uncool", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 1, 'date': '2015-06-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BB1Phyw_XsrFGZtLjXI-HA', 'review_id': 'lsgsogegEJzg9yGnTO2_TA', 'text': "The great food but the service was bad. First we didn't get our drinks until I was done with my appetizer and we had to ask for them. Second the second appetizer (sweet potato fries) didn't even come out until we were done with the main food and we had to ask about them too. \n\nThe one stars is for the service \nI would give 5 stars for the food", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 1, 'date': '2015-06-06', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'Kl7DC102R-vRZc_7yG0XuQ', 'review_id': '7pCr5ymuLaqw9yoDEAYZfg', 'text': 'I will just start by saying I do not enjoy giving bad reviews. \nMy boyfriend and I went for a late lunch/early dinner. The restaurant was basically empty. We were seated right away. The server brought us out drinks and explained how to order and advised that whatever spice we would normally order to go a step below when ordering.\nMy boyfriend hates spicy food so ordered a pound of crawfish in garlic butter seasoning and "baby spice" (lowest) spice level. I ordered a pound of crawfish with the hot and juicy seasoning and spicy (instead of my normal extra spicy due to the earlier recommendation). \nThe order was dropped off. I had to look up a YouTube video on how to eat crawfish since the waitress did not ask if we knew how and didn\'t explain how. \nThe food was decent which is the only reason I gave 2 stars. Before the meal was brought out our waitress was always visible. Once the food hit the table she disappeared. I tried my boyfriends food which was incredibly spicy while mine was not even a little hot. \nSo between the service, lack of info, and the music (10+ usher songs in a row) we had to get out ASAP and unfortunately will not be returning', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 2, 'date': '2015-06-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '29OOsV97YqkG9wFjiPa6_w', 'review_id': 'ep5YWgfj5FSBORQRwlECrw', 'text': 'Tasty! Got the snow crab, lobster, clams and others. Fun eating messy! The seafood was fresh and tasty. Maybe pricier than other similar restaurants (like Angry Crab) but service was good-- friendly and prompt. Only way con would be smaller space and limited seating. Overall fun and good place to eat!', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2015-06-20', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 1}, 'user_id': 'IDHrwv_RCildFvmfWTkj5Q', 'review_id': 'HVTRtpaJWKSkExtMxb5T8w', 'text': "Went here a couple times recently.  When I come here,  I always order crawfish.   Always.   I can eat a pound of crawfish faster than most folks,  so eating those in this place don't bother me.   Anything else, besides the bivalve shell creatures,  require too much work in a messy saucy environment.   \n\nI grew up eating crawfish.   I do love to eat them.   They are in season for about 5 months every year.   As a child,  I recall waiting for the first signs (billboards)  that appeared advertising crawfish boils.   So,  happy I was last spring when HnJ  and the AC opened in Phoenix. \n\nI have been to HnJ 3 times this season.   2of the 3 experiences were stellar,  one was poor.   It seems as though when I bring a guest from home who loves Southern style crawfish and crab boils as much as I,  this place fails me!   \n\nI have come to the conclusion that HnJ is inconsistent. This is based on my 3 or so visits last year and this year.   When their seasoning and their crawfish are great,  I have a very good experience.   This week,  the crawfish was just OK,  a few straight tails in there (don't eat the straight tails).   But this time,  their usually thick and flavorful seasoning was liquidy and rather transparent.   *sigh*  I desperately want to call this place the King of seafood boils in Phoenix,  but,  alas,  AC is winning this battle for me.  \n\nThe menu is fairly limited.   There isn't much more to choose from if you aren't having a seafood boil.   \n\nKid Factor: 4/10\nMy Return Factor: 20%  sadly,  I probably won't be back.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2015-06-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'YELU5TN4M9U6B264EBO4eQ', 'review_id': 'byhtslHhkjFFSouyjE66SQ', 'text': 'Love this place!  I used to go to one in Vegas when i lived there and could not wait when i heard this one was opening.  I love the spices and eating with my hands.  I personally have never heard of waitresses giving instructions on how to eat your own food. Lol.  I think when I was 6 I surmised the crawfish look like mini lobsters and you probably eat them the same.  Anyway.  The place is really good and everyone i have brought here has loved it.  I wish they were able to take reservations for large parties.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2015-06-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'EdazKG_FraCazrG_ZnyLPQ', 'review_id': '6ISihLHs3-eZ_vNBUTDymg', 'text': "First time having crawfish and I wasn't disappointed. Flavor and spice levels for every tastebud. Really enjoyed the hot and juicy medium crawfish,lemon butter crab legs and hot lemon pepper shrimp! Fun place to go with delicious food and friendly waitstaff. Our server Alicia (what a beautiful name ) even put on gloves to show us the proper way to eat a crawfish. My new favorite place.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2015-06-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '8LAOKaivVSq5Y2gL1CV1_Q', 'review_id': 'LXAuhrOh2WsOqUAMyX6TsA', 'text': 'Deliciousness in a bag. My mom and I had shrimp, crawfish, and black mussels. We also had the corn potatoes and sausage added to the shrimp bags. Everything  was amazing and tasted great with the hot and juicy seasoning. Our servers were Michael and Jasmine who were really great especially michael. We will definitely be back soon. Price was decent for 5 lbs of seafood.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2015-07-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'U_fAIe7CUaGMejwSdNvMgw', 'review_id': '1dm_y_tOrgeCldthV91Rmw', 'text': "I recommend ordering a pound of fresh seafood and 1-2 potatoes and 1-2 corns.\n\nI'm from New Orleans and had to try the crawfish.  Unfortunately, they were out of fresh crawfish during crawfish season.  Tried the clams.  They come with the shells, which works well for scooping up the seasoning.  I opted out of getting the gloves.  They weren't needed.  I also didn't use the bib and my shirt survived.  Extra spicy is nose running, tongue burning, eye watering hot or just about right.  The Hot n Juicy seasoning hit the spot.  I'll be bak to try the fresh crawfish.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2015-07-12', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'mDzMELsP_F-MQJUSJiT2ww', 'review_id': 'JPd53E78VX8TKR02OXbZWw', 'text': 'Not Quite What I Hoped For\n\nI headed for "Hot n Juicy" in Tempe with pretty high expectations the other evening. I probably should have tempered my anticipation a bit. First of all, this isn\'t a place to go for the ambiance, not that ambiance was all that high on my list. That said, I got over it and settled down to order. \n\nMy server was friendly, attentive, very courteous, and appeared to know quite a bit about the food and various preparations, but her explanations didn\'t really guide me to ordering what I really wanted. I ended up ordering a pound of shrimp, and had the Louisiana Style seasoning in mind, but my server made that sound like dish water so I went with the Hot N Juicy Special seasoning that she guided me to, at the medium heat setting. I was going to order 1 piece of corn and 1 potato, but she made each sound as it they were tiny, so I ordered 2 corn and 3 potatoes. Being accustomed to boils in New Orleans, I threw in an order of sausage as well.\n\nMy food came out promptly all sauced up in its plastic bag, as anticipated. I tied on my bib, pulled on the plastic gloves to preserve my manicure, and started in. \n\nHaving read a review by someone who indicated that he didn\'t like to fight with his food to get it out of the shell, I anticipated a bit of work, and a good bit of messiness. Being pretty used to peeling shrimp, I was prepared for a bit of effort - but this was pretty extreme. For some reason, the shells appeared to be bonded to the shrimp pretty firmly, and getting shells and legs off of the shrimp was rough, time consuming work. I took off the gloves, thinking they were the problem, but, no - that made no difference. Enough about that,\n\nWhat I was most disappointed with was the seasoning. It was rather thick and pasty, so that on the corn and potatoes, it just sort of sat on top. The shrimp fared a bit better for flavor than the veggies, but again, it was mostly surface flavor. The sausage was similar with respect to the impact of the seasoning, but was also very salty - so I pretty quickly just left it alone. The Hot N Juicy Special seasoning was just ok, medium was just right for me, with a bit of bite, but the seasoning profile was nothing like what I was accustomed to either in New Orleans, or on the east coast where I grew up in Baltimore with wonderfully seasoned boiled shrimp. I don\'t have any desire to ever try that seasoning again. \n\nThe potatoes and corn were about twice the size that my server described, so I had way more food than I wanted or anticipated. To the restaurant\'s credit, the corn, potatoes and sausage were all reasonably priced, so I didn\'t feel that I had been unreasonably up-sold. \n\nAfter 6 shrimp, I got fed up with the peeling process, and eating as slowly as I was (so much time peeling in between bites) I found myself fairly full and gave up on eating any more. I still had more than half of my food remaining, although I\'m not really a big eater anyway. My server helped me wrap up what was left, promptly brought me my check, and I headed home.\n\nConsidering my experience, I\'m going to try Hot n Juicy a few more times. Once, to try the Louisiana Style seasoning, or the Juicy Cajun which hopefully will be a different experience. I\'ll ask more clarifying questions, and not rely on the server\'s preference or recommendation. I may even ask to try them both before deciding, since it is an investment that affects the entire meal. I\'m also curious whether the shrimp peeling dilemma was related to the pastiness of the seasoning I chose. I will also return another time or two to try the Soft Shell Crab Basket, the Calamari, and the Blue Crab (if I find a seasoning that I like). \n\nAll things considered, I had an average experience that didn\'t destroy my overall interest, and the service really was fast and friendly. I hope to have a better review after my next visit.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2015-07-15', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'iRn90PSex6EGBcXk-163qA', 'review_id': 'SeHnh5l38lnZCPsUsBDmdw', 'text': 'Food was alright at best, but it took a whole hour to get my fries, shrimp and calamari. Well I actually never got the calamari. They then informed me they removed it from the bill... Well thank you?!? And small basket of sweet potato fries (drum roll please) 6.99. Then they ran out of validation tickets so after they took two hours to disburse our food we paid 4.00/hour. Probably not coming here anymore', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 1, 'date': '2015-07-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pxox4nOOJSCAdpz-hW3IVA', 'review_id': 'm8tLFm8ep5na1CJs2KVL_Q', 'text': "You gotta rip off the tail and suck the head... Had some yummy crawfish here , they bring you gloves and a bib. Probably not the most appetising thing , watching people eat crawfish but sure was yummy. They were fast , very freindly and the joint was clean. I've eaten crawfish fresh out the gulf so can't compare but I would reccomend. Just remember if it smells like fish , have the chicken .!!!! Try this place.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2015-07-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'gJFxYqD0ZQsBsJQrIDtuAw', 'review_id': 'XtoS0GsetKmivrX4zdnN3w', 'text': 'Location is nice but call ahead during the weekend for dinner as it can get packed quickly with groups & when your enjoying a crab/crawfish cookout, it will take some time to turn tables. \n\nWe had about 5lbs of Dungeness crab (2), a half pound of shrimp & added sausage to both. The flavorings are good with one being a bit too spicy then expected. Also had an order of Etouffee (which was excellent) that I would highly recommend.\n\nStaff works well to help each other with radios so if you need something, they will get it for you promptly. Order some beers from tap and via the bottle and would of liked them colder, but still a good experience. Would recommend for locals and guest coming to town as a group outing.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2015-07-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'ZKEDymJie4rFbmnrgsLUeA', 'review_id': 'HF1_y-Wult76DhD4g4r0MQ', 'text': 'After a short wait, our party of 8 was seated in the center of the dining room.  Bibs were passed around the table and the rolls of napkins teared to create "dams"  to prevent the juicy liquids from trickling onto our clothes. Disposable gloves were also provided, if you didn\'t want to get your hands messy.\n\n Lime, salt and pepper was provided if you wanted to make a dipping sauce or use it to clean the fishy stench off your hands post meal.\n\n Although the menu was basic, it was quite overwhelming to decide what seafood options to order.  Pretty much, the seafood choices are crabs, king crab, snow crab legs, lobster, clams, shrimp and crawfish.  Once you settle on your seafood choice, you pick a seasoning then pick a spice level.  Seasonings include Louisiana, Juicy Cajun, garlic butter, lemon pepper and the famous "Hot N Juicy" Special.  The server warned us that their spice level is above average and to choose a level beneath what you think you could handle ( I should have listened)!\n\nWe snacked on some fried corn fritters as we eagerly waited for our seafood feast.\n\nIf shellfish isn\'t your thing, there were also a few options for fish, chicken, calamari, etouffee, etc. One of the girls was allergic so she went with the fried catfish basket with seasoned fries.\n\n\nTo our disappointment, they ran out of fresh crawfish so we went with 2 orders of 2 pound frozen crawfish.  Although they were cheaper, some of the girls noticed the difference.  Each order came arrived at the table double bagged smothered in the special seasoning blend.  For every 2 lbs of crawfish, one corn and one potato was thrown in the mixture.\n\nOur table pretty much ordered everything.  There were steamed clams, lots of shrimp, crab legs along with a few sides of rice and fries.\n\nYup, I should have listed to the server. My clams were super hot! Those were my favorite.  It was a good burning sensation but I knew I would pay later.\n\nThe head-on shrimp came 2nd. I\'d tear off the head, suck it then remove the shell from the body.  Some were bigger than others but they were all good.  I did the same with the crawfish but they proved to be a bit more difficult and time consuming to eat.\n\n I kept dipping the mild shrimp and crawfish into my sauce to make it even more spicy.  I was so excited, I couldn\'t stop tearing the shells of the shrimp and plopping it into my mouth with my dirty gloved hands.  At one point, it was so filthy that I had to change my gloves.  By this time, sweat was dripping down my face and I kept having to wipe it.  My cheeks were on fire form the combination of SPICY Hot N Juicy sauce and sweat. Despite all this, I kept on going. We had to finish.\n\nI thought we were done and I went to go wash my hands.  The seafood stench still lingered on my hands even though I used lime and washed it with soap two times. It was that bad. My nails must have poked through the flimsy gloves, or maybe the shrimp of the head.  After I cleaned up as much as I could, I returned back to the table to find out that we still had more shrimp left.  I just couldn\'t do it.\n\n With gratuity and tax, we averaged about $30.00 per person. Not bad at all for all that food!\n\nThe meal was a fantastic dining experience.  From the plastic bibs and gloves to the buckets of trash lined on our table. it was definitely a must try meal.  I would recommend this "no frills" place to everyone. \n\nMy only change would to NOT ORDER the "SPICY" level.... it leaves for a VERY UNPLEASANT NIGHT.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2015-07-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_aMWlB15214AQprlKRuGWA', 'review_id': 'Bq5I9IAx6ct9k66O7McbGw', 'text': 'Great food and very friendly staff where everyone cares about your experience. Delicious food and awesome happy hour pricing - always a good time!!', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2015-07-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'cam7ol5XQ-DpVSX7i7VjYA', 'review_id': 'fz9TrYq2ziP9BCsH3qBaag', 'text': 'We waited 30 minutes to be seated when half the restaurant had empty tables. Host boy took a party of six before us and had us waiting some more. Staff needs more training..', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 1, 'date': '2015-08-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IzRCkQYohJNAc1VILxz9JA', 'review_id': 'aa1cG2gmbRpJP80--IfbuA', 'text': "No, just no. Don't even glance at this place. I don't understand why people rave about it. It was annoying the moment you park your car because that just mean you have to pay for parking. My experience here was pretty damn annoying. I order crawfish and snow crab. The snow crab was small and cold and they gave crawfish to someone else so I had wait for an hour for another batch that they didn't clean. So it's dirt with the sauce. And what made it worse is that they didn't even apologize. Thank you but no thank you. Don't waste your time, if you want Cajun seafood experience, go to Angry Crabshack. There's free parking, the sauce is so much better, and the lbs are bigger and meaner. Hot n' juicy-you can't even compete.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 1, 'date': '2015-08-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DRswvC9rpkjf3wNVFzSeRw', 'review_id': 'rZWrO_mtdd33d0gWkIRiSw', 'text': '"Meh" pretty much sums the whole thing up.    Interesting concept but at the end of the day freshly steamed shellfish is a miracle on its own. The sauces themselves are actually good but the amount that comes in the bags is excessive. If they toned down the sauces, ditched the bags, and increased the portion sizes they could probably get away with charging more. Servers and hostesses were nice.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2015-08-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '_IqEWmyY_VfGN4u7mqppAw', 'review_id': 'Souycfx4-uBkIUeVTfLwdg', 'text': 'Thoroughly enjoyed this experience.  Such a different way to eat.  If you love seafood I highly recommend giving it a try.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2015-08-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'afZT_HMHcjK0XEprZGPxwg', 'review_id': 'mBh8UJilcDIp5MMXzknwrA', 'text': 'Customer service was top notch they made us feel like family. The food was amazing i got 1 pound of black mussels in a garlic butter sauce out of this world and just the right spice. I also got half pound of shrimp in the hot and juicy sauce. Well worth the mess on my hands. Hands down the best seafood i have had in a long time.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2015-08-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DQ3AVUmDuKW8FygaMCkk2g', 'review_id': 'SifK0TtZJYrOMSPWkU6Zvw', 'text': 'Having recently been disappointed and Angered by another popular "cajun" Crab and crawfish place that seems to think it\'s cool to swap out cajun spices for mexcan spices, I had a little trepidation about trying H&JC. When I walked in I was actually pretty happy to pass a group of guys with decidedly cajun accents. Happy looking Cajuns in a Cajun restraunts is a really good sign.\n\nI ordered a pound of crawfish..."sorry it\'s Sunday and all we have today is frozen"...I probably should have said thanks anyhow but was Jonesing for some crawfish and had just driven from East Mesa. I also ordered shrimp. \n\nThe shrimp was awesome with the seasoning, but I\'m just one of those people that finds frozen crawfish to be very inferior to fresh boiled crawfish, the meats tougher on frozen and half the time the heads are just plain bitter and disgusting. I can\'t even eat etoufe because of those tough desecrated pieces of something that used to be a thing of beauty. It\'s like asking for poached eggs and getting two that were fried until the yoke starts to turn green.\n\nI will come back...on a day other than Sunday. Other than the toughness of the frozen, the seasoning was excellent and exactly what I\'d hoped for and expected from cajun...not some crazy mexican spice that still burn your hands two days later.\n\nNext time I expect to give them 5 stars.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2015-09-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3iBJADJm5IHbCK65qQ4LbA', 'review_id': 'ro5DJMWAi3FuSTUZ9M3F6g', 'text': 'Love this place. Come here at least once a week. The waiters and waitresses always have a smile on the faces and accommodate guests professionally.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2015-09-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zoHllVEvU91xYbTWMMIT0Q', 'review_id': 'pmOIANfDvKijEnvyNJb8OQ', 'text': "Really enjoyed this place! We had Tad as a waiter he rocked!\nWe came in after church and before watching Black Mass (good movie btw)\nMy husband and I ordered 1 1/2 lbs of shrimp.\nThe food was amazing the flavor was out of this world!\n\nTad did an amazing job of keeping our drinks filled since we got the shrimp spicy and boy they do not lie it was spicy but the flavor a just blended together so well.\n\nWe also got sweet potato fries and they were also very good!\n\nOnly one down fall it was our first time and I wish they had taken the time to explain the menu better but we can't wait to go back!", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2015-09-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'A0KPfKzuarVLaD8TKFF6cQ', 'review_id': 'A0PwXYuhq3QwYxyemVr2GA', 'text': 'In the heart of downtown Tempe is where my boyfriend and I found this gem. I was super skeptical, cause how do you get good seafood in the desert? They made it happen though! \n\nI ordered a pound of crab legs and 1 pound of crawfish with potatoes and sausage. Both were seasoned in the Hot and Juicy season with spicy seasoning. It was delicious! Although they were out of fresh crawfish (I had the frozen), I was still impressed. \n\nServer was great, order time was decent for a Friday night. I will definitely be back again!', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 4, 'date': '2015-09-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'UzHfxmdSpQsrysxIAAOUiw', 'review_id': 'ug5P0AAhqBoTqmGUHa7ukA', 'text': 'Selena is amazing I love her!Food is amazing! Staff was fun and great!drinks were strong Luke I love em!', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2015-10-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'VbbeN7rMPzSXvFDG7m1lWQ', 'review_id': 'HNGEcd1_qfqeCJRsCXpQxg', 'text': 'This is my favorite restaurant on earth. The food is always amazing and the service was perfect!!!', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2015-10-15', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': 'hyvVXNT1MjgRHCsyxatexA', 'review_id': 'p16IF6kHxKW79Ba3bmWhnQ', 'text': 'Food has to be checked before consuming!!\n\nChicken was not cooked, restrooms are filthy, & place is small...', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 1, 'date': '2015-10-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': 'H-aksFzj7ua5h9qGe2pyzA', 'review_id': 'tkKDTIRTcxSxWc8mADgpPA', 'text': 'Amazingly friendly service! Delicious food for a good price! Definitely coming again soon!', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2015-10-18', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 1}, 'user_id': 'e_xKYOVQqQNT5VNYlkjthA', 'review_id': 'Y-oFn94zcSUsr89IUo4brg', 'text': 'Place is so bomb! They have two locations in Arizona and i believe the tempe location is a little better but either way both of them are still taste so good!', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2015-10-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'AvN4m1I0rg5CRIF5jFKR2w', 'review_id': '5iNXp8AY1WnFOKHHfxTBsA', 'text': "The good-shrimp/corn was good. \nThe bad-service, calamari was just horrible it was over cooked, we order appetizers  and they came with the dinner. They don't have a kids basket\nAll and all, I would definitely choose angry crab..", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 1, 'date': '2015-10-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '3qZWlbG4x7GGVq7KUWiXvA', 'review_id': 'n4IfyBeEOj2d7TwZQ73cRw', 'text': "I'm so disappointed.  Me and one of my best friends come here at least 2 times a month.  Today we went and I walked out extremely disappointed.  The service was fine, our hostess is always great.  I always get the shrimp and I probably ate about 5-6 shrimp and noticed the tip of the shrimp was raw.  Usually when I break the head off its red that comes out but this time it was brown which indicated the shrimp was undercooked.  I never send food back, ever!  I let the hostess know that shrimp was not cooked all the way so she asked me if I wanted another pound, I said yes.  10 minutes go by, then 15 minutes go by.  At this point, I'm over it and let her know to cancel the order.  I walked out still hungry and just irritated.  The food has gone down and by the other recent reviews saying that their food was undercooked should be a red flag to the business!  Please fix this, or I will just have to give Angry Crab another try as well as my business!", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 2, 'date': '2015-10-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'tEAxVMZFUAi4mdGMuYopIw', 'review_id': 'CFsBpCE5MV6jQcL-d8bCTg', 'text': "Great food today as usual. That's said... Service was an atrocity..have you ever experienced service so inept and with such bad attitude that it becomes entertainment????", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 2, 'date': '2015-10-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'bys4bLWR6cVHkWZVEJQSwQ', 'review_id': 'QS_uBc7-q6lvfZBIiez3Uw', 'text': "We were able to walk right in with no wait time. When we were first greeted by our  server, she informed us that they were out of over half their menu. No lobster, no mussels, no crab legs, the list goes on. We ended up ordering two different types of shrimp. We waited over 30 min for our food, and the place wasn't overly busy. Luckily, the food was amazing... Otherwise this would be a one star review. The service stunk and the bathrooms were filthy. Hoping it was just an off day, and it will be a different experience if we try it one more time.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2015-11-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MYggUpePR_pETF4FxVrUhA', 'review_id': 'Zmu5P7rnAIZSIwlnc3tZBA', 'text': 'I come into Hot N Juicy every Sunday night with my roommates for good food and a better atmosphere and have yet to leave unsatisfied. \n\nThey have an abundance of fresh seafood with a lovely assortment of seasonings that caters to almost everyone. The food is always on point, I highly recommend the Dungeness crab. It is very reasonably priced and you won\'t get a better crustacean anywhere around Tempe. \n\nAlong with the food, the staff is always friendly and super eager to make your dining experience everything you want it to be. Their good attitude and incredible work ethic is contagious and makes me look forward to my Sunday evenings at "The Juice"', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2015-11-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9wb9Qk-QGvKlAkFSIwfXbg', 'review_id': '-0LJOU6rtMUd8qvFcF1JlQ', 'text': "I usually come to this location a few times a month and I usually leave exceptionally satisfied. But my last visit was less than pleasant. I always get a pound or two of crawfish and never had a problem. But this visit was problematic. My friend ordered shrimp to find that it was undercooked and when offered a new batch it took nearly 30 minutes to come out. Then to add insult to injury - my crawfish came out slightly warm. But due to the issues my friend had, I chalked it for a loss. I haven't been back since and it pains me because I looooooove hot n juicy. I see that they have had some reviews about food quality and I hope they fix it soon. I don't really want to go to Angry Crab", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 1, 'date': '2015-11-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ctkz8rj87bfen9uqRlmzgQ', 'review_id': 'tqOBtSENWTac21ovzBMw6A', 'text': "This place is the best nothing like it around sometimes I am here twice a day when they open and close. Always get the same crawfish hot n' juicy med and shrimp lemon pepper med as it always seems to work. They have a wide variety of seasonings and spice levels that will suit anyone. If you can try and get Billy as he is a terrific server at first I thought he was the manager because he knows everything about this place and can be honest with any questions you have. Just try it you wont be disappointed.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2015-11-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': '3qZWlbG4x7GGVq7KUWiXvA', 'review_id': 'X2nOc8LbiIqfkIUYCEy8lA', 'text': "I had to come and update my review from my last experience.  It went a lot better and the food was so good that I almost couldn't finish what I had left.  The service is always great and when we were finished, Emily took care of us and made sure we were completely satisfied with the food.  I commend them for trying to redeem themselves to make sure we left happy.  I told Emily we don't want to go to the competitor because we love Hot N Juicy way too much.  I know we'll be back in a few weeks!\n\nThanks again Emily!!!", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2015-11-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'fsAsmHQaCt63PbQyryF65Q', 'review_id': '4OJdZRzM59mrqqQGoudKJQ', 'text': "Every time I come here they are always out of clams  it's best to call ahead to make sure what you're coming here for is available.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 2, 'date': '2015-11-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 3}, 'user_id': 'wqwHih7XF1BPSdFyK1U-fw', 'review_id': 'zOsYzdCtZ3d6-qeRHGxXOA', 'text': "Oh ...I haven't written a review  on this place? Well, well, I love this place. I have been here twice and had a great time both times and cannot wait to come back. \n\nI am gonna write the review for a little bit of both of my experience. My first time was fun and but the spice that we got was soooo spicy (mild hot n juicy) haha I know..we are babies. But for us, it was so spicy...I love the flavors tho and I kept eating anyways....\n\nSecond time around I went with my man...and man they took care of us. We just felt happy after we left since the servers were super nice and helpful. We asked them to change the channel to the football game and they were more than accommodating. We said it was Mando's first time and they definitely made an effort to make us feel well served. This time around for 2 people we ordered one pound of frozen crawfish $7.99 and one pound of shrimp $11.99 I think? We asked the server what flavor can we do since we don't want it to be super spicy even if it is mild...she suggested doing baby spice for whatever flavor we are getting and maybe the other pound more like a garlic butter baby spice...So we decided to get the crawfish baby spice hot n juicy and shrimp baby spice garlic butter and it was PERFECT!!!\n\nWe ordered rice for each and a drink for each...also added a potato and corn for each (extra $)\n\nM doesn't like seafood that much and he definitely enjoyed himself and the flavors. \n\nI cannot wait to come back!!! I'm craving it right now....that butter tho eeks.\n\nP.S. It's better to eat with your bare hands...but be warned...wash your hands well or you will smell like garlic butter hot n juicy baby spice for a couple of days :)", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2015-11-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'p2_0YiwniJTlhiiD5Q9bzw', 'review_id': '29oYLmgnl2ir_1FCUsoXXg', 'text': 'All the food was rich and spicy! While my husband is not a seafood eater, he filled up on all the teasers. The sausages were tasty. Our server Anthony was a rockstar and handling the patio all on his own with humor and awesomeness.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2015-12-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'd0wJVf7Gv7v1B-HHYhxZtQ', 'review_id': '89g93He6OQtMOilhchVjfA', 'text': "Angry crab is better.\n\nThe tables are lined with plastic and you get bibs and even plastic gloves but the gloves are just about useless after a few minutes.  Then you don't even get waste buckets so you're just making a mess pile and eating on the mess pile.\n\nThe logistics are just so much tighter at angry crab but I also thought the flavors didn't really get into the seafood as well at this place either.  I'm not sure, but I think they don't have beer either.  :/", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 2, 'date': '2015-12-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UKUcz891pYT5JEZkJjqO4w', 'review_id': 'CHZyLBr2ZbWNGEp7NBfivQ', 'text': "I came here with a large group of people, including one person who is a self professed Hot n Juicy addict.\nFirst off the service: our waitress Isabelle was AWESOME! In the face of crappy food from the kitchen she did a great job.\nOn to the food: it was embarrassing how bad it was. I had the clams and they were way over steamed. I had also ordered corn and potatoes and the bag didn't have them. Other members of my group got ice cold potatoes. When we got the substitute potatoes those were cold too. My friend's shrimp was not just overcooked, it should have never been cooked at all! It was bad, like was probably spoiled. Just an over all bad food experience. \nLike I said at the start, thank god for Isabelle.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 1, 'date': '2015-12-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1AxALwNKdLZm5QeFxeC_kg', 'review_id': 'DidS0wwrD1jeb5kPBMGHsQ', 'text': "To:\nHot and Juicy Crawfish,\nEmily,\nMady,\n\n\n\n          My wife and I like to frequent the Mill Avenue venue for our Friday night ritual. Our Fridays' typically include bar hopping and walking the strip until we settle down at one of our favorite restaurants. This Friday, however, was not typical. Our evening started with the perusing vendors at the Tempe Arts Festival, trying to fight the hustle and bustle of the crowds and closed streets. We took cover at one of your competitors and imbibed a couple of tasty beverages and consumed some delectable eats. With several destinations in-between we ended up landing at Hot and Juicy Crawfish.  It is rare that you feel a percussion so magnificent you feel your own heart beating in its absence, but this is Hot and Juicy Crawfish.  Your Family, Emily and Mady were the highlights of a spectacular dining experience. They were awesome and personable. It is quite a rare spectacle that you visit a restaurant were the employees are allowed to display their personality. Upmost, I commend Emily and Mady on a level of personable service far above your competition.   \n\n\nThank,\n \n          Melba and David.", 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 5, 'date': '2015-12-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GvCth6sFdpH607ePiCZlaA', 'review_id': 'nGZyXMkgPtgj_XEYTSmSwA', 'text': 'Been there so many times. Today We asked for the validation tickets for the first time, BUT none of them works! We paid 6 dollar extra for each vehicle!!!!!!!!!!! Service is also disappointing.', 'business_id': 'qj7WihihB03Z5xR4G1d9yw', 'stars': 3, 'date': '2015-12-22', 'type': 'review'}
