{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'oFhtzLhXS1iENWoBMdWk4w', 'review_id': 'mMzceDt6P3YKP-ofTa6jjA', 'text': 'Like Greg, I was apprehensive to try Ha Long Bay, especially after my disastrous lunch experience at Sa-Bai Thong.  As mentioned before, I\'m not a Thai snob (or a snarky food snob in general) by any means - I\'m just desperate for some decent/tolerable Thai food.  And with that in mind, I can enthusiastically and without hesitation, recommend Ha Long Bay.  It\'s great!\n\nWe stopped in on a Saturday afternoon, just after the lunch rush.  We were quickly seated and spent a few minutes browsing the vast menu.  My eye spotted at least a dozen potential "must try" dishes, but we settled on our "old faithful" entrees.\n\nFirst up were the egg rolls.  Perfectly fried, packed with flavor, and complimented by the dipping sauce.  I believe they were called the Ha Long Bay Special rolls (A3).  Give \'em a try; they\'re wonderful.\n\nThen came the steamed dumplings (chicken).  Very mild flavor, as you\'d expect from a dumpling; perfectly steamed.  The dipping sauce was a bit light on flavor; the chili sauce helped liven things up a bit.\n\nAnd just as we were wrapping up the appetizers, our main dish arrived - chicken pad thai, medium spice.  The Pad Thai had a slightly sweet flavor, but it was really delicious.  And, there wasn\'t a hint of grease anywhere.  In fact, the serving platter was completely dry when we were finished with it.  Now, that\'s a welcome sign!  Not like the greasy mess that we had over at Sa-Bai Thong.\n\nI\'d probably go with more spice next time, but for a first experience, this one was wonderful.  Great service, excellent food, reasonable prices, good portions, and a wonderful ambiance.  It all adds up to a Thai restaurant that we\'ll definitely visit again.  Ha Long Bay = WIN.\n\nSummary:\n\nService: 4 stars\nFood: 4 stars (a bit mild, but we can adjust that.  Big bonus = NO grease)\nValue: 4 stars (our lunch was about $20 with drinks and 2 appetizers)', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2009-08-10', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 1}, 'user_id': '4WY-wPe6bwwq4t1Qp8-ELQ', 'review_id': 'WkPgQ8v1M0T3kFMyKFlxPQ', 'text': "This is probably my favorite place to eat in Madison... and no I don't go around saying that about just any place. The staff is so nice and attentive, the atmosphere is relaxing (it's a good place to sit and read or have conversation, enjoy with a big group over yummy food)... which brings me to the food. The food!!!!  Delicious, exquisite, mouth watering Pho. I could eat this every day for the rest of my life and die happy and satisfied. Actually it's all good here! They serve both vietnamese and thai food. For dessert get the sweet sticky rice with mango or icecream. The ultimate comfort food. Sigh... I love you Ha Long Bay. :)", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2009-08-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GnFluOcnG8k3hQOJBfTtrg', 'review_id': 'dTYSy7i3LAgU-j268SW5fg', 'text': "I'm very glad that I didn't write a review of Ha Long Bay after my first visit there, because it would not have been so positive.  While their first month or two in business might have been a bit shaky (looong waits for service, mixed up orders, etc.), I returned last night to find that they have vastly improved on all fronts.\n\nWe ordered the chicken dumplings, pho, and bun, and it was all excellent.  The bun was euphorically good: cold noodles, fresh herbs and vegetables, and wonderfully seasoned grilled pork with a thin, sweet sauce poured over it.  I highly recommend it.  The pho was great, too, but I'm not as much of a noodles and broth person.  I will say, though, that the beef and noodles in the broth were fresh and well prepared, and the sprouts, herbs, and chili peppers we got on the side of the dish were all fresh and flavorful, as well.  Together, they made a nice combination of flavors and textures in the dish.\n\nAnd the service, which on my first visit had been phenomenally slow and had messed up both our order and our appetizer, definitely had their acts together last night.  My dining partner even spilled the bowl of pho on his lap, and our server was there in an instant with towels to clean up the mess.  She was very nicely attentive.\n\nAfter a rocky start, Ha Long Bay has established itself as a great option for Vietnamese food in Madison.  Go, and get the bun.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2009-08-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': '13XTZwRHFLGjAdpN3YCm5Q', 'review_id': 'Mo2f04baaGYFrbSuBrX2KA', 'text': "Enjoyed dinner here last night with a friend. Walking into the place I thought it was really nicely decorated. Not over done, but very welcoming. We were seated at one of the tables overlooking Willy St. I am not a Thai food aficionado. I don't know what's authentic and I don't really care. I more judge the food on whether or not I like how it tastes. I liked how everything I tried here tasted. \n\nThe menu was huge, so having an idea what you are hungry for helps narrow down the search. Dinner started with some of the chicken egg rolls. They were crisp on the outside and yummy on the inside, served quickly and very hot. I opted for the Mango Chicken Curry (2 star spiciness cause I'm a wimp). It was lovely. Chunks of squash, potato, mango, and pineapple in a tasty sauce. I thoroughly enjoyed it. My friend had the Peanut Stir-Fry with Shrimp. The bit I tasted was pretty spicy but still had a nice flavor. The service was prompt, friendly, and our waiter was kinda cute, which is always a nice perk.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2009-09-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'U4qqz9pPKaVQv6JrvMceTg', 'review_id': 'pTh_urWTa4Ykzt7tbDn0RA', 'text': 'We came in close to closing, so we werent able to eat in the dining area, but the staff were so super friendly. We chatted with them at the bar while we were waiting for our food to be made. The ambiance was very relaxing, and the food was really good. Totally recommend.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2009-09-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dt3JIkSnfgHDAwd-qbf9mQ', 'review_id': 'VJkM3q3knGabhzvimJN2DQ', 'text': "When a top-notch bowl of pho is in front of you, there should be no talking. Don't talk to me about your day, don't remind me to get bread at the store. What the pho? If the broth has been cooking for hours, sucking every last bit of deep flavor from the stock bones, it can be a thing of beauty. Ha Long Bay seems to know how to do it right, pho real.\n\nThe bistro was packed on an unseasonably chilly evening; we had to wait a little longer than I'm used to for pho, but it was worth it. Fresh thai basil, crispy bean sprouts, and the usual pho-king hot condiments. Unlike other pho huts I've been to, there is only one size here (about $7). I'll need to give an updated review after trying their other dishes. If they can do pork as well as pho, I'm sold.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2009-09-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'SKzZNdfk4CLWi4GSTzW_Hw', 'review_id': 'gQwaL8DJwsyb81UztI0KJw', 'text': "Summary: (+) Great, well prepared and seasoned food (-) A little too much on the menu, pare down (+) However, impressive authentic dishes like Banh Cuon. (+) Tastefully decorated (-) Paper place mats make me feel cheap (+) Good price. In all, Great Place!\n\nI've been here a couple times and I have to say that Ha Long Bay is an excellent addition to the Madison area. Having been in areas with much more substantial vietnamese, thai and south-east asian populations, I thought that the food was great for Wisconsin, far superior to anything else that I've had in Madison. \n\nBefore I comment on specific dishes, I have to make a general comment: their tofu is just fantastic. I might even claim that if you know someone that doesn't like tofu, this might convince them. Everything that I've had there with tofu in it has just been great. \n\nFood: Ha Long Bay has an impressive menu, although perhaps TOO impressive (i.e it is far too large) I think that they should scale back and find a central vision for their menu. All of their food is fantastic though, so if they stuck with what works or split off some of their items (like lunch specials) for a separate side menu, then it might make the menu more manageable. \n\nI've had several different dishes there and they have all been good. The pho is a welcome addition to Madison. I planned to be camped outside of this place all winter in order to fill myself with the delicious broth that is pho. Having been to more traditional pho places though, I would prefer if they're waiters understood that I might want to get more than one type of meat in a dish. For instance, I tend to get Pho Tai Bo Vien. When I ordered this the first time I was there, I did get this confused look. It might have just been that waiter though.\n\nLast night, I took a very large party there and we all had a variety of dishes and no one had anything negative to say about their dishes. As a side note, they worked really well with us and had the table set up when we arrived and were very nice about splitting checks. A+ Back to business, we had crispy fried noodle, several types of curry (The mango curry and the roast duck curry were just so fantastic!), dumplings, pad thai, some pan fried noodles and several tofu dishes. It was all great and recommended.\n\nOne last note about food, although I haven't had it yet, I am very impressed by several of the more authentic dishes on the menu. They have Tom Rang Muoi, Banh Xeo, and (most impressive of all)  Banh Cuon. I will certainly go back to try these. \n\nDecor: The place is pretty well decorated, nothing too fancy but just enough to make you feel like the place is nice and taken care of. I appreciate their cute little window seat by the door. It gives it the kind of vibe that I expect from a Willy St. location. \n\nThe tables: Considering the amount of condiments that they could have, I like that they have out just the necessities: hoisin sauce, sriracha, and soy sauce.  This is perhaps the area that needs the most improvements: they need to get rid of the paper place-mats. It ruins the otherwise classy feel of the joint. And, I know that it's Wisconsin, but I would appreciate receiving chopsticks with my silverware. Similarly, I think that most dishes should receive a separate plate to eat from. I don't know anyone for example that would (or could) eat an entire crispy fried noodle dish to themselves.\n\nIn all a great place to have here in Madison, and I think that we should support it to keep it here for a long while!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2009-09-24', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 5, 'cool': 0}, 'user_id': 'ZYaumz29bl9qHpu-KVtMGA', 'review_id': '_yDqhTN5BVOdcLf-_0w8ug', 'text': "Based on the glowing reviews on yelp, I was kind of expecting this place to be great, so I went here last night.\n\nWhat I was not expecting was a 2 hour meal due to the fact that the servers were totally incompetent.  There were actually open tables, yet no one was being seated.  There didn't seem to be a host/hostess and people were walking in and staring around like they didn't know what to do, and weren't being greeted.  There really wasn't any reason I should have waited for an hour and a half for a table when the place wasn't all that busy, there were only 3 people ahead of me, and there were actually empty tables in the restaurant.\n\nI think there was just a total lack of communication in the kitchen.  My water glass was empty and a waitress walked by with a pitcher of water, yet she only poured water for the tables she served.  \n\nThe food was okay.  It was certainly better than other restaurants in this town doing the same thing.  I think if I ever went back, I'd order take-out.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 2, 'date': '2009-09-27', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'dt3JIkSnfgHDAwd-qbf9mQ', 'review_id': 'gv4OlARgzqPWamX2y_rDbQ', 'text': 'Ha Long Bay, you\'re breaking my heart!\n\nMy first HLB visit was all pho, and it was cozy and succulent (if soup can be succulent). Last night, we decided to branch out: I ordered the "bun" with grilled pork and vermicelli, topped with cucumbers, basil, and mint. And Mr. G mixed it up with a Vietnamese version of phad see ew (egg noodles with beef and broccoli).\n\nI was mildly disappointed because my dinner, a classic Vietnamese dish, wasn\'t warm at all! I can understand if the vermicelli noodles were cool or room temp--I think this is normal. But the noodles were all clumped together in a sad, chilly mess. And the grilled pork had clearly just been pulled from a tub in the walk-in cooler, already pre-sliced, because it was completely cold and dry. To top it all off, or not to top it off, there wasn\'t any mint. \n\nTo be fair, we were one of the last tables of the night, and I could hear the kitchen cleaning up immediately after our entrees were served. But I don\'t pay any less than the person who ate during the dinner rush of 6:30pm, who most likely had a better "bun" with warm/hot grilled pork. Therefore, I deserve the same quality food. My advice? Just stick to the pho. \n\nP.S. It\'s pronounced "fuh" as in rhyming with "duh", not "dough".', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2009-10-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'RxD8XEw5do9-2ue0NBi9vw', 'review_id': 'W_otXe82qVOvENwAl-p8Cw', 'text': "This place is good. My co-worker and I went here because we thought it was still a New Orleans resturant but when we walked in we had noticed something different. Anyway, we ate here and were quite happy. I had a large bowl of delicious shrimp and eggroll bun, spring rolls and pot stickers. Alsothe beers were cheap (3.50). Go eat here it's good.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2009-10-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'gDbRpS5KWr1uszRH2AEJvg', 'review_id': 'CyU8InmSTDzrhBqacQhWLw', 'text': "I love the all-inclusive (Vietnamese, Thai, Lao) menu and the decor, and when the place isn't busy the service is fast and friendly. We live down the street so we've eaten here a handful of times since they've opened and we've learned two things: 1) just because they ask you how spicy you want your dish and you say 4 stars, it doesn't mean it will have any actual spice (they forget?), and 2) if it's busy we go somewhere else. The main problem seems to be consistency, both with the service and care with which the food is made. Other than that, I'm happy with their food and have yet to have a dish I didn't like. The pad thai is fantastic; the bun lovely and cool when it's hot outside; the pho deliciously hot when it's cool outside. Most dishes range in the $9-15 mark for dinner and $7-8 for lunch.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2009-10-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '9PLgvcIiM_DRZqnrxjQfJw', 'review_id': 'RimtCiv7l_nkFe9FJm-ETQ', 'text': 'This place has a nice decor and is in a good location and I suspect that is the only reason why it\'s been busy so far since it just opened.  The food is very white-wash.  Yea, I said it, white wash!  The pho broth absolutely has NO flavor.  We ordered the papaya salad and asked our waiter to ask the chef to make it "Lao" style (we know that the restaurant cooks are mostly Laotian people and wanted it more authentic with all the real ingredients, like stinky fish/shrimp paste, fermented crab etc.) the waiter looked at us confused.  We told him we just wanted it authentic.  He assured us it is authentic and delicious.  I was NOT comforted by that and told my sister not to order it, but she did anyways.  It came out and was nothing BUT, shredded papaya with lime juice, tomatoes, and peanuts.  Now if you like "white washed" papaya, then it\'s fine, however just don\'t expect the real thing.  I wouldn\'t mind if the waiter knew that it was NOT authentic, and just told us the kitchen didn\'t have/keep all the ingredients to a Lao style papaya salad.  I\'ve been to places that simply told me that, and I still got the papaya salad anyways just to try.  But it wasn\'t just the flavor that gets you...the portion is also very small.  It is not worth the $6 or $7 dollars they charge at all!\n\nOh and be ware of one of the server.  She\'s a nice and kind Asian lady,  when she serves she carries food tray out on her shoulders.  She\'s petite so it must make it easier for her, however, her hair is shoulder length (and curly) and I\'ve noticed her hair brushes the food on the tray especially the rice...I\'ve noticed this on more than one occasion.  Yes I\'ve been there twice despite my 2 stars... I was extremely sick the first time I went there, and decided to give them a second chance.\n\nOh yes I also should mention, the kitchen takes FOREVER to cook.  Both times we were there, the whole meal took over 2 hours!!!!  The restaurant was NOT busy and there was only 4 of us.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 2, 'date': '2009-11-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'VRzYwROO_vUccD9J38aYLg', 'review_id': 'NAzRpVl2meTZwSUGRPQcIg', 'text': 'Visiting from OC and the land of accessible and pretty good Vietnamese food, I had pretty high standards for this place. With an extensive menu that had both Thai and Vietnamese dishes I started to get a bit worried. I agreed with Jason O. that they probably had thai dishes on their menu to appeal to the general midwestern populace that wasn\'t so interested in Vietnamese food.  \n\nWe had the tom rang muoi (shrimp with salt/black pepper) and the pork com tam. Perhaps we didn\'t choose the best dishes, but the tom rang muoi tasted quite bland with the salt/pepper mixture being nonexistent. There was also very little heat with the jalepenos provided.  Also, in my experience, tom rang muoi is traditionally prepared with the shells still being on the shrimp in order to keep more seasoning on and in the shrimp as it\'s being fried. This shrimp was peeled...ultimately leading to its strange texture and blandness.\n\nThe pork com tam we had was just a generic pork chop flavored with lemongrass and grilled. The pork was flavored nicely, but was quite overdone and ended up being a bit dry. The dish came with most of the traditional garnishes for com tam, but was missing the traditional egg/pork "meatloaf" that disappointed me. \n\nAll in all, Ha Long Bay was a bit of a flop. I won\'t be coming back here on my visits to Madison. Don\'t let this place ruin Vietnamese food for you. I\'m giving this place 2 stars, one for their attempt to create a good Vietnamese restaurant in Madison, and the other for having such a wide variety of choices...albeit the choices that we had were greatly disappointing.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 2, 'date': '2009-11-11', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 0}, 'user_id': '2OquMv5WPNNrRX3hTGJhYg', 'review_id': 'oXj6kxR-9wuva5QsXA7xAA', 'text': 'Don\'t be derailed by all of the California D-Bags posting reviews of this place.  I\'ve been there several times and it\'s fantastic.  The food is as succulent and fresh as it gets around here.  If the "Pho" is not the real deal, well, I\'m sure that\'s disappointing to the connoisseur.  But this place is very, very good.  The beef stew is especially delicious.  Give it a shot, you won\'t be disappointed except, maybe, if you\'re from the OC.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2009-11-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MfZJg3n4n2gpK7CngBSRoA', 'review_id': 'dfSJDZy2_jB5RvNAAuWmnA', 'text': "I've so far only had the basics here, but they have been good every time. I love the pad thai. \nI really like eating at Ha Long bay for more than just the food. It's just a nice place - the interior is nice, the staff is nice. Nice nice nice. Good good good.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2010-01-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WTU4O_gfkbsIHoLNBoEAfQ', 'review_id': 'XigjPckxsdQw629w3bDExg', 'text': "I moved to Madison from the DC area, where I've had great Vietnamese and Thai meals.  Since coming to Madison, I've had some good pho (Saigon Noodle), but in general had bad experiences at restaurants like Sa-Bai Thong and Banh Thai.\n\nHa Long Bay changed all that.  The wait for tables can be long due to popularity, but it is a fairly big place by Willy St. standards.  I am vegetarian (converted since the pho, obviously...), and have enjoyed several great meals at at Ha Long Bay.  And service has been consistently good too; food can take a short while, but is well worth the wait.\n\nLike others, I was concerned about the breadth of the menu, but so far, so good!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2010-01-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'S0WAH8ijhKjrs6cYE8mbcg', 'review_id': 'DgOMkMpmSuL6Wy4ildGW6w', 'text': 'Remember that Seinfeld episode where they talk about a restaurant that has every sort of international cuisine? Sometimes it seems like Ha Long Bay is trying to be that for Asian food. The menu is absurdly long, and has Thai, Vietnamese and Laotian Food. Ordering can be a little overwhelming.  \n\nIn my experience, they don\'t do Thai food as well as the dedicated Thai restaurants in town, and same with Laotian, but every dish is a very solid attempt, and the portions are huge. If you want Pad Thai and your friend wants Pho, this is the place. I would generally say that seafood is not the best bet here. It must be coming out of a bag frozen -- the mussels were particularly tough and fishy.    \n\nThere are a ton of Vietnamese specialties that I\'ve never had, and we are having a good time working our way around the huge menu. I dubbed V6 today "general Tso\'s Eggplant." Yum. \n\nThe staff is friendly, and refills on rice are free. I\'ve had very slow service when it\'s been busy sometimes.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2010-02-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DxskpNqrzI8y4dkb0DBZsg', 'review_id': 'qsn72T-0PDYNMeVsug2ygg', 'text': "We live four blocks from Ha Long Bay so we have gotten take-out from them many times in the last year. Oddly, we have never dined in, so I can't comment on the service. I'm not sure precisely when they opened, but I know in the fall of 2009 when we first started picking up food there were a few problems with mixed up orders and longish waits. However, those issues seem to have long cleared up. They have hired some good employees and generally seem well-organized and attentive. I haven't had to wait for my call-in order to be ready in a long time.  \n\nThey do have a ridiculously large menu, which is fun for us since we can leisurely look it over in the comfort of our home, but I can see how it's a little much for one restaurant. At the same time, I have liked most of the dishes we have gotten. Some of their Thai dishes do not meet the standard of my favorite divey Thai place in Milwaukee, but I think others are really good. \n\nI especially like the squash curry, the pad thai, and the spring rolls that have an egg roll inside them (sounds so ridiculous but it's actually good!) I am realizing that in order to get the food spicy enough for my husband and I that we have to order 4/4 stars, which seems a little strange, but whatever. I'm looking forward to trying the pho whenever we decide to dine in. \n\nOverall, I think this is very good Asian food for Madison, and I'm happy they are in the neighborhood!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2010-02-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4u785FxU5RUe0Bl0BBSpjw', 'review_id': 'P0OuBBg6BZ2NE_oTZqTgLw', 'text': 'I went to Ha Long Bay last Friday for dinner. It started off awkwardly... We were standing inside the door waiting to be seated and another couple came in behind us. They were immediately helped and had their names put on a list to wait for tables. I had to say "excuse me" a couple times to get the man\'s attention. Maybe because I\'m a female?? I have no idea. \n\nSo the menu is huge as many have mentioned and everything I have tried is good. That being said I have not tried the seafood. \n\nMaybe skip the spring rolls, although they are delicious, I have had them twice and both times they were loosely wrapped and fell apart/difficult to eat. I had a Vietnamese tofu soup and my dining companion had a curry. Both were fantastic. \n\nOur waiter was strange (the guy who didn\'t want to take my name). But somewhere in the course of our dinner an older woman, perhaps an owner?? took over and was wonderful. She boxed up my soup - which I really appreciated. You get A LOT of soup!!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2010-02-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vjoyupfMNVHoW7PKxxH3hg', 'review_id': 'Z-0PcBNWD6oRgNSOrXOrAg', 'text': "I've been here twice.  The first time was summer '09.  I can't remember what I ordered, but it was Vietnamese and it was good.  My last visit was more recent and I had the pho special.  \n\nIt wasn't special.  The pho broth tasted like pho bullion.  There was one piece of each type of meat.  The noodles got me full, but the soup definitely was not fulfilling in any way.  This is a shame because I like this place.  It's new, it's bright, and the service is polite.  \n\nHeard the Thai dishes are better.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2010-03-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'aeX-t6FP5Dn062YAK5ewYA', 'review_id': 'eQg8AIHP_zLhpEu6R9G_Mg', 'text': 'I used to live only about 5 blocks from Ha Long and ate there regularly.  I have since moved to DC and have not yet found a place there that makes as good summer rolls or Pho.  I miss it dearly and dream of my walks from Morrison St. to Ha Long.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2010-03-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Jnu1WBSAy3cggN7n9RQ--Q', 'review_id': '6Xjch-9b2zAUKTh7rqbrLQ', 'text': "As a friend said: this place is great for takeout. Great food, but the service is terrible. I've given this place two good chances but it's slow slow slow. They either need more servers and cooks or just more competent servers and cooks. Be prepared to wait an hour for your food. Once you get it it's delicious, though, and the atmosphere almost makes waiting so long bearable. Nevertheless, I won't be going back to dine in.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 2, 'date': '2010-04-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'aGbiLEZFReyybvQAQ1dxnQ', 'review_id': '-bTachHfoQBTM2gxA7lazA', 'text': 'the best pho (the one with all the meat, entree PH8) ive ever had!!! sucha  cute and authentic restaurant, service was good, also my friends got the mango curry which was DELICIOUS as well! for an app i had the pha goi (pork egg rolls) came out HOT and crunchy and sauce was so good!!! cant wait to go back!!!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2010-06-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '3KYHumUCMe6L1dTdlYiqIQ', 'review_id': 'k7MKd-jg4JsbLqyUqwkZ_g', 'text': "My go-to restaurant for take-out. Also a good place to dine in. The drunken noodles are fantastic, and don't be afraid to get them spicy.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2010-07-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'zkCFutOvKFxxduatWQI7Rg', 'review_id': 'pxa0bclYaT_fWrdOBGQFsg', 'text': "My rating is based only on the Vietnamese part of the menu, as I'm hooked on it and haven't gone further. The pho is perfect, little explosions of different tastes in each spoonful of broth. The spring rolls are so, so, so fresh and fantastic. I think the lemonade is fresh-made. Just the right amount of tart-sweet. I've never had anything but impeccable service here. I like sitting at a window table and watching Willy Street go by through the filmy green curtains. I'd eat here every day, but don't want to risk getting bored...", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2010-07-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dFSg9ZUwdvXO1c1ZACgZzA', 'review_id': 'afoYxpS8lv67OY73HZ4Mmw', 'text': 'Clarification: "I\'m a fan" is a bit of over statement. But I\'m willing to give it a second try. Why? Because their papaya salad - a must order item on my southeastern restaurant outing - was pretty good.\n\nThe interior of the restaurant is nice. Like, I\'d feel good about taking a date out to a dinner here. However, I echo on other reviewer\'s take on the service. Slo~oow. So you might want to make sure that there are plenty of conversation topics between you and your friend(s). \n\nDespite of the slowness, my waiter was incredibly polite and pleasant. I appreciated the cordial smile and friendliness. The order of Tofu in pineapple-ginger sauce and squash curry were pretty good / decent. My squash curry obsessed friend thinks that LaoLao Xiang does the better job on the item than Ha Long Bay. And as I mentioned in the beginning, papaya salad was good, so I was in a good mood at the end of the meal.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2010-07-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'aTYpoKdMAZqXLb5taBRY1A', 'review_id': '0PPS_73GMIX529zMWoe0Tw', 'text': "cute place.  great food.  somewhat disoriented service, but i think they were just especially busy.  we split the fresh vietnamese spring rolls and i got the tofu pho - and they even offered to make it vegan for me (i didn't even have to ask).  it was delicious.  really the only place in the area with pho....2 thumbs up!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2010-07-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'eQqLTnj3LAds0ublmGDLhQ', 'review_id': 'TOJ4SGhwv-DeTuA3z9o7yQ', 'text': "This palce is awesome. Nice atmosphere.  It has jsut a huge menu and i had great experenice every time.  IT's GOOD!!!!! @_@", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2010-08-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'crhrjDQpvejQ3HZ0Fk4xLg', 'review_id': '9p0FM0I-VuqCMNxQxwDtGg', 'text': 'Ha Long Bay has quickly become my favorite restaurant in Madison.  I always order from the Vietnamese menu and love the shrimp bun and sometimes daydream about their egg rolls.  The fresh lemonade is divine and I really like the atmosphere.  \n\nThis restaurant makes me want to do a culinary tour of Vietnam!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2010-10-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bFum5f0fPWkbMs6mr5S38A', 'review_id': 'Qmcy82qmHGk3h0Tch2l3mA', 'text': "This is an amazing restaurant, not only is the food pretty good, but the atmosphere sets a cozy, relaxed tone to the restaurant. Very spacious and can accommodate quite a few people. I ordered the Pho which was as good as I've ever had...and I've had some all over the world. All in all, it was a good experience, my review may change the more I eat there. Hopefully not negatively though, as I'm pretty impressed with it so far.\n\nMy rating 1-10 (10 being the best)\nAtmosphere: 8\nFood: 9\nCleanliness: 9\nNoise: 8\nService: 9\nOverall: 9", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2010-11-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'Z4pAvvByKSHCIMkQ6WXGBQ', 'review_id': '8SqVvtewIHppSnk8l5CEUg', 'text': 'Fried chicken dumplings, fresh spring rolls with shrimp. probably best thai/lao appetizer selection in madison by far. apps get 5 stars\n\nentrees get 3-4 depending on what you order, ive had hits and misses. Noodle dishes are always fantastic\n\nUPDATE:  raising my review to 5 stars\nwent back to Ha Long for the first time in over a year last Saturday night and everything was awesome. Tom Yum soup was the best I have ever tasted and all the entrees were considerably better then what i remember.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2010-11-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'aTYpoKdMAZqXLb5taBRY1A', 'review_id': 'Swk7ZtK_-ifbU_kBH-2W1w', 'text': 'update: another visit when  it was less busy - amazingly attentive and fast service.  such great food!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2010-11-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 4, 'cool': 1}, 'user_id': 'R005MrvgUEgCW_V4I-f3nw', 'review_id': 'BQjjWMzYZ8hp-TI4cCjboA', 'text': 'I just simply ADORE the food here. I come here EVERY week :):) \n\nFaves and MUST-haves:\nVietnamese Crepe (only on weekends): The cripsy outside is filled to the brim with loads of bean sprouts and loads of meat and shrimps. The fish sauce just finishes it so well!!!! Love it!\nVietnamese Iced Tea: Might be a little sweet at times, depends on who makes it. If it is too sweet, let the ice melt for a while, will be perfect in a few minutes! \nAnything with sticky rice rocks!\nLaab: Huge plate of minced meat with awesome flavor! Delish!\nBun (with all the meats): AWESOME! love dried vermicelli with fish sauce. The grilled meats are done JUST RIGHT!\n\nIt is rather busy anytime after 7pm, so you might have to wait 15 to 20 minutes.. and yes, since they are so popular, the service is a little slow. But they give such tasty soursop candy as your "farewell gift". Love it!\n\nIf you\'re into spice and southeast asian food, one of the MUST GO-es in Mad-town :):):) (Btw, they are really nice about no spice and no onions/cilantro etc, just tell the server!)', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2011-01-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'neMc9cBm48RrkYL56EGXGg', 'review_id': 'p9Hl0szk8EN0BNmLDMavPw', 'text': "The curries are outstanding, as is the Drunken Noodle.  As a vegetarian, I am really impressed with the distinct flavors of each of their tofu options.  On a recent visit, the place was packed half an hour 'til close and our waitress was sincerely sweet and very knowledgeable.  My only complaint is the estimated time for pick-up.  If they say 30-40 minutes, they actually mean 20-25 minutes.  Also, the 'mints' in the bowl on the counter are not very good.  Aside from that, food, staff, and atmosphere are great.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2011-01-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'nmDcdE8LvcJ0vFy9jmctOA', 'review_id': 't6JpKwvFbcHm8UwlcU0KxA', 'text': 'Absolutely my favorite restaurant in Madison!!!  I have tried multiple dishes and have loved every single one of them!  My favorite is TE1 with 4 stars.  Always made to perfection!!!  I also highly recommend their plum wine, a bit sweeter than usual, but it is fantastic.  I only live a half block away so we go here often or get take out.  I have never been disappointed!!!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2011-02-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '0XfPeSFmXb89yHGt0Ur7yQ', 'review_id': 'c53f-VsLbXtkCG8Xthm4pQ', 'text': "I used to come here all the time for their chicken wings. Yummy yummy. Service is pretty awesome too. It's very casual, it's a good place for my group of friends to eat together.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2011-03-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '3FjUMSmcL3z70GWC4YwOMw', 'review_id': '2V35aAAjF7JGc3xmfaozGA', 'text': "I came to Ha Long Bay 4-5 times over the past 3 months after a recommendation from a classmate. My relationship with this restaurant is a perfect example of a roller coaster ride. I actually want to give it 3.5 instead of 3 because I still have hope that our relationship is gonna get better.\nI first came here and tried the fried rice, while hubby got the chicken steamed in banana leaves (listed under Hmong dishes). My fried rice was good (not special), while the chicken in banana leaves were horrible and tasteless. \nThe second time we were here was on a Saturday because we wanted to try the Vietnamese crepe (served only on weekends). Being a huge Bourdain and Zimmern's fans, I always want to try this dish (probably the best one can only be obtained in Vietnam). I was dissapointed with this  dish, but I am not an expert so I won't say anything else except that I won't order it or recommend anyone to order this.\nMy third time: I got the pho, and hubby got the green curry noodle with chicken. Both were surprisingly delicious, and made me come back for the forth time. The pho was fresh, brothy, and the green curry noodle soup was warm and comforting, and a little spicy. But you can just adjust the spiciness as you like it.\nMy forth time: I got the red curry noodle, and a friend of mine ordered the vietnamese beef stew with rice. Both were great, but I still like my hubby's green curry noodle soup better. My red curry soup were a bit too sweet for me.\n\nAnother fave from this place is the fried egg roll. It's crispy and I like the sweet/spicy/salty sauce. The thai iced tea is good, but I haven't had thai iced tea in Madison that aren't good.\n\nThe service, however, was not the best. It's a little slow even when the place's not busy. I personally don't like the setting because the waiter is actually on the other side of the restaurant and not facing you. They only occasionally check on the customers and it can be a while before they notice that you need something from them (ready to order, get the check, etc).\n\n\nSo, Ha Long Bay.. i am looking forward to try more dishes that you offer!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2011-03-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '1KxfcH2SikGLHPxJGiBTRQ', 'review_id': 'u0FqBTTEURUyu83IA4Z9Ug', 'text': "The food here is awesome and it is so reasonably priced! The portions are huge. I've never eaten here and not had left overs. My fiance and I usually get the mango curry with tofu and the pad thai with chicken and split them. The pad thai isn't like typical pad thai in that it's not heavy on the peanuts, but I like it. Last time we went, it was just the two of us and we didn't get anything to drink (just water) and the bill was about $18. Seriously, the prices are amazing. They have a HUGE menu -- it's actually a bit overwhelming, but should suit everyone's taste. Definitely try the appetizers. I've had all the various rolls, and they'll all good and of course, large portions.\n\nThe service is a bit slow, especially during peak dinner time. But, when the food comes out, it's always so hot and fresh so I never feel bad about waiting because I know the food quality is great.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2011-03-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'auEqO5p6dkDyRCR5WK3SbA', 'review_id': 'D-uccPNGb_U2M45_LgqnZw', 'text': "This place is the bomb. \n\nExcellent food, reasonable prices, generous portions. Curries, pho, stir-fry, the Vietnamese crepe...we've sampled all over the menu and have never been disappointed -- all great stuff. \n\nFriendly and attentive staff.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2011-04-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'v_7KW52Z8r_su8v4uV98MA', 'review_id': 'qY-yFADnMk4yaAJG4a69gQ', 'text': "Madison has a lot of Lao/Viet/Thai places, but lets face it they mostly suck.  At least that's what I realized once I tried out Ha Long Bay.\n\nThey have an intimidatingly long menu that I have not begun to sample in my several trips but The Pad Thai and Sesame Chicken dishes I have had were both good if a little sweet.  The Vietnamese soup was pretty good.\n\nThe best part for me has been the appetizers.  Every cheap Chinese place has a crab rangoon or fried pot stickers on the menu but I have never had better rangoon-like fried items than at Ha Long Bay.  The Dumplings were also quite tasty though recently they have been more greasy and poorly formed than they were when the place opened.  The spring rolls were also excellent.\n\nAlso though it should not be a factor I have to give them props for replacing the 'Cajun' place that preceded it, that was one of the worst restaurants I have been to in Madison and the current occupants of the location do it much more honor.\n\nbtw, on one trip we were there a little late but our young waiter very obviously got baked in between bringing us courses.  It did not improve his waiting skills and our order immediately got messed up but it was hilarious so I suppose he get a pass.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2011-04-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 's6t3ACgaG0g7QTpfNIY_Hw', 'review_id': 'TDqqD7N4CLHXWBms0xf_FQ', 'text': "The best squash curry out of the numerous excellent Thai restaurants on Madison's near east side!  All of the curries that I have tried are delicious, rich, and creamy.  The menu is enormous, and even though I have eaten here at least a dozen times, I have barely scratched the surface of trying all the items that sound good.  The only reason for 4 stars is that the service is slooooow.  On multiple occasions I have waited at least 5 and somtimes 10 minutes for a server to come over just to take drink orders!  Word of warning, be prepared to order the first time your server comes, becausse if you send them away it will be a long time before they return.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2011-04-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'IrXDv4anJ_2Ibm54w2Zrvg', 'review_id': 'e-Wqg3i5XiYNIxpCLiusjw', 'text': "My boyfriend and I were driving through Madison and we we're die hard pho fans so we stopped by and was so amazed at this place. Chris got Pho Tai and I got Pho with meatballs. They were crazy large portions, the soup was amazing, and the noodles were perfect. We also got Thai iced tea with cream and it was so good that Chris actually got another one to go. After 2 bowls of Pho, Spring rolls, and 3 Thai iced tea, the check only came up to $25.00! \n\nIf you don't like Vietnamese food they had a large menu range for Thai food also. The service was amazing and the place was great. Most definitely going to go back!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2011-05-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'F9hoilLNXNmeRXh0Ka3Yqw', 'review_id': '-A_nwQXSC9v3OUJ4tEo4xQ', 'text': "This is one of my favorite restaurants in Madison. Don't ask me where I want to eat because we will inevitably end up here 100% of the time. The menu is extensive so I admittedly have not tried the majority of the food, but I always find myself craving for their amazing pho, wonton noodle soup, and vermicelli noodle dishes. They also have kickass egg rolls and spring rolls.\n\nI swear they put crack in their food.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2011-05-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'EoWffFB8hVG13lF0pam0Vw', 'review_id': 'ucL5elMreNh4x5WI1ZXcgA', 'text': "This is absolutely the best Pho I've ever eaten. Would go back simply for that, but the sesame chicken my husband ordered along with the Tom Yum soup were stellar as well. We also got the chicken egg rolls, and were not disappointed. Overall, has replaced my previous go-to pho place, hands down. And I'm looking forward to trying the Pad Thai next time we go, which will be sooner rather than later.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2011-06-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'gJox9wklkNgakSuhn8SRdg', 'review_id': 'rNvAEd0KEKrpvFlI0RzP1A', 'text': 'the dumplings are amazing. carry out can sometimes take a while, but the food is delicious!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2011-06-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CC4g_0ZVz3P_0He6p4uIQA', 'review_id': 'OsOERq8lwz2wXvEQCuFKmg', 'text': "I ate lunch at Ha Long Bay yesterday.  I was craving Vietnamese spring rolls and bun.  \n\nI've had much better spring rolles (Saigon Noodle), and the bun was mediocre.  My son had the Pad Thai and it was good, although the sweetness overpowered any of the other flavors.  Very little peanut, chili, or lime flavor.  \n\nThe vegetable dumplings were fabulous.  By far my favorite part of the meal.\n\nService was okay.  Our waitress got part of our order wrong, didn't bring us napkins, and didn't check up on us.   We ended up flagging down another server to get our to-go boxes and then went up front to request our check.  The other waiter in the place seemed much more efficient.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2011-06-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CBED6R124oz0aP_cte4P3w', 'review_id': 'VvA06biPqBUDsiZF5BsGtw', 'text': "I give this restaurant 5 stars easily!  Everything I've ever tried is amazing and incredibly reasonable.  Every time my fiance and I go we order three dishes and split them all and take home the leftovers because it is so reasonably priced and delicious.  My favorite is the pork vermicelli salad.  We were so in love with it we've replicated it at home (or at least tried).  Theirs is still the best!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2011-06-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ycjU57QT3_QKH7wjMsQJMQ', 'review_id': '4jp8US2cggFq7Td4oxAAdA', 'text': "I went here last Friday with my family and everything was amazing! I had the squash curry and even though it wasn't as spicy as I would've liked (I ordered hot and could barely taste anything spicy at all), the flavors were outstanding. The atmosphere and service was great, and I always respect a place that carries New Glarus brews.\n\nOverall I loved it, and I'll definitely be eating there again soon!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2011-06-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lEzEM7dHZkYyJnThcpqElw', 'review_id': '-KP0oUhHsis5ZhnQo_8eHA', 'text': 'The service was excellent. The food was great. Seasoned well. We could have received a larger portion of white rice. It was not enough to go around for the entrees we ordered. I would recommend this place.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2011-06-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'NjeI7eoeLWndPI0zYFZMHw', 'review_id': 'XSGRCrK7JAKgHYdpMlnXcw', 'text': 'Spring roll with sauce is so nice. Tho noodle soup is great! The Vietnamese stir fry is good. Pad Thai is great! I went to Ha Long Bay 5 or 6 times. I was never disappointed.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2011-07-06', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'C2hVx7POcUGLQZV3hW6_sw', 'review_id': 'dnlOdMpZwNYwOd2vNCOJjA', 'text': 'Not really impressed, sorry! The wait was long, so we decided to get take out. It was really confsuing to order, and it took over half an hour to get some noodles. The guy was pretty rude when I asked how long it was going to take. We should have just gotten food from the coop, because for $9 I got some noodles with a few pieces of shrimp and some iceburg lettuce.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 2, 'date': '2011-07-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yDRZq3DEPTQ1ILKMFKGySw', 'review_id': 'WH7e9ASUhSt-eDmQDKCvbQ', 'text': "This is one of our go-to places for takeout -- the lemongrass beef bun is delicious, and the pho is great, too. The menu is a little overwhelming if you don't know what you're looking for, but I haven't had anything bad from there. The one criticism I'd have is that, the one time my husband and I actually ate in the restaurant, the service was a little on the pokey side. But, it's a great place if you're looking for Vietnamese food.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2011-08-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GqqnSqq2uzr4BnmykKnHyQ', 'review_id': 'DEuBd2Pf86EvNQZz7jri0Q', 'text': "The food is delicious and reasonably priced.  The service is at times slow and somewhat inattentive, but never unpleasant.   This is not the place it go if you're looking to get in and out.  But slow food is the way to go anyhow.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2011-09-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ffa864LL90s6oxImKPI7pw', 'review_id': 'AU-4Pe_seWqe3ajzxt7v_w', 'text': 'My husband and I went here for dinner last night.  \nAppetizers: \nSpicy Chicken Wings - Excellent\nTom Yum - Excellent\nEntrees:\nShrimp Pad Thai - Excellent\nChicken Laab - Excellent\nWe both had their Thai Iced Tea to drink - Excellent\nBrought home leftovers from both entrees, huge portions.\nWe will be going back!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2011-10-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'vsiQmP-XXKZqDETydzbW4A', 'review_id': 'NMztNQ71HOE6BRrSF6O3sg', 'text': 'I was disappointed with the great reviews from other people.\n\nI ordered Pho, Vietnamese Springrolls and Eggrolls.  The broth for the Pho was very salty, the eggrolls were burnt and looked old (as if been previously refrigerated), and the springrolls had way too much vegetables and very little noodles and a small hint of meat and shrimp.\n\nI was clearly disappointed.  I will not go back here.\n\nTwo stars for friendly service and clean restaurant.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 2, 'date': '2011-10-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4yo6ofYC-AKRtTtTOfTOHw', 'review_id': 'iS531CaYxFIsVm9PZdvg5w', 'text': "Good food & a nice choice of Vietnamese dishes it's nice to see a place in Madison with something other than Pho and a few stir fry dishes. The service can be a bit slow which is annoying but the food is worth the wait. If everyone stays away from here it will make my wait shorter - yea!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2011-10-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KnLfzcBrLyQsraYzWdfJzg', 'review_id': '79X1rohSTkJ6lcEVQHSkzw', 'text': 'Better than others around.  Extensive menu, fast service, and thank God, clean.  Try the Pho, good stuff.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2011-10-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IgkaEYlWUymDjf2psD4IMw', 'review_id': '66tYjp0ZFwSzPX05fB8E7Q', 'text': "LARGE portions of very yummy food!  We (party of 3) ordered a soup, the mango curry dish (to DIE for), and several appetizers.  The crab ragoon appetizer was fantastic, chicken satay appetizer is HUGE and could work as an entree, third wasn't great or memorable.  The soup was hot, spiced/seasoned just right, and HUGE. This is definitely a place to split an entree or plan for left overs. Service wasn't as slow as some mentioned here but we had an early Friday night dinner.  Parking is kind of a bummer though.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2011-10-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '6rMHhS3Hf_Ofn1hYaxaUgQ', 'review_id': 'Vkcc-ar_S00CQCEGejUZ3A', 'text': "I have been looking were Jean opened her restaurant and I finally found it. Ha Long Bay is phenomenal. Had dinner last Saturday and at 5:30 the place was starting to get busy. I thought the atmosphere was very pleasant and service was exceptional.\nGeca (Angelica) was very attentive and we never had to look for her. She was spot on with her service. I quite frankly could see any lack of service Saturday evening.\nI asked for a recommendation on the appetizer and was not disappointed. We had the Spring Roll Wrap over Vietnamese Egg Roll (AP10). I had never seen the presentation before and it was very light with a surprise in the middle.\nWe ordered all our dishes with medium heat and was done perfect. Next time you go you must try the Papaya Salad (SL1) Shredded green papaya, Vietnamese Sizzling Crepes (VS1) which are available only on the weekend. The Triple Delight Curry (TC8) was very flavorful and almost didn't have any for take home. The glazed pottery bowl it was served in was a nice touch. I had the Stir Fried Curry (VE8) with beef and had the right amount of curry, lemongrass, and vegetables.\nHa Long Bay is going to be a regular destination for us and should be for you.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2011-10-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'M0HEkJPy9TjuujoMJj7a0g', 'review_id': 'kuU01snr_W9whU1ZbXjb0A', 'text': "Service is SLOWWWWWWWWWWWW!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\nI understand new restaurants usually are slow when they first open but this place has made ZERO improvement in terms of speed. Expect to wait a long time for your food.\n\nThe food... it's a hit or miss. You have to find the items they make well. Pho is okay. The vietnamese dishes in general are decent. The Thai dishes are laughable though. Don't order the Thai food!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 2, 'date': '2011-11-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '2Lf8Kz5vocSiB0KgEtEvYA', 'review_id': 'xRr827VTE7Va_tDy9yjlYw', 'text': "I live just a few blocks from Ha Long Bay, and have been there several times.  I was there about a week ago with my boyfriend on a Sunday at 1:45pm, and the place was packed.  I thought our lunch might take a while, but it actually came super fast.  I can say with confidence that they serve the best pho in the willy street/downtown area by far.  The broth is savory, flavorful, and delicious.  The noodles are done well, and the meat is tender.  The service is always friendly and quick, and the prices are really affordable.  I love that my boyfriend and I can go for lunch, get 2 glasses of wine, two appetizers, and two entrees all for less than $35 dollars.  My only criticisms are that the pork and shrimp spring rolls are not the best I've had, and I don't understand the nuts? in them.  Also, they don't put chopsticks or fish sauce on the table unless you ask.  It's no problem asking for these items, but personally, I think they should be put on the table as staple items.  Aside from the tiny things I find wrong with Ha Long Bay, I think it's an awesome restaurant, and will dine there many more times in the future!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2011-11-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-hwN2juKYn-KTxa2WBYLnw', 'review_id': 'JayPBzuDIOl4bS9DeQVUUg', 'text': 'We were really happy with this restaurant.   The menu is huge making it difficult to decide on which dish to go with.  But with all the selections one is sure to find something they can enjoy.\nThe Chicken dumplings were excellent and delicious.  The Thai Tea was very good too.\nI chose the Laan Chicken which was beautiful and well made.  But I personally found the dish had a very different flavor from what I enjoy.  I also ordered medium spice and I detected no spice in the dish.\nWe really enjoyed ourselves because we did not feel rushed at all and had a very relaxing time talking and dining.  The service was friendly and very helpful too.   Other dishes that were very good were Pad Thai and Curry Chicken.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2011-11-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vfzGCNlUj8e_v0CsDzsf7w', 'review_id': '1e1M-JMM6r-Rm1j_-KG7AA', 'text': "Great food and lunch is generous! Wait is an issue when it's busy - but it's busy because it's really good. Go for lunch when it's a little quieter and enjoy the tom yum that comes with lunch specials (last page of the menu - and only one page, making it a little easier to decide than the vast dinner menu).\n\nEnjoy.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2011-12-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'ocUayw1Ih7W_mHSR1RDdGA', 'review_id': '71VbwNDJBIDCwOCKzLDXeA', 'text': "This is like my favorite place. If i could change just ONE thing I wish they chopped up the eggs in the pad thai some more. They're always in huge chunks...\n\nOne more thing, they don't put mint and basil in their fresh spring rolls, even though it's described that way on the menu. I get plain lettuce in mine every time. Maybe because I'm an asshole?", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2011-12-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'QNitK17HQe0HN5y_xghYQA', 'review_id': 'e0RnpMt-0Gpa9Fv7EdX5cg', 'text': "I tried the beef pad thai and a vegetarian spring roll appetizer for take-out.  Both were okay, but I am still on the search for good (ie that i would order again) pad thai in Madison.  This place is just not it - sauce was too sweet-and-sour sauce with not enough peanut, lime, or savory flavors.  spring roll was bland and too much lettuce.  \nthe ambiance of the place looked fun, but all in all I'm still searching for my go-to Thai restaurant.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2011-12-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ffa864LL90s6oxImKPI7pw', 'review_id': 'UFvT9gw03ZvBvp0schNqNQ', 'text': 'Third visit, and outstanding as usual!  The Tom Yum is insanely good!!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2011-12-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'SnnwGJ6PvxlWXMfrJxhhzQ', 'review_id': 'qMcsV1ndyebKRIxyuxOcdQ', 'text': 'Until last night, I thought I didn\'t know the difference between good pho and bad pho. Last night I ate at Ha Long Bay and discovered that actually, I DO know the difference, but I\'d never had terrible pho before.\n\nWe stopped in for a "quick" bowl of pho after skiing (so, we were cold and hungry. our standards were low.) We ordered pho, because at every authentic pho restaurant I\'ve ever eaten at (maybe a dozen?) it takes about 90 seconds for the soup to come out after ordering. Not so at Ha Long Bay. It took about 20 minutes for us to get our food. How is that even possible? You dump some broth over the noodles, throw some beef on top, and its done! There\'s no cooking involved! When our pho finally appeared, it was pathetic. The broth was one-dimensional and the meat was severely lacking. I ordered #7, which is supposed to have rare beef, beef flank, and beef balls. It had ZERO rare beef (maybe because it just sat there, waiting for our waitress to decide to do her job and cooking away in the broth?), about 4 little shreds of tough overdone beef, and one beef ball cut into 3 pieces. My husband got the delux pho, which had roughly the same amount of meat, but featured the biggest, most inedible piece of tripe I\'ve ever seen. Think ping-pong ball sized. Gross. If we hadn\'t been starving and already waiting for our dinner for so long, we probably would have sent the food back it was so obviously lacking. \n\nBetween the bad service and the worse food, I\'ll never eat here again. I would rather not eat pho in Madison ever again than pay another $8 for this junk.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 1, 'date': '2012-01-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'RJ_57sW6QKwCReuc70VEAg', 'review_id': 'RiW2-Sr8QUe80dIz-QsZcQ', 'text': "This place has AMAZING food!! Every single dish I have tried has been awesome.  Their prices are reasonable too.  I'd say an average for a good dish is between $8-$14.   I had the Ginger Chicken dish with pineapples, medium spicy and it was SUPER SUPER good! \n\nThe only problem I have with this place is that it is ALWAYS packed busy.  Every time I've gone there, we have had to wait 20-30 minutes to sit down.  The area to wait in is right at the front door which gets really crowded and congested with people waiting for tables. \n\nOther then the crowded front door area, I highly recommend this place!!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2012-03-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'v3dbIu8qB2FuOJHOv_ZJrA', 'review_id': 'V2haPSEOXQ3W9PFBH7d2wA', 'text': 'I am convinced that anyone who gives Ha Long Bay more than three stars hasn\'t eaten really exceptional Vietnamese & Thai (which are both easier to find exceptionally done in bigger, more diverse cities). I like Ha Long Bay and eat there frequently, largely due to proximity and lack of other options, but it is not four-star (or five!) worthy. \n\nUpsides: \n\n-When dishes are good here, they are very good. The best dish I\'ve had so far is the "LS7 Nem Khao Tod: Crispy rice with minced sour sausage, chicken, onion, cilantro, mint, lime juice, topped with peanuts, served with lettuce for wrapping," which I eat rarely because I have to take an ethical meat time-out.\n\n-The only other place to get decent Pho is on the west side, by the mall. When I am chilled to the bone and want Pho, this is the place to go for it. I am sort of a chicken addict, but I still think that the chicken is the best Pho at Ha Long Bay, even though it isn\'t traditional. \n\n-The staff is generally friendly, and they have to be, because it\'s a zoo in this restaurant most of the time.\n\nDownsides:\n\n-When dishes are bad, they are very, very, bad. Bland & tasteless, as many of the reviewers have pointed out. The drunken noodles are not good, for example, and neither is the Pad Thai, and these are two dishes that should be easy to make flavorful.\n\n-Sometimes, Ha Long Bay gets overwhelmed by the volume and food takes a long time. I\'ve seen several people melt down when waiting for take out. \n\n-Ha Long Bay falls into the same sphere as many restaurants in Madison that think that to make food hot, it is acceptable to toss a full bottle of crushed red pepper into a dish 2 minutes before serving it. This is also the only way to get food spicy at Ha Long Bay (but, again, getting hot food in Madison is impossible, unless you go to Vientiane Palace). \n\n-The music is sometimes so bad that it\'s hard to concentrate on eating. Think oriental elevator folk music with strings.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2012-04-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'YraWlPjamUaiV2VzHiLsnw', 'review_id': 'CVSnojV81ThysJeLjzrVpQ', 'text': "My family and I come to this place pretty often. Certainly the best place in Madison for pho. This place by far surpass Nams Noodles and Saigon. The broth is fresh with a hint of lemon, the overall ingredients are  fresh and not freezer burned. Unlike other places that I've mentioned above. Where the ingredients are just poor, the only down side about Ha Long is the wait...", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2012-04-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'Hk3Vx_voj5dQ66P_NgMkEA', 'review_id': 'hHE2yayswW-MUcKEdDctLA', 'text': u"It seems this restaurants it serves both Thai and Vietnamese food. The deco reflects such as well. Towards the front of the restaurant or some well lit tables with some large windows. Towards the back is more dimly lit tables for the more romantic atmosphere. \n\nThere is a very large selection of foods from appetizer to entr\xe9es to desserts and even drinks. I had ordered the steam chinking dumplings. They were 6 of the biggest dumplings stuffed with a lot of meat. The grilled pork chops and lemongrass was very juicy and tender. One of the better ones I've had. I'm going to have to try the pho and Thai curry next time.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2012-05-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'A-u11JSkZt9A5Hoo7Opc1w', 'review_id': 'ZEjhVsswd3Z_LHC8gWqcdg', 'text': "I'm a big fan of pan dear egg noodles and have been trying to have more of it around the country. This was my second dish since I have started and it was delicious. The way they served it was pretty cool too, it was a boat like structure. Unfortunately this structure made it strange to eat because I could not soak it in the sauce without completely destroying everything. The atmosphere was wonderful and I would say upbeat???? That might be the wrong word. The service was pretty good but you have too look for them because they are really busy. I totally recommend this place for anyone looking for a Vietnamese food kick. It's a good price for the food too.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2012-05-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'kKBuPUfJ0mtbUzdwDDtASQ', 'review_id': 'hTlKEyZFqcddECSsV26XrQ', 'text': "i'm pissy that this place doesn't exist in chicago.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2012-06-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'T5S_Zg8hwoDfOmnuhmtsbg', 'review_id': 'Q_If-zbMyS2RlPGupXslYQ', 'text': 'Having lived in Saigon, I am picky about my pho. HLB knows what they are doing. The broths color, aroma and taste transports you from the Midwest to Vietnam. The Thai menu options are reliable, but the pho is the best you will find in Wisconsin.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2012-07-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'UnI6VU12tCECvdQaHh6lLg', 'review_id': 'fM24KrduHRggU4dlNsHRhw', 'text': "First off, I'm from San Jose California and spent a number of years in Madison while my husband went to medical school. I was very disappointed in the Vietnamese food selection until Ha Long Bay opened. I felt right at home and then some. Not only did they have Vietnamese food but also other Asian fare that is sort of like Thai, Cambodian, etc. The flavors reminds me of home with a slight twist that is unique to this restaurant. Portion size is good for price and I love that they offer choices of chicken, shrimp, tofu, etc. for the same dish. The staff is wonderful. We go there twice a week and they eventually remembered us. They would give us complementary desserts or let us try something we don't usually order. I'm so glad they did because I would never have tried Nem Khao Tod on my own and now it's one of our favorites! Other dishes we love is the crispy noodles, shrimp fried rice which has a nice smoky aroma, ginger chicken and curries. Not everything is great. The thai ice tea is too sweet and the pho is OK (can't compared to San Jose, but good enough to satisfy my pho craving). Wanted to give it 4.5 star but that's not possible so decided on 5 stars. Why 5 stars if the pho is just OK? In context, it is the mid-west and it is the best Vietnamese/Asian restaurant in town, and when the dishes are good they are really good and some are better than in San Jose. Now that we've moved I really miss this restaurant. When we go back to visit, we're definitely stopping by.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2012-07-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fQKg9rb1Gf253qaAMdLS0g', 'review_id': 'MtCPUe7YOUS3WU90nIj27g', 'text': 'Five stars in my book. Excellent Thai.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2012-07-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kV7ZoThXkTq9yxT7PAbq0Q', 'review_id': 'HyKwBjM_fHTV3H-i76swYA', 'text': "Mango curry is the best thing in the world. Enough said. \n\nBut, I came in for my birthday and I was in a party of 8 people. The biggest issue that really did bother us was the fact that the dishes didn't all come out together. My dish came out first and my friends ginger chicken came about 15min later. But i'm rating this restaurant on food then everything was amazing.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2012-07-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UoLBr6AtKz4Ep7I0bWqtSQ', 'review_id': 'E5BSu7qiaW-tXJuFYtWKuA', 'text': 'I have only eaten here once so far, but it was very good.  Service was very friendly as well.  Next time I am in town, I will be back for sure!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2012-08-08', 'type': 'review'}
{'votes': {'funny': 8, 'useful': 13, 'cool': 14}, 'user_id': 'lC0KGXmIhyjzghBUlVnkhQ', 'review_id': 'cMwhXFWv06A_pcHEAZQffw', 'text': "CASHIER: How was everything?\nCOREY: Delicious.\nCASHIER: Looks like you're new to the area?\nCOREY: (internally...) Really? \nCASHIER: I mean that's the Chicago skyline on your credit card.\nCOREY: Oh right. Yeah, I'm from Chicago originally and I've been living in Tucson the past 6 years. I just made the move to Madison and I'm looking for an apartment. \nCASHIER: Oh yeah? Which area... this one is great.\nCOREY: I've noticed, I'm actually looking around here. \nCASHIER: If you lived close you'd never be far away from Ha Long Bay.\n\nTruth. \n\nAnd I won't be. The spring roll sare enough to get me back, as are the mega lunch specials, all of them reasonably priced and served until 3. The staff is super friendly and they rhyme. Common.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2012-08-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'P6XNh69c0iv_DDUkIdC2gA', 'review_id': 'NoRyfBKoA5RcPkr_TylUxQ', 'text': 'First visit was pleasant. Great food. Slow service. I will certainly go again and try other dishes.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2012-08-24', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 1}, 'user_id': 'qpTR-5Ks2cj0tJnwR7UL6Q', 'review_id': 'Pv1XgKWdDRqsO0ELo5VlRA', 'text': 'All I can say is that I am happy I live less than a block away from Ha Long Bay. I smell Ha Long Bay constantly and having tried many different things on the menu I say try the Pho and try PE1, the one with the peanuts. SO SO SO good. I could eat there everyday.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2012-08-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jPPehFXXuy9tHIc8gAXKIg', 'review_id': 'd7x7RhM1HCjN231d51iCUA', 'text': "Delicious Vietnamese food. It's so beautiful. Spicy like the sunshine, mild like the morning mist. There's a wide enough range of flavors to satisfy any palate, vegetarian/vegan and meat dishes and pretty good pho! That said, this is Madison, and I wasn't quite blown away.\nThe service is great, timely and friendly. \nIf you bring a group, you may want to schedule ahead, because it gets busy! \nGreat value and delicious food!\n\n(p.s. visit sf or some other large city for the real stuff)", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2012-08-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'r3giCPsg3C0_rDWewjln5w', 'review_id': '0LHu6vdR28EjLAnXZxAMGw', 'text': 'I got the tofu pad thai and some giant spring rolls (fried on the inside, lettuce/wrap on the outside). The pad thai was the best I\'ve had in years. I ordered it 3 stars out of 4 since I\'ve found they tend to under-spice things. "Hot" was just perfect for me.\n\nThe location is a bit small and tends to be noisy. I hope they can move to a bigger location (with nearby parking) sometime soon.\n\nI recommend reservations if you\'ve got a group or plan on going during the busy hours.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2012-09-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'pNtazWShJ9XSSVMRmrpEBQ', 'review_id': 'RW00fJX9c96aMa3O8bwQ3Q', 'text': "Part of the great pho quest of 2012.\n\nI love me some pho and Ha Long Bay does it right.  While there are plenty of other places to get a steaming bowl, this is some of the best.  It's always well-seasoned with a good noodle/offal/broth ratio and seriously fresh garnishes.\n \nAs soon as I can pull myself away from the pho and try more of the menu, I'll be sure to update.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2012-09-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '6kp815UUjK--ukUjmDlSCQ', 'review_id': 'PWm4LG5qwOFknO-IJu2xPg', 'text': "From the moment we walked in, to the moment we walked out took a solid 2 hours.  They were extremely busy, and we actually got the last available table, everyone that came in after us had to stand around and wait.  \n\nThe table we were at was right by the front door/counter area, not to be confused with the nice tables sitting up by the big bay window, so all these people were coming, going, standing around and STARING.  This combined with the incredible noise in there made things somewhat uncomfortable.  The acoustics are bad, it's like having someone yell in both your ears for 2 hours, and to hear the people across the table from you, you have to lean in and focus intently on what they are trying to say.  \n\nWe got our appetizers pretty quickly, and they were very good.  However, the wait time between appetizers and the main course was making everyone at our table a little squirrelly.  When we finally got our main course we discovered that the drunken noodles tasted weird.  I couldn't quite put my finger on it, but it had this taste of chicken broth or something to it that made it taste funny, we no like that.  We also had the Pad Se Ew.  That was the bomb, and we were fighting over that dish.  Then we had the middle of the road dish, thai fried rice.  Everyone thought that was good, but not worth throwing punches over.    \n\nI'd go back again for the appetizers and the  Pad Se Ew, but not when it's crazy busy in there.  Oh yes, and on a final note, parking is a bitch!!!  Come with patience, ear plugs, and be prepared to walk n' wait.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2012-09-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'hNTg66E2RDH9-YM5JkDgQA', 'review_id': 'zhWCckZmEZAwvIoRDQnyFg', 'text': "I have lived here for four weeks and have been here 3 times already. \n\nHave not gotten a dish I haven't liked yet! My only complaint would be the service, which is slow and a little sloppy, yet redeemed by the servers having great attitudes and being very sweet. \n\nNice decor, clean. Very reasonable price.\n\nI was a little concerned about a bottled beer being out dated.... check those bottles, guys!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2012-09-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'IhNL5RS_hEdmBvA0O468ZQ', 'review_id': 'ejVggWaW_mMdtgv2UM1HCA', 'text': 'I think this is the best Thai in Madison. I love the pad thai with tofu and especially the pan fried chicken dumplings!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2012-09-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lZq-CaPk58whjRxjnLIPQg', 'review_id': 'XfQv2zVtZUvdzQsx6LFGIg', 'text': 'Came in here with no expectations, and left feeling slightly unsatisfied. \n\nThis was my first pho experience in Madison, so I tried going easy on them.\n\nI went with my usual "pho with various parts of cow" order, and waited a good 20-30 minutes for my food to arrive. When it got here, my noodles were clumped together, as if they had just thrown the frozen noodles in last minute. The broth was actually too flavorful for my liking, overpowering the rest of the dish. The beef was fine, though I would have preferred more meat to soup ratio. The portion was smaller than what I was used to, thankfully. It was the first time my stomach didn\'t feel like exploding after eating pho. The prices were fair and pretty standard for a Vietnamese restaurant.\n\nOverall, it wasn\'t the worst I\'ve had, but definitely not the best.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2012-09-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 4, 'cool': 3}, 'user_id': 'WYXejDeBOH-std4FADEeKw', 'review_id': 'xM6enMW8swi2-Rwo3ElB-w', 'text': "I went there last night, I'm still full. The menu is more like a tome; I'd suggest coming here with a dish already in mind, I flailed in the spider web of options for a little too long. After much deliberation and a popular vote, I got the pad see ew. 'Twas delightfully delicious. Nice sauce selection on the tables, as well!\n\nI withheld that precious fifth star because Ha Long Bay closed at 9:30PM which is just about when the good conversation starts, service was slow, and there was a longer wait than expected to sit down, but hey, at least you can have a beer while you wait!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2012-09-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nQ828XHLeXm58G1akKblvQ', 'review_id': 'hNqk5y9U-5L6FtGbTAToJw', 'text': 'Came on a Saturday expecting the delay we read about on reviews. While packed, we waited only ten minutes. We were a party of two.\nThe spring rolls were fantastic and I tried Pho for the first time. It was phenomenal! My wife says she will be coming here for take out at least once a week.\nDo not worry about the possible wait...try this food!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2012-09-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 3}, 'user_id': 'XqbTw6FlkTHRZaKCuKdkRA', 'review_id': 'V1FWGmteAFO7Ffcjd41OVQ', 'text': 'Best food + atmosphere for Thai in Madison!\n\nI consider Ha Long Bay & Sai Bai Thong to be the two best Thai restaurants in Madison----however, Ha Long takes the cake when it comes to atmosphere. The place is always buzzing with people (sai bai tends to be mostly empty when we go), they have a young, hip waitstaff and a restaurant with a modern, fresh decor. Although the food is great at either place----the experience is better at Ha Long!\n\nOne note---I find their "spice" rating scale to be a bit more "mild" than the average thai place---so if you like something really hot try emphasizing that you want it *really* spicy instead of just "five stars".', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2012-09-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'P6XNh69c0iv_DDUkIdC2gA', 'review_id': 'ib1fkNY0bF42HNG0-A3q5g', 'text': "For my 2nd visit, I ordered the sour sausage with crispy rice. Their dishes are so mufti-dimensional, fun and delicious. I am looking forward to trying more items on their menu. \n\nOnce again, it took a long time to get a table, and table service was slow. I would have ordered several more drinks but the waitress never came around after the food was delivered. We didn't see her again until we were done with our meal.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2012-09-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '4W3_Sdmw7xrLIGimzhlHLg', 'review_id': 'VLLotvhZBC0-d_SzUo4OkA', 'text': "We live nearby and have probably been here 10 + times and almost always get some variation of the numerous curries. \n\nOverall, I really enjoy this restaurant, but I have found it to be hit or miss. At times the curry is great and others it's not as thick in consistency or flavorful. Depends on the chef that day, I guess? Either way, I think it's worth the trip and a great deal in terms of price and the amount of food.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2012-10-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UxCAIgei3T8WeAb8aSrvdw', 'review_id': 'o0Gcy5_iYGbQfbLHZMap_A', 'text': "Their food is quite good, about as good as good SE Asian in Chicago, which is better than any other SE Asian here.  It almost but doesn't quite make up for how poorly managed the kitchen is.  Waits are long at a table, and with a party of four entrees will arrive as much as ten minutes apart.  Carry out reliably takes ten to fifteen minutes longer than they say it will on the phone, whether ordering to pick up or ordering ahead for a specified time.  We go back about every six months in the hopes that they've gotten more the ball.  Over the last couple of years they haven't, which is a shame.  The food is good, but not quite good enough to be consistently worth the delays.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2012-10-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 4, 'cool': 3}, 'user_id': '6rMHhS3Hf_Ofn1hYaxaUgQ', 'review_id': 'nHnvluO29GgpBWzceNfUsQ', 'text': "This is my favorite asian restaurant in Madison,\n\nExcellent portions, decent prices, packed with orgasmic flavors, with a heat level to your liking.\n\nThere menu is long (at least 6 pages). Would recommend looking it over on line to help with the decision making.\n\nMy favorites are Papaya Salad, Vietnamese Crepes (Sat & Sun only), Ap10 (egg roll inside a spring roll), LS7 Nem Khao Tod (crispy rice, sausage, chicken, mint, cilantro)\n\nI don't understand people's problem with the wait. They don't take reservations for one thing and It's a happening place( = people like & come back). Also the wait for the food never seem too long. Just convers with the people your with. Cause once the food comes out. No one will say a word because of the food their chowing down on.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2012-11-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'pNtazWShJ9XSSVMRmrpEBQ', 'review_id': 'JpofKniQPh_b5pyQbXwm9A', 'text': "Is 4.9 stars possible? Not quite a 5 yet, but so so close that I'm giving them 5 anyway. \n\nStill so good. I got some pho the other day when I left work early due to a cold.  When I went to pick up my order, the cashier asked if I was feeling okay and I said I had a cold. She ran back to the kitchen and tossed another small container of pho broth in my bag. AWESOME! \n\nEveryone knows their pho is good, but another stand out is the LS7 Nem Khao Tod: Crispy rice with minced sour sausage, chicken, onion, cilantro, mint, lime juice, topped with peanuts; served with lettuce for wrapping. Now I know sour sausage sounds weird; trust me, just try it. It's amazing.\n\nThe portions are huge, the prices are right and the flavors are bomb. It's popular and they don't take rezzies (except for larger groups) so expect to wait on some nights. If you get out for lunch, they have some great deals.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2012-11-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'v_7KW52Z8r_su8v4uV98MA', 'review_id': 'x9tzb6uH16YevWu7AJZleA', 'text': 'Since I wrote my old review I have eaten here many many times and while it is probably still my fave lao/viet/thai place in Madison the quality seems to have really dropped off substantially.\n\nThe dumplings still taste good but often they are haphazardly assembled wads of dough and meat.  The Pad Thai is a huge gamble, one time it is is sweet and not hot at all with four stars, the next time it is super greasy and not hot, the third time it is dry flavorless noodles CRUSTED in pepper seeds, completely indelibly hot.  And I grow my own chilies, I love hot food.  That has happened several times now.\n\nIt seems to have really gotten busy (though the last few months less so) with there often being four people running the front desk and it still takes a while to get their attention.  I think they have had trouble dealing with the success of the restaurant and keeping the same level of quality up.  I wish I could figure out what day the good cooks work and only order from them then.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2012-12-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mSzOBOFOPZbrw25D8dpllw', 'review_id': '5eXKb0D19IoHa4TLeC6hHQ', 'text': 'Pretty standard food.  MANY reserved tables you will not get.  Potatoes in curry? Why bother?', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2012-12-16', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 3, 'cool': 0}, 'user_id': 'pIkuKt3aCUjG6ljWDi_7LQ', 'review_id': '2MbKR7aUfMbDkM8Lz6c_SA', 'text': "I'm sitting here right now. I have time to write a review while at dinner because I've been here for an hour and haven't even ordered yet. \n\nLets see if my ratings change when the food gets here.\n\nFood came.  Not good.  Not sure why people like this place.  Maybe Madison doesn't know what good Thai food is.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 1, 'date': '2012-12-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'N5mMyaq1tfk8q8-A2dooMg', 'review_id': 'cjl8Weg1EyEjC4d2ejqx_w', 'text': 'Hire some staff!!\n\nGood food if you can tolerate waiting 45-60 min. to get it after being seated, consistently wrong orders, part of the table being served 30 min. apart from the others, a 30-45 min. wait beyond the designated carry out time and no responsibility taking on the part of anyone who works there, ever. Go there for lunch if you want the experience, hope for a slow day because this has been going on like this FOR YEARS!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 2, 'date': '2012-12-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GQNlXRCbopaqnhTty2Gcrg', 'review_id': 'LD6qdUlnv3-UMO6vV6LNvg', 'text': 'I especially recommend the Hot and Sour soup. In fact,  I have never had anything bad there- to the contrary.  Subtle flavors and fine textures.  As a vegetarian, I have eaten at many Asian restaurants.  It is probably one of the best ones in Madison. I give it 5 stars because it is also inexpensive and the service is great.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2013-01-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zRGgppSoYuFEVRam97eHtQ', 'review_id': 'RlbnZP0Sh8emNJOih2rH-w', 'text': 'Excellent food, locally owned.  There can be a wait, but it is not long and worth it.  \n\nDo not forget to order spring rolls!!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2013-01-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Faj4KQG_aHV3MrhwoJroww', 'review_id': 'll9sjmCtR0SEQgJN8PRNpQ', 'text': "OK food. Ambiance is what you would expect from a mid-tier asian restaurant. Don't get anything that goes beyond the obvious, we had misses every time. Pho not as good as Saigon Noodle.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2013-01-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': 'XHuEbGrgPEhnBRjRUdcSgg', 'review_id': 'saYTTBXovfyw-RfOK5kzKQ', 'text': 'Sometimes good food clouds your vision.  You forget what makes a great restaurant, the little things or the "necessary things" that complete a five star experience.  I just finished my third visit to Ha Long Bay and after the first two I was ready to give this place a strong five stars and then write enough good things to make you think it deserved a sixth.  Sadly, the third experience went very poorly and thus my 3 star review.\n\nLets start with the good.  The food, overall, is delicious.  The first time I went we had egg rolls, and I think I had the HS1 (Ga Xao Don) otherwise known as the equivalent of sesame chicken.  Both were fantastic, the plate size was huge, the food was mouth-watering can\'t have enough scrumptious goodness, and the atmosphere was a lively buzzing place with lots of conversation and smiles.  The second time, similar experience, my fiancee and I brought her family of which two of the eaters are fairly picky, and it was a homerun for all involved.  This time we had the pan-fried chicken dumplings (also great) and I had LS5 (Sai Oua) which was a really interesting and tasty dish.  It had a great tomato dip, the sausage was a flavorful mix of spices, and overall completed another great visit.  My fiancee had the Drunken Noodles, and despite many negative yelp reviews here both her and I really liked it.\n\nService-wise, both visits the staff was friendly and pretty good despite long waits.  Yes, as everyone mentions, this place takes their time, but the buzz of excitement you always hear about it, the quality of food, and on the occasions where they have a good social hour going, it makes up for it.  The first time we went it was really packed in the evening and we still got a table and our meal just fine.  It\'s too bad there\'s not a little more decor or more comfortable seating (we\'ve missed out on booths all three times), but it\'s not the end of the world.  In all, I\'d say the wait maybe gives a half-star deduction if anything for Ha Long Bay.\n\nMoving on, our third visit tonight was what you shouldn\'t have to go through at a restaurant.  I\'ll admit, I was not the greatest customer tonight, but the way this all went down is just not how it should be.  I felt like I was on an episode of Gordon Ramsey\'s best restaurant as the secret diner.\n\nWhen we got there the restaurant was about half-full, we got a table and the waiters/waitresses were very friendly.  In fact I\'d say even better than the two previous times.  We ordered dumplings again for an appetizer and I\'d been looking on yelp for a while at reviews to see what other people like since I wanted to try a new dish again.  A lot of people recommended LS7 (Nem Khao Tod) and TN3 (Pad See-Eew), both of which sounded good to me although I was leaning towards the latter.  My fiancee wanted that too though and had been looking at it for a while so I decided to get the Nem Khao Tod and let her get the Pad See-Eew.  The dumplings arrived, we ordered, and as usual the food was starting off good along with the service.\n\nOur food finally came out and my dish didn\'t quite look like what I had expected but I took a bite and I didn\'t like what I had.  The onions were really thick and bland, not a "flavor ingredient" like they usually are in say a stir fry or other mainstream dish.  I\'m not a huge fan of onions, but I really don\'t mind them if they\'re not terribly invasive.  This was cutting right through the taste of the food and not making it appetizing for me.  I had one more bite, the sausage was average, the rice was still so-so, and again the onions were ruining it.  I tried a bite of my fiancee\'s Pad See-Eew and it was great.  So at that point I knew I didn\'t want the dish and she didn\'t want me to have something I didn\'t like or not eat.  I waved over a waiter that we had talked to before, I told him that I really didn\'t care for the dish that it just didn\'t taste good to me at all and that my fiancee didn\'t like it either.  I asked him if I could get what she had instead.  He apologized and said that it was no problem and took it back to the kitchen.  \n\nA few minutes later our waitress comes out and tells us they are charging us for all three dishes and has a to-go container trying to offer us the dish I sent back.  I explain to her I didn\'t want it and that neither of us liked it and that I don\'t want to pay for a new dish.  She goes back to cancel the new order.  I walk up front and ask for a manager, which turns out to be her, and I tell her that we\'ve been here a few times, we love the food and the place, but that they are about to lose two customers if they can\'t make this right.  She gets into a 10 minute debate with me about it saying that this is how the cooks/owners do things and made me honestly feel very embarrassed as a customer.  They eventually concede by the time my fiancee finished her meal.  I hate putting someone in a spot like this but this is not the way you handle a situation.  I was as polite as I could be, but comon man\'', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2013-01-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'Nj5rppfu7rR8K5fsoJfp6g', 'review_id': '4aj1aIi8Kw-_qWi_KfcKJA', 'text': 'Food is a high point here, which helps make up for any negatives in my book.  The curries, fried rice, soups and fried noodle dishes are almost always good here.  They\'ve had a few off nights (too sweet pad see yew, too oily drunken noodles, etc) but when things are good they\'re very, very good.  Spice levels are "midwestern average", so order a star hotter if you like spicy food.\n\nThe negatives: it\'s loud.  The place is in dire need of sound-absorbing decor.  When it\'s busy you can barely hear the person across the table from you without yelling.    It\'s also only open until 9:30pm, even on Friday and Saturday night.  My guess is that they could do business until at least 10:30pm on Willy St those nights- it\'s sometimes completely full at closing time.  Sometimes a hankering for Thai sets in after Geriatric Early Bird Dining Hours when you live downtown, and then the grim reality of their business model makes you search out a less-desirable curry rice fix.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2013-01-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'kJeJ2Dg7R0nzXuwB2mY2hg', 'review_id': 'Z7iHJTtpw8Ns4yQ6QC5elw', 'text': 'Everything I have tried at Ha Long Bay has been delicious!\n\nI have been twice, once for a birthday and once just with friend. Both times I ordered a curry; yellow and green. Both curries had great flavor, with big chunks of veggies mixed in. They were both delicious, but I think the yellow was my favorite.\n\nI also tried the dumpling appetizer, and they were really good! The sauce that comes with is basically just a soy sauce, and super salty, but the dumplings were so good that they were fine without the sauce.\n\nI sampled my friends drunken noodles with chicken, which were incredible. I also sampled another friends soup of some sort and orange chicken. Both were very tasty! No complaints. \n\nService is always friendly and prompt. \n\nI really like that you can pick the level of spiciness for your dish! They only serve beer and wine though :(\n\nMake sure to try the chili paste on the table! Really spicy, but super delicious!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2013-01-30', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'mUNMXyz5b0CBBrDvXnkoRg', 'review_id': 'WgkLMXr4zMRhvNHgE6JAFQ', 'text': 'Ha Long Bay never fails.  No matter when I go or what "newbie" that I bring to try it out for the first time, the restaurant always delivers on extremely solid food.  Last night was no different..  \nWhile the menu is packed full of gems, I went with my stand-bys....AP10 for an appetizer and LS7 for my entree.\n\nThe AP10 is a spring roll wrapped around a Vietnamese egg roll.  Served 2 per order, they are great to share.  Both soft and crunchy, they are flavor packed.\n\nMoving on to the entree, I had my favorite...LS7....Nem Khao Tod.  This dish pairs up crispy rice with sour sausage (breakfast link sized, not that sour), chicken, onion, cilantro, mint, and lime juice served over a bed of lettuce.  I usually get it 3 or 4 stars (4 being the hottest).  Something about the spiciness of the dish, the coolness of the lettuce, the crunchiness of the rice makes it an unbelievable dish.  \n\nAnd I am not alone on singing its praises.  The wait can be a tad long but you can wait or give them your number and saunter down to the Crystal Corner for a beer or two while waiting.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2013-01-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uCRyCDYxQflFw8Yov57qSg', 'review_id': 'QA4yCAr4HVp7MLCtCbulIw', 'text': 'I want to give them 3.5 stars.  I\'ve been to Ha Long Bay 3 times now, with my most recent visit last night.  The first time I came, i tried the Vietnamese weekend special crepes (very good, interesting, 4.5 of 5), the sweet n sour pork (3 of 5, much too sweet), the "LS7", (4.5 of 5, thought a tiny bit dry), and last night I had the Pad Thai with pork.  It\'s seriously good.  It\'s a little sweet but very tasty with a decent amount of pork.  The place is pretty loud and a little cold but service is overally pretty good and food is decent.  I had to compare to other restaurants but I\'d have to say Lao Llang Xang is better overall but if you want Thai food, this is the only acceptable place.  Oh, and the guy who said the pho is super good at Ha Long, well, it\'s too sweet, too!  Saigon Noodles is def better for pho.  I\'ll go again but only if I want Thai.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2013-02-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lZq-CaPk58whjRxjnLIPQg', 'review_id': 'AqK_Xs98C6SopEk5i0n4iA', 'text': "Judged this place a bit too quickly last time. Though their pho might not be the greatest, their other entrees are great. \n\nTheir generous portioned fried rice dishes are just so flavorful and unique, that I finished the mammoth plate in one sitting. They also have some great curries made to order. I was feeling adventurous, and went with extra hot on everything. My taste buds were definitely challenged by the spiciness, but it was spread out evenly among my dish, making the meal slightly less painful. \n\nI guess just like with books, you can't really judge a restaurant by your first meal.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2013-02-04', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 6, 'cool': 6}, 'user_id': 'MtJX6PYWnC2QPA8o9YDP2Q', 'review_id': '8HsE03kuQW1E35WQRd_g7g', 'text': "Ha Long Bay intrigued me, and it wasn't just the waiter with unique tats running the length of his arms, nor the floor to ceiling window seating....although that helped....  \n\nNo, it was the Tom Yum Talay that had my attention.  So I'm in the mood for something spicy, and healing, and Tom Yum provides that medicine... trust...so I ask the waiter to be so kind as to serve me.  And he obliges, and he brings out this generous bowl of soup chock-full with prawn, enormous scallop, mussels, squid, fresh chunks of galangal, ginger, lime leaves, shards of lemon grass, visible red chili slices, and of all things... pineapple?  \n\nCan't say I've ever had Tom Yum with pineapple before, was this some kind of fusion joke?...  But screw it, I put heaping spoonfuls into my bowl and delicately slurped..... Wow.... that broth. Enamored...  \n\nI could write pages of my infatuation...", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2013-02-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'rrwKynfpsGGxPLWY31PLkw', 'review_id': '3vk4lxCwqIfmEXiHw1w4hg', 'text': 'Oh my where do I start.. Love this place.. I really like the pan fried dumplings and their soup is delish.. The coconut curry with scallops is to die for.. Will be going their again to try more.. They have a huge menu .. Oh an btw they have the best ginger beer and FYI yes it has alcohol in it ,)', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2013-03-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'neWgBKTTqojng6i7b0p6MQ', 'review_id': 'ztejdEVfZArZDRnObws4cw', 'text': "The exotic flavors take you away from the frigid Wisconsin winter into Asia. A lot of options in the menu that you'd want to return to taste them all.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2013-03-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'qMChQyJYhFsgQ1ZI3ZAasA', 'review_id': 'kv7s3XGfeAPP0ceIUKQKbw', 'text': 'I reluctantly give Ha Long Bay 3 stars.\n\nI say reluctantly because I want to give them more, but I can\'t in good conscience. The food is (usually) amazing. We order from them frequently, but despite them having the best Thai and Vietnamese food in town (in addition to Lao), we often opt to order elsewhere to avoid various hassles.\n\nOne is that there is usually no parking. Not completely their fault. More importantly, we usually order and are told it will be anywhere from 20-45 minutes. Regardless of how long we are told it will take, when we go to pick up at the specified time or even a little bit afterwards, we wait at the restaurant for a minimum of 15 minutes for our food. Usually my husband suffers this indecency when we order, because he loves their Pho and I am obsessed with their Tom Kha Noodle Soup (never seen anything quite like it anywhere else). Recently, however, I ordered take out with a friend and we went to pick it up together. I predicted to my friend that 1) our food would not be ready when we got there (which was 20 minutes after we were told it would be ready), and 2) that we would need to check the food because they would likely forget something. (More than once after picking up aforementioned pho, my husband got home to find to his dismay that his fixins (sprouts, basil, peppers etc) were missing). Also, the previous time I ordered, I had ventured to try something new, Xao Lac, a peanut dish with hot peppers, but instead got something with cashews that was totally bland and had nary a hot pepper to be seen.\n\nUnfortunately, I ended up being right on both counts. We got our food shortly after arriving, they read our order to us, we confirmed that it was right, paid and took it to our car. I had my friend check the bag. Our simple order of my soup, her curry and our dumplings was missing dumplings. Back in we went. I told the hostess and she went to investigate. I heard someone in the kitchen chastise her that "they were missing because the order wasn\'t ready yet." (Ding ding ding! Now I\'m 2/2!) If you can\'t tell from that overheard exchange, it seems like there is a level of disorganization and poor communication that makes good service fairly unlikely. As a side note, although it was busy, there had to have been at least 10-12 people working besides chefs (3-4 people just in front manning the cash register), so it wasn\'t an issue of operating with a skeleton crew.\n\nI have also eaten in at Ha Long Bay 2-3 times and the service hasn\'t been any better. I\'m from the east coast and it\'s been suggested to me the standard here isn\'t the same. Well, I don\'t really buy that given how many places I\'ve gone in Madison that have EXCELLENT service.  Also, while a mistake once in a while can happen anywhere, the fact that it is the rule rather than the exception at Ha Long Bay frustrates me. Because I really want to love this place.\n\nAnyway, I can recommend the fresh spring rolls, curry puffs, crab rangoon, fried dumplings (best I\'ve had in a while), soups mentioned earlier, in addition to Pad Phet and Xao Ca Ri. Really, everything is probably delicious. If you get it. And if it\'s what you ordered.\n\nDo better, HLB. I implore you.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2013-03-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'kRwxhuSJzrC09s4Owamg9w', 'review_id': 'A-QXdS4RUDRpy8GIVdZuLw', 'text': 'Wow. In town from LA and went with my brother, this is as good as my favorite Thai place in East Hollywood. Great value as well. Had great pad see ew, chicken satay and the cucumber salad-all great. My new go to restaurant when I am back in Madison', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2013-03-30', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 1}, 'user_id': '104LiSWMsGvqWxi0PMNqbw', 'review_id': '8Ze1BIY1YEwVjeH9P5wHqQ', 'text': u"I got the Com Chi\xean (Vietnamese fried rice) with tofu, and it was yummy! I need to work on my adjectives, don't I? Savory. Palatable. Tasty. Luscious. This was the first time I had ever eaten at a sit-down restaurant with Vietnamese food (and not just Thai), and what an incredible introduction to the cuisine it was! \n\nI noticed that a lot of reviewers complained about the long wait and overall slow service. We did indeed have to wait maybe a little longer than usual for our food at Ha Long Bay, BUT there were not many other people dining at the time. The waitstaff was not particularly friendly and there was a little bit of a language barrier. True. BUT, the food is just SO good. My three dining companions (one of whom was Vietnamese) all gave shining gold stars to this place, too. \n\n This food was delicious and well worth the long wait. Maybe if we had been in a huge hurry, I would be singing a different tune. But the food was delectable, and I'll certainly come back for a second go if I'm ever in this neck of the woods again!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2013-04-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '59_jveJjjA4Y40ksdkBZCQ', 'review_id': 'J2pkoQVZfr6tXLPkPqbL_w', 'text': "As others have mentioned, Ha Long Bay has the best Tom Kha I've ever had. When I first moved to Madison, this was my go-to restaurant. Amidst all of the bar food here, HLB was like a breath of fresh air.\n\nThe wait can get a little ridiculous, especially after 7 on weekends, but you can't exactly blame them for having lots of customers. I would just try to get there as early as possible, especially with a large party. As for other noteworthy dishes, I'd order the curries. I've tried many of their noodle dishes, and they all seem to taste very similar with very few distinctions between them (typically just ingredients or type of noodle)-- Perhaps this is because they have a crazy amount of noodle dishes to choose from. \n\nBut all in all, HLB is one of the best, if not the best, SE asian restaurants in Madison.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2013-04-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 2}, 'user_id': 'x6JQJ_xdSx1O9FNedmT1aQ', 'review_id': 'feMWDHq9UbGNqXoRBgPGcQ', 'text': "I am absolutely IN LOVE with Ha Long Bay!\n\nMy dining partners and I began with the Crab Meat Wontons, which were the best crab rangoon that I have ever had- a great size and a perfect shape that ensures that every bite has a taste of the amazing cream cheese filling. \n\nFor my entree, I had the Squash Curry with Chicken, my favorite. As always, it was absolutely delish and the spice level was perfect. Definitely a must try!\n\n Finally, we finished our meal with the Coconut Sticky Rice with Mango. If you've never tried this stuff, you need to right away! The tangy, soft sweetness of the fresh mango is the perfect contrast to the slightly chewy texture of the rice. It's actually my favorite food ever!\n\nI would have given Ha Long Bay 5 stars if it hadn't been for the unreasonably long time that we spent sitting at our table without greetings or drinks. Having worked as a server in the past, I can understand when a server is busy, but the fact that as we waited for at least 10 minutes, many servers walked past us without even stopping. I would have appreciated at least a quick greeting!\n\nBesides a few service mishaps, my experience at Ha Long Bay was amazing as always and I can't wait to return for more Mango Sticky Rice soon!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2013-04-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4G_iZq6XDUXdOt16cJUUgg', 'review_id': '0j2cTLLBxmMADjmVnAC0jA', 'text': 'The best Asian restaurant in Madison!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2013-04-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'oFhtzLhXS1iENWoBMdWk4w', 'review_id': 'zxXsB9Ty49qF6FsxilL6-A', 'text': "Ordered take-out on Saturday and wow - was it fantastic.\n\nPork and Shrimp spring rolls? Fantastic. Huge, tasty, and so fresh. \n\nThe Ha Long Bay specials - HS1 and HS12 (chicken and tofu/squash curry, respectively) were absolutely delicious. The chicken was lightly battered and packed with flavor. The curry was unreal - some of the best I've had in a long time.\n\nPortions were incredibly large; had enough for 2+ meals.\n\nI'm glad I did take-out; the place was absolutely packed at 8:00pm on Saturday night. I overheard the hosts telling people the wait would be 1.5+ hours... take-out wait time was just around 30-minutes, so phone first!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2013-04-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'RBhNiqaAU95xXYRf4gpnLg', 'review_id': 'jEI8XGm1kLE9SOY4tpQbwA', 'text': 'Things I ate at Ha Long Bay (one night, 2 people)\n\n- Pork & Shrimp Spring Rolls\n- Golden Tofu\n- Pad Prik King w/Shrimp\n- Drunken Noodle\n\nThings that are amazing to eat at Ha Long Bay\n- Pork & Shrimp Spring Rolls\n- Golden Tofu\n- Pad Prik King w/Shrimp\n- Drunken Noodle\n\nBased on this evidence, it appears that everything at Ha Long Bay is amazing to eat', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2013-04-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nciaeGaGOaEnLlFL62VF9w', 'review_id': 'cMaAxQh7NevjDmlSbWAoVw', 'text': "Went here for dinner last night with a friend. It was absolutely delicious! My friend and I shared the pork and shrimp spring rolls which was really good... different kind of sauce though. I had squash curries and it was sooooo good! The flavor was super rich and the squash melts in your mouth. My friend had pho and she said it was just okay, she liked the saigon pho better.. but it's not bad. I can't wait to try other things next time!!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2013-04-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'zEHcZ7V911uwOD2IzieiQg', 'review_id': 'ni5DbFmlICpS9e9Xu96Prg', 'text': "After flying into Milwaukee from Louisville, KY and connecting in Chicago O hare, I drove to Madison on a brisk Monday afternoon. Glad I asked the gate agent to bump me to an earlier flight, so I didn't have to experience traffic on the I-94W and the tedious 3 hour delay if i stuck with my original itinerary. I was craving Pho, after not having any for quite awhile.\n\nAfter checking Yelp and my bookmarks, I stopped by Ha Long Bay Vietnamese & Thai Bistro to get my Pho on, since it was rated high by the reviews. Located off of the main thoroughfare of East Washington Ave, it took me a good while to locate this place. After mapping it out and finding Williamson Street, I parked on the quiet Jennifer Street and walked on over to the entrance. It was nice to be able to sit down after long drive.\n\nThe restaurant itself was nice, but dimly lite. They have restrooms, but assuming for customer use only. The restaurant itself was a smal bistro in the heart of Madison and there was some patrons hanging out and eating when I came in. There was 2 servers nearby and a older lady came over after to take my order. I assumed this place is a mom and pop establishment, so it was good to support local even on vacation.\n\nI ordered my usual when I come to get Pho, which was combination Pho and a side of summer rolls with shrimp. The entire process took about 10 minutes. The bowl of Pho was good and the flavor of the broth was deep and it was delicious. Only problem was that there was not enough noodles that I am accustomed to. Wish I did speak up about this and asked for extra noodle in the beginning, it was my fault for not asking. The summer rolls felt like they were refrigerated and not made on request, which was a bit disappointing. Nevertheless, it was good anyway.\n\nOverall, this place is worth it's weight in yelp stars. My only gripe would've been the portion of noodles, but that can be corrected easily. They do accept cash and credit cards, so that's always a plus. Clean and inviting to take in a meal by yourself or your Pho hungry friends out. I had a nice experience here and hope you do too. While I can say it was good Pho, it can be better.\n\nSupport local!\n\nB", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2013-04-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vYR0TJBmgfwvIwb4UkzU9Q', 'review_id': 'zqKMSniTraOx9GngfFwq5g', 'text': 'Worth the long wait to be seated.  Food was excellent.  They were extremely busy and service was slow, but as good as the food was I am willing to overlook it!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2013-04-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'YroNL98cYvWyezzxtIWMDw', 'review_id': 'FkI66F97gNmg9mqhWFDdGw', 'text': "Go off the beaten Pad Thai path and enter the world of some amazing curry. Fresh and amazing food that's perfectly prepared. I love their squash curry. Affordable and delicious every time.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2013-05-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mv85AhLBJpn6RpRgbeh4cw', 'review_id': 'daOzE_AY-fCegxEczRnwkQ', 'text': 'The mango curry with chicken is VERY TASTY, however not the most complex curry flavor I have ever experienced.  However it also had very little mango flavor, and the predominant flavor was certainly from the acorn squash, and a little from the pineapple.  Ordered it as "medium" spicy, and in my opinion it was not spicy at all, not even a little heat.  Will order it as "hot" next time.  Got takeout on a friday night and I am very glad we did because the restaurant was so packed I had trouble even spotting the counter through the mass of people standing  by the door waiting for  a table. Very affordable too, my curry was only $10 and was huge :)', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2013-05-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UJDfIlh5DhrgZ33E5Qmssw', 'review_id': 'aiHVyNrpUyLqC_fxrZiGBg', 'text': 'My colleague said all the good things about this place and so one day, we decided to hit this place up.  The place is as advertised.  The food quality is a top notch and they give you more for the price than anywhere else.  \n\nMy colleague had the house special #7, beef with asparagus and I had #8, green beans, squash, bamboo with chicken.  It was one of the best Thai dishes I have had in the States.  Of course, Thai people may say all Thai places in the States are not as authentic as places back in Thai but the dishes we had were as good as they get here in the States (especially in Madison).\n\nWe also had their shrimp and pork spring rolls with bean sprouts, cilantro and lettuce for appetizer ($3.99 for two pieces) and they were awesome and fresh.  \n\nOne thing we noticed though: there was a group of about 7-8 people waiting for a large table and they must have waited for almost 1 hour.  The place seemed to have enough tables for smaller parties but be sure to make a reservation if you are more than 4 people.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2013-05-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HKWz7KmxP_BD8uaz0wuSMw', 'review_id': 'TE0mhLzbYf6nyeItNGycUg', 'text': 'I like Ha Long Bay. The decor is nice and comfortable. There are prominent window seats which give a good view of Willie Street, but that also put you on display for everyone walking/driving by.\n\nThe menus, as has been mentioned, is very large-- I like the Bo Kho, which is a stew of beef shank and vegetables in a rich, flavorful broth. The green curries are tasty as well. The only think I\'ve had there that didn\'t suite my palette was "Dynamite" shrimp. The shrimp were pretty good, but they were overwhelmed by a sauce that was essentially mayonnaise with lots of Tabasco sauce in it, and maybe a little sugar for good measure. Eating one of those shrimps was sort of tasty in a junk-food way, but it got less than appetizing pretty quick.\n\nAll in all, though, the food has been tasty and fresh, and the meals are well paced (I like a little slower-paced meal when I dine out). There are more flavorful Thai options nearby (Bahn Thai is a bit better, food-wise) but Ha Long Bay can certainly be a place for a wonderful dinner!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2013-06-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'AEIKxjduqqu545E3T2lHog', 'review_id': 'D3BfA-z73-G8wLYcp5u2IA', 'text': u"This is probably my favorite restaurant in Madison. Nearly everything I've had here has been excellent, and the service is great, too. The only reason I'm not giving it 5 stars is that the rest of Madison seems to share my enthusiasm for the place, and they don't take reservations unless you have a party of 5 or more.\n\nThe street parking can be a bit tedious on weekends, but usually during the week it's not difficult to find a space. There's a (very) tiny waiting space when you're waiting for a table with a few outdated magazines and ancient copies of the Isthmus; it's often cramped and I believe there are only 2-3 chairs. Make sure you check in right away with the front counter to get on the waiting list if this is the situation with which you're confronted. As of yet, I don't think there's a way to grab a soda or beer from the case and have it added to your tab once you get a table, which would be a great idea. The booths are extremely comfortable (the tables, less so, since they are crowding a bunch of them into a tight space). The bathrooms are always clean and well-supplied, but since they are single-occupancy, you can count on a line for them on the weekends.\n\nI've had the Crab Wonton, Goi Cuon Cha Gi\xf2, and Goi Cuon Chay as appetizers. While the Crab Wonton (served with a sweet & sour sauce) is nothing to write home about, the Goi Cuon Cha Gi\xf2 is fantastic - it's a spring roll wrap over a Vietnamese egg roll, so it has a nice hearty warmth while still feeling light and refreshing. The rolls come with a delicious sauce with chunks of peanuts that I only wish was a bit thicker, since it tends to run everywhere. The Goi Cuon Chay is a great vegetarian spring roll.\n\nFor dinner, I've had Musamun Curry, Panaeng Curry, Red/Yellow/Green Curries, Pho T\xe1i (you should definitely clarify with your server if you order this, since many of them mishear it as the Pad Thai), G\xe0 Kho Gung, and Pad Thai. The Musamun Curry is better here than I've had it anywhere else - it's not too sweet (usually the downfall of Musamun Curry, in my opinion), and the mix of spices is perfect. I always order it with beef. The Panaeng Curry (usually ordered with chicken) is alright, but I had better when living in a Vietnamese neighborhood in SF. The Red/Yellow/Green Curries are all nice, but flavor-wise not terribly distinct from each other. On the other hand, the Pho T\xe1i is freaking amazing - the best I've had since leaving SF. There's plenty of meat (though it could be rarer when it arrives, letting the broth cook it), they bring out tons of Thai basil/bean sprouts/lime wedges to add, and there are huge bottles of Hoisin and Sriracha at the tables to adjust everything to your personal palate. It's really filling, but it doesn't work well as takeout or leftovers (Pho T\xe1i rarely does), and you'll probably feel a touch of hunger later as the broth leaves your stomach. The G\xe0 Kho Gung is the PERFECT meal when sick. It has a ton of chicken and fresh ginger in a broth-like sauce, which the rice absorbs well. It's one of my favorite winter meals. The Pad Thai is pretty good, but not a standout dish like some of the others. A note about spice: I tend to like things spicier than the average Sconnie, but the difference between ** spiciness and *** spiciness is bizarre and sometimes wildly fluctuates from time to time. I can't taste any spice at the ** level, but the *** level means I'll have to pack most of it to go because my mouth is too on fire to eat much. I tend to find a happy medium by choosing the ** level and adding Sriracha. My Texan boyfriend is fine with the *** spice level, though. Another note: the portions are ENORMOUS; I can't remember a time when I didn't need a to-go box. They're easily shared between at least two people.\n\nThe Thai Iced tea does a great job of blunting the spiciness of some of the food, but I suggest requesting that it come out WITH the meal instead of before the meal, so that the ice doesn't melt too much, thinning it out. I've also quite enjoyed the Crabbie's alcoholic ginger beer, though it will not soothe spiciness and sometimes seems to exacerbate it. I've always been far too full to order dessert, so I can't speak to that. They do bring out lovely little candies with the check, though; I wish I knew what flavor they're supposed to be.\n\nWhile I've always had a pleasant experience, I do think it's fair to mention that some good friends (who have also been huge fans of the place in the past) did have a bad experience a few months ago. One of them ordered a new dish and thought it tasted terrible. His fiancee verified that it was basically inedible, and they alerted their server after each taking only a bite or two of the dish. She was fairly unpleasant when they requested to send it back and replace it with something else, though she did finally do so after calling in other servers. However, I've never had a bad experience, and look forward to returning.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2013-06-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'I6HsIsNPUJ6qjoieTYFIbw', 'review_id': '7GhNuf4IccYjr55o-HsI9A', 'text': u"Terribly disappointing dinner tonight - both the food and service were simply awful.\n\n  I was here last September, and had a wonderful dinner, though it took forever to dine; I chalked that up to it being a UW football weekend, albeit pre-season; the Bun that evening was a revelation.  Sadly, tonight, after a 40-minute wait for a table, it took another 20 minutes for my downright surly waitress to even approach the table - the hostess noticed, and  took my drink order (bad sign).   After my first choice proved to be something they don't serve anymore (despite it being prominently featured on the Vietnamese menu), I switched to a Thai squid salad (Yum Pla Muk).  Bad mistake.  The sauce had no hint of  either saltiness (from fish sauce) or sour (from lime juice), just mild heat and  cloying sweetness - imagine a squid sundae - with but five pieces of squid.  I would have sent it back, but the waitress never came back to check on anything until she dumped my Bun entree and fled - without taking the plates from the squid salad, which sat on the table until I self-bussed the table.  \n\nThe Bun, in the same variation as the fabulous one I had last summer (B\xfan B\xf2 Nuong, T\xf4m (grilled shrimp and grilled pork), was a flat-out disaster.   The pork was a tasteless, dry afterthought, the noodles were overcooked and mushy, and again the dressing was terribly out of balance, with no hint of either fish sauce or lime, just minor heat and dessert-like sweetness.  Also, as with the squid salad, there was only lettuce and cilantro as the green component - no mint, a critical element.  Terrible.  I can make a far better Bun than this myself. \n\nAgain, the waitress never came back to check on anything, or even to deliver my bill - I had to again enlist the hostess to do so.    Worst $35 dinner I've ever had, hands down.  With the far superior Lao Laan-Xang a block away,  I can't imagine anyone eating here.  I will never do so again.   Madison is chockful of fine restaurants - don't waste your time and money here.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 1, 'date': '2013-06-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'iSZunVni3ZMhWIOYL1gTPA', 'review_id': 'SN7gQLdGV_tDwB0sdt3i3Q', 'text': 'Their menu is a bit overwhelming, but everything we had was very tasty and at reasonable prices, with plenty remaining for leftovers.  We will be back to explore more of this menu!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2013-06-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4_6Q7K5Dm0rEj7ksOnYUbw', 'review_id': 'qpqbMd6kdj5xzYeILXUfOA', 'text': "Recently moved to Monona which, outside of average crappy Chinese that does in a pinch, has little to offer restaurant-wise save for chains.  We LOVE Thai and Vietnamese, but it's usually more pricy than cheap Chinese delivery.  Then we found Ha Long Bay.  Outstanding food, tried several dishes and it's always fantastic, plentiful and inexpensive.  My favorites so far:  Drunken Noodle, Squash Curry, Crab Rangoon, Fresh Veggie Thai Spring Rolls, and my 12 year old loves their Pad Thai.  If you dine in, plan on a wait.  Every time I've gone, including last Sunday at 8pm, it's at least a 30 minute wait for a table.  And I'm glad for them.  But I usually do take-out.  Any way you go, just go.  Seriously good stuff.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2013-06-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SU6POhroNR7SNXh5Nq1GYA', 'review_id': 'HWb0c_p9j8RJ4eGZLzEfAg', 'text': "Everything I've had here has been good, but the absolute best thing is the Nem Khao Tod (LS7). It's actually a shame it's so good because I'd like to try more of the menu, but I can never resist ordering the Nem Khao Tod. Seriously, it's like an explosion of a million different delicious flavors in your mouth at once. So effing good.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2013-06-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'JpltNtTRoqL4Vq9Mghge7g', 'review_id': 'd8rqLz5AT-vPVfASLdpPLg', 'text': "A co-worker of my husband's recommended this place--we had been living in Madison for a few months and were down to try whatever!  OMG!  Their dumplings are delicious!!!  We ordered both the pan-fried chicken dumplings and the ones with tofu.  Getting them pan-fried adds a great texture vs. getting them steamed.  I am not a vegetarian by any means, but I can appreciate a no-meat dish.  However, the chicken dumplings were bigger and tastier...I could eat a million of them!  In fact, my husband and I fought over the last one (not so with the tofu :)\n\nOn a second visit, I tried the green curry and fell in love all over again with thai food.  This place is super authentic and very affordable.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2013-06-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'NKc0b52V7iOZe-UBstO5-g', 'review_id': '7f5GKWG9YlKkklkf_2ayiw', 'text': "Food and selection is best for southeast Asian cuisine. I would the Pho isn't as good as other places in town, but the bun, stir-fry noodles, and curries are great. Prices are very reasonable. I would frequent the place more if service wasn't so slow! It's much more convenient on the weekends.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2013-07-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'ME7BOK4LNk-hFmIUPkrwGw', 'review_id': 'nb8LydiVEP1Gz6zpg-pn6g', 'text': "My hubby and I are regular for this place. We always have their chicken egg-rolls and their thai tea. They both are so good. \nFor the main dishes, we usually  have their drunken noodles, curry and mok pa. We have tried their kinds of curry: red curry, green curry, masamun, etc and they are equally good. \nTheir pad see ew is also good and if the restaurant is not really busy, they can have the big noodle fried (just like the one in drunken noodle) and it's yummy. I love it and never have any disappointment by far.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2013-07-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'lUvTSHNmUGmc9hkDFr_3aA', 'review_id': 'Wvm5yur29zazjQYjh8zgbQ', 'text': 'Ha Long Bay, the definition of a love hate relationship.\n\nFood is excellent, service is deplorable. I write this over a takeout order that, while delicious, is not at all what I ordered.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2013-07-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'IJgLsg6mlaz40STZPctHpA', 'review_id': '4m7fZCppVQv2yDb74hH1hw', 'text': "Awesome food, TERRIBLE service. I recommend calling ahead with a take out order and eating their delicious food in the comfort of your own home. 2 stars for service and 4 stars for food. Just spent 2 hours there, watching people who had arrived after we did get their food and even leave before we got our main dishes. Food was great, won't be eating in the restaurant again.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 2, 'date': '2013-07-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 4, 'cool': 0}, 'user_id': 'VpB8ejqP9H6EwFA1PMVfeA', 'review_id': 'p91_aVWhIAkvEyRh5rSjTw', 'text': "Would rate a 0 if can. Had reservations and was seated right away but had to wait 30 mins just for drinks and over hr for food. service was horrible. restaurant wasn't even busy also.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 1, 'date': '2013-07-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'X5UxKoKmtiHrwkkEMJ71Pw', 'review_id': 'dr-ZDi-8F3wPH5S6UrC82w', 'text': "OK, with two stars I think I am being kind. I read the reviews of this place and thought, Wow, let's try it. Now to preface this a bit, I lived in Thailand for two years and throughout other parts of Asian for many years, sooo. having said that there is good Thai food in Madison, really good but just not here.\nStarted off with the Vietnamese spring rolls, not much filling in them, very cheaply made, but the vinegar sauce, well, watered down so much it  was really hard to taste the vinegar, the peanuts that should accompany this was so meager that you could count the individual little nuggets floating on the surface of the water, errr... vinegar.\nLame and poor.\nI ordered the Padthai and my wife ordered the chicken curry. Almost 55 minutes later we got our food. Busy but, what to say?\nThe curry was decent, creamy, the squash was good, good proportion of chicken to the dish but nothing to scream about. \nThe Padthai, I was somewhat horrified when it came out. It was watery with enough red sauce, almost like spaghetti, Padthai is not supposed to be like that, Not even here in the states have I seen it made like this, way too sweet and runny consistency, not what Padthai is about. No veggies in it at all, noodles sauce, lots of sauce and the shrimp. Now the shrimp, the only good thing about the whole dish was that they were almost perfectly cooked and good size, oh and there was the egg in it. Really the worst Padthai I have ever had, anywhere. \nThere are so much better other Thai restaurants in the area that are really good, too bad.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 2, 'date': '2013-07-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'a-ZvAUEV_A5j_YmSShGStQ', 'review_id': 'BJYDrvdqf_YkZkAJYYSmFA', 'text': 'Best Pho in town probably but it does not mean its great. If you want some this is the place to go to', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2013-07-29', 'type': 'review'}
{'votes': {'funny': 9, 'useful': 2, 'cool': 4}, 'user_id': '38AnfLl0TKTqmWUhZLkDIg', 'review_id': 'KRu-VHpU3_uhoHpY2pGHGg', 'text': 'I want to have a long, long, (Long) happy marriage with the squash curry. I left my heart at Ha Long Bay.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2013-08-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'e4mZoYhRJFId1OTFJgvfIw', 'review_id': 'bW7JikG8rVOqkxqVfBLtIQ', 'text': 'FANTASTIC Thai in Madison! The Tom Kha noodles alone would make me rave about Ha Long Bay but everything else my group had was awesome as well-even something as simple as fried rice! My friend that brought us here loves their Pho and the others in our group were very happy with the noodle dishes they ordered. Much love for Ha Long Bay, definitely hope to return the next time I visit Madison!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2013-08-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lB4hOIAWg2-L3Xmx_vNQKQ', 'review_id': 'Nd6Z3kubFofd-Q3JfXRznQ', 'text': "The best Thai curries in Madison, -- I've tried everywhere I know of -- Ha Long Bay's expansive menu also includes specialties from a variety of ethnicities, and should provide something delicious for anyone with even a slight inclination towards Southeast Asian cuisine.\n\nIn addition to the superlative curries and curry soups, each of which I'd recommend highly, the pan-fried tofu dumplings and the curry puffs, both appetizers, are excellent, and I prefer their tasty Thai iced tea to wash it all down. Afterwards, it's hard to escape without trying the mango sticky rice or red bean sesame balls for dessert, and even the post-meal guava candies are notably pleasant.\n\nThe only real knock is that the service, though eminently friendly, can run just a bit slow, especially given that they are usually jam-packed with hungry patrons. I often prefer ordering carryout if the plan is to dine during peak hours, sometimes taking a nice meal for two to enjoy by the nearby lakefront.\n\nOn the whole, the quality of the ingredients, the exquisite flavors and preparation make Ha Long Bay one of the very best restaurants in the city, and every bit deserving of the full five stars.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2013-08-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1qpc3PN65rCnZB4REAsp9A', 'review_id': 'L_nWY51I1uC-dzwfZtejBg', 'text': 'Terrific wait staff equipped with excellent recommendations, amazing food and attentive care. I cannot wait to return to Ha Long Bay! Their signature dishes are truly memorable and delicious!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2013-08-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 4, 'cool': 1}, 'user_id': '16gN21ENNDQEQq1fvicFnA', 'review_id': 'xUN1kykF7fXxgyF3nnkTGQ', 'text': "It's clear why this place receives a decent amount of stars, but I will say that's it's not due to timeliness or good service. Not seeing your server for 10 minutes is really bad. And it happens every time I go in. I've been in 20+ times.\n\nWhy go back if it's that bad? Because the food is awesome. Seriously good. Best soups. I love the red curry coconut with bamboo. I always get shrimp. It's a soup to die for.\n\nAnother thing is their hosts always look miserable. Yes, you're 17. Yes, you'd rather be out partying, but suck it up. You're lucky to have a job.\n\nLastly, they once added a credit card tip on a to go order I placed. I was shocked counting on the fact that I had left a cash tip. When I called to settle a woman who didn't speak English answered and eventually hung up on me. Oh well. What can I say? It was a one time thing.\n\nLet's get it straight: in short, ha long bay is the ever famous ha long wait. I'll keep going back for soup, but not for service. Yeah, it's worth the shitty service.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2013-08-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'piDym3-FSP5gstfMbDvq8Q', 'review_id': 't7A5cz8sKN2_jGHpWAQC4w', 'text': 'Best vietnamese around, appetizer spring rolls are fantastic, some of the best dumplings which are clearly home made.\n\nFor entrees try out any of the vietnamese specialties or thai noodle dishes', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2013-09-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'cWWNHJw-mBX_cAs04LabKg', 'review_id': 'wBYsipBTT1UpEO0chvGqTg', 'text': "The food was delicious but the wait (to get your food after you order) is ridiculously long.  I think if I get food from here again in the future, I would get take-out instead or else bring a book.  It's also nice that they have a lot of dishes to choose from.  I got the yellow curry and loved it.  Portions were large and I had enough for lunch the next day too.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2013-09-02', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'lGf7kft_ImlB-n57yn-kFQ', 'review_id': 'uzNiDFpmvi0xxgJVJ0dRoQ', 'text': "Can't I just say WOW WOW WOW three times?", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2013-09-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': '6kp815UUjK--ukUjmDlSCQ', 'review_id': 'AZ_ysazwxHXiwHOvK3d83g', 'text': "Since my first review we've gone here three more times.  On two occasions we got the table by the big bay window, and that was awesome!  We ordered what we usually order every time we go there, and it was outstanding.  Before I had mentioned how unimpressed I was with the longgggg wait time, however, we've discovered the secret!!  Don't go around the typical meal times!  *duhhhh!*", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2013-09-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ZFoKT5dm3J6iQ3n5E_w1ug', 'review_id': 'vJkUOZxXa5b2qRi3DfBIzA', 'text': "Service is terrible. Dining area is less than sub-par in cleanliness.  Come maybe for appetizers.. but even then, expect to wait.  Between food on the floor to our waitress that didn't seem to care about anything until she came with the bill... I'd say, if you can opt for some where else to go - than do so.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 2, 'date': '2013-09-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'T15oL2E_-k6A4y4q_dRkjQ', 'review_id': 'vg9c3BIltrzQzmvmyYf6eg', 'text': 'Very good! The squash curry- spot on. The tom yum- fresh and just the right flavor. There was a noodle dish with beef and tomato and that was also great. The wait was long-ish and the wait for the food was really long, however, we were behind a huge group so it was understandable. I will definitely be back.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2013-09-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'aOyQjWtTSvH1oibZILRDvw', 'review_id': 'eBK53sLqzmdLQ5N6GMwz9w', 'text': 'Favorite "nice" asian place in town. Love having both Vietnamese and Thai options and you\'ll get to see some great courses you won\'t find at the other Thai or Vietnamese places in town. Service has been not the best in the past, but not bad enough for me to rate down.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2013-09-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 3}, 'user_id': 'd52N6YsTwhswyYnQQOc3dw', 'review_id': 'dqyMt6R0EbQIDsonlmRwPg', 'text': "As far as meals go, Ha Long Bay's Mango Currey Chicken tops my list as my all time favorite. I no longer live in Madison, but every time I go back I make a point to go to Ha Long Bay. Although I only ever order the Mango Currey, I've tried other people's dishes a number of times and they've all been very good. If you're looking for a place to take someone for a special occasion, this may not be the spot for you, as it's very casual and the atmosphere is nothing to write home about. But if you're looking for amazing food and a reasonable price-- you will not be disappointed.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2013-09-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'd_SsxPAWMGToJuoe4pDyAw', 'review_id': 'MbCgoAA7H1CavM0THq37AA', 'text': 'We are not very experimental with Asian food... \n\nBUT - the curried squash was the very best I have had - ever!\nMy partner said her pad thai was an "excellent specimen."\n\nWe have had only take-out from this restaurant, but it was ready in fewer than 25 minutes, which is a plus in my book.\n\nThe restaurant seemed crowded and noisy for a Sunday night, but the flip side of that is that most everyone seemed to be enjoying the food and the atmosphere. \n\nParking was really difficult: it took me ~ 10 minutes to find a spot close enough to make sure the food did not get too cold when carrying it outside.\n\nAll-in-all, well worth the $20+ for the generous portions of delicious food.\n\nUpdate as of 9/2014: after going here several additional times, I can say I appreciate the food even more!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2013-09-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XE-EtNY1ogC6XdLYhYVVFQ', 'review_id': 'jh1jX6hjhO6M-qsHDimhzQ', 'text': 'First time yesterday. Will not be the last! We tried a couple of curries, medium heat. Huge portions. Next time I will try it hot.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2013-10-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'sRzJNAkaxw4oIdvt1SbhNg', 'review_id': 'FdmQNbxnkGIAlcNfMDDZOA', 'text': 'Great food and ambience - one of the best restaurants on Willy Street! I went there with a large group and they went out of their way to accommodate us. I would also recommend the place for a romantic date.  :-)', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2013-10-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 1}, 'user_id': '2po57w1BmUTRjxyTMHAIhg', 'review_id': 'bic7fAUqk9XUaDbEw-4-2A', 'text': 'Repeat after me: "AP1, SL3, TN4"   This is all you need to have a world class meal at my very favorite restaurant in the entire world, and I do mean the world, including Thailand and Cambodia where I\'ve spent months enjoying the fabulous cuisine of SE Asia at the source...and  yet, its HLB I crave weekly.\n\nAP1= Incredible fried spring rolls, the filling is flavorful with spiced pork, always dry fried (not greasy), and perfectly accented by a sweet, but not cloying, ginger sauce. It will ruin all other spring rolls for you, beware.\n\nSL3 (Beef)= Thai beef salad, cold, crisp, refreshing with fresh cucumbers, tomato, herbs, shallots, and  thinly sliced steak swimming in a bracing lime/fish sauce vinaigrette.  My husband has been known to lick the plate. \n\nTN4 (Chicken)=Broad, fat, luscious rice noodles stir-fried with broccoli, chicken, tomatoes, onions, and holy basil  in a rich sweet-hot sauce.  Satisfying and filling, the best comfort food.\n\nEat, drink (their wine pours are generous), and be so, so, so happy :)', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2013-10-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'sd4kstHD9zl4UIG47mSUCw', 'review_id': 'Stupr-OzvPTnxDxyQuTgtA', 'text': "Pho on a cold dreary evening is such a perfect way to end the day.  My husband and in-laws walked to Ha Long Bay after a cold and wet walk.  We opened the door to a warm, cozy and deliciously fragrant room with the hustle and bustle of a great neighborhood place.  We ordered the chicken spring rolls, dumplings and green papaya salad to start-everything was just great!  Three of us ordered the pho and the steaming hot goodness lifted our spirits...the duck curry was generous and everyone agreed we'll need to come back soon.  The service was excellent-our host was friendly and our waitress was helpful and efficient.  Ha Long Bay has really made an impression-I cannot wait to return!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2013-10-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': 'Ffa864LL90s6oxImKPI7pw', 'review_id': 'vmtyuJJY3fC4sszB8gqRNA', 'text': "Again with the Tom Yum!  I know, I know, I keep getting the same thing every time, but when it's this damn good, how can I not??  I crave this stuff like crazy....", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2013-10-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nxpqZbZj6W9JtIlEtk5Fmw', 'review_id': 'QjQ3wv0UnYw7nVU0FNo-hA', 'text': "Hungover on a Sunday morning? Get to Ha Long. Their pho will wake you up quick and quicken your recovery time with their rich broth and plentiful meats. I'll save you the trouble and tell you to get a PH8 large. Looking for a nice place for dinner? I guess this place works too. Most of the time I come here for dinner, I try to come early to escape the long line that usually starts around 6-7pm. The food is very tasty and hits the spot if you're looking for something very well done. Their squash curry is delicious, their vermicelli noodle dishes are refreshing and their pad thai is almost the best I've had. However, most people seem to come here for atmosphere and conversation. This adds to the wait times and mass crowding. Service is inconsistent, sometimes taking 15 minutes for your order, sometimes 30, but always friendly and courteous. They had everything I asked to accommodate my pho, such as fish sauce and chili paste. Come early to escape the wait or takeout to eat well at home. Come Sunday morning for the cure to your aching hangover.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2013-11-04', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': '0pbQ7ie99n_stY-mSNQo7w', 'review_id': 'nkB6omISQDmjHVQqTHjfbg', 'text': "looks like this was the hottest asian restaurant on yelp for madison, so we had to check it out. when we walked in, the line was really long (a great sign), so we sat in the corner to wait a bit. together we ordered a pad thai, yellow curry, shrimp fried rice, and tom kha. pad thai seems to always be a safe option, and it was as good as expected. the yellow curry was not as sweet as i usually like it. and the tom kha ... well, it was my first time trying it. i wanted to be adventurous and try something i haven't tried for a change. a bunch of people here on yelp said it was good, so i went for it. turns out to not be quite my taste. it was a little sour. but i can't say it was bad, just not my thing. \n\nthe menu was HUGE though ... and for now i give it 3 stars, but when i visit madison again, i may want to check it out again to try something different next time. i really wanted to try EVERYTHING on the menu, so im extremely hopeful that next time it might hit the spot.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2013-11-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'iQgZGzNZkdfd37zl1q3gAA', 'review_id': 'xaWMdXyxIH8-Bv2_52nVFQ', 'text': "Easily one of the best places in town! Servings are huge, price is reasonable and it's awesome food all around! Don't be in a hurry if you go to Hong Long Bay. They are a smaller operation with limited staff; however, the wait is definitely worth it!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2013-12-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FO7jOZCKyQXMJ4mROo53jA', 'review_id': 'geZPmYVmUADyL9d51fTeoQ', 'text': 'I just ate there tonight and had the pad thai with shrimp.  The dish was great and the staff was fantastic.  They even went above and beyond to help me when I got stuck in the snow after dinner.  I love those guys!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2013-12-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': '8zpR2pLRFMvBDmw26OEJWA', 'review_id': 'M9xQXx-aFm_eke5U30CiRw', 'text': "I came here because of the good reviews on yelp, but I'm disappointed. The food was very mediocre and the service is far from ok. I got here at 1:30 on a Monday afternoon, so it shouldn't be super busy, but I waited for my food for more than half an hour. The two tables that sat down way later than us got their food first. I asked a waitress if they forgot my order, and she said its impossible because all the order was sent to the kitchen in order. I asked, then how come those people got the food before us, and she pointed to a third table and said see they haven't got their food either. But the problem is, those people just sat down less than five minutes ago. That waitress's attitude was terrible. I won't come back to this place again.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2013-12-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'N_8pR1fIUnBAh4fLhkftEQ', 'review_id': 'KleELpgARNr_Mg29ai40Zw', 'text': "I am of Vietnamese descent, and I have grown up on home-cooked Viet food. Now that I'm in Wisconsin, I find good Viet food hard a prized commodity. On a cold winter day in Madtown, this place has food to warm the soul. So far, this has been the best Asian food I've had in Madison.\n\nHa Long Bay offers both Vietnamese and Thai food. I've gone here 4 times, and I would recommend the Pho and Pad Thai. I got a couple of the pan-fried noodle dishes, and they don't quite compare to home-cooking. The Pho gives you a large portion of the beloved soup, and the broth is great. I don't care if they don't cook it in the traditional fashion; whatever they're doing is working. \n\nIf you want spicy food, be sure to ask for at least a 4 (out of 5). It may be just because the Midwest doesn't do spicy quite the same way as the South, but a 3 is a cakewalk and barely adds a kick.\n\n\nIf you are planning to do a family-style meal, two of the noodle dishes could feed 3 people. Dishes are large for one person (not a complaint), but not quite large enough for 2 people.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2013-12-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'xv6zplylmpMYrPmbD59s9w', 'review_id': 'q121XINLGKHW74Mkv4euNQ', 'text': 'My boyfriend and I got takeout here on New Years Eve. We both got a bowl of traditional Pho and loved it. Everything was separated into perfect portions on the side so it was ready to throw together when we for home. We also got a fantastic Panang curry dish. We will definitely come back to try other items on the menu.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2014-01-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'T1Ju5Uin6Ja3iki17ME6fA', 'review_id': 'zJNv480iAcAdtyFnhIPXyA', 'text': "One of our favorite ethnic restaurants!\n\nWe always end up coming to Ha Long Bay to eat with big groups of friends & I always order the same thing: the fried eggplant! It's a pretty indulgent meal, but it's so worth it.\n\nI've also had bites of friends' Pad Thai & drunken noodles, which are also so good! The service is also friendly & mostly quick. The only time I've seen things go slowly is when we ask to split the bill.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2014-01-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '6W4umA1jqrudRnO64jZ2FA', 'review_id': '8QY94fGtVEdAiUSLTD07BQ', 'text': u'The whole package! Affordable, great environment, fast and friendly service, and a wide range of Vietnamese, Laotian, and Thai cuisine!\n\nSuperstars: Veggie curry puffs, pan fried dumplings, chicken satay, and fresh spring rolls to start! Mi, Pho are 2 superstar noodle dishes in hot broth that come with \xfcber fresh veggies. Squash curry is heaven.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-01-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'nciaeGaGOaEnLlFL62VF9w', 'review_id': 'izNtm0VJvcr614XvGsYY2A', 'text': 'Ahh after waiting 1.5 hrs at A Pig in a Fur Coat and still cant seated, we gave up and came here! It was 9:30pm, We were starving and just wanted to stuff our face at this point! I ordered chicken egg roll since I have never had egg rolls here before and I was craving for something fried. It was phenomenal! Just the right amount if crisp and not too oily! Nommm I basically ate it under a min. Then had my standard squash currie. Same yummness! Thumbs up HaLongBay for saving my arse on a cold starving winter night!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-01-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7URb2_xXFG1EhAuDFAWzjA', 'review_id': '1WMeZlifqQvHcb7xedqxAA', 'text': 'Great fabulous restaurant! Love the chai tea and sticky mango rice!! Should enjoy a set of pho here and also the fried rice! A lot to explore and I will definitely come back!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-02-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XgshW2t-oEF6rzSIaoP8dA', 'review_id': 'rBH_yncpktF9kvVyedcRlQ', 'text': 'Just ate here a few days ago. There food is made to near perfection. \n\n    Unlike most Asian food, that is most of the time lacking in flavor, this is full of flavor \n\n    They offer Thai and other Asian food. Each bite as tasty as the next.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-02-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'eNYdsZRIWZ4Rpr0jWirMwA', 'review_id': 'tLPCX1TnE3ih7iU99VM7Qg', 'text': "Definitely one of the best Asian restaurants Madison has to offer.  I've been here several times, have gotten a different dish every time, and have been very satisfied with all of the dishes.  Their menu is vast, so there's plenty of reason to come here many times. If I had to narrow it down, my tip would be to try item V5, which is what a lot of my friends get every time they come.  It's a safe bet for those who don't want to browse the enormous menu.  Even though this enormous menu is overwhelming to some, it allows to get nearly anything your heart desires, and it makes you want to come back to try other dishes.\n\nThe only downside about this place is that it's very popular, so nearly every night from 6-7:30 there's going to be a wait for tables, and you can't call ahead or make reservations.  But once you get in, it's smooth sailing from there, as the food is always made fairly quickly, the prices are affordable, and the portions are generous. This is one of Madison's best.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-02-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'c0-2WUhN0ImLWmargq1Ywg', 'review_id': 'DhPJWnmz0PRDzstdo0N5jg', 'text': "My favorite spot for Thai food. Nice variety of Thai and Vietnamese food. Reasonable prices. My only issue: I sometimes get slow and inattentive service when it's not even that busy.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2014-02-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2eQBw5RmjjHTTAKBGEgAgQ', 'review_id': 'Zr__prcG7RUMZbueO6RxYw', 'text': 'Awesome food, always fresh and delicious.  Service tends to be quick and you get your food quickly.  If only they delivered!  So happy to have them in the neighborhood!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-02-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'QBKzfolWUTa0Ka9ujSm4gw', 'review_id': 'hN0Cw8oupIcos6lR0XslaA', 'text': 'Lunch at Ha Long Bay. This place is always hopping. Really, even at odd hours. Met a friend there. He ordered Pad Thai so I decided to follow suit. I haven\'t eaten Pad Thai in years but it sounded like a good idea . I had to shake off my urge to eat pho or my favorite, vegetable combo.\n\nAs always, I was not disappointed. The noodles were excellent, spicy and toothsome. The shrimp actually tasted like seafood and were done to perfection. The spice level was a little low for a "medium" rating. \n\nMy biggest challenge at Ha Long Bay is remembering what I ate and stopping myself from ordering the same thing over and over again.\n\nEveryone says, "Don\'t go there in a rush." I Agee. The service can be slow. Relax, breathe deep the sweet, sour and salty. Enjoy the food and venture out and try something new. Many wonderful dishes await.\n\nSadly I forgot to take a pic. Leftovers sit in he fridge but I am sure they would no longer "represent". Maybe next time....', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2014-02-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'yMZKXYM9oYEBi2o2q9c8fA', 'review_id': 'FP5RoehtVkWiv2PtM64bcA', 'text': "If you are looking for some Asian food on Willy St. this is the place to go! The pho is decent and they have a large variety on their menu. Their Thai dishes are pretty good too. Just another comfortable Asian place with reasonable prices for their food. I wouldn't say it was one of the best Asian restaurants I've had, but probably one of the best around here. 4 stars considering where we are. Most of the items on the menu are satisfactory - pretty good.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2014-02-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'J3i55rQ9jQlMipuG0At30g', 'review_id': '4rMnSjGLf3Ysxhga0kU4zw', 'text': "Yum!\n\nWent to Ha Long Bay for a weekday lunch. It was so tasty! I had a Thai noodle soup made with coconut milk, rice vermicelli, and red curry. They let you select how spicy you want your meal on a scale of one to three stars. I went right in the middle and selected medium spice, which was perfect for me. My friend chose hot, which was a little much for her. \n\nI also had a taste of my dining companion's Pad Thai, which was also ridiculously good!\n\nThe waiter was very nice, but service was surprisingly slow. We ended up waiting about 40 minutes for our food, which was unexpected for what we had ordered. This was only an issue because it was a work day and we needed to get back. \n\nThe atmosphere of Ha Long Bay is nice. It feels cozy, but not too crowded, even on a busy day.\n\nI look forward to going back!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2014-02-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XuavhETwynlnLRu-HOHr_g', 'review_id': 'J8SS2WFrK0HY6oJ7GhDJ6A', 'text': "I will definitely go back to this restaurant again but want to get some information out there. If you are planning on a Saturday night, expect a 40 minute wait which we were happy to do. The food was fabulous - we had crab wonton, egg roll, pad thai and sesame chicken and a pot of ginger tea so it wasn't anything too adventurous but it was DELICIOUS, no doubt! The one downfall was that there was so much smoke in the restaurant from the fried food that our eyes actually burned. Better ventilation is a must.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2014-02-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 3}, 'user_id': 'em6GWyKHpHBjRZg5G9o8dQ', 'review_id': 'fuUJuxflS649be0-pGNV2Q', 'text': 'Outstanding flavors from Vietnam, Laos and Thailand.\n\nService is very prompt and friendly. Waitress was helpful and accurate when determining level of spiciness.\n\nI absolutely loved the mango curry with chicken. It might be the best version of this dish in Madison. Food is also well presented.\n\nMy husband had pad kra prow maeng and it was perfectly prepared and delicious.\n\nI enjoyed the veggie curry puffs as an appetizer. They are shaped like crab rangoon rather than the "pocket" or "puff" style I usually see, but they tasted great, especially with the sauce on the side.\n\nThis will be a regular spot for us!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-03-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BxAlwbeUXEw-VU3c2LYDiw', 'review_id': 'fAcR6JwzzJQwLkTFLnYymg', 'text': "It would be difficult to come up with anything that hasn't already been said here. I was introduced to Ha Long Bay on a double-date with some friends who live on the East-side of Madison. Because we live out past the far-west side of town we rarely make it to the Willey Street area. Wow! We were so impressed. Everything was delicious. I had the tastiest pad thai I've ever experienced and it was enough for three meals, for me. The spice level was perfect and the flavors were amazing. I introduced another friend only a few weeks later because I was craving more. I look forward to trying all kinds of new dishes from their vast menu. This is a restaurant we will visit again and again and again.\n\nYes, they can be very busy and they don't take reservations, but good food is worth the wait. I have found it to be a little louder than I prefer at times, but I do have a low tolerance for noise. The service has been great whenever I've been there, no matter how busy. I just can't get enough. In fact, writing this review is making me crave another trip across town...", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-03-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yxp9i_wQo9wd6PE09IjT7A', 'review_id': 'COD0qn9sujqGU5X3DWojfQ', 'text': "Oh my gosh- such a combination of delicious wonderment!\nWhile visiting my daughter's family in Madison I know we learn about the best places appreciated by local families.\nWe had a curry with noodles, a beef and green bean dish, sticky rice with mangoes and a rice and pork dish. Will check on the names of these yummy delights on the menu but truly you should high tail it down to Ha Long Bay.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2014-03-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ijzzQob1SO0x0Efrx3Ue2g', 'review_id': 'OxVAXkmJmEbxZpPlsaMU2Q', 'text': u"Wow, this menu is large and fantastic. We arrived at 5:30 on a Saturday and there was already a 30 minute wait. Sadly, during that 30 minutes, there was no bar to wait at or much room to stand or sit. In the winter, this can be a problem. \n\nOur server was an adorable old asian woman who was as kind as your own grandma. Five stars for her.\n\nOn to the food: We ordered tea, the thai spring rolls, and hot and sour soup for appetizers. All three portion sizes were double what we expected for the price and all were fantastic. Our entr\xe9es were also great. We ordered the VE5 and HS2. I probably wouldn't order VE5 again because I'm sure there is something better on the menu, but it wasn't bad.  The menu is too inviting to explore! The entr\xe9e portions were average to slightly above average.\n\nMy wife and I had a great date night; we would definitely go back. The only reason why 4 stars instead of 5 was the lack of space for waiting and the fact that the restaurant was full of smoke that was slightly irritating for our lungs and made our clothes small like delicious food.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2014-03-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'WSwvf_KFzRtnZZHrrDtQsg', 'review_id': 'mMrUN1dIUCzpUNy0_uTcNQ', 'text': "Food is AMAZING !\nBut never go here after 6:00pm on a Friday or Saturday. With a party of 4 we waited 80 minutes for a table when we were told a 30 minute wait. Now here as a couple we were told a 30 minute wait. After 20 min with 5 parties still in front of us we switched and ordered takeout . We've been here 40 minutes so far and at least 2 parties of two that arrived before us are still waiting !!!! How is that for 30 minutes ??? Ridiculous.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 2, 'date': '2014-03-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '9hTtqG-dEtNwohjbnD5MCw', 'review_id': 'g3AaIml-87E7HRG1SiT9Yw', 'text': "Great Vietnamese. I had the Bun and it was very tasty and authentic. I'd prob eat here three times a week if I lived closer.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-03-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'b8yhmb3mEHK_CuDCvN0KdA', 'review_id': 'hexoICmzl6OLKK2E6T1aZg', 'text': 'Had lunch here and I have to say that the food is AMAZING!! Lunch specials are a great price! I had the Xao Thom Chicken which was FABULOUS!! This is a MUST try if you are in the area!!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-03-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nyKTpC0Q-fE87seukFUTgQ', 'review_id': 'uX4d6ZcTWmMoK84FDTYEQQ', 'text': 'Amazing chicken dumplings got us very excited for our meal. Then had bland mango chicken. Something that resembled tso chicken and chicken pad Thai \nBland bland bland', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 2, 'date': '2014-03-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'p2SqB1Fi5YRMZoTUizJ8Uw', 'review_id': 'TXcLskAy4DmIhG2pMYX82w', 'text': "The dumplings are amazing! Probably some of the best in the entire Madison area!\n\nI have eaten here more times than I can think of, and I order many different items from the menu. Everything I've had has tasted fresh, and is always excellent. My only wish is that I still worked near there and could have lunch there 1-2 times a week like I used to.\n\nBesides the dumplings, I highly recommend a few items:\n\nThe Yum Nuah or Yum Gai (SL3) - it's a salad with either beef or chicken - just fantastic!\nAny of the Bun dishes - they are all fantastic! A cool noodle dish that is very awesome on a hot day!\nThe Mi Xao Don - Crispy Egg Noodle - fold the edges in - and wait for the sauce to soak up the noodles. They become soft and have a crispy/fried taste while being soft and easier to eat.\nLast, but not least, their Pho. It is top notch. Ask for them to keep the raw beef on the side when you order so you can let it cook yourself. Otherwise it can come out a little too cooked, and not rare anymore. I think they probably do that to accommodate Caucasian patrons, and there's nothing wrong with that.\n\nTry this place. I drive over from Middleton at least a month just for dumplings. You won't regret it.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-03-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'bKY498VIP4SDCSkjjnUovA', 'review_id': 'luD1AisQJra8YViP9AKraA', 'text': 'Sometimes it feels repetitive to give good reviews, so let me keep it short: delicious, huge selection, great service, portions big enough to take some home after. Loved it!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2014-03-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'MfQRz8He78Z8C4dYdGnFAg', 'review_id': 'gloa6zX9WYtHIWLtTyxu1w', 'text': 'My primary place to go to Vietnamese food on the east side. \n\nHa Long Bay provides broader selections than Saigon Noodles and Pho Nam on the west side, as it has many entree dishes, while other places specialize in noodles and rice dishes. For the Vietnamese entree, ginger chicken is one of my favorite. Personally, I almost always stick to the entrees in Ha Long Bay and go to Saigon noodle for their lovely pho. \n\nBeyond its VT offerings, Ha Long Bay has a big menu that also blends in Thai and Laotian dishes. Thai curry plates are as good as any other Thai restaurant in Madison. \n\nIt always gets busy in dinner time. Make reservation if you can. \n\nOverall, the quality of food is very good, and consistent. A very well-rounded restaurant. Service has been satisfying. The only minor quibble is that the menu is so large, and many items are in its original languages. While I truly appreciate the authenticity associated with it, it could difficult for the first-timers to order, and even more difficult to remember what I just ate. \n\nI highly recommend Ha Long Bay.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-04-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'Vgg4i0z3P0tfA2ahPXly2Q', 'review_id': '54Id-MbbdKoifcRMsH08pQ', 'text': 'Awesome awesome food! The best in Madison! Dumplings Rock, the fried wide noodle dishes Rock, everything is a good pick!  The decor is horrid, but just look at your food!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-04-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '3oLxIeh78P-VjuPDPgqbtg', 'review_id': 'FMS7Zp3hN5O00sDI7kPtPA', 'text': 'My 10 year old son James LOVES Thai food and he said this is some of the best curry he had ever had!  The menu also has Pho and other yummy dishes.  Reasonably priced and packed on a Friday night.  This place Rocks!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-04-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'cFgxaEi0SbvQEAHB9Y2a-Q', 'review_id': '0XwXqNv2umj-xUlaQ2XpVw', 'text': "Very, very impressed with Ha Long Bay. The one downside I noticed was the wait time - I arrived with a group of four (plus me) on a weekend night at around 7 or 7:30, and it was PACKED. We had to wait about 45 minutes for a table, which wasn't surprising, but still a bit of a bummer.\n\nOnce we were seated, though, everything was great. Service was quick and friendly (especially water refills - you will never go thirsty here). One of my fellow diners was a bit overwhelmed by the incredibly varied and expansive menu, but I'm a fan of having options, especially when it comes to cuisine and restaurants I'm not familiar with. Our food arrived surprisingly quickly, given the sheer amount we ordered -  at least three different appetizers, followed by five different entrees. Everything was delicious, from my mango curry to my friend's pad see-ew with tofu, and we had plenty of leftovers that were still tasty two or three days later. Major bonus for a non-leftover-lover like me!\n\nLong story short: if you're here for a weekend dinner, be prepared to wait quite a while. But if you've got the time to spare, it's definitely worth it.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2014-04-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'App6bhWj1YOsgwUieAE35Q', 'review_id': 'djF9NPoz3mLVt3Y0grSP3g', 'text': "This is my favorite Southeast Asian restaurant in Madison. HS8, the Pad Ped, is amazing with squash, veggies, and your choice of protein. The sauce is creamy and if you get it spicy it is balanced nicely with coconut sauce. LS7 is another family favorite (and favorite of James Beard award-winning chef Tori Miller).  I've never been when it's not packed, so I always get carryout.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-04-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rhwyKVB-Mq_ZkZqf21EtCw', 'review_id': 'XS8YR2vsP7DOgnwi8lSZxQ', 'text': "I've been here a few times and although happy with my meals, had not been overly impressed.\n\nToday, however, I just had the best bowl of Tom Kha I have ever had. Can't wait to come back.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2014-04-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6lggD4qxVQV5gefn4I4jMg', 'review_id': 'ugsFgrmnZiKf-4M9hK459g', 'text': "I've been here three times and love their BBQ Pork pad thai. Their portions are pretty big and you will most likely end up taking some of it home because you can't finish it all. The downside to this place is the service isn't that great. The servers are not that friendly and it takes a long time for your food to arrive. Is it worth going? Yeah, if you're willing to wait and put up with the snobby servers.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2014-04-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'MUdI4JBeHgkil5sChUHZNA', 'review_id': '39Xv51IQjsQQayuOzvg18Q', 'text': 'Really enjoyed the food here! \nI had the Panang curry and it was perfect. Everyone in my party enjoyed their food as well. I definitely would come back here, very authentic!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-04-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'T-rg4SJ0wlc6z1yQbB8nbA', 'review_id': '2vHUI3eC-Cyw3mqRKh2wBA', 'text': '\'Twas a madhouse the night we ventured over to Ha Long Bay, but the wait wasn\'t painstakingly long (30 mins) due to how surprisingly large this restaurant is. Once seated we looked through the menu, which is honestly a novel and quite overwhelming. My eyes caught my staple of sweet and sour chicken and jumped at it. Wish I had explored something different, as my meal tasted much like that of something I\'ve had before, but that\'s my fault. \n\nFor an appetizer we ordered the Chicken Sa-Tay which comes with a small and delicious side cucumber salad, and an even more delicious peanut sauce that I think I could just guzzle for days. The chicken was also perfectly grilled.\n\nBoyfriend purchased the Pra Ram Long Song, with chicken, which was also topped, lathered and drenched with the peanut sauce. It was SO. GOOD. I may have accidentally ate all of his leftovers.\n\nService was alright. Very friendly and not overly attentive, but it was, as I\'ve said, super busy and in all actuality I\'m glad things went slow. I had the chance to actually "taste" and contemplate my appetizer and meal(s). \n\nWith such an extensive menu, I\'ll do some exploring, and I\'ll definitely return.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2014-05-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 5, 'cool': 6}, 'user_id': 'YPrGskgm9mjmwz2l_7hTuQ', 'review_id': '9D6d7YLycaiGEv2sS3cf1Q', 'text': u'Descriptive phrase: authentic-ish and de-lish East Asian eatery.\n\nHa Long Bay serves up Vietnamese, Thai, and Laotian food to the Willy St crowd (and there will be a crowd, expect waits of at least 30 minutes), and does it well. It\'s bright and airy inside, and the service was quick. I ordered the X\xe0o Rau Cai (VE3) ($9.95). I was served a mountain of chicken, broccoli, peapods, carrots, baby corn, and mushrooms, stir fried with fat and flat noodles. There are not enough "noms" in Vietnamese. The "medium" spiciness was perfectly tasty and hot. There didn\'t appear to be much of a sauce, but you could taste it with each bite. Companions\' dishes were equally delicious, from different countries on the menu.\n\nEasy 4.5 stars, but I\'ll reserve perfection for my next visit. And you can bet I\'ll be back.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2014-05-05', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'hiJQnR90oBQCgzwE83SsyQ', 'review_id': 'OLhB0sZqFrXxYtC9PdsrQA', 'text': "Be still my heart. I live a rock's throw away, so I'm here for both food and takeout on a very regular basis. I have tried a large portion of the menu, and I rarely find something I don't like. Get the AP10. It's a spring roll with a small egg roll inside. It defies logic. The dumplings are fantastic as well. There can be a wait, but then ignore your grumbling tums for an off time (3pm is great!).", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-05-05', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 8, 'cool': 3}, 'user_id': 'oFhtzLhXS1iENWoBMdWk4w', 'review_id': 'tJmZNhyRxQ5PL7e5A2Jt3w', 'text': 'I\'ll happily wait (nearly) an indefinite amount of time for a table at a great restaurant. I\'ll tolerate poor service, to an extent. I realize people get busy, get distracted, and generally have bad days. I understand all of that, within reason. But let\'s paint the scene for Ha Long Bay tonight (and quite honestly, most other nights, albeit with slight variances)...\n\n8pm, slammed busy. Zero waiting space. Loud. Cramped. Hectic. People bumping into one another; servers bumping into people. \n\nNames are given with the hope of getting a table. Hostess could care less. Grumbles something about a wait. No drinks offered while waiting, although it\'s not like they have a vast selection or offer any room to imbibe while suffering through the wait.\n\nTable becomes ready, but don\'t get your hopes up... It\'ll be another 10+ minutes before a "server" shows up. Our server on this particular night was a bearded gentleman with a chip on his shoulder that was bigger and more full than his Duck Dynasty wannabe scraggly beard could ever hope to be. \n\nHe literally slammed waters on the table and asked if we wanted anything else. I ordered a single hopalicious, while extending a smile and a sincere thank you. Nothing. Just a quick turn and departure.\n\nThat would be ok if he were on a mission to fill the requested beer. But it was another 10 minutes before he returned. He had the beer, and then asked what we wanted for food. We ordered two appetizers, which he struggled with - the notion of getting the "pork AND shrimp spring roll" apparently too much to handle... He wrapped up the order with a, "so, just appetizers?" and an eye roll upon our confirmation.\n\n20 minutes later, we had our appetizers and more attitude when we requested a refill on the beer. We never saw said server again, save for a fling of the check at us. \n\nSo... Crappy service, cramped interior, slow kitchen, and mediocre food... I will order takeout, but I\'ll be hard pressed to dine in again. It\'s just not worth the frustration.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 2, 'date': '2014-05-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': '6HaSlDY_KBYVbHdXUBrB1w', 'review_id': 'ggN_kqhCr1o-I3fc4X89Iw', 'text': "My wife and I stopped in at 7:30 on a Saturday night expecting to wait 30-45 minutes for a table. The hostess gave us a 45-minute wait time, which we gladly accepted. \n\nOne peculiar thing about Ha Long Bay is the lack of a bar or other space to enjoy drinks and appetizers while waiting for a table. The hostess counter doubles as the cashier station for the dine-in guests and steady supply of carryout customers. Had we been offered a drink, we would have gladly ordered a round to help pass the time. The interior is spacious, yet cozy, and could quite easily be modified to clean up the crowded waiting area. \n\nAs our 45-minute mark approached, there were still several people who had arrived before us that had not been seated. A table for eight was reserved and left open the entire time we were waiting, and the group actually arrived around 8:15. As it turned out, my wife knew a member of that party and they had two unfilled seats, so they were nice enough to invite us to join them. Otherwise, it might have been another 15-20 minutes before we were at a table of our own. \n\nAfter sitting with our group, service was cordial and steady, but definitely with room for improvement. We each ordered Thai Iced Teas, along with the Pan-Fried Chicken Dumplings (six per order) and the Chicken Satay (four skewers per order) as appetizers. Both dishes were flavorful and cooked perfectly, with the appropriate garnishes. \n\nThe menu here is huge, and covers at least three different asian cuisines extensively. For our entrees, we tried the Panang Chicken Curry and Xao Tham (a ginger chicken dish). The portions for both were huge, the Xao Tham could easily have been shared by two people, and the Panang was also very hearty. In terms of spiciness, the curry could have been ordered at least one notch higher (I ordered medium, but it was very tame). Like our appetizers, both entrees were cooked perfectly and comprised of high quality ingredients. \n\nThe other members of our party had a variety of different entrees (Laab, Red Curry, Green Curry) and everyone was very satisfied with their selection. \n\nThe waitress had no issue giving us separate checks upon request, and our bill for two (two appetizers, two entrees, two Thai Iced Teas) was just under $40 before tip. \n\nLong wait times seem to be consistent regardless of time of day/week, so plan on a two-hour experience from walk in through walk out, and possibly longer for a larger group. Put simply, go here with people you enjoy killing time with. \n\nHa Long Bay could make the leap from 4.25 out of 5.0 to 4.5 or even 4.75 with relative ease by sorting out the waiting area, adding a bar, and finding ways to make service easier on their own staff. The food is on the same level as Lotus of Siam in Las Vegas. We will definitely be back often, as this is easily the best Asian restaurant we've been to over our 12 years in Madison. \n\nYelp Scorecard\n\nFood: 5 \nService: 2.75 (the chaos up front really hurts them in this area)\nCost: 5\nDecor: 3.5\n\nOverall: 4.25\n\nZagat Scorecard\n\nFood: 25\nService: 15\nCost: 28\nDecor: 20\n\nOverall: 22", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2014-05-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'C97nBTuZbyh4t1HTmk59EQ', 'review_id': 'XoLDlzk2j2gdqtS-0CbXJw', 'text': 'I was pleasantly surprised to see vermicelli noodles w/o broth on their menu! It was excellent quality at an excellent price. Currently, this is my vote for best asian restaurant in Madison!\n\nI will absolutely be back to try the other menu options, most likely the Thai cuisine!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-05-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'roUx18oNTJo5kdJORgJmNA', 'review_id': 'NGlMuprJITWYbs-2ATRpyA', 'text': "This place deserves credit for developing a varied and consistently satisfying menu, but their service hasn't kept up with their rising popularity. \n\nThe menu is a step or two up from the typical Asian place - extensive and varied and pretty good in all categories.  But the past two dinners I've eaten at Ha Long Bay on busy evenings have been disappointing. We understood waiting for a table for five while several other groups were seated before us (that arrived after us). But then our server brought four entrees out and made us wait another 10 minutes for the fifth. We ate in an uncomfortably hot dining room, literally sweating over our food, while smelly vaporized oil billowed out of the kitchen. \n\nThey need to step up the quality of their service, the BTUs of their air-conditioning, and the power of their kitchen exhaust fans if I'm going to be a long-term customer.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2014-05-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': 'FKhR58dYj_MPGbAdxOHnsw', 'review_id': 'TajfZLPynm4TnUq8p3ATFw', 'text': "I was pleasantly surprised walking into Ha Long Bay. I liked everything from the ambiance to the yummy smells drifting from the kitchen. I just moved back to Madison after living near San Francisco, CA. I didn't think the Thai/Vietnamese places there could be beat...\nI was wrong!\nHa Long Bay was outstanding. I went for a birthday dinner with my family & everything was perfect. Our meals were both delicious & brought out in a timely manner. That's always a good sign with a bigger party (6 adults, 1 baby). Our server was awesome! Always had our drinks full & very friendly. I believe her name was Sandy. I'll be requesting her every time I go (I'll for sure be back soon)! When she noticed it was my Bday, she even brought me out a complementary blueberry wonton dessert. It was soooo good! :) Now that is good customer service! \nThis is one of my new Madison favorites! 5 stars :)", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-05-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XGtjj2nkvcnfxxbE98fwYQ', 'review_id': 'NdHurgYD3uYL_tVJ4uC_Mg', 'text': 'The squash curry is the best in town. Love the crab rangoons, too.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-06-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tjv6IaxVNR8ZEP_p0dbH2w', 'review_id': 'uGp1DttsfeFqYlAaTvnieQ', 'text': "I was unfortunately very dissatisfied with my visit. After having been recommended by more than one person for their Thai food, the Pad Thai and Massaman dishes were bland and lacked many key ingredients. The Pad Thai was particularly sparse lacking leeks, raddish, and especially the bean sprouts....and it isn't Pad Thai without bean sprouts.\n\nIn short, isn't worth the wait or the hype.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 2, 'date': '2014-07-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Tlsz8hiRUySKpQgjYgpvdg', 'review_id': 'OUOU2phqDhFXw2petR6DTw', 'text': '4.75 stars! Vietnamese owner who lived in Lao for sometime. Hit the lunch crowd which was not bad, but not the fastest service (but friendly). Can not talk about the rest of the menu, but do not sleep on the lao dishes...... Outstanding and very authentic. Mok gai and khao meo gai were top notch. Easily stop if in Madison.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2014-07-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'fmuzhtKZrsGKXaEm5IjX0w', 'review_id': 'et0_WqxYUO8tzgJpX7R-QA', 'text': "I solemnly swear that the food here is an extravagant trip of your tasting palette! I can't even begin describing the dishes and how delicious they are!\n\nI am a crab rangoon lover since ever...and if I were to vote for the best crab rangoon the award would go to Ha Long Bay ! The curry puffs are also delicious!\n\nThe space is cute and the Asian servers are more polite than the American ones... not in the mood of being racist, its just a fact.\n\nIs service slow? That depends on who is serving you but they got better with time for sure! Everybody is friendly and caring. Go there early! I will wait an hour to eat here any time\n\nExtremely affordable and suits everyone! Try it for yourself!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-07-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 's4OrbceWiEnJIWJerNoEgQ', 'review_id': '5fpPWO1qQT_9o_Wx4-uMBw', 'text': 'Ha Long Bay is always super busy! Try to get here at like 6 and you might be okay to get a table quickly. But they are busy for a reason! Delicious food! One of the few places I actually get take out from. \n\nMango curry. Delicious! \n\nAndrew Zimmern from Bizarre Foods America has been here. And has had the Nem Khao Tod, LS7 (under Laotioan Specialties) which is actually not bizarre and I recommend everyone to try it. The crisy rice in the dish is amazing, reminds of when you get Bi Bim Bap from a korean place and the rice is crisp at the bottom of the hot stone bowl. Well just think of the whole dish being made of that amazingness. \n\nAlso the Vietnamese Beef Stew. Full of flavor. Definitely a nice change of pace from any beef stew I make at home.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2014-07-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'em6GWyKHpHBjRZg5G9o8dQ', 'review_id': 'orkAAPmk-wMaxMMyLf-EOA', 'text': "Food was good and service was great today. \n\nTheir version of crab rangoon (yes, I know it isn't authentic, but it tastes good) is done well and I like the sweet sauce they serve on the side. I added a little of their chili paste to give it a kick.\n\nI ordered B3, Bun Tom Nuong (grilled shrimp vermicelli noodle). The greens and carrots were really fresh, exactly as I like them, and not soggy. The grilled shrimp were great and I appreciated that I didn't have to remove the ends of the tails myself as I do in most restaurants, especially when the shrimp are covered in sauce (so messy). Shrimp arrived ready to eat! \n\nI was a little surprised they wanted us to order by number, but I guess it confirms the order is right.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2014-07-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'jRoaf7utXVNwW6_SCKoHvA', 'review_id': '-fgaXu0F5hdb7nZajkOCFw', 'text': 'Excellently prepared and great service! \nI love how they have such a varied menu. I also love how they have plenty of vegetarian options, none of which suffer in quality. I especially like the Green Curry, and their pho dishes.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-07-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9SgOL43GemQjAt_kBX4aJg', 'review_id': '7LMPfYFowWY1Aq6zaWdH7g', 'text': "Fresh ingredients friendly service. I'd describe it as delicious and perfect every visit!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-07-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vu4snh5octjlThyHA0XS1Q', 'review_id': 'zmtgoADA14vzg0g0ii3WAQ', 'text': 'AP8 dumpling chicken.\nAP11 spring rolls shrimp. \nMD1 crispy egg noodle chicken.\nThen sticky rice with mango for dessert.  My wife & I had a fantastic dinner.  Alex our server was friendly & gave us excellent service.  We recommend Ha Long Bay any day!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-07-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': 'JF1d4Lh3PA-zkcnFgNpmzA', 'review_id': '5yTIcsDdZD1lbumBz_dOJQ', 'text': "The good: \n-  Best Pho, should have just stuck with that. Without the Pho, this place would be a 2/3 star for me. \n\nThe OK: \n- Shrimp spring rolls are good. \n- The service was decent, considering how busy they were (could probably stand to hire another server though). \n\nThe bad:\n- The Tom Yum is amazing the first few bites, very distinct flavor. But the taste gets old fast, and might leave you with a bit of a tummy ache.\n- Expect long waits and crammed, loud ambiance.\n- The menu is the size of a book. Take a look at it ahead of time if you can- and a lot of things look delicious, so decisions are hard to make! In my personal opinion, the menu can be done a lot better: get rid of some things, and simplify (if all dishes are the same but vary in only one ingredient, list the ingredient as an option, don't list them as separate dishes) \n\nP.S. Yes you can order for pick up!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2014-07-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '3NBQkob-vrBwQTusFR3n6g', 'review_id': 'SZoG-scEsCbq_F85rYRKEg', 'text': 'The best Thai food around, for sure! Always clean, cool atmosphere, always good service, GREAT FOOD. Try the pra ram long song- I get it every time now. The papaya salad is also amazing! Expect a wait if you plan on going during a weekend evening.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-07-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 4}, 'user_id': 'wE7kSbc96IIXpQxJgLrGMQ', 'review_id': 'WJWHaV8mAo8p-XHyGGtUBw', 'text': "Best thing to happen so far on this *challenging* day.\n\nI stopped for a late lunch at 3:30 pm, the place was very quiet, about one quarter filled with diners. No music playing, just window light filtering in through the filmy lime green drapes, soothing, dim, peaceful. Just what I needed.\n\nPleasant, fast seating for one, in the window, great for Willy St. people watching. (Including a friend who was kissing his girlfriend, and never saw me on the other side of the glass).\n\nMy order was taken quickly and cheerfully, and my Thai iced tea arrived immediately.\n\nFood: hot and sour soup and spring rolls, arrived together within ten minutes of ordering. The rice paper wrappers were very thin, ingredients inside were plentiful, very fresh and crispy. Peanut dipping sauce was mild, so I added Sriracha and soy sauce, ate it all. Yummy!\n\nSoup was thick, tangy, very spicy, full of bamboo shoots, carrots, mushrooms and Napa cabbage. The heat was balanced perfectly by cool sweet creamy Thai iced tea.\n\nThe bill was $10 and change. \n\nThe only fly in the ointment was the fly buzzing my food. But it's the height of summer, ish will happen.\n\nStill five stars :-)", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-08-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'XHuEbGrgPEhnBRjRUdcSgg', 'review_id': 'dVVwQ8RdQF4ypE8bWMtHbw', 'text': "So after a year hiatus due to the unfortunate experience we had, my wife and I started going back to Ha Long Bay.  Usually willpower for me would say otherwise, but the food here is just too good.  \n\nFortunately the service, while still agonizingly slow, has improved.  The waitstaff is much more pleasant to deal with, they've hired some new faces and everyone seems polite.  \n\nSo I'm upping them back to 4 stars, because simply put, they still have the best Asian cuisine in town and no one else really comes close.  During my hiatus I had a chance to try Bandung and Lao Laan-Xang, both of which are pretty good in their own right, but nothing in Madison IMO tops the Ha Long.  If you haven't been, hopefully you will make this an immediate life choice.  You won't regret it.\n\nJust do not plan to be anywhere right after. . .", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2014-08-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'vcxz-rMLaxOiTa4crHK6KA', 'review_id': 'M5eJgjfOFtjG86Pb23eHRw', 'text': 'I went with my family for dinner and got the Pork Wonton Egg Noodles. They came in a large bowl with lots of broth and some thai basil on the side to add to taste(I added all of it). The positives were the broth was excellent, full of flavor and boosted further when you add the thai basil. Second the "Wontons" although more like pot stickers were flavorful just as much as the broth. Lastly the egg noodles were cooked perfectly providing a good base for the rest of the components. My cons were the temperature and how hard it was to eat all the components of the dish together. I will say they when I did manage to get a piece of wonton with the noodles and the broth it was fantastic. In the end separately everything was good just hard to eat together as one bite.\n\nP.S. The dish I described is also available with chicken or shrimp as the protein.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2014-08-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'raS7K8PsKjkoLULKggfPuQ', 'review_id': 'FsDHqvCCDsYZi2mBq6Xzug', 'text': 'Nice food and nice ambience! Great place for vegetarians with many options to order from! Staff is friendly! Green curry is really nice!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2014-08-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'TbrTV-oYi-jYXMgAWZoEQg', 'review_id': 'aNipYvHOLofLo_fTgWY7XQ', 'text': "Ha Long Bay Rocks! Did the carry out tonight. Musamun Curry with Beef, Squash Curry with Chicken, and pan fried dumplings (chicken). Everything is a hit. I've never had a bad meal at Ha Long Bay. Squash Curry is by far my favorite item on the menu. The dumplings are actually made in house. The dipping sauce is a rich soy based sauce. I've been know to sip it off a spoon.  \n\nFrom my perspective Ha Long Bay has the best curries in Madison. OK, I'll say it - best Squash Curry in North America. I order it medium spicy and like it with a splash of soy sauce and a few dots of so sriracha sauce. The curry itself if silky, the squash tender with a rich flavorful sense of heat. You get to choose your protein on the curries, tofu, chicken, beef or I believe shrimp. \n\nThe menu is gigantic... Make your life simple, just go to the curry page and pick one out. \n\nOh you say you don't like curry... It's because you haven't had the Squash Curry at Ha Long Bay. \n\nEat local... Explore local eats when visiting Madison or anyplace else!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-08-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '3RUUvhJ9suizJxyVpkrQYg', 'review_id': 'YbTJgsz0-4KHcnILH_FMWQ', 'text': 'My rating is totally based on the service and not the food. Food is fine here but I had  terrible overall experience which ruined the good part too. They made me wait for over 40 minutes (after saying that waiting time is only 10 minutes). Besides, they seated other people who came after me. After I got seated, they took another 10 minutes to take the order. I know this is a very popular place, there is a lot of waiting usually. But they need to make sure that they are attending customers in order and with priority. I went with high expectation but came out with this review.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 2, 'date': '2014-08-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wBiYIDzNhvS1Emue2dMfMw', 'review_id': 'iAPfg6W-_QnT3Gav_sACBg', 'text': "Ha long bay is a pretty decent restaurant. I only tried the triple delight curry, and my girlfriend had the vermecilli noodle. The curry was extra watery, but the noodles were good. The Thai iced teas were also very delicious but was filled with a lot of ice, so if you're ordering a drink ask for less ice. They also charge extra for bowl of rice which I thought was weird, but I'm from chicago so idk.\n\nThe service was good, it was pretty busy so we had to wait 20 minutes for a table. There were flies by our table and there was no a/c which kinda sucks.\n\nThere is free street parking, and you might want to get a reservation if you don't want to wait.\n\nIt's a pretty nice place with some decent food if you don't mind the wait and the slightly overpriced items.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2014-08-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-4XngkRlxU_E1XFhclDHww', 'review_id': '8twrmMlpyiVOLo7Cqerq2w', 'text': "I am so glad I gave this place another try. I went here when it first opened thinking that finally I did not have to trek all the way to the West side for decent pho and vietnamese food, but I was disappointed. Now years later, they have definitely improved on their services and of course food. \n\nPho here is pretty good. It's not amazing, but it's pretty darn close, so save your gas and East siders there is a reliable place to get your vietnamese fix. Their prices haven't changed much in the past couple of years and they offer a variety of dishes. Go before 7 pm, otherwise there is bound to be a line!  \n\nIf you're going to get Vietnamese food, you always get the pho. If you're not a soup person their Bun combination is excellent. Any of their rice dishes also won't disappoint and of course can't forget the Bahn Xeo, Vietnamese crepes with shrimp.\n\nTheir thai dishes are good, again not great. There are better places (nearby) with excellent curry but for a Vietnamese-Thai restaurant this place shall be darn good enough.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2014-08-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'Azs2WnrEAVqTikVB2D3WmA', 'review_id': '4-tF9rhrWD5bGXwj6qSEzw', 'text': "The more I try from the menu, the more I'm disappointed. Also, why the heck is the menu so big? Gordon Ramsay would not approve.\n\nWhile I stand by their pho, I haven't had anything else that I'd recommend. The food here is like slightly upscale Asian cuisine. The menu is trying to please too many people, and really should be more focused.\n\nI have ordered the pho probably a dozen times (usually the chicken) and it's always been good. A good simple dish, and a generous portion. But the last several meals I have tried (snapper in some sort of ginger sauce, lemongrass chicken) were seriously lacking and reminded me of cheap Chinese food. And that plate of snapper was around $20, which seemed like a poor value. A beef curry was also underwhelming, but not terrible. All of the sauces taste heavily of salad dressing or corn syrup.\n\nThe restaurant space is fairly cramped and extremely loud, so much so that I had to yell my order to the waitress. Conversation is difficult if you plan on dining in.\n\nService is usually good, with polite and attentive staff. They have a small but decent selection of bottled beer, and a few decent wines.\n\nOverall this is just an okay place, and I've only enjoyed the pho.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2014-09-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jyH7PP2lfHZ4vla8UD3LYw', 'review_id': 'WcKIZpcaWADznGeg32_EIQ', 'text': 'Best pad Thai. Okay pho tai. Best curries you will get in town. Usually packed, be prepared to wait', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-09-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'NhaU_pnuMQgETVQVEknFtA', 'review_id': 'Z3w9lIOGi4F9GEGUOmQ7LA', 'text': 'My favorite restaurant in Madison!  Huge selection (the menu is like a book), great vegan options, giant soup bowls, good prices and friendly staff.\n\nI highly recommend the veggie curry puffs appetizer! And anything with their house sesame sauce. I get the tofu or the eggplant, but really it is just the sauce that is so amazing. I have had other really good tofu and vegetable dishes here, but I keep coming back to the sesame sauce! \n\n(Also, they have alcoholic ginger ale and that makes me happy!)', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-09-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Fwpxxjt67ZwiB0FPbSkTWA', 'review_id': 'oVlle9m9BQ8aN67v040ysA', 'text': 'Enjoyed both the peanut curry and pad see eww. Best thai and Laotian food in Madison.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-09-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1oXsV_I0TeschDfjM3Mr5A', 'review_id': 'uekdyYB39g2OOoU5bs5maQ', 'text': "Did carry out a couple weeks ago. The curry puffs are so good. Have them every single time I go or get take out. The Tofu Panang Curry is one of my favorite dishes as well as the veggie combo (V1). The only minor thing wrong is how inconsistent HLB is with spicing things up. I know they only have a 1-4 star spice scale, but when asking for 5 or higher, I wish they would spice it up. Only a handful of times has my food been just the right amount of heat. The menu has a ton of items to pick from and it's a bit overwhelming and when I've ventured from the 2 things I normally get, I've not really been that happy with my choices. Once a year or two ago my husband asked for the Mun Duck Green Curry (fake/mock duck) and was given real duck. I think they made the mistake because they were so busy on a Friday night and we had to drive all the back to HLB from Middleton and were given a free order of curry puffs to make up for the mistake. Other than that huge error, our orders have been spot on minus my need to have food hotter than the sun (which if you dine in and get the owner he actually brought extra crushed chilies to me which was perfect).\n\nThe best time to eat at HLB is before 6 during the week. The weekends is just always busy. It's worth the wait", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2014-09-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fj_7h9vkO-IDm5-wOdb2tw', 'review_id': '1XfYTdvJw0G8A-7xMnVgrw', 'text': 'Ha Long Bay is my favorite restaurant in Madison!  The only negative is deciding which dish to order since they have so many good ones.  A few highlights:\n- Squash Curry is to die for.  It\'s hearty and flavorful.  A visiting friend described it as "Thai comfort food."\n- Shrimp Summer Rolls.  These are a fresh and delicious appetizer. \n- Chicken Dumplings. You can tell these are homemade and not frozen dumplings like a lot fo restaurants. You can get them steamed or fried. Yum!\n- Pho.  I personally like the shrimp pho since I don\'t eat a ton of red meat.\n- If you\'re looking for a noodle dish, the Pad Thai and Pad See Eiw are also good bets.  The serving is very generous so you\'ll go home with leftovers.\n\nThe line is usually out the door on weekends so expect a wait if you\'re going on a Thursday, Friday, or Saturday evening.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-09-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ieY7JCl8Dwefl6rtMw1eDg', 'review_id': 'RFWATUXDO4WaA-drxHYYMg', 'text': "Best Thai food in town. I always order the TN3 pad See-Eew with chicken. I also love their veggie puffs. The place is always stacked but it's worth the wait.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-09-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wE7kSbc96IIXpQxJgLrGMQ', 'review_id': '87wsesIB7tf6bI3W_qauAw', 'text': "Ha Long Bay continues to be a standout favorite. Daughter and I had a great dinner here Thursday night as a sendoff before she left for two weeks traveling around the UK.\nThe food is uniformly great here every time, but the wait can be interminable, historically. We went in expecting this and didn't have a problem with it, as we knew we would fill the time by chatting up a storm.\nAmazingly, even though it was super busy, we got seated right away, were served drinks quickly, and got our food in a normal amount of time. We were almost disappointed! Haha\nThe service was friendly as well, and l just love this place more and more. A true jewel of the east side.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-09-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JXY8_CtaN1XxmsxqQKd-aA', 'review_id': 'gyLAIG373YW7aCXU6mzvoA', 'text': 'My go to to-go. Their squash curry is the stuff of dreams. Though I have a hard time ordering anything but their curries, I have tried the other menu options ordered by my companions and they are consistently delicious. Even things as simple as chicken with vermicelli are flavorful and satisfying. \nUsually delivery wins out in life for the convenience factor. This is never true here. When I crave Ha Long Bay, nothing else will cut it.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-09-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'U9StnOIApiMR8c5uuq3epg', 'review_id': 'l1y5iv-kRfkiF0aq8ddY7g', 'text': 'My favorite Thai restaurant in Madison. All of their appetizers and soups are delicious. The wait staff is super nice. You also get a ton of food meaning leftovers for a few days.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2014-09-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '2R3JZOKpzQJxeu-mpHWG4g', 'review_id': '3URdbI6p61Qb5Xqagp0mzA', 'text': "Ha Long Bay doesn't take reservations for parties of less than 5. I ordered their pad see ewe, which was really really good. My friend ordered the pad thai and was very pleased. We also got the curry puffs as an appetizer. Those were just okay. This is really good thai food, but expect a wait if you want to sit down. Service was quick and friendly once we were seated!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2014-10-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'a4AWrP06zV6A_RjSb0a2iQ', 'review_id': '-AhEXXVZaJNim1Nkbd7qWQ', 'text': "This is by far my favorite southeastern Asian food in madison.  The big menu can be a bit overwhelming, but that means TONS of choices. They can pretty much make any dish GF, which is good for my wife. Atmosphere isn't the greatest, but who cares the food makes up for it. \n\nThis last visit I had the wonton soup...The broth is GREAT. Along with a noodle dish that I can't remember the name of. \n\nEnjoy!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-10-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'fJCwWvdZvvIC9f-K8QaosA', 'review_id': 'U9qGv1XHK3W8bQzKrDjcjQ', 'text': "Ah I love this place! Best pad thai in Madison hands down. I have only had the pad thai and pho, not too adventurous I know but I crave both fairly often and they are the best here of what I've tried in Madison so far. The menu is pretty extensive though so there are a lot of options for those who aren't creatures of habit like myself.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-10-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'aLWigN8C1cGNk20cQkgPZg', 'review_id': '1Hv8nlFJbt2fx9odwYGLKA', 'text': "The outside of this restaurant doesn't look like much, but the inside is much larger.  The service was friendly and fast.  The prices are very affordable and the food is too notch.  \n\nMy wife and I travel all over the U.S. eating at different Thai restaurants, this one is at the top of our long list:-)", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-10-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_ssxKNLZjMR4EinFpUWQsw', 'review_id': '7nAnvPniJfeWa0OKcYKK7Q', 'text': 'Ginger chicken was stellar and they make very good Pad Thai.  Service was fairly good for the degree to which it was crowded, and it was very crowded.  Waited 20 minutes and it looked like the wait list only got longer.  But it was well worth it!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2014-10-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'OblWNAEosUR2k3udPxCq5A', 'review_id': 'nHBFchKYsaYG2-QJCxA1IA', 'text': 'Best pho I can find in Madison. Also delicious Thai food as well. Penang curry is one of my faves.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2014-10-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'bfN6IGiS3n5EHQ0rs-7MHw', 'review_id': 'p30SaMErg6_5XLv3QkeSJw', 'text': 'It\'s usually very busy and it sometimes takes a little time to get your food. That\'s the only negatives. The positives? The staff is very friendly, and the food is amazing. Very reasonable pricing, this is simply the best Thai / Vietnamese food I\'ve ever had in a restaurant. I love restaurants like this that allow you to choose spiciness level as well, because I love spicy food. A "4" is noticeably spicy, a "5" might be too much for some. Overall I really can\'t say I\'ve ever had something here that wasn\'t delicious. The menu is huge too. Highly recommend this establishment.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-11-02', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 8, 'cool': 7}, 'user_id': 'fFmLNPsvu-mT0ewk-sG37w', 'review_id': 'I3i8adz7bUTdLxeApDuaDw', 'text': "The squash curry at Ha Long Bay is delightful. \n\nOnce you've had a taste of this red curry sauce, there's no turning back. It's been known to convert non-curry fans into true curry addicts. This is truly a feel-good dish that's packed with flavors that will warm the soul. The gentle medley of spices will have you hooked at first bite and will leave you craving that flavor like no other. \n\nWithin the curry is a great blend of zucchini, Thai eggplant, bamboo, basil and, of course, squash. Ha Long Bay incorporates both acorn and butternut squash into this dish, and these components are the star of the show. They retain their lovely flavor while also absorbing a good amount of the spices from the curry, which makes for a hearty yet healthy meal. \n\nAddicts beware.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-11-05', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'tOS1MVVagkPxR-fiodhjXw', 'review_id': 'XBHlcdZkR3urf_0OejLXbA', 'text': 'Excellent food.  Excellent service.  This is one of the best restaurants Madison has.  Go there now.  Quit reading my review and leave.  Order anything.  Why are you still reading?  You could be eating tasty Thai food by now!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-11-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '_7cdtHgS1g0dtYjdpXIB0w', 'review_id': 'MNzz0SpGnzEWbzuDdBYkLQ', 'text': 'I read a ton of reviews on yelp, went there, and ordered almost all the dishes that were recommended on yelp. The taste was pretty good. I tried squash curry, mango curry, pad thai, spring rolls, fried rolls, Nem khao tod, Vietnamese crepe (only served in the weekend), all kinds of pho, Coconut sticky rice with mango and ice cream... OMG, I have such a big stomach. It must be a pig who is writing this review, lol Oh btw, chai iced tea is also worth trying. In one word, you can try anything you can find on the menu. I promise it will not fail you. It has a reason to be this POPULAR.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-11-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'NvGn_ap3I1jWcPyz9rNXJw', 'review_id': '8-4WRZQClFG9OesujLXvxw', 'text': 'Loved the green curry.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-11-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ehh697zs5Ao_RAGjdudA6Q', 'review_id': '7bJshieHhPyBGoQXSi9MCg', 'text': "First time visit. Small interesting space, Buddhist decor, statues. So cool to be in. Server was friendly. Menu is large. I settled on TC 2, a vegan coconut milk based curry with peanut sauce, veggies, potato, rice. It was huge bowls of food. Didn't run out of potato it was plentiful. It was incredible. I had to slow down! \nEager to go back and try more dishes. For vegans they all have a tofu option. The little apple candy at the end was a nice touch. The curry has a aftertaste.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-11-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'vxN-cUGzeUkcWWMHRoWRuQ', 'review_id': 'M3HMYdD3Rtn6XfOAID3mdg', 'text': "We LOVE this place. Our favorite take out joint in town!  Although it often takes a while to get someone's attention, the food is definitely worth the wait! \n\nThe food is delicious, we especially like the Pad Thai, the spring rolls and curry puffs. \n\nWe have eaten in a couple times but it is busy and loud.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-11-28', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'oYTLoecDJ5MknYYmJEStMA', 'review_id': '0mUzfqhhRrpcnz4mqqUSOQ', 'text': 'I have been to Ha Long Bay a couple of times now, and have yet to taste anything that is not absolutely delicious. I could probably eat their chicken dumplings and pad thai daily. This place is always super busy, even on a random Sunday at 2 pm. Which brings me to the only downside- the slow service. Everyone has always been polite, but last time I was there we waited a good 10-15 minutes before our server even took our drink order. Worth the wait, but plan to be there for an hour plus!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2014-12-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'vxN-cUGzeUkcWWMHRoWRuQ', 'review_id': 'Ssboy9xWQMEW8YJzyIFktg', 'text': "We LOVE this place. Our favorite take out joint in town!  Although it often takes a while to get someone's attention, the food is definitely worth the wait! \n\nThe food is delicious, we especially like the Pad Thai, the spring rolls and curry puffs. \n\nWe have eaten in a couple times but it is busy and loud, we prefer to take out.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-12-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': '-ZSPer3Fb79GxWLUIq7Dfw', 'review_id': '0_xFSTxu3onr0BrOzAgaaA', 'text': 'How do they do SO MANY THINGS WELL?! Usually I hate places with menus as big as Ha Long, but I have never had anything bad there. They somehow perfect most things. \n\nIt is usually busy so you have to plan ahead. The service is usually good, however, and the food is always on point.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2014-12-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1oXsV_I0TeschDfjM3Mr5A', 'review_id': 'CNudM5U1Q0ktvokC536uXQ', 'text': "So an update. It seems HLB is so random with their service. Usually they are spot on, but lately especially last weekend they were so missing, I'm questioning whether or not I want to come back. Sure the curry puffs are amazing....but I know I can make these at home.  \n\nFriday night, we ordered take out. Was told to pick up at 6:30pm. Get there at 6:30pm. Tell them we are picking up food. The hostess proceeds to ignore us for 30-40 minutes while our food is sitting there packed up and ready to go. \n\nSunday, ok busy because of graduation...was told 20-25 mins to wait for a 6 top. Ok. The people who arrived after us with a 5 top were seated before us and another party of 6-7 that arrived after us were also seated before us. The guy admitted he screwed up, but no apologies were made. \n\nAgain when ordering 4 stars, I always have to ask for extra peppers...I would expect 4 stars to be really hot, but alas its just not.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2014-12-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tM8IOve6M50DcgD64Ujfiw', 'review_id': 'fTS4Tyzf3kK4nGRZeIpMBQ', 'text': 'It took a long time to get seated and to get our food, but given that it was a busy NYE it was understandable. Everything else was great! The Khao pad karee was delicious, the prices were good, and the service was friendly and attentive. They have a wonderful variety of Thai, Lao, and Vietnamese cuisine available.  I look forward to coming back.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-01-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'xfN02Zn9Bfp73k6CAvNWZg', 'review_id': 'gPIHko_rljeS_no5RS0cAg', 'text': "This place is pretty poppin, quite busy on a Friday night.\n\nI've gotten the Squash Curry with chicken. It's amazing, I super recommend it.\n\nThe Pad Thai is pretty solid, and the portion size is ridiculously huge.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2015-01-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PXpBlEk-Hg7hPMWTUZh8qw', 'review_id': 'PxafPADUxNBplOu5Lz6sVw', 'text': "Finally, a great Thai restaurant in Madison! I've tried a few others around town and was disappointed in either the lack of flavor or the excessive heat (spice) that detracts from the food. I found neither of those things at this restaurant. It is a busy place, but with a cozy atmosphere and exceptional wait staff. The food is delicious and the portions extremely generous. Why not 5 stars? I'm a green curry fanatic, and though their's is very good, it wasn't the best I've had. If they had nailed that, it would be 5 stars all the way! Don't miss this place, it's worth it!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2015-01-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'igKmn3knj6QbhobkIH25RA', 'review_id': 'SNZn0vtoHk8cn3BKe7doLg', 'text': "Foods great.  Best Vietnamese food in town.  That's the problem.  Called on a Friday evening and could not connect with the restaurant from 5:45-7:45.  Busy signal.  Finally gave up and ordered Laotian food.  Although Ha Long Bay has great food, if you Can't order the food then who cares. Bad way to do business.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2015-01-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ocUayw1Ih7W_mHSR1RDdGA', 'review_id': 'AzBV0b1tmDXbtVfpb5WT6Q', 'text': "Everything on the menu is delicious, and they're consistent on quality of prep. I'm so happy they put up with so many takeout orders from me.\n\nThey're also careful about labeling and putting together vegan orders.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-02-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'k634P9tDy-q0Q0jdePmwKA', 'review_id': 'Tw_ZKr4_h_z2PhZ_s18k_g', 'text': "I don't quite get the hype about this restaurant. I really wanted to love it but it is just sub-par. I've been here over 10 times and never have had something I've loved (I go with friends who are a fan). The first thing I try at thai restaurants are usually curry. Theirs is too thin and grainy for me. Bahn Thai has much better curry. Their stir-fry dishes are undercooked and too salty or too sweet. The Pad See Ew is okay, but the noodles are too soft and not caramelized properly. Their Pho is pretty good. If I go, this is what I usually end up ordering. Their fried rice dishes are also alright. \n\nNevertheless, this place is insanely popular. There are usually long waits and it takes quite a while to get your food. If it were good food, I'd say the noise, the wait, and the crowdedness is all worth it but I honestly believe there are more under-rated and better quality restaurants on Willy Street (Bahn Thai, Monsoon Siam).", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2015-02-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wyEbMgKtH9cVc8XjyKauPg', 'review_id': '83iDkSxG1IDAni5tOb43IA', 'text': 'Was a little scared to try food that was out of my norm, but this place is amazing and has food for every kind of palate. You have to park on the street, which is a little inconvenient, but the food is well worth it.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-02-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ME7BOK4LNk-hFmIUPkrwGw', 'review_id': 'Dsu6LsUVroCDzMIMX5pJcg', 'text': "Ha long bay needs to work on the service. The wait time (from waiting to be seated) until the food comes is longer than one hour!!!\nLast night was the worst experience that I ever had in Ha Long Bay. While it was not weekends, this place was full and had a long line of queue. Okay, this is a good thing. The bad thing was that our waitress seemed to forget our order, which took him more than one hour to bring our food (note that I paid attention to other customers coming much later than us and they had the food earlier than us). I complained to the waitress by telling him politely that it took more than one hour for our food to come. He said sorry but that was it. He did not seem to care. He never had come back to refill our glasses. He never came back to even ask how our food was. Really? I am really sorry to say this but he needs to work on his attitude. \nI know this place has become a hit these days, but it doesn't mean they can treat their loyal customers for granted. \nI am so disappointed.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 2, 'date': '2015-02-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'rj98ZLijdmoq6XdW_oodJQ', 'review_id': 'SkDC8ROwC7PJpRY8RyLpwA', 'text': 'Some of the best Bun I have had in the Midwest. The spices and herbs were very fresh, and the fish sauce was the perfect sweet and sour blend. I ordered B5, aka Vermicelli bowl with shrimp and egg roll. I liked how they took the tails off of the shrimp and chopped all of the ingredients into bite size pieces rather than making me bite them all off. \n\nFor $10, I was genuinely pleased with both the quality and quantity of the entree. I did go in with moderate to low expectations though, so perhaps that is causing me to overrate the restaurant. Nonetheless, the prices are reasonable, the interior of the restaurant is cozy, and most importantly, the food is delicious and worthy of a return visit.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-02-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pG-aH8Xpl68tAUKieLcgOQ', 'review_id': 'kN0mtKZV3m_ajAMu4I3khQ', 'text': "Went this past Saturday which was also Valentine's Day. Very packed. However the wait was well worth it. Thirty minutes easily turned into an hour and a half. \n\nThe boy and I were famished by the time we got our table so we ordered two appetizers; the tofu pan fried dumplings and the chicken spring rolls. The dumplings were ok. The chicken spring rolls were phenomenal. I have never had such flavorful, tasty spring rolls from a restaurant before. I also loved the home made dipping sauce that came with them. And the spring rolls were a great value at two for 2.50. I also tried the Thai iced coffee. It was pretty good as well but you can't really mess that up. \n\nNow for the entrees. The boy ordered the chicken egg noodles birds nest and I ordered the chicken squash curry. Both dishes were amazing. We were both glad that this place was not stingy with their chicken by using more veggies. \n\nOur whole meal (two appetizers, one iced coffee, two entrees) came to 32.50. Back home that total is unheard of for such great quality for food. But, if they ever did raise their prices I'd definitely be back; as long as the food quality did not go down. \n\nOne side note: with the popularity of this restaurant I'm surprised that they have not added on to it (second floor) or added another location. I'm sure either or both would be beneficial to the owners and patrons.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-02-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'R4CadutvXS31EkRr46TpDQ', 'review_id': 'xb3YXfKNpKgjbdiF_2C7hA', 'text': "This was a wonderful restaurant and we had a great meal here.  This place is constantly packed, so if you can, make a reservation.\n\nI had the squash curray with chicken.  The flavor was great, as was the texture.\n\nWhy only 4 stars?  My wife's pad thai was nothing more than average.  And there were different prices on different menus around the table.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2015-02-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4kQdU4lEg4KpSwuEkpp8PA', 'review_id': 'CDoX5DMlVMpvFA_2HLhr_g', 'text': 'Our family LOVES Ha Long Bay!  There is usually a wait, and it gets crowded, but the food is delicious.\n\nThe one thing I wish they would change is to put an infant changing table in the bathroom.  This casual restaurant is otherwise very family-friendly, that little change would make a huge difference for the families who dine here.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2015-03-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Kp6yJ7IqlvPrtKSb8taYSw', 'review_id': 'DQlYwanVj1FAVKC_ghN0CA', 'text': "One of my favorite Asian restaurants. Every time I'm in Madison I go here. Service is fast, good, and polite and the food is amazing. Great selection of dishes and very reasonably priced. The guava candies after dinner is a nice touch. I've been here probably a hundred times and never had a bad experience. HIGHLY RECOMMEND!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-03-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'kT8C-5y3tkYsQGsoFLvfYQ', 'review_id': 'aC7Tw3KwFFQ92vR8dTK6ZA', 'text': 'After reading the accolades about the squash curry, I had to check this place out.  I love squash.  I love curry.  Nuff said.  \n\nI was charmed by the black booths, sundry plants, high ceilings, and random decor.  Not so much the lighting, which is warm over the tables and cool from the ceilings--which creates a strange effect.  \n\nMy server was dear and everything clean and prompt.  I\'m just not so sold on the ... curry.  The flavor was good, and the moments the warm tones contrasted with the acidic basil leaves were great.  But the squash and zucchini were both a bit overcooked, and the tofu had a strange aftertaste.  I\'m also not entirely clear on what makes it "squash curry."  Like many curries, it contains a medley of vegetables, among which there is some squash.  \n\nAnyhow, it was a solid meal for $9.50.  I don\'t regret it, but won\'t necessarily repeat it.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2015-03-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zZB-pnKbVr2a-fABvPeSYA', 'review_id': 'uQ4_fNz_z3yvIDp88tH8Xg', 'text': "I really enjoy dining here except when there's a long line waiting to be seated. Here's a great tip. Reserve and order your food ahead of time, and you'll be sure to get your food shortly after being seated. Otherwise another down side to service here is that it sometimes takes up to a half hour before you get your food.  Otherwise I love the food and the waitstaff is really nice.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2015-03-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qYLKkWhzAU5kb0DbZs0dmw', 'review_id': 'VFYVW-a4JpiEjr6uNFOerA', 'text': 'Excellent pho, fried dumplings to die for and the Tom yum was yummy! Very slow service.  Very good food.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2015-03-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Lao_dTR_7Y5w_40cU1xxKg', 'review_id': 'jn8r-T1J0f-PLKw3i4sTTA', 'text': "I came here on a whim because I was in the mood for some sort of Asian food (and I wasn't picky on what kind of Asian food it was). I stumbled onto this place after doing a search on yelp & it had fairly good reviews and from the pictures, the food looked good.\n\nI ordered the wonton soup and pad see ew. The wonton soup came out fairly quickly and it was delicious. It was some of the best wonton soup I've ever had. The pad see ew then came out soon after and it was good (You were able to pick how spicy you want it). From what I've had before - which was salty and too much sauce - this was extremely good. I would highly recommend the pad see ew. \n\nWould I come here again? Absolutely! I would even bring my friends here too.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-03-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ytGoTosYw6CRHJ2FnUg82A', 'review_id': 'isJVCUXJh41eAfabPHGgGQ', 'text': "We came around 5:30 pm so there was no wait. It took our waiter good 10 min to get our order even tho it wasn't busy yet. I ordered Tum yum soup and squash cury with spice level at 4 (which wasn't spicy at all). Food was delicious and the portions were pretty big, good for sharing. Definitly a good place if you are looking for good Thai food.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2015-03-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GTCuW3TaSAYAWMcjgrw1qw', 'review_id': 'wA-fLo9dzbe-tGtx_rI2Og', 'text': u"Thai is my comfort food, and Ha Long Bay is so good, so this place gives me the warm fuzzies. I couldn't decide between the squash and panang curries, so our waiter suggested getting the squash, but adding peanut sauce. It was perfect. One of my companions got the pad thai, which was great, and not sickly sweet like some places, and the other got Hu Ti\xeau X\xe0o which was chewy, pan fried noodles and lots of crisp vegetables. \nThe only con we experienced was that this place is just so darn popular. We knew it would be busy, but wow, people really cram themselves in there. We waiting 45 minutes for a table around 6:30 on a Friday. We scored the only three seats in the waiting area, so we were happy campers. We were fine with the initial wait, but it also took a long time to receive our entrees, I believe close to 45 minutes placing our order. I would have been grumpy by then, but we orders appetizers (crab rangoon and spring rolls, both great) so we were ok. \nThe service was good, the wait not so good, but really none of that matters because the food is so amazing!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-03-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ofAtOISFzoMVjUe8hUerOA', 'review_id': 'HBDCFmNN-H0ETS7GDlf8DQ', 'text': 'This was my first time trying Thai cuisine in Madison. And I was really happy with the food. The squash curry was simply amazing. Their overall presentation was also good.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-04-02', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 9, 'cool': 9}, 'user_id': 'NduGDKc6hLcb1S6OtW62XQ', 'review_id': '0VEcfAj3l53OEZXmfvbMkg', 'text': "Yup, this place does it for me.\n\nI was in Madison for just a day visiting the infamous Corey D, and we were absolutely starving for lunch. We stopped in with only about 45 minutes to spare, and Ha Long Bay ended up being a really excellent choice! Thai heaven happening here (as well as Vietnamese and Laotian.)\n\nFirst of all, the menu is huge. You're going to need a good few minutes to decide what you're going to order. For the sake of time (and because it's my absolute favorite), I quickly decided on the yellow curry lunch special with a cucumber salad on the side. \n\nWhile we were waiting, there was a pair next to us that got their food extra spicy... we were coughing all the way from our table! That's really the only negative thing I have to say here... it was so, so smoky in there and my hair even smelled like curry for a while after I left. They definitely need to do something to improve ventilation! Regardless, our lunch happily went on.\n\nMy lunch was everything I wanted it to be -- the cucumber salad was excellent, and my yellow curry with chicken was perfectly spicy and full of flavor. I seriously didn't want to stop eating.\n\nWe paid our bill (which was so cheap - $16 and change for two lunch specials) and were on our way. This place is so good, and I'll be stopping in during my next visit to Madison!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2015-04-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '5rntg0FSjBFmYL9B0Ac49w', 'review_id': 'H4rTb3kEYXEomIK-eeBMBA', 'text': 'Don\'t get me wrong, there was nothing wrong with the chicken steamed dumplings or chicken pad thai I had. They were both tasty, just didn\'t blow me away as I had hoped. Of course, I understand that I probably ordered the most "watered down" options this menu had to offer, but I was traveling for work and had a serious craving for pad thai. This restaurant came highly recommended by the hotel concierge as well as my colleagues I was in town to meet. I got there at 9pm on a Wednesday and the line was out the door, seriously, out the door. That\'s a great sign. The photos on the wall were of the restaurant crew alongside Andrew Zimmerman (of bizzare foods and other notable foodcentric shows), another great sign. Hence my utter excitement to chow down on what was sure to be the world\'s best pad thai. I think that\'s where it went down a few notches. It was good, not the best in the world; but again, I completely take responsibility for the fact that my order was lame.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2015-04-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 4}, 'user_id': 'wXhyvL4skq8kEvu11LAKFw', 'review_id': 'ZfPSnrZSnGiZOlBiveei0A', 'text': "Average of four stars?\n\nAll of you are insane. The food here is amazing. I've never had to wait too long, but I also don't expect popular restaurants to instantly have a table for me no matter when I show up so maybe that's just me.\n\nTry the curry puffs.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-04-10', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'DN4DLNVadDiHhFJhWBU3Sg', 'review_id': '9p-cCBw0JdccpbaDGCP0zA', 'text': 'Food is always good but:\nHow and why we should wait over 35 min to get food????\nNot accepted at all', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 2, 'date': '2015-04-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'pFaxS9urbidOonVfr3Ss_Q', 'review_id': 'hSexki8kw05mZ1YFf7MiNw', 'text': "It's my second time here and it never let me down. Very reasonable prices and tasty food. I love papaya salad (spicy), all kinds of curry dishes and Tom yum soups.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-04-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'eaNinyxWWZpTHLbQqdO9hA', 'review_id': '-dtI6pH6ECGLyUU-PdCdZg', 'text': 'The HS5 is amazing. Food was a little slow getting to us but it was very busy. Good prices and great servers.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2015-04-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Wgdh2bMt8PeH5H0L8PJ5ag', 'review_id': 'rPL1PEz8GkFsOQ5ZrYcpbQ', 'text': "I read the reviews on this place and I had to try it. The place was packed for lunch and everything smelled great. We started with cucumber salad and veggie curry puffs, both were excellent. My husband loves Pho and was pleasantly surprised that there are several options to choose from. I had pad thai with shrimp extra spicy, I think this was the best pad thai I've had in Madison. The service was a little touchy because it was so busy. All in all I great experience.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2015-05-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'C1ctun7gnlFeGsTtdBnXdg', 'review_id': 'qp5W2LFUCyRtom-ZK_yjvg', 'text': "Food is very good. The reason I'm giving it three stars would be the service. I have waited for a long time just to get my drink order taken several times. I tried to understand that there was a lot of people a few times but then I went when there was not many customers at all and it still took forever for someone to come by our table. Other than very slow service it's a place with pretty good food.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2015-05-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wlSXRXas_NX8xsCaCwRMTQ', 'review_id': 'FmapbnIDFjX_4xjtsjTZfw', 'text': 'Never had a bad experience in this restaurant.... my personal favorite is Red Curry Fried Rice. A great place to try something new and be sure that it will taste amazing. Had viatnamese crepe and thai noodle soup and they were fantastic. Be prepared  to wait though.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-05-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'n3JgptL1ing6EQK4J87x6g', 'review_id': 'z5bCMtJ24WMo1eDwkvG3Fg', 'text': 'Always a little busy. But great food overall. \n\nTry the whole red snapper. The steamed wontons are also great as an appetizer.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2015-05-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 5}, 'user_id': 'Nhl1aq_Ucvv0nXysCMwJsA', 'review_id': 'vDLJGmsRz-QPF6tkumwjPQ', 'text': 'PROS: Delicious Thai cuisine, great value, good service, open on Sundays!\nCONS: Long waiting times\n\nYou can tell that the food here is tasty by the sheer amount of people overflowing from the restaurant. The menu features an enormous selection of seemingly authentic Thai and Vietnamese dishes, from which you may have a difficult time picking, unless you enter knowing approximately what you want. I ended up defaulting to my usual Pad See Ew, which is almost always a safe bet at Thai restaurants, and it was great! There were plenty of vegetables -- something that many Asian restaurants choose to forget in their offerings. The waiting times were long (20 minutes to sit + 20 minutes post-ordering) but quite worth it!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-05-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rhI6PgXDXwBmAjOzjbUvcg', 'review_id': 'K1_9CNW30O4HAtKX1Swlew', 'text': 'Ha Long (do you have to wait for a table?) lives up to the reviews: excellent fare. The wait on our recent visit was in excess of 90 minutes; we were told 20 when we arrived. \n\nAsk your server if you are overwhelmed by the tantalizing options. Hard to go wrong.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2015-05-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Jjc-MFbHbE2if69fehM-eQ', 'review_id': '9509yPPeMtHcyphtO1Yvug', 'text': 'not so good compared with other Thai', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2015-05-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5-Y-FQN62vxLLdj4zfMJRA', 'review_id': 'hjfyn2aRO2A-fUxT9lOUMg', 'text': 'Always packed with people! Really great Tom yum noodle soup. Also tried the mango curry with mushrooms. So good~', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-05-16', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 4, 'cool': 2}, 'user_id': 'LkmcnJNBfnvaZk6MoE_k5w', 'review_id': 'kd-BaIrS6fYS9Kuo5PdjLg', 'text': "Sorry folks, no pictures because I was too busy inhaling my food. I went to HLB at the suggestion of a friend who was craving something Asian. I haven't experimented a whole lot outside of your standard Chinese takeout, so the range of cuisines they offer made a good jumping off point for trying something new. \n\nThe menu is vast and can be a lot to take in, but I eventually settled on the peanut chicken from the Thai section. I've had Thai two or three times, but have never managed to find what I tried at the last place on the next menu, so I don't really have a favorite thing to look for. The peanut chicken sounded pretty safe - rice, chicken, peanuts, pea pods, onions, and carrots. I went for two-star spice - I love a good kick but since there's no standardization I'd rather have it be a little too mild than eye-watering hot. \n\nDespite the dish's humble description, it was a really outstanding meal. The chicken was so tender, the vegetables fresh, and the peanuts added just the right amount of crunch. No idea what all was in the sauce, but I'm in. Next time I might bump my spice selection up a level, just to see - two stars was quite tasty but I think I might like just a bit more. I'm also going to have to try their sticky rice. I've had several friends live in or travel to Thailand and it always looks so delicious. Can't wait to go back!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2015-05-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9zJ-iVMCjRRk-xvPikGaYg', 'review_id': 'AzudpOP-A0oaOQIu3FOI2w', 'text': "We have been to HLB 3 or 4 times, each time trying something different on the menu. We have yet to be disappointed! The menu is huge and has something for everyone, whether you are an adventurous foodie or someone who sticks to the basics. We usually have to wait for a table because it's always packed, but it is well worth the wait!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-05-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '7iSOxeUwJ1tbSmGPa6jUKw', 'review_id': 'zRHOpzbSoBYCqjNlypIHgQ', 'text': 'Came here the second time yesterday and the food is still as fantastic as always!!\n\nI forgot what I ordered the first time but this time, I tried their pho. Broth is a little bit on the sweet side but still delicious nevertheless! I would definitely come back here with family and friends! Customer service is very good!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-05-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'M525E3WbS6_T4d17FIT4aw', 'review_id': 'yOmxqUh5jTG9OGBW_taJKQ', 'text': 'Everything was delicious fresh tasting appealing to the eye the service was also up to par I will most definitely be back', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-05-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3qXl-9GWsSvQ3B4TbJ8-Xw', 'review_id': 'oAjOgmiB-UI0-iVVfHHfFg', 'text': 'Gotten too big for their britches\nNow that Ha Long has been discovered by everyone on the East Side the quality has suffered. Just had a curry that was a big disappointment, the Thai eggplant was not in the dish and the pork was beyond tough. Worse, the guy at the counter could not have cared less. This is the second subpar experience there in a few weeks. There are too many other good places around to bother trying them again. Sad, they used to be a favorite!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 2, 'date': '2015-05-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MrB_SR346mYE7gL7Ti4OOQ', 'review_id': 'OLwKwGBXEK6ZK5TYoXydRQ', 'text': 'This has always been my favorite place of having curry! They also make good pad thai.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-06-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qTrgjAaNzsuJwztHFdwMqg', 'review_id': 'fPRVGoTANtWcGm23BYrjtQ', 'text': "Food was tasty. Menu is very extensive, not sure they can master so many tastes. Had the panang chicken. Sauce was great, good spice but the chicken was rubbery. Place is very loud even for the early dinner hour about 5:30. Seating is just okay. Avoid the booths, you will get bounced around by the university drinkers behind you. Not a place for kids. Can't even have normal level voices for dinner conversation, just too loud. Cost is not bad and overall might try it again for lunch without the family.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2015-06-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'qL-VolaYesEz7DEKooJ7cw', 'review_id': 'VJ9YJDr62ToJPhwDc4gIQg', 'text': "I would have given Ha Long Bay 5 stars if not for the time I didn't get my food for over an hour. I am not sure what happened, if my waiter forgot to put in the order or what but plenty of people that ordered after me got their food a decent amount of time before us. In fact, one party that arrived after us, left before we even got our food. I have been to Ha Long Bay at least 10 times and I had only one bad service experience, so overall, I still love the place. Their curries, dumplings, and tons of other dishes are to die for. Not to mention, the guava candies they give you with the check. Because of my bad dining experience and the restaurants usual wait, I have begun to get take out instead of dine in. I haven't had any issues yet!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2015-06-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'Odobq8QefFolnJQos9cd3Q', 'review_id': 'R7fjrFyuvNEuaWnC3EL3bQ', 'text': "all the dishes i've had here are excellent! it is a bit expensive & usually super busy so the wait is typically pretty long, hence the 4 rather than 5 star raiting.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2015-06-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'TX-lodjwgMZ-Jn1rZ519Sw', 'review_id': 'EZQ-htzlIU42Fy3nnDb-Uw', 'text': 'Great food just get it to go and avoid the crazyness that is dine in there. If you can even get a table.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-07-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'elY25wa2F8b2SkI6DBsv7g', 'review_id': 'RdVhMvfJ7liUmw1eXtEtgw', 'text': 'We were sat right away and our waiter took our orders quickly.  We decided to try a few different things.  We started off with the chicken dumpling, spring rolls and vegetable soup.  The dumplings must have been handmade they held together really well and the filling was well seasoned and moist chicken meat (YUM).  Spring Rolls were good but the vegetable soup was amazing!  I loved the broth.  I love soup but I am still thinking about this soup the next day.   We finished out meal with Pad See Ew and it also really delicious too.  The noodles seem to be homemade and lot of chicken and broccoli.  We will for sure be back!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-07-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mn9U7DUiChBIeqLbjnaeEA', 'review_id': 'FGqj144kDO8QBgGw4H0-rg', 'text': "Good food, large menu. I have always ordered take out so I can't comment on the dining service, but I will say that wait time for take out orders has been pretty bad every time. We have called ahead and given 20 mins of lead time and we still had to wait another 20 mins or more for the order. I think it's worth the wait but 40 minutes is unacceptable now matter how good the food is.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2015-07-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bFVA3nsB3NGnF7m3KBzfvQ', 'review_id': 'RCiTI4ZYT7Dvi2ITQ5ExyQ', 'text': 'The spring rolls are really good, Authentic and delicious. The staff are really helpful, quick, and have great attitudes!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-07-06', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 3}, 'user_id': 'HHwM8z-2q65-yKbemjS3kA', 'review_id': 'vk8SWgQEY2JatS1J52F9WA', 'text': "I've been here twice now and I've gotten the same thing twice because I tend to get the same thing always if it is yummy.\n\nI got pho, the one with the tendon. The broth is the best part of it. They are also very generous with the beef. The sprouts aren't the freshest, but they get the job done. \n\nMy boyfriend ordered the Chicken Pad Thai with spiciness level of 4. The sauce was very spicy but also a little sweet. It was kind of like ketchup but not. The chicken was a little dry but I'm not an expert on chicken.\n\nDo try the Thai Iced Tea. It tastes just like a milkshake. It's probably unhealthy, but hey, live a little. It's too cold out to go to the beach anyway, so eat everything.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-07-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'AoD0JjHTWzs6fVVJ9Pvtfg', 'review_id': 'ZWTu5kU89sm6A4Cw0yceyg', 'text': 'The soups are rather distinctive. Budget extra time in your schedule for decent, but slightly slower, service.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2015-07-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0a3Ppk4J1sYa4Ncy6AtGSg', 'review_id': '_hXfUljODG7oSS1g9njX2w', 'text': "Amazing food ....we were driving by didn't even look at Yelp first and stopped in to get a bite to eat and the food was so good that we wanted to leave a review and then we saw they had 305 reviews and 5 stars and I see why ...because there food is so great :)", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-07-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xdgtecTsDvxfKwaCKaRFcw', 'review_id': '5dX2Q9OWyjsU2rqXobxhWQ', 'text': "Simply put, this place makes an excellent curry.  I mean, it was difficult to stop eating it, so be mindful with how much you order.  The atmosphere is okay, and if you go at a busy hour it can be really tight (with only two toilets, if that's a concern).  The service is unfrilled, and the beer selection is lacking, but make no mistake, you are going here for the curry!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2015-07-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'X5TN3zmgrfP6Sh5hXt87_Q', 'review_id': 'WNjF56jXz-n8pOO2DtV57g', 'text': 'Great pho! Cold green tea was rather flavor-less. Cool atmosphere. Would definitely return.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-07-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ocUayw1Ih7W_mHSR1RDdGA', 'review_id': 'UCEw7d9L_v0rM9g3vALA1A', 'text': "The last few times I've ordered pad thai as takeout it's been extremely greasy to the point of having to throw it in the garbage. Didn't have enough sweet sauce at all - I think they actually forgot the sauce. Disappointing as it's been so good in the past.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 1, 'date': '2015-07-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 3}, 'user_id': '2R3JZOKpzQJxeu-mpHWG4g', 'review_id': 'qqBzJ_N9rTv-p-9mxyB7ng', 'text': "Ha Long Bay makes the best pad thai ever. I've ordered from/eaten at Ha Long Bay a dozen times, and I want to order chicken pad thai ever single time. In the winter, I got crazy and ordered their squash curry, and it was awesome. But I couldn't stop thinking about the pad thai.\n\nTheir service can sometimes be less than average, but their food is so good that I don't even care. It's often hard to call in orders since they're always busy and regularly don't pick up the phone. I'm relentless, though, and will continue calling back over a 15 minute period to try and get someone to take my order.\n\nI have a friend who used to live in Madison, and sometimes I just snap a picture of Ha Long Bay's sign and send it to her, just to drive her bonkers. It works.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2015-07-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'yy2CnS-Abm6LTNnT1Kxw5w', 'review_id': 'FRrm8qg77HszxMKK4StvKw', 'text': "I loved the atmosphere here: super cute with orange and green decor. We went on a Thursday night at 8:00 and we had to wait 30 mins, but it was well worth the wait! Everything was on point from the lengthy menu to the teeny lime slices in the water to the super clean, nice bathrooms! We shared the squash curry with chicken (we got it medium spicy, but we wished we had asked for it hotter!) and the chicken was super fresh and tender. We also got a notably delish beef vermicelli noodle dish which was chock full of fresh, crunchy veggies! Of course we got a couple Thai teas which were creamy, sweet and addictive. My food lovin' friends and I were impressed with this place.... See you soon again, Ha Long Bay!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2015-08-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '76vSTlJECIuDIMAbga1vZA', 'review_id': 'EN86JYoc4MnRuZaXocH3CA', 'text': "The food here is good and was one of my top go to spots. The only thing is their service, it isn't the best. I shouldn't have to wait an hour just to get a water refill or for my order to be taken. This constantly happens and everytime it makes me want to return less and less. The food may be good but sooner than later it won't be enough to return to because the service is so slow.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2015-08-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '45WnRHJ-A7WJDoQjjq_u0A', 'review_id': '5vMMWanO86_9ZYLBWtNKhQ', 'text': "The food is mediocre but it's the most authentic you will find in white-bread Wisconsin. However the service is atrocious. I placed an order for take out and I was still waiting an hour later to take my food from the restaurant. When I expressed my displeasure to the manager (women with all of the dope chest piece tattoos) she was really snarky and unapologetic. When I finally got my food and returned home, my spring rolls were in pieces. This place is great if you want white-friendly flavorless pho and to be treated like an afterthought", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 1, 'date': '2015-08-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'rbpEFTHbNSWsLk0dRu9f3Q', 'review_id': 'ekrjidHBtLTcZ8jaUhYvgA', 'text': "Her: Ha Long Bay for dinner?\nMe: Sure. The usual.\nHer: OK. *calls restaurant* Can I order for pick up: MD1 with chicken and TR3 with beef, both medium spicy.\n\nI am not kidding when I say that for the first 6 months since we started eating here, it was almost a weekly tradition. The MD1 is the egg noodles deep fried topped with suateed broccoli, bok choy, baby corn, peapod, bell pepper, mushroom, and onion. The sauce is incredible and the noodles are crispy and delicious. The TR3 is my fiancee's favorite; Red curry fried rice with red curry paste, basil, mushroom, bamboo, peapod, and egg. She tries to save leftovers but usually will get up later at night to eat the rest. Occasionally, we'll order some egg rolls or spring rolls which are also always tasty.\n\nService is good. It's busy there so we typically call for pick-up and it's ready in 30 min. Besides, you stay in there long enough and you end up smelling like the food. It's not bad, but might not be ideal for most folks.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-08-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': 'gzatg0C4VSA2xNUW9k8kNg', 'review_id': 'KW_f4RNxCudE5QHM4-p5gg', 'text': 'Excellent eats every time. The only variation is the "hotness." Which, you know, whatever, it\'s all part of the experience.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2015-08-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'Kg5Uc97FMPwVxbH0lXz4eQ', 'review_id': 'z1eB65YlgUc2IzcClfSXnA', 'text': 'Since traveling to Vietnam, I find myself craving the cuisine far more frequently.  I have NEVER been disappointed here.  We are lucky to have this place in Madison.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-09-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'gq1CsUDXO99vOXTH3w4hkQ', 'review_id': 'vxofJTbF254gNwJ7kPZ1vA', 'text': "My husband and I consistently enjoy the pho, the squash curry (with tofu), chicken sa-tay (especially because of the peanut sauce), and the beef laab. When ordering the pho with the rare beef, ask them to bring the rare meat on the side and then put it in the soup to cook. Trust us. It'll cook in the hot broth and will still be tender.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2015-09-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TgJJzb16aEFpvkRllKd2Lg', 'review_id': '_bkY2ZpuQFBRV9idccxY_g', 'text': 'It was very crowded on a Friday night.  Come ready to wait.  Our reported 15 to 20 minute wait was more like an hour.  It was very warm in the restaurant. I ordered the squash curry as recommended by fellow yelpers.  It was just okay; pork was dry, but sauce and squash were yummy.  Pad thai was too sweet for my liking.  Service was efficient, but not very attentive.  My request for limes was seemingly heard but never fulfilled.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2015-09-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tJ1QDBJ4c7W9OTPEPYF46A', 'review_id': '5FWhcJIRvQtCK-49lnJzkg', 'text': "My favorite SE Asian in Madison.  Amazing chicken laab (aka larp).  I daydream about that symphony of flavors.  I like three star spiciness.  They also make a mean shrimp pad Thai, and you can't go wrong with any of their curries.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-09-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'OtpHvQFGbZ4sONaQAXankg', 'review_id': '4JefAWU_qqqJK-fytDRXJg', 'text': 'This is a hidden jewel of a Thai Restaurant. I had driven past it for over a year, thinking, "Hmm...I should try that place sometime." Well, I finally did. And I\'ve been back three times in the past month. My first excursion produced some of the best Pad Thai I\'ve ever eaten. The second, Pad See Eew that was solid, but a bit too oily for my taste. (And I have decided that  large rice noodles are textural anathema to me--something akin to platyhelminthes--but that\'s not HLB\'s fault.) The broccoli in that dish was amazingly good. For my third trip, I ordered Tom Yum soup, and it was fantastic. Every time I go to HLB, I end up with more food than I can eat. Which also resulted in the discovery that cold Thai food for breakfast is a wonderful thing.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-09-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': '08NwFmrBfH-wkx0txlVM7w', 'review_id': 'xvSxia2WVpslBFsDZlhZyg', 'text': "Ha Long Bay is a popular pan Asian restaurant that offers the standard vegetarian fare: replace meat with tofu! This place was packed until close on a Sunday night, and my friends and I ended up waiting about thirty minutes for a table to open up. There's not really an area to wait inside, so we walked around the area, which felt a bit dilapidated, but also hipster. A man begging for money was harassing patrons waiting outside the restaurant, which was a sad sight.\n\nI ordered the vegetarian pot stickers for the table and tofu pad thai for myself. I asked for the pad thai to be hot. The vegetarian pot stickers were very average: they were definitely the kind that were probably frozen and then dumped into a fryer. They were more eggroll than they were pot stickers. The pad thai itself was good. The tofu absorbed flavor well, and the egg was quite nice. The pad thai needed another vegetable or something, though: if you look at the photo,  you can see that it looks like a mushy blob of noodles, which it started to taste like toward the end of the meal. Don't get me wrong: the pad thai tasted good. But how many same-texture, same-consistency bites can a person eat before hoping for something different?\n\nI'd return if I were in Madison looking for Asian food. I think I would order something more adventurous than the pad thai - I'm usually at least a pad kee mao kind of guy.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2015-09-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'AC8zvkuewir0ohS-_4eZZQ', 'review_id': 'WqCVHk_RbOACy3gDP5A13Q', 'text': "This was by far the best Asian food that I've ever had. I've never been out of the US, but I have eaten in Chinatowns across the US, and make a habit of frequenting the local Asian restaurants whenever I visit a new city. \n\nI ordered the peanut chicken stir-fry and crab Rangoon. Every ingredient POPPED, and tasted FRESH FRESH! (sauces were fresh and delicious - not cornstarchy) A person can tell that the cooks here take pride in the preparation, and don't cut corners. HLB has a new life-long patron!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-09-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '6qDbDdspl8-Psmp282a4ig', 'review_id': '0ucZnZ4wmc6xZJfQzp1New', 'text': 'I have been meaning to post a review for a while. Hands down, the best Thai/Laotian/Vietnamese food around! I try and come here whenever I find myself remotely close to this side of Madison and I am never disappointed! \nMy personal favorite appetizer is the spring rolls with pork and shrimp. Make sure you put the hoisin sauce on them--sooooo delicious! My favorite entree is the squash curry with chicken. I fall in love all over again with acorn squash every time! I almost always choose the soup with mine. I can never remember what it is called but it is wonderful. It has mushrooms, tofu (the only time I ever eat tofu), and cilantro in it. Weird combo, I know but so, so, so good! \nMy husband and kids love the dumplings and my four year old is obsessed with the cucumber salad. \nThey are usually very busy but the food is so worth it!', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-09-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5-Y-FQN62vxLLdj4zfMJRA', 'review_id': 'O21wQcauHKw5-EE8ubnStQ', 'text': 'Walked in and every server just walked past us for like 10 minutes like we were not there. I understand they are busy but they should at least put us on the wait list. Tried talking to them but was just ignored that one time. All the 3-4 times we had food there we waited 30 minutes or more but they were decent.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2015-10-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'QKgaqFlx5Dz_YMoPUFed4A', 'review_id': '4ugnQGyoqgqJl0B32vNwjw', 'text': "Yum yum and yum.  Food is excellent, service is excellent, my favorite!  Every dish I've ordered has been amazing.  Good service, expertly prepared food.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-10-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '2ci4gFuLskrf-ShTAt7UXA', 'review_id': 'ZN0ihkNDyU9JwKP1sFUnzg', 'text': 'Fresh. Delicious. Large Variety of choices. It does get busy at peak hours like most good places. Amazing pho.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-10-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'IU9ArEUIijrMqNEgVKZDuw', 'review_id': 'n4cGRzAv2sVoxYfIQ16hIA', 'text': "If you're looking for some good Southeast Asian food (Vietnamese, Laotian, Thai), Ha Long Bay is as good as it. I recommend their Pho noodle bowls. If you haven't had Pho before, you are missing out in one of the best things in life. These are heaven on a cold winter's night. Piping hot delicious soup, with light and thing rice noodles. Add your choice of meat!\n\nAlso, the LS7 (Nem Khao Tod), is a must try! Delicious minced meat seasoned and sitting on lettuce ready to be wrapped and eaten! If you want to try something new for an appetizer, try the AP16 (Thai Spring rolls). These are amazing! Just writing this review makes me want to go visit again. Go try it...Now!", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-11-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'HYLbflVtCoQSnoZsRCwOPw', 'review_id': '9GkEPo7YhWkPpuAv9_0m5w', 'text': 'As my epic quest for fantastic Asian food through the Midwest continues, I made a recent trek over to Willy Street one afternoon to experience Ha Long Bay Vietnamese & Thai Bistro with the fam! \n\nFirst, I must tell you a little background on how we got to Ha Long Bay. When we first moved to the Midwest, we would ask everyone where in town to find decent Asian food. Then, when we began to hear a trend for one, specific location, we paid attention. Ha Long Bay was that place. So, we stopped in on a Friday afternoon, and ordered four lunch specials: Two Pad Se Yew\'s with chicken (one medium; one mild) and two Pad Thais (one mild tofu and one mild chicken). I also got a bowl of freshly-made Hot and Sour soup. \n\n(One last thing...I should mention that I typically judge all Thai restaurants by the quality of the their Pad Se Yew. Some people go curry and some go Pad Thai. But for me, I\'m looking for that downtown bay area, hole-in-the-wall, knock-your-socks-off phenomenal Pad Se Yew.)\n\n* FOOD TASTE/QUALITY: Let\'s start with the appetizers, tom yum soup or cucumber salad. Both were fantastic tasting. I particularly liked the small, fresh button mushroom halves in the soup. The cucumbers were cut a bit too large for me, so they didn\'t have much time to marinate. But, again, very nice tasting. \n\nI reordered the Hot and Sour soup, as I had enjoyed it very much on a previous visit. It was phenomenal that day, but this day was a bit too thick for me (too much corn starch, I believe). While the taste was very good, I couldn\'t get past the consistency. \n\nThe Pad Se Yew was very good. An excellent dish. Noodles were a tad-bit overcooked for me, but the flavors were very fresh and on-target. It wasn\'t overly fishy-tasting and had just the right balance of sweetness. The medium heat one was a bit weak for my taste (to me, if a customer asks for medium spice, they\'re looking for a hotter-than-mild; this wasn\'t the case), but I would certainly come back for it again.\n\nPad Thai was also very good, particularly the tofu one. Tofu was just the right size and fried very nicely. The chicken on the other was a little too thick for me, but again, it was an excellent dish.\n\n* PRESENTATION: The dishes were presented nicely. Small soup came in a small white bowl with a spoon, and the large Hot and Sour came in a more decorative clay pot. Everything else came as expected.   \n\n* PORTION: This is one of those "you won\'t leave hungry" kind of situations. While the starters are smaller (as they should be), the lunch portion of main dish was fairly large and made to order. Let me put it like this: I\'m writing this review two days later, and I still have one more little white take-out box in my fridge. Yeah...big portions.\n\n* PRICES: Very reasonable. $6.95 with choice of beef, pork, chicken, or tofu; $7.95 for shrimp. $3.50 for the soup. \n\n* DINING EXPERIENCE: Fairly authentic. We went on a Friday afternoon, so it was pretty packed with about 50 customers. But, it\'s a classic, mom-and-pop Willy street place. It was busy and a little chaotic with the crowd, so it took our server a bit to find us. But, when she came, she was very nice and helpful. Food came out fresh and was all hot. Nice environment to dine in.\n\n* FINAL NOTES/IMPRESSIONS (4.5 to 5 stars): I really liked Ha Long Bay. The food taste is excellent and the staff were very nice. While, for me, I would have liked the Pad Se Yew fried a bit more and a bit spicier, what it really comes down to are the flavors. This is an area that Ha Long Bay does very, very well. Mix this between the large portion sizes and reasonable prices, and I can see why they stay packed on Friday afternoons and why it\'s one of my go-to Thai food places in Madison. Well, that and the addictively-good Lychee candies you get on the way out.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2015-11-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 3}, 'user_id': 'bjHNUPI_Huh2yu7xz7uMaQ', 'review_id': 'Ipmo4DygXwAaP6a0ey-5Jw', 'text': "Seriously the best Thai food I've had.  I consider my self spoiled because I live in California near LA and we have tons of great food but this was bar far the best Thai food I've had in a long long time.  Can't go wrong with Pad Thai Chicken and that was on point.  I got the Mango Curry which sound delicious and it was.  When I'm back we're going again.  :)", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-11-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '16fUoxbABxFICJuVNxvI1g', 'review_id': 'm8qpMEfUB46zLMFtGMGTcg', 'text': 'Very good and love the variety on the menu! Nice location, but difficult to find parking sometimes.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2015-11-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'W6sGR6TK-WhNuN_fqibA1w', 'review_id': 'nqnGzCzRpMylL0KGCtzgMA', 'text': "Oh Ha Long Bay, so fresh, so delicious!\n\nWe took my mom here to experience Willy Street and one of it's gems of a restaurant. Since it was her first time we ordered the steamed dumplings as an appetizer, and part of me wishes that we just ordered 10 of those. They were that good!\n\n Our entrees were delicious as well, but I can't help but feel that the menu is overwhelming and hurts the experience. With so many options and vague descriptions I had a hard time distinguishing items from each other and ended up almost closing my eyes and picking one.\n\nThat being said, you have to try Ha Long Bay at least once and with such a large menu there is always something new to try.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2015-11-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'PcRHwoEPV43McwgFoIL_kg', 'review_id': 'KfiIwrDLcdMADB66NlXglg', 'text': 'Best Thai in madison.  Yummy iced coffee, delicious curry.  They are ALWAYS busy though, so be prepared to wait.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-11-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'tf8DLNonoNtSaXhuuASWbg', 'review_id': '1uBpXtmEm7H74tvocG5e2g', 'text': "Wow... So close to giving them a five star rating but the service was average at best.\n\nHowever, the food was excellent.\n\nWe started with the ginger tea.  It was spicy with a strong ginger flavor.  I personally wish it was a little less sweet but can't complain.\n\nWe moved on to the dumplings which were excellent, lots of flavor, we put a little extra hot pepper sauce on top for added kick.\n\nThe next course was the Thai soup with tofu.  We got it hot (3 of 4) and it came as advertised with lots of flavor.\n\nFinally, we had the lemongrass entree with shrimp.  It was spicy, flavorful, with six nice sized quality shrimp.  I would have liked a little less gravy on it, but really a fine dish.\n\nI wish Milwaukee had an equal to this place, I'd be there all the time.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2015-11-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Jso6qFR6OCo_o44_hVweNA', 'review_id': 'DQdEj8EjLFPzoU3YoKitTw', 'text': "Everything on the huge menu is numbered for easy ordering. Come for the fabled AP 10, the turducken of Asian appetizers, a fried egg roll inside a normal spring roll. That and big bowl of pho and you'll be very happy. They do a stir fry served on crispy pan fried fat rice noodles that we love and get all the time. Forgot the number, sorry.\n\nIt's a casual neighborhood place, the food is fresh, tasty and fairly priced, and consequently they are jam-packed ALL the time. If you come at 5:30 you might walk in and get a table, but otherwise you'll be waiting. If 8 or 10 people are standing around outside the front door, it's a bad sign.", 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 4, 'date': '2015-12-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'doSnQ2BpIf_gXrxnE8rUvw', 'review_id': 'HmHuGl8yhtIJo7J79b81iw', 'text': 'This is our go to lunch spot when in the Atwood and Willy Street areas. The pho is wonderful, as is the chicken won ton soup. AP10 appetizer is a must. I have never been disappointed with  the food; service can be slow(er) at times, but always worth it. The person I go there with the most swears the pad Thai is the best in the city.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-12-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IfnA7DLOoYE09uPoo8ENeQ', 'review_id': 'eEXEwgYfSoVOD7g5VqL2kQ', 'text': 'plain and simple this place is bombbbbbbbb and its 2 blocks from my work so thats cool lol eattttttttttttttt.   hhhhhhhhheeeeerrrrreeeeeeeeeeee', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 5, 'date': '2015-12-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '8MAK-j86HwJbZHPFGrGTkw', 'review_id': '4PgXLLAOmD7YvpBVuhKnIA', 'text': 'Of course we had to try Ha Long due to the massive amount of highly rated reviews on Yelp.  We didn\'t realize how long the wait would be on a Friday night either, but we toughed it out and waited an hour for our table.  Too bad this wait was not worth it.  \n\nOnce we looked at the menu, we noticed that the cuisine is not strictly Vietnamese or Thai, but rather a combination of items from South East Asia.  We were totally OK with this, it\'ll be nice to have choices.  \n\nWe decided to stick with Viet items and had the crispy fried seafood noodles and a bowl of pho.  The wait for food also took a long time and sadly was a disappointment.\n\nBoth the noodle choices were unimpressive in presentation and less so in taste.  The crispy noodles were plentiful, but not crispy.  The sauce was plain and the toppings overcooked.  We\'ve definitely had better crispy noodles elsewhere.  Then we tried the pho and was just saddened by it.  Broth was lazy and ingredients lacking, especially for a "special."  \n\nMaybe we should\'ve had Thai or Laos food from this place but we doubt we\'d be coming back.  The food was just not to our liking.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 2, 'date': '2015-12-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wxPmCbN2TDM9rEgI8Zy8Bw', 'review_id': 'meYjlUtfR4vOwWMaK9PpEg', 'text': 'Having lived in SE asia for 1.5 years, I was very excited to try this place out.\n\nWhen a place advertises as "thai and vietanemese" I am a bit skeptical- it is akin to putting Indian and Chinese food together. The menu felt like a mishmash of places and dishes.\n\nI got a stir fry noodle dish, it was good, but the flavors seemed a little dulled down. Not the flavor explosion I would expect from a SE Asian place.\n\nPositives: still solid SE Asian food, and seems like an accessible way to eat this food for some. \n\nand, it also looks nice from the outside.\n\nServings are a great deal/size.', 'business_id': 'th4uGmjyjPnQpN-ukf20PA', 'stars': 3, 'date': '2015-12-24', 'type': 'review'}
