{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': '23zYCcnqfru5jdxnTqjgDg', 'review_id': 'tsOPqOVaiyJIsVCzqsbbig', 'text': 'What the hell? Yelp don\'t got Swish? Awww hell nawww...Hehe that\'s my ghetto supa star!\nOk so Swish is actually the first shabu shabu place in Vegas. I looked when I moved here. This was the only place. I needed something to get my shabu shabu fix taken care of. Shabu Shabu is when you get a hot pot of water or broth and you "swish your meat/veggies/seafood" to cook it and eat. I have this thing with interactive food. I love to play with food. "BE THE BOLOGNA SANDWICH!" \nSo you come into this strip mall not knowing this place is here. I\'m sorry but this place was not easy to find. But yo support yo local businesses. The table setup is kinda cool. It\'s like a square counter with everyone having their own seperate hot pot. It\'s a very simple menu. Veggies, meat, kobe, or seafood. You get a healthy size....and a hungry size. They need like Hulk size. But then again this explains so many skinny asians. You can get a variety of apps from Edamame, seaweed salads, miso soup. But the good stuff comes in 2 forms Shabu Shabu form....or Sukiyaki form \nFor dessert - have some Mochi ice cream and rub yer full belly. Mmmmm So this place did place in Best of Las Vegas Staff picks 2006. If you get lost it\'s on Sahara near Buffalo!\nNow I need to find a Japanese curry house....', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2007-02-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'SNBJb9xiaRJ0ohHhugwn_g', 'review_id': 'R3M4p-id5wsBnf0_8kDJZg', 'text': "Swish, a shabu shabu place where you dip your meet in a broth to cook along with vegetables.  There's also sukiyaki, where you cook the meat in a more shallow pot of sauce/broth.  There's not much more to it.  They serve you raw vegetables and meat, and then you basically just cook it yourself in their broth.  It was delicious, but I think it's a bit over-priced for shabu shabu/sukiyaki.  However, I don't see any place like this around Vegas.  The place is small with a U-shaped counter.  I couldn't really talk with our group much.  The decor is clean with just one TV on one side of the room.  Guess where us guys sat.  On the side where you're able to watch the NBA game haha.  Not a bad place at all, just wish the prices were a bit better.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2007-05-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 6, 'cool': 3}, 'user_id': 'zTWH9b_ItSdLOK9ypeFOIw', 'review_id': 'uosTGCBD6breQ4pcR0tBPw', 'text': "I love the idea of shabu shabu cooking, whether it's fondue style for the Chinese, Japanese, Koreans, or the French.  \n\nAfter discovering Nina's has closed down (for now), the BF took me to Swish to satisfy this craving.  Walking into the restaurant, it's pretty straight forward how business is run here.  In front of every seat is a hot pot (or a hot pan) for your own cooking wishes.\n\nThe main two features of Swish is their shabu shabu menu and their sukiyaki menu.  \n\nFor shabu shabu, you get to cook your meat, seafood, or veggies in a broth.  (The menu says it's a seaweed broth, but it appears clear like water and I couldn't taste any seaweed in it.)  I ordered the Prime Rib-Eye Shabu Shabu, Healthy size portion for $13.95.  They give you two dipping sauces, one is a ponzu type sauce and the other tasted like it had a peanut taste in it.  (Supposedly it's sesame though.)  They also give you a small dish of assorted veggies that include onions, carrots, green onions, tofu, mushrooms, spinach, and cabbage.  A small portion of two types of noodles and a bowl of rice are included with your shabu shabu order.  You can also request for shichimi (chili powder), layu (hot sesame oil), and chili paste for an additional kick.  It's a filling portion for the price you pay, and you can order additional rice or noodle for no extra charge.  (Double check on the noodle part though.)  They also offer a Kobe Classic, a Seafood Combo, a Mushroom Party, and a Vegetarian Delight.  You can also everything a la carte to your existing order of shabu shabu.\n\nThe BF ordered the Prime Rib-Eye Sukiyaki, Healthy Portion for $14.95.  They pour a bit of oil into your hot pan, and add a sauce where you pretty much grill your food into the sauce.  Throughout your meal, you'll add more grilling sauce to help cook your meal.  There's a bit more taste with the sukiyaki style, but shabu shabu would be considered healthier.  You also get the assorted vegetables, noodles, and bowl of rice with your sukiyaki order.  Be sure to ask for your raw egg too, you can either dip your food into it or pour it over your rice like the BF does.  They also offer a Kobe Classic, a Seafood Combo, a Chicken Fiesta, a Mushroom Party, and a Vegetarian Delight.  You can also everything a la carte to your existing order of sukiyaki.\n\nOther items on the menu include appetizers like kimchee, spinach sesame salad, seaweed salad, and spicy seafood salad.  For dessert, you can find ice cream, mochi, and Japanese steamed cheesecake.  A few bento options are available to go too!\n\nService was good, but I heard it could be better.  In the beginning of your cooking, they offer garlic, radish, and green onions to your sauce or cooking pan.  The BF mentioned that when he eats there, the waitresses often cook the food for them.  However, when we went, they didn't offer.  He wasn't sure if it was because he goes at lunch or because he's with other guys.  =)  Haha!\n\nOverall, my experience at Swish was good.  At other shabu shabu places (like Koji's Japan in Orange, CA http://www.yelp.com/biz/cqQHvz1zvM_z2MbH0zjXBA#hrid:xzHUpQinpow0nRqocXAB0w/query:Koji),  they offer unlimited vegetables and a better dipping sauce.  Then again, Koji's is a bigger run operation than Swish.  I wish they would offer more vegetables though in their order.  \n\nLook out for their specials!  When we went, they offered 25% off Kobe orders, 10% off with Student IDs, and a frequent eater card.  They're about to open another location on Silverado Range and Maryland Pkwy in the late fall.\n\nOverall: 3.5 stars, but I'll round up.\n\nUpdate! 10/29/07 - Over the weekend, the BF and I were craving some Swish.  I ordered the Kobe Rib Eye Shabu Shabu, Healthy size ($35.95) and the BF order the Kobe Rib Eye Sukiyaki, Healthy size ($38.95).  The meat was so tender and oh so good.  I think the prices just went up and they no longer offer a frequent eater card.  But they do offer a group discount for five or more.  And reservations are accepted for parties of three or more too.  Only udon noodles were given to us this time, and the veggies are still on the skimpy side in my opinion.  The Kobe Rib Eye is pretty good stuff, but it's a costly thing!\n\n(I added some pics of our dinner on the business profile section.)\n\nUpdate! They apparently offer a happy hour from 9 pm to 10 pm.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2007-08-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '38JK-SfO9NkAGs1RwlH2Gw', 'review_id': 'pbY8ON8RwhZBQ7jWjoDGxA', 'text': 'This 2-year old restaurant serves 2 types of hotpot, shabu-shabu and sukiyaki. The staff is very friendly and patiently walks newbies through the entire process from ordering to cooking. We selected seafood (shrimp, salmon, tilapia and scallops) shabu-shabu. Veggies, tofu, mushrooms, and (2) types of noodles accompany each entre. You cook your own food in a hot pot filled with a seaweed-enhanced water and then dip each cooked item in one of 2 sauces. You are encouraged to adjust the sauces to taste by adding chili sauce, scallions, hot pepper sauce, minced garlic and/or minced white radish. The broth is not consumed, as is the case with Vietnamese Pho. Unlimited rice is included and prices are reasonable. It was truly a unique and delicious dining experience.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2007-10-03', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 1}, 'user_id': 'x_mxU74z1cx8C34-C7CjlA', 'review_id': 'qD2G_u_72e5JoCUNTbE5YQ', 'text': 'The place only seats 27, but it has to be this small in order for the staff to be attentive.  I really love the layout because it lends really well to conversing with neighbors. The shabu shabu and the sukiyaki were authentic and the staff was great in offering suggestions. Their website menu doesn\'t mention this, but they offer "kobe chuck" as an option, which is their more affordable serving of kobe beef. (18-19 dollars as opposed to the 44-45 dollar charge for prime kobe beef).', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2007-10-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '7ho-0EBT1uphpUr_0H4i-g', 'review_id': '4kRuYe_uRc_AyiNYU-E_EA', 'text': 'I went here with my family when I was back in Vegas. What a fun place!  I loved the sukiyaki with the standard beef...The "healthy" portion is enough even for those with a good appetite. \n\nHonestly, I wouldn\'t recommend spending more for the Kobe beef since it tastes the same...all of the beef is thinly sliced and is of great quality.\n\nA little pricey, as they charge $14.95 for a meal that you have to cook yourself! I think it\'s worth the splurge for a special occasion or "just for the fun of it!" \n\nJust an FYI, if you show your Student ID they give you a 10% discount!', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2007-11-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GMf_f8fv_dfWel9cwL3AoQ', 'review_id': 'eBbNGq2A2066CflT5O2w6A', 'text': 'You always walk out feeling healthy. The thinly sliced beef and veggies in broth or sauce is enough to be filling without making you feel like you just ate a truck because it is light on carbs. You get a small portion of noodles but most of the meal is protein and vegetable. Good deal for the money. The sukiyaki can sometimes be a bit too salty, especially when it boils down. I prefer the shabu shabu.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2007-12-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'oc_ovS7Zeo9QXo8HkO_UfQ', 'review_id': '-Sj6EnbxZ0UBpJUiKl12ng', 'text': "My co-worker had one of those entertainment books and there was a coupon for buy one get one free, so we gave it a whirl.  Since it was half off, we decided to get the mac daddy of shabu shabu, which is the kobe rib eye.  It was $35 or so and it was definitely worthwhile.  The beef was so tender!   \n\nThe people next to us had the sukiyaki and it looked and smelled really good.  Although its not as healthy, I am going to try that next time.  I can't wait!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2008-01-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Gswhjfxr-3rvx5yquzLaWw', 'review_id': 'rtD9zsde_iKFWZwAX2jwJA', 'text': 'Swish is a cute modern shabu shabu/sukiyaki joint. \nThis is some pretty healthy cuisine (shabu shabu).\nGood service.\nAlthough the portions can be a bit small for a few folks, but it filled me up.\nA good place to have fun with food!', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2008-03-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mH5ntFr-Ykg9roQZnQYkFA', 'review_id': 'g6vA9Am9IciPAj-ta5WRww', 'text': 'This place is hella badass! I eat here every time I go to Vegas because it\'s way off of the strip and I don\'t have to deal with drunk tourists. Don\'t be intimidated by the "make it yourself" portion. The servers are crazy nice and help you out the whole time. I was "that guy" and screwed up my order about 4 times before figuring out what I wanted and the servers were accommodating and gracious the entire evening. \n\nHow can you beat great food and watching crazy Asian TV? They were playing some show that\'s a mix between MXC and American Gladiators. So intense! I love this place.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2008-05-08', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'L3HT_5LwkK6xgChRLCNpXQ', 'review_id': 'QY5fCiI2tv58FLUODu3VbA', 'text': "One of my all time favorite places to eat in VEGAS!!  Way off the strip, it's best to come to Swish, when it's not peak eating hours.  The first time I came here, I arrived right about the time they opened.  This turned out to be a good thing.  By the time my friends and I were finishing up with our leisure lunch, the place was filling up quickly and nicely.\n\nThe layout is waaay cool.  A large U shaped counter sits in the middle of the room.  Sitting out the outer edges, your server will provide you with a gas grill and give you your choice of shabu shabu or sukiyaki.  Or, loosely translated - wet (soupy) or dry meal (grilled)?  You get to 'swish' your food yourself.  If you give a stupid enough look, your server might be as sympathetic as mine and help you out with the cooking.  Luckily, I've done this before, so no stupid looks here!  At least, not in regards to getting my cook on.\n\nThe average plate is slightly price, but it is well worth it.  The owner and staff are awesome and friendly.  I try to hit up Swish, whenever I get the chance.  You should, too!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2008-05-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'RsS6jUNram-5svM78_fdbw', 'review_id': '50Ydoe6meBrU-srh7NDzhA', 'text': "I like the hands-on experience when I come here. They serve you the raw ingredients and you just cook it yourself shabu shabu style (in a boiling broth, like fondue) or sukiyaki (pan-fried) on your own personal burner. \n\nBut for the same reason, it seems the place is a tad over-priced. I mean ... you cook it your self. \n\nPrices on entrees range from $9 for the small veggie shabu shabu plate to $60 for the large Kobe sukiyaki plate. \n\nI think with the exception of the bento, they don't cook anything. All of the kitchen labor is just prep work (like washing veggies, cutting meat). I'm gonna assume the seafood is shipped in frozen. The cheesecakes and mochi ice cream are probably outsourced. They don't have to keep a large variety of ingredients on hand. \n\nYou can ask someone to help you if you're totally clueless. Sometimes they offer to get you started. It seems the burners frequently go out or the wait staff forgets to light them. Don't be shy to let some one know. The wait staff is always attentive and polite. \n\nThe items always seem to be fresh. I get the seafood or mushroom party (variety of fungus) or vegetable plate add on to my bf's Kobe. The Kobe is sliced per order. I like it when meats are cut or decanted right before eating it. It keeps the texture crisp. \n\nI'm pretty particular on the temperature to which my seafood is cooked. Like I like my shrimp well done, but I like my salmon and scallops rare. One of the advantages to cooking all your own stuff. \n\nThey recently expanded their menu to include bento. \n\nTry the steamed cheesecake. Its Japanese-style, so its fluffier, lighter. \n\nSwish is a good alternative to the common dining experience. Each meal is nicely balanced with meats (or meat sub), veggies (cabbage, carrots, onions, mushrooms, green onions, and spinach), and starches (rice and udon). Meals also come with two dipping sauces: a peanut sauce and ponzu. You can order a small or large portion meal. \n\nI think I liked this place a lot the very first time because it was novel. After that, it was just meh. Now days I just go there when I'm feeling like being healthy ... which is rare. \n\n* off the strip, non-casino", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2008-06-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'yV2cI0fPVvwGMjrYyCQQ6w', 'review_id': 'g2V_7ZK0rHxfcB3YphCMyA', 'text': "There's only one way to describe this place. Perfect. Ok so no decor. And yeah you cook it yourself. I don't care. I love it.\nThere is a happy hour. But grr. I think it ends at 5. \nSo grab a bottle of Sake. \nOrder the Kobe Beef in the Sukiyaki and enjoy life.\nThe tofu. The edamame. Everything. \nIt is pricey. Yes. I wish it wasn't.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2008-12-03', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'XZgZXmhnWitMW4GEvM79ZQ', 'review_id': 'Mo24MMbGfaHAYfU5wCAaCw', 'text': "I went to Swish for the first time last week and it was so amazing that I returned 2 days later and joined yelp to tell everyone about it. They have 2 portion sizes, one is healthy (smaller), and one is hungry. But the great thing is that if you do get the smaller portion you can add on just a little bit more at any time if you're still hungry. The place is pretty small, the counter is in a big U shape and your little hot pot is in front of you on a counter. The staff is really friendly and take good care of you. Happy hour is from 9pm till 10pm and that is 50% off, half of sake makes me happy. I had the Kobe Chuck and it is amazing, sliced so thin it almost falls apart. The chicken is amazing too. I'm just going to go ahead and say everything is amazing. They also have adorable bento boxes for lunch. They are vegetarian friendly which is very nice and the prices aren't that high. The Kobe chuck dinner is around $16. My only gripe with the place is they play some cheesy radio station all day.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2009-02-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'QaguvugBJtqK7-c58DRs4Q', 'review_id': 'XlkkRo8MhEJMAHg8V38lKg', 'text': "This place is pricey, healthy and tasty. Compared to other Shabu Shabu places in LA this place seems to give you more meat and less vegetables.\nIt's nice and clean inside. The service is nice and friendly. It sometimes seems a bit understaffed when it is fully booked but other than that it is a great place to fill your empty stomach and have some fun with friends over a cup of sake.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2009-02-16', 'type': 'review'}
{'votes': {'funny': 5, 'useful': 6, 'cool': 6}, 'user_id': 'D_NLQyF1w8CaDX4fh7Hl8A', 'review_id': '2K1DAa47YSPwRz1DZYphHg', 'text': "2.5 stars\n\nKorean owned and operated.  This place is ok.  It's the only shabu-shabu place I've been to in Las Vegas.  \n\nThe kobe chuck was pretty good but the seafood was a little underwhelming.  Also, got the mushroom plate - fresh enough.\n\nOne thing I liked was the wasabi octopus appetizer.  It's hard to find raw octopus in Vegas.\n\nService was great.  Extremely friendly and helpful girl behind the counter. \n\nI felt it was overpriced.  $75 with tip for two not-so-hungry guys.  Eh.  \n\nI'd probably go back if fiending shabushabu.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2009-06-10', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'f5vgLcoKpFcTvD4lOUxcTQ', 'review_id': 'JQfHqhSlnQBUwUHJDPNJFQ', 'text': "My shabu shabu cherry just got popped last night. For a first timer, I think I did pretty well. For my Japanese fondue debut I decided to get the prime rib eye so I could get the feel of things and how it is done. I opted to do the sukiyaki style at the advice of my seasoned shabu shabu friend. It was quite savory and flavorful. Extra garlic, of course! Do not forget to ask for the peanut sesame  sauce? The meat was cooked perfectly. Compliments to the chef. Oh wait, that's me! I really liked this place. The prices were not bad and the food was delicious. The service was great. I am now officially hooked.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2009-06-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TYsR8St3TGuOvyqDAN7DqQ', 'review_id': 'TFKakBhPUsxCUa1H6Y4X8w', 'text': 'Very good place for shabu shabu.  If you are coming from the strip, make sure your cab driver takes the highway, it is much faster.  I had the Kobe chuck and it was very flavorful, with good veggies on the side too.  This place is a nice retreat from the crowded Strip restaurants if you want to get away for a while, and is the only shabu place near the Strip as far as I know.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2009-08-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MDbYmXUU1FVh0J9QYippWg', 'review_id': 'yTAlMxs1IeVgHJFYBioKvg', 'text': "I love this restaurant one of my favorites. Everyone gets their own hot pot! The concept works. Very excited to go there again. I've already recommended it to most of my friends. I wish there was one closer to me.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2009-09-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XAz4I30tssPn373BzAduug', 'review_id': 'oqzbQriP3LLKqFUMMgBbmg', 'text': "I've been here twice. The first time I took my bf and roomate and I don't think they have been to a place like this but they ended up ordering the kobe steak shabu shabu and we also did the chicken sukiyaki. There is a place in the bay area that I used to go to which was exactly the same, and at first it wasn't that good to me but I think you get used to it and eventually I started to like it. It is pretty healthy if you do shabu shabu because you are really dipping veggies and meat into just seaweed flavor boiling water. My favorite is loading up on the ponzu sauce and adding tons of garlic, onions and red pepper flakes. I love dipping the meat and veggies into this because it just enhances the flavor. They also give you a peanut sauce which is good too.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2009-09-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 3}, 'user_id': 'i8KMQX7nekLSCzb_DVb6yA', 'review_id': 'c9nSXset7GdU12PJD9obFg', 'text': "The new location is OPEN! I dragged my very skeptical husband here for lunch today and he was an instant convert. As this was my first experience at a shabu/shabu place, keep that in mind for this review. Being the un-adventurous sort we both decided to stick to the sukyaki style cooking for this time. \n\n*Kobe Chuck - $13.95\n*Prime Beef - $11.95\n\nMy husband loved having some of each, but I prefer the kobe! I was skeptical what the quality would be for 4 oz of kobe for under $14, but I was blown away. Gorgeous marbeling, tender beef. SO good! \n\nThe veggies weren't too exciting (carrots, cabbage, etc.. luckily a couple pieces of mushrooms were thrown in too). The udon noodles were tasty but my white hands found it very difficult to cook the noodles in the hot pot without breaking them ! Picking up the noodles was a challenger for me the entire time. Maybe next time I'll ask if they have easier cooking utensils. \n\nService was friendly, but you could tell they still have some kinks to work out in the new location. I look forward to returning often in the future!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2009-12-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VINcm23oX30iPX8hpfbx0g', 'review_id': 'uWWRboxjUHICIJTZj8qDzg', 'text': "Great shabu shabu place here in Las Vegas. I ordered the prime rib-eye shabu shabu style but also tried the sukiyaki and both were great. The portions were generous and the prices were reasonable. I've seen places charge $35 for half the quantity.\n\nThe server was very helpful and was actually Japanese. He recommended the unfiltered sake for shabu shabu and the sparkling sake for sukiyaki since the meal is heavier. He poured our sake for us which is not even common in most sushi places around here.\n\nThe restaurant only has a couple of tables so I would call ahead if going with a group of people. It is still worth checking out though.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2010-01-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'vyJxm4LcCUuWyz7QIeiyTg', 'review_id': '3IdoWuznKSXmKkm4S6yLZA', 'text': "I came here on a Saturday noon with friends. It felt like a private party, since we were the only ones in the resto. Usually, when you're the only ones, this just screams that the food might not be great. However, I know you can never go wrong with the combination of spending time with friends and eating Japanese hot pot. My best friend and I shared the Prime Rib-eye and Seafood combo sukiyaki. The broth was superb and the meat/seafood was excellent. The veggies were ok, I only liked the mushrooms.\n\nOther plus was that there was a jar of minced garlic for each table. I went a bit crazy with the garlic, since it was next to me and simply because I love garlic. Also, they give you unlimited refills of the drinks.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2010-01-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'f5vgLcoKpFcTvD4lOUxcTQ', 'review_id': 'QLRbF1e1kFLumTXZX_wklA', 'text': 'Just an note: The new location for Swish is now open.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2010-01-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'ynGxw3zZqAjahVou563zXQ', 'review_id': 'vQ-11mIQXFRxtYZLECEdcA', 'text': "Yeah for a shabu shabu birthday!  It had been a long time since I'd had shabu shabu, last in New York several years ago.  We were a bit hesitant, worried Swish would be touristy or not authentic, but we were more than satisfied with the choice.  Our reservation was early, and probably wasn't necessary, but good to know they take them.  \n\nWe went traditional: the Kobe Ribeye (hungry size...8 oz).  The meat was BEAUTIFUL, great marbling, very thinly sliced, amazing flavor.  Each of us were served a very nice helping of veggies, tofu and udon, as well as a bowl of rice and the two dipping sauces: ponzu and goma.  There were also, of course, negi (green onion) and  daikon to add if you preferred.  We also chose the Mushroom Party, which came with a number of different varieties, and was also a generous portion.  \n\nOur server was helpful, but not intrusive, checking on us from time to time and adjusting the heat of our tabletop burner.  We had a relaxing, well-paced meal, one of the things I love about shabu shabu: you take your time and enjoy the experience.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2010-02-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'Aluc0ilh_rgUIXD5YUf1Mw', 'review_id': 'ghFYYpmAg2HJ-6AKUknHhg', 'text': 'Swish is my favorite place for sukiyaki shabu shabu. The sukiyaki broth is so flavorful. You can make it how you want it. Get the rib eye sukiyaki. Another good place  to satisfy your soul.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2010-03-05', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 0}, 'user_id': '5fA4DHiyqq94VS1EZwjHGg', 'review_id': 'exckOyLk1sbuNWXBBzzoJA', 'text': "I'm not sure how to review a place where we did all of the cooking ourselves. The service was friendly and prompt.\n\nWe had the seafood combo with a kobe chuck add-on. There wasn't as much seafood in the seafood combo as we had hoped. The fish, vegetables and meat all looked and smelled fresh. the borth they give you for shabu shabu seemed fine.\n\nWhat else is there to say about a place where you cook your own food?", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2010-03-28', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 6, 'cool': 4}, 'user_id': 'i8KMQX7nekLSCzb_DVb6yA', 'review_id': 'CuzZoIE-tmw9knZsHWO5ng', 'text': "Officially obsessed with this place. It's so nice to have incredibly tasty healthy fresh food when dieting (or just in general! ) . The $13.99 Kobe chuck lunch special is hands down one of the best food bargains in this city ! Incredible. I also have to give major props to my favorite server there for always accommodating my obnoxious and bizarre food requests. Today he made me a custom plate of low carb veggies (mushrooms, asparagus, and cabbage) instead of the usual mix! Very cool of them to say the least. Also have to add they have alternate noodle options if you don't like udon - just ask! Prices are awesome and the servers will bend over backwards for you. Highly recommend, especially for lunch !", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2010-06-02', 'type': 'review'}
{'votes': {'funny': 5, 'useful': 8, 'cool': 9}, 'user_id': 'tmuVweJdPKDnZGnQOq2L2Q', 'review_id': 'HHOYp3Hf3cDS_Cmdvcdcyw', 'text': 'This place is now on my list of, "I don\'t care if I ate this earlier this week, I\'ll eat this again tonight!" foods.  Yes, I know, that\'s not a very memorable or catchy list, but it gets the point across!  I think I have to get my sukiyaki fix every couple weeks, or else I start to crave it!\n\nWhen ordering your meal you\'re presented with several options: the type of meat/chicken/seafood, the portion size and shabu shabu or sukiyaki style.  Once those details are out of the way, food is brought to you almost immediately.  The waitress gets your stove going for you, and you\'re off!  Your choice of meat is brought out to you, along with an assortment of vegetables that include onions, green onions, asparagus, carrots, mushrooms and cabbage.  You also get some udon noodles and a bowl of rice.  Additional condiments are chili paste, radish and green onion that you can add to your broth.\n\nI\'ve had the shabu shabu here before, but it wasn\'t something that I\'ll be eating again anytime soon.  The broth seemed quite plain and didn\'t seem to do much more than boil my veggies and meat.  The sukiyaki however, has won me over.  I love the sweet/soy sauce flavor of the broth itself, as well as the fact that the veggies and meat do take on the flavor of the sauce.  \n\nBonus Tip: Checkout the front table by the entrance that has business cards and newspapers.  One of the newspapers is a Korean newspaper, and on the cover there is a coupon for Swish that gets you 10% off your meal! ;)', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2010-06-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '-Q1iK37BSnImI8QX8XJJYA', 'review_id': 'N-qEun-Izb4FoE7uLYOzvQ', 'text': 'Excellent healthy, leaner choice cuts of meat & vegetables. Some may have a problem having to cook their own food but at least you can have your meal exactly the way you want it.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2010-06-24', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': '8JC-Yb3UDUv2FUl5ym1nVg', 'review_id': '1ZWD4mbNmBQW7MGMt15Hsg', 'text': "When you go to a basketball game, you hear a swish...it's probably a good thing. I had a couple of good friends in town over the weekend, and as soon as they said Shabu Shabu, I thought...SWISH! \n\nI read some very positive reviews from Misti Y, Lily D., Teri C. and Anthony M. If my yelpers think it's good, then it has to be right?\n\nYup!\n\nBefore I go on, I'd like to point out that I knocked off one star, only because of the awkward seating arrangements. \n\nEverything else about this place? FANTASTIC! Food was delicious. I had the Meat Lovers (Kobe Rib Eye and Prime Rib Eye). Normally the Meat Lover's also has Kobe Chuck, but since they were out of Kobe Chuck, I got extra Kobe Rib Eye. Hey, I'm not complaining. More premium meat (thats what she said?)\n\nThe vegetables were plentiful and flavorful. The establishment was clean. But the best part? I was able to get my fix of 90s pop music! Granted it was all boy band music, but it was hilarious because it took me back to the days of late high school early college.  Pretty hilarious stuff.\n\nAll in all, Swish lived up the hype by my fellow Yelpers. \n\nNext time, I want to try the Mushroom Party (literally, a mix of 5 different kinds of mushrooms). Pretty awesome if you like mushrooms. \n\nCheck it out though. You won't be disappointed. Promises Promises and more Promises.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2010-07-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GqWhMimDWuZ6jJ7qDMuzEQ', 'review_id': '9wVW74VsoJ89yW_O8ki8VQ', 'text': 'For a Japanese joint in Vegas, this place is quite cheap for the quality they deliver. Japanese cuisine usually equals expensive luxury, but this place had reasonable prices for both the quantity and quality. I had their garlic chicken bento box which included sides of seaweed salad, miso soup, steamed rice and ginger for I believe $10.95. The chicken was fried in a light crispy batter and glazed with an amazing garlicky sauce and sprinkled with toasted sesame seeds. The ratio of the sides to chicken were portioned perfectly enough to satisfy my appetite without overfilling my stomach and making me feel guilty for not cleaning my plate...which I indeed did :)..I will definitely pay a visit there the next time I am in town!', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2010-07-19', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'ofWeLxI7w12mHYNZphA20g', 'review_id': 'AR9B6WTYGd5JqhNkQD5fIw', 'text': "Sukiyaki is such a fun word to say and Swish is a great place to go.  Healthy, clean flavors resonate from this restaurant that moved from summerlin to Chinatown.  Now that I've had the opportunity to try shabu shabu (lite broth) compared to sukiyaki (rich and more intense soy flavored reduction) I enjoyed the sukiyaki flavors more.  \nOn this particular field trip I ordered the shrimp with sweet soy & coconut crystals as a first course.  Good dish to start with.  Coconut wasn't too intense of a flavor surprisingly.  I want to try other appetizers on my next visit but this will be an old standby when I need a safe bet in the future.\nSukiyaki was the main course except\nthey were out of the Kobe chuck.  The great thing about sukiyaki is you control the flavors of your sauce and temps of your meat & veggies.  If you don't like it, blame that person looking at you in the bathroom mirror...You made it sucker!!\n \nI can't wait to go back for lunch again.  Portions and prices are great, service is above average.  It's easy to go to Swish Han Solo or fun to go with a significant other.  Its a fun dining experience that keeps you active and keeps you adventurous.  Great thing is, if you have friends that have already visited Swish, tell them you're going and you won't be dining alone!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2010-08-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'K7Jati4rLaJXaF8GDGA7tQ', 'review_id': 'Z3GLGZTDUl-fHlbBW6ikIQ', 'text': 'Good Japanese shabu shabu,  So nice to find a place like this in the desert!  The service is excellent, the restaurant is very clean and spacious.  The seating arrangement is a little strange (all facing foward or towards the middle).  Free parking right in the front, of course.  \nThe beef is awesome and cooks perfectly in the broth.  The sauces are really tasty.  My dinner partner made his own spicy broth by ordering a side of kim chee and mixing it in (hint hint).  After dinner, I felt healthy full instead of GROSS full.  PS:  The bathrooms are squeaky clean.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2010-08-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lX67QH47mVxfCcXhM2MlCg', 'review_id': 'nxwO5AmBqkeTY3PqE2y9YQ', 'text': "Came here for lunch with a few friends and loved it!  It was a nice change of pace from the Las Vegas Strip Hotel foods.  They had a lunch special for $11.00 which included your choice of meat for shabu along with all the veggies.  i was happy to see that they included asparagus as one of there veggies and they had the most amazing dipping sauces!  If you are in the area definitely give it a try.  It's not that far off the strip and it wont break the bank.  Next time I plan on trying the sukiyaki, heard that was yummy too.   :)", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2010-08-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'o-wGAWy0Sd29dH4utXtbZQ', 'review_id': 'Z3D84Kjiv1qMRE29ARnqrw', 'text': "This place was a good chance of pace from the regular restaurants on the strip.  Being from OC, I've had great tasting Shabu in Costa Mesa, Fountain Valley, and LA.  I figured LV should be comparable.  To my surprise, this place definitely disappointed when it came to taste.\n\n1.  The decor of the restaurant was decent.  It was bad or anything, but nothing stood out that made me like the place.  NO ONE was in the restaurant, I mean NO ONE!  We were the only people there so they were attentative.\n\n2.  The service was good, though I can't be a critic because no one else was there.  \n\n3.  The food was decent.  I mean it wasn't the best shabu.  They have Kobe Chuck and Kobe Prime Rib that you can Choose.  We chose the Kobe Chuck with an add on of USDA Prime Rib.  The slices of Kobe Chuck were huge!  One slice of the chuck was the same as 2 USDA Prime Rib slices.  We weren't too starving so the amount of meat for us was more than enough.  They cooked great and easy.  The dipping sauces were good as well, it got the job done.  As were were finishing up, I asked for the soup base so we can use it for our udon noodles.  They brought us canned soup base that we had to mix ourselves: beef broth, tom yom, or chicken broth.  Sorry to say, it was a disappointment in flavor.  It's not at all on the same level as the broth from California Shabu Shabu.\n\nOverall, I would eat here again only if I was in desperately in the mood for shabu shabu in Vegas.  I don't see myself crazing this restaurant or its nasty soup base.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2010-09-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9qWPrBvo2WXwilJRH0ijqA', 'review_id': 'fzeiRIP19p3Gy2c7NOgbDA', 'text': 'We loved this place! I was looking for some healthy dining options while in Vegas and this place came highly recommended. We had such a great experience, great service, and awesome food that we went back the next day to do it again!  We each ordered something different and shared so between the two visits I tried the Kobe chuck, salmon, scallops, shrimp, suikiyaki, shabu shabu and two kinds of sake! \n\nWe were super impressed with the service! He made numerous recommendations, gave us a great demo and was nice enough to pose for photos. We will definitely eat here when we are in Vegas!', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2010-09-28', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 3, 'cool': 3}, 'user_id': 'mO2Qw9O4oTHio4TlaHTSfw', 'review_id': 'XD-BKnio5fNpnRmvy9r3dw', 'text': "Shabu Shabu, Pho, or Ramen.  I gave my fiance 3 choices and he picked Shabu Shabu.  Shabu Shabu Paradise does not open until 3:00pm on Sat and Sun, and we have a dinner to go to at 5:30pm, so I decided to try Swish.  I was really glad they had moved to Spring Mountain Road.  \n\nIt's location was fairly easy to find.  When I stepped inside at 12:30pm, I was shocked it was completely empty.  The inside was rather dark and eerie with only 1 server.  Also instead of a built-in stove, they use portable stove.  \n\nMy fiance and I both ordered Prime Rib-Eye Healthy Portion and regular Shabu Shabu broth which is basically plain water.  I have to say the portion of the meat was quite big (I think there were 9 slices of meat).  However, the quality was not 'prime'.  The meat was tough once fully cooked.  I tried to make sure I didn't over cook, but it was still not as tender as the other places I've tried.  The veggie plate was also very average.  Ponzu sauce was missing some kick despite my effort to add lots and lots of garlic and chili sauce.  And the gorma sauce was too sweet.  \n\nThe server was nice but very quiet.  When we left, we were still the only customers.  I was really tempted to ask her if they were doing better at their old location.  \n\nTheir location definitely has the advantage over the other Shabu Shabu place.  But this probably will not be my first choice.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2010-10-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'JqUV-6vfHlapw8d3JhAKWA', 'review_id': '6EGZg2JOsGT1gIabxSkG3Q', 'text': "I love this place. \n\nIt's as good as the Shabu Shabu House in lil tokyo in downtown Los Angeles, but without the wait. I have been here atleast 10 times in the meager 2 months I have lived here. \n\nSeriously that good!!!\n\nBut be sure that you do not confuse this place with the old location on Sahara and Buffalo. They are not the same and the one on Sahara has nothing on the location on Spring Mountain.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2010-10-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 3}, 'user_id': 'XHkzCzmIAB3DnjQO7v6jww', 'review_id': '7YKgzSCH655atLJx70l56Q', 'text': 'Overall, a very good shabu shabu place in Las Vegas.  Plus it is on Spring Mountain near most of the other Asian restaurants and supermarkets, so getting here is not a hassel for most people living, shopping or working nearby.\n\nPlus they have two (2) happy hours!  3-5pm and again from 9-11pm. But you have to tell the waitress/waiter about HH to get the HH pricing.  That will entitle you to 50% off your HH alcohols, such as Gekkeikan Zipang Sparkling Sake for $5 (instead of $10), which is cheaper than buying it at the Asian/Japanese supermarket that carries it. And if you have a current student ID, you get 10% off too.\n\nI have not tried their Kobe RibEye yet, but Living Social has a $15 for $30 deal today, which will be like getting $15 off the typical $38.95 or $48.95 pricing.  http://livingsocial.com/deals/12943?ref=email-jp&rpi=2266445\nBut that is only good for about another 11 hours.\n\nThis Swish location is located in the old SF Market, along with many other popular businesses. The closest parking spots are usually occupied, but there are plenty of other spaces in the garage under the building.\n\nNow if they just add an AYCE option, and this will for sure be a 5 stars shabu shabu place for me.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2010-11-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'LIdBsu7nspO56DdYYI5TTA', 'review_id': 'oMUsz4wE8_jdJzhc018FYQ', 'text': "I don't think this is owned by Japanese people... food was o.k. nothing outstanding, but nothing bad either. I'm from Japan, so I guess I'm a little bit spoiled when it comes to Shabu Shabu. It's delightful to have Shabu Shabu place here in Las Vegas though.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2010-11-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': '0kHlIKnWzaMQ1TLYQB1rPg', 'review_id': 'O_npGwn9p2CH1boILGnniQ', 'text': "I came here eons ago when it first opened and still wonder about it's success. I really didn't like it. Shabu-Shabu is supposed to taste much better than this.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 2, 'date': '2010-11-30', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'ABRSArh1Ap9kv2DLg7dWEA', 'review_id': 'k7okDgTOb-1WG1yyK7vYNA', 'text': "When I go to this place..I can't help...I always eat so much..lol\nMeat and vegetables are really fresh and I like their sauces too.\nI didn't know what Sukiyaki is..until I tried those...It was soooooo tasty and something new.\nI had event there last time and had family dinner couple of times..\nEveryone looked so happy with what they ordered.\nSome ppl don't think Shabu Shabu is good because you have to cook your meat with boiled water but once you try...you won't think that way at all..It is really tasty with sauce they give you and really healthy too :)\nIf you're really really not sure about Shabu Shabu..then you should try Sukiyaki...it is awsome taste!!!\nI always can't decide what to get so end up order one Sukiyaki and one Shabu Shabu..that way you can try both taste.\nThis place is my favorite place!!can't wait to go back there again :)", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2010-12-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'm4oc-yghCtBGnT2fZE1BPg', 'review_id': 'wLmq3dMybDK7tdOULpP6lg', 'text': "This is the first time I had Japanese hot pot and I am hooked. Usually hot pot places aren't too thrilling or the greatest thing in the world to me, but after coming here it is life changing (or at least opinion changing). \n\nGuess what they had on their menu that caught my eyes... a mushroom party plate!! I cannot stress enough on how much I love mushrooms. I LOVE IT!! *does a little dance* This plate has 6 or 7 different types of mushrooms and a second plate full of vegetables with noodles. You can either eat your main course with rice or ramen soup style. \n\nWhen I come back to Vegas, this is definitely one of the places I would revisit.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2010-12-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XKjj6QrxsBeM1CqX-_VFQg', 'review_id': 'FPhrw9c3XKVr0xzc-hZjDg', 'text': 'First attempt - we made a reservation and still had to wait to be seated.  Finally we got seated, then we waited another 30 mins and no one ever came to get our orders.  we left with empty stomachs.  the place that night was way too busy for just two servers.\n\nSecond attempt - a much better experience.  we were able to eat!!! how about that!!!  \n\nwe are still searching for a good shabu shabu place in town.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 2, 'date': '2011-01-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Q9_2u93GLfdnHNDC2vzAJA', 'review_id': 'Xo6DJAFZnbRdMKkGXdLFpg', 'text': 'Love the food! Try the cooking beef on teriyaki pot, so tasty!!! love the food there. However, I think the place needs some more decoration thou! :)', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2011-01-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'UOJ0EUsZfO6fyyMmptTnIg', 'review_id': 'JZn0yENQuTxRE6OAZzyTYQ', 'text': "Standard Shabu / Shabu fare - about $30 per person without drinks. They boil their meats/vegetables in water, not broth. Can't say I was loving the decor, but the service was friendly and efficient.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2011-01-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'vyiHjaQlESGcXgEfEmH4ow', 'review_id': '_d4VU-jrNyCy8pxqt_LeXA', 'text': "A very good atmosphere (and a special delight to find a bar in a Chinatown restaurant, it's especially welcoming when you like to eat out alone).\n\nThe ribeye hot pot is very good meal at a very good price. It will definitely fill you up without wiping out your bank account. \n\nAnd did I mention? - they have a actual bar!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2011-02-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '38JK-SfO9NkAGs1RwlH2Gw', 'review_id': 'RVIVC1lZPwhrB7MYCagYcQ', 'text': 'We have dined at this restaurant in its former location several years ago so we pretty much knew the drill.  We shared orders of scallops and shrimp that also included udon noodles, Napa cabbage, onion, mushroom, broccoli, scallions and rice.  We cooked the seafood and veggies in a hot pot filled with seawater and then dipped each in either of two sauces which may be customized for one tastes by adding of chili sauce, daikon and/or garlic. The ingredients were uniformly fresh and the overall experience enjoyable, but the amount of seafood was ridiculously small in relation to the price', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 2, 'date': '2011-03-31', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': 'BsOyfRuAkWXUkcgDaqVjSA', 'review_id': 'P6SOV5XQFn-UwsR0lek_RA', 'text': "Oh Goodness! This has to be my all time favorite restaurant!  The staff is super friendly, attentive and nice!! How many restaurants workers these days remember their customer's by name and talk to them outside of work? Not many, but they do! And it's not because I go every week. Truthfully, with my schedule, I can only get there once every 3 to 4 months, but my friends, family and I look forward to it every time! The food portions are GREAT for the price.  I noticed one person complained that they didn't get enough food for the price, but I think that is due to American portion sizing expectations. lol, compared to the rest of the world, we over-stuff ourselves. \n\n**The food~ I have tried everything there from t he Kobe Chuck, Kobe Ribeye, to the seafood platter and chicken platter. My Good Old reliable favorite is the Prime Rib Eye, Healthy size, Sukiyaki! Don't get me wrong, I like Shabu Shabu (cooked in water) too, but I LOVE LOVE LOVE their Sukiyaki sauce! It is their own special blend and it is SUPREMELY flavorful! I have been completely unsuccessful in my efforts to duplicate it though.. lol. They give you a hearty portion of veggies, rice noodles and meats. My personal recommendation- When you choose to cook your noodles, wait until the broth has reduced a little bit, then leave your noodles in the reduced broth for a few minutes to absorb the extra numminess flavoring.  All their food is FRESH!!\n\n*Now the staff~ they are AWESOME! They are always there when ever you have a question or just want another glass of water. I have never had anything more than a 10 second wait, and even the other waiters come to check up on you too, so every one helps every one else there. \n\n**ONE WARNING** They used to have a location on W Sahara, and due to landlord issues, they moved down to China Town. However the former landlord has decided to take up using the Swish name and logo, but the quality and service CANNOT match the original's! So, if you have a bad experience on W Sahara, I assure you, that company is NOT related at all to the Original Swish, locate on Spring Mountain road.\n**Really though**, if you are looking for something new, visiting Vegas, or just looking for a new Girls Night Out spot, THIS is the place to be!!\nAnd if you go in for lunch, be sure to say hi to Phil!  =)", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2011-04-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'B-mWdlaF3Ct7XtnZVIAGZg', 'review_id': 'yMsxS2DZtELLHTKvpskTFg', 'text': 'I love this place! My husband and I were going almost every week at one point. Kobe chuck with sukiyaki HANDS DOOOWNN is my fave!! I get the healthy size and can finish it. I cook half my veggies and udon first. I let the liquid reduce down then add the kobe chuck and caramelize it. If you caramelize the meat you will taste a BIIIG difference from when you just cook it in the broth. and I know I sound like a pig but I always ask for extra udon. I just love cooking the udon for a very long time so it sucks up all the flavor. Writing this review makes me wanna go eat there now! Lol. The staff is nice and friendly. I like when your servers can spark up a convo with you :)', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2011-04-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 2}, 'user_id': 'xGTSn8aKFDgbQKuXRhkGaQ', 'review_id': 'nJNWxRvx9qfKDNUfbtxXkg', 'text': "Shabu-Shabu time! I ordered the Vegetarian Delight Shabu-Shabu style. The Veggie Delight is a nice portion of various items including asparagus, napa cabbage, onion, green onion, carrot, broccoli, baby corn, mushroom, tofu and udon noodles. All the veggies were fresh (minus the baby corn)- a good sign!\n\nIf you're going with Shabu-Shabu, you get to cook your veggies/meat in a light and healthy seaweed broth, then dip in your choice of two sauces- coma sauce (sesame-based) or ponzu sauce (soy sauce and yuzu-based), and eat with a bowl of rice. I preferred the nutty, creamy, and slightly-sweet coma sauce over the ponzu sauce which was a little too salty. Nevertheless, I enjoyed my meal and was stuffed. \n\nThe waitress was nice, returning a few times to check on our water glasses and to add more broth when needed. The sukiyaki looked delicious; I'll try it next time.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2011-04-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'bJZpA9_zstijiME0jqrUxA', 'review_id': 'mCZerMq-SzHkS-zWQe4HJQ', 'text': 'For a Shabu place in Las Vegas (as opposed to J-town in LA), this place is pretty decent.  In general, I give Asian foods in Vegas a handicap of .5 to 1 star additional simply because this area in general is not the land of diversity compared to large metropolitan cities (I.e. NY, SF, LA, etc.).\n\nWe craved Shabu Shabu and this appeared to be closest to the strip.  Service was excellent, sauces were good, prices were fair.  We will be back. :)', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2011-04-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TLCIGu8lzvm58TpYSWphVQ', 'review_id': '-Wsn9VuB3ESNUXM5NwrVVQ', 'text': "Directly across the street from the (in)famous RAKU. Where Raku tries to portray a hip urban Tokyo vibe, Swish is like walking into a neighborhood eatery somewhere in working class Japan. Me think that a good thing. \n\nI have been to several Shabu Shabu locations in SoCal and even though Swish is a no frills version, I like it the best. Service is very attentive-and helpful- without being suffocating as many Asian places can be (got to turn those tables...).\n\nFood is very good and has generous portions. Prime Rib is really the best option. Beer is a nice compliment on a warm spring day but remember that Japanese beer is like a light-light version of its American counterpart.\n\nTake a nice three hour hike in Red Rock and stop by Swish on the way home. You won't be sorry.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2011-04-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WZ5Tb8Sx3u4tKL1_wrPLkg', 'review_id': 'BIblBJoCERd1zxfRgdFz3w', 'text': 'Shabu Shabu or Sukiyaki.\n\n\nWe get both. They do "healthy" and "hungry" plate cuts, order appropriately. We always get the Kobe Chuck if they have it, it\'s fattier than the Ribeye for only a bit more money and is worth it in my opinion.\n\nThey do a garlic chicken starter dish that\'s good if you need something else to eat.\n\nNot much else to say.  Friendly staff, great shabu shabu and sukiyaki.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2011-04-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0NUb6LNbKwMqXZW2bUXQcA', 'review_id': 'uOMzs9tdgNLPji-vGc-4Eg', 'text': "Never ate sukiyaki before and it was tasty morsels! (A BIG THANK YOU to Hot-n-Spicy Shrimp for opening at NOON for lunch! I was with a friend and we were hungry @ 11:30AM.) So Swish became our 2nd, No, FIRST choice! My friend has been here lots of times and she suggested we go here instead. Fresh ingredients, tasty broth and excellent service from friendly staff. Enough food to fill you up, and maybe take a little home, too. I had the beef, my friend had the mushrooms and we shared. Decent selection of beers, too. So if you'd rather not stand in line for hot shrimp on a hot day, just motor on down the street and enjoy yourself here.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2011-05-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8l351svY2y1yX5LFm8H3vQ', 'review_id': 'zRV7xfoGpk1Gl-3zQ6anFw', 'text': 'went here last week. the sauteed spinach with seasame was OUTSTANDING! delicious!!! however, the rest of the meal was ok. the vegetable meal i had included asparagus (the reason i ordered actually) and they didnt serve it because they were out. i asked for brocolli and never got it. food wasnt terrible but i wouldnt go back.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2011-05-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'DuPK8kp71h_Qu52rpxcmtA', 'review_id': 'DdJ26_igU79IZ2qgXhUgiA', 'text': "I am a huge fan of shabu shabu....... it is hearty, healthy, and perfectly portioned. It's a great way to avoid your typical greasy stir-fry and feel cleansed after your meal (:  Let's just say I've been to several shabu shabu places on the east coast. \n\nThis place was my first attempt at shabu shabu in Vegas. I must say I was greatly disappointed :(. Best way to explain why is to compare lunch at this restaurant with my prior experiences at other shabu shabu places. \n\n1) The base broth I am used to is more flavorful and a bit darker in color. This place was almost like water, so I had to make too many additions to get any flavor out. \n\n2) There is usually a good selection of vegetables and plenty of noodles, OR you can 'build your own' by choosing what you want as a combination. Here, there were no combo options and the vegetables are the same for each and every order. Broccoli, cabbage, asparagus, carrots, and tofu. Would like to see other options such as egg, corn, bamboo, bean sprouts, etc...  Also, the noodle portion is WAY too small even for a child, and the only option is udon. \n\n3) Service. I believe the girl on shift that day was inexperienced. She was on her own and we had to keep asking her over and over again for the same items. They don't provide you with a bowl and spoon for the soup so we had to ask for it. They weren't provided until close to the end... \n\n4) I would say most shabu shabu places, if not all, that I've been to had the built-in shabu pots. Here, they use the portable gas ranges, which I don't think provides the same kind of experience. We were finally given a ladle towards the end of our meal, which helped with the pots being elevated pretty high... \n\n\n*I must say the positive thing about this place was that the seafood is fresh and the meat is good quality.... they just need to work on portions, more menu options (combinations, build-your-own, etc..) and have better training in staff for serving shabu shabu, because it's different than serving at an average restaurant. Hopefully, they will receive enough customer feedback to work on their shortcomings :)", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 2, 'date': '2011-05-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'kREnSMpQPDezTYYJzk2oFA', 'review_id': 'GgSIRw-8lxPP8QzwWXleAg', 'text': 'This was my first time to try shabu shabu. I enjoyed the Kobe chuck shabu shabu w/potato noodle. It had great flavor and was delicious! I orderd the "healthy" versus the "hungry" portion and it was still very filling. Their garlic chicken appetizer is AMAZING!!! I definitely recommend this place.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2011-05-27', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 7, 'cool': 5}, 'user_id': 'ttjUfq7auCNVkPXAl_0wrw', 'review_id': 'rwVM7eF90byCOf2YDiM8mw', 'text': 'So i\'ve a little confession, I\'m a groupon addict. I bought the $15 for $30 coupon to come here, and let me tell you I was impressed.  From the minute I walked in, the aroma of yummy goodness filled my nose sending my stomach into a raging fit.  The interior decoration was pretty simple and low key, which I did like.  The lights are dimmed out, almost seemingly romantic if you ask me.  Upon entering we were immediately greeted by the hostess, which quickly seated us to our seats.  From there she handed us a thin menu, which seems to still be in the works I presume? Regardless of that, me and my friend both confessed to never ever doing shabu-shabu before.  The waitress was kind enough to explain what it is, and what she recommended. In my eyes, that was great customer service.  She recommended that we try "sukiyaki" mix if we weren\'t too familiar with the shabu-shabu flavor, since it does have more taste.  \n\nMy friend and I skimmed through the menu and came to the decision of trying their prime beef and the garlic chicken.  As soon as the waitress collected our menu, our food was out within the next 10 mins. I was merely impressed with how fast they worked to keep their customers happy, and not waiting.  The garlic chicken was amazing, crispy and fried to perfection.  The sauce was just I imagined it to be, if you\'re from Hawaii and had the Mitsuken garlic chicken.....lemme tell you, this is almost an exact replica.  The meat came out for the sukiyaki portion, and yes, it was amazing too. The taste of the broth was uncanning almost like an outter body experience.  I loved the udon noodles they gave, and the nappa cabbage.  Honestly, just eating that in your broth makes the meal amazing....adding the meat is just a plus.  \n\nI indeed shall give this place another try.  Their appetizers looked to enticing to say no, if you\'re ever in the neighborhood come by and give it a try. I promise you, you won\'t regret it.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2011-06-01', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 5, 'cool': 2}, 'user_id': 'WJIslBDXUCVv420UW1OQFQ', 'review_id': '5vsqRTCzG7Dy-8mQKrZm2A', 'text': "4.0 Stars\n\nI know it's Summer in Vegas and I know it's a bajillion degrees outside, but after eating on The Strip for a while I was craving a good, healthy, and authentic Asian meal and Swish Shabu Shabu delivered. Typically I love to have hotpot during the Winter months, but the balanced mix of meat and veggies hit the spot.\n\nSwish Shabu Shabu wasn't too busy when I arrived around 6PM. My server told me they typically get busier later in the night around 8PM or so. I guess people in Las Vegas eat later in the evening!\n\nThis restaurant offers a variety of meats to choose from including typical beef to chicken to seafood. I picked the Kobe Chuck since it was a step up from the Prime Rib-Eye and it had a nicer fattier texture. \n\nSo there are two sizes to pick from: \n\n*Healthy that is 6 oz. and consists of 10 slices.\n*Hungry that is 8 oz. and consists of 15 slices. \n\nAfter picking the size you can pick the broth:\n\n*Shabu Shabu that is a clear water broth.\n*Sukiyaki that is a richer soy sauce based broth.\n\nThey'll bring out an individual propane cooker for you to cook all your ingredients in.\n\nAccompanying your meal you'll get a bowl of rice, two dipping sauces (ponzu and peanut sauce), side condiments (minced garlic, green onion, and chili sauce) and a plate of vegetables. I remember seeing these items on my veggies plate:\n\n*Napa Cabbage\n*Tofu\n*Mushroom\n*Onion\n*Green Onion\n*Carrots\n*Udon\n*Broccoli\n\nIt may not look like it, but there is a ton of food. I was definitely grabbing my stomach by the time I cooked my last slice of beef. The Kobe Chuck pieces were quite tender and remember not to leave the beef sitting in the broth for too long. \n\nMy servers were also very courteous and hospitable the whole night. They even helped me get a taxi back to my hotel.\n\nBe sure to check out Swish Shabu Shabu to have a nice Japanese meal off The Strip.\n\n== A MUST TRY! ==", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2011-06-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'kGOgxrVD4sWla1ah7EV0FA', 'review_id': 'u1Vq8VOTByyaR9fAoNXuVQ', 'text': 'Really friendly staff food was great. The waitress kept coming and refilling our drinks and our soup base and asked if we were ok. I would definitely go again. And price was good too!', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2011-06-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 3}, 'user_id': 'v-HksoosvZozoWmkKr7gSA', 'review_id': 'JqxPGu8RBwVsC3L8lMwfMA', 'text': "I haven't had much experience whne it comes to Shabu Shabu, but I know quality when I experience it.  I have only been to Shabu Shabu Paradise in Henderson, so unfortunately I have no other basis for comparison. \n\nI had just gotten the Groupon deal and decided that it was a healthy option that I wanted to try out for dinner.\n\nWhen we got there, though, there were only 3 other tables occupied at about 5:30pm on a Friday.  \n\nThe menu, though, was awesome--meats, meat sampler, seafood, and chicken.  My boyfriend and I were hungry, so we each opted for the bigger/hungry size portions (8 oz. meat, roughly 15 slices).  For those of you not too hungry, you may want to try the smaller/healthy size portion (6 oz. of meat, roughly 10 slices).  You also get a variety of sides, along with white rice.   \n\nUnlike Shabu Shabu Paradise, the burner isn't built into the table, but is a portable unit where you get a bowl and some vegetables/tofu/noodles (sides) to cook.  The type of broth, though, is where the cooking differs.  For those of you that prefer less seasoning/plain eating, choose Shabu Shabu.  If you like Soy Sauce, though, definitely go for the Sukiyaki.  I opted for the Shabu Shabu, since I tend to like my food more on the plain side (sensitive stomach).\n\nAlso, they do give you more seasoning options, such as dipping sauces--peanut-based and ponzu, as well as other ingredients (garlic, scallions, chili sauce) to make an altogether different sauce.\n\nRemember, if you get hungry, you can get refills of the veggies/tofu/noodles without paying extra, but will have to shell out more money otherwise.    \n\nI was so hungry/focused on the meats that I almost forgot about the veggies/noodles/tofu.  Regardless, I enjoyed, and did NOT have to order anything extra.  Granted, it's not the same as a buffet, but I did \nlike this healthy alternative. \n\nThe service was pretty good, and they made sure to come back regularly for refills and to check on our progress.  I was afraid that I was annoying them because I kept accidentally turning off the propane a few times in the middle of cooking.\n\nOverall, I enjoyed this experience, although I would rather have paid a little less...oh well.\n\nI'll definitely be a repeat customer, especially since I have another Groupon to use :).", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2011-06-30', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '562yN3nT7OWj1HDEzBjyrA', 'review_id': '4dz0z6472dCWWVJzJSY36w', 'text': "Healthy food so you don't feel so guilty after stuffing your face.  You can't really give this place a bad review...because if you didn't like it...you cooked it yourself!  I loved this place, we did the sukiyaki (which we didn't know the difference between sukiyaki and shabu shabu) the server explained everything to us and helped make sure we didn't burn the place down.  I thought it was awesome and delicious!  *only con- it gets to freakin hot cooking your own food and you end up smelling like meat....I guess the smelling like meat part is actually a pro!  I will return shabadabadubu (as he calls it)", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2011-07-07', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'oORsDVytfcoo3oqARp76uA', 'review_id': 'LE93eSqArSJWowAEvxe7Qg', 'text': "Mmmm Swish is so good. One of my favorite restaurants in Vegas and it smells so yummy when you step in :) \n\nThe sukiyaki is a little sweeter than other places that I've been, but that's how I like it. Definitely get the Kobe Rib-Eye or Hungry Meat Lovers. The crispy garlic chicken is tasty in a deep fried unhealthy kind of way, but I'd recommend skipping it and just eating the meat and veggies. They give you a pretty decent amount of veggies - tofu, udon noodles, cabbage, broccoli, carrots, broccoli, etc...  \n\nWorth coming here.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2011-07-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'd4IyDGfNwLD9b5h-odQt_Q', 'review_id': 'nx8UHNH23QjHbIcBMUFVmw', 'text': 'friendly service and staff, great food and fun experience!', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2011-08-03', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'mB6c94BgweAovjfbRJ2lCw', 'review_id': 'qzNQgFWGI0T42OKN5-t6Cg', 'text': "Friendly service and yummy food. Plus it's fun! (and it helps when you have a groupon)\n\nSwish was tasty. The staff was friendly, mixing and pouring our broths for us. Me and my fiance both ordered the sukiyaki. We went in for the lunch specials. I ordered the seafood and he ordered the kobe chuck. The way the veggies and the noodles soak up the salty, sweet flavor of the broth was amazing. You also get a bowl of rice so you definitely are full when you leave. \n\nThe prices are a little high for an average lunch. For a cup of sake, one lunch kobe chuck, one lunch seafood combo, and one order of green tea ice cream, the total bill was $42. But we had a groupon for $30 so our bill was only $12. I'd definitely go again and bring friends.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2011-08-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IKAkVSbAO-b9FjIUnPAzHg', 'review_id': 'bfhfY1xS-WHz-uls7DHOHg', 'text': 'Been going to Swish for quite a while - one of my most favorite eating experiences. \n\n\nThe old Swish on Sahara has different owners.  Not so good (different sauce, poorer meat quality...)  Stick with the Swish that does it right!', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2011-08-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'nd00BeTZ686RAHzyBE8WSA', 'review_id': 'WAmJ7M09i_ofZuDvK3DUvQ', 'text': "So what more can I say about Swish as I go way back to when the previous location on Sahara and Buffalo was the place to go for Shabu Shabu and Sukiyaki. My brother and I had the great opportunity to go to the new Chinatown location last weekend and my hats off to Phil because the food is even better now. The Crispy Garlic Chicken and Sassy Calamari appetizers were a delicious way to start and the Kobe Chuck in both ways of cooking was the best meal we had bar none during our stay in Sin City. You can't argue the bang for the prices and if you enjoy spicy, go with the Spicy Salmon Salad... I could eat that all day! We went during lunch hours and our waitress Hazuki did a great job taking care of us. Great food, great service.. and now its closer to the Strip. Definitely go check it out folks.. you won't regret it=)", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2011-08-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wQtlSOxdugtiJfB8bH1K_w', 'review_id': '4TeYNrbf7v1QiFZGpqWc7g', 'text': "Not the best Shabu Shabu that I've had in my life, but its alright.\nThere isn't a wide variety of condiments they supply to put in your stock or in your dipping sauces. Its lacking the dried chili peppers, and/or chili oil, etc.\n\nTables are a little more cramp than most places and the decor is really lacking. \n\nWE had the shabu shabu and sukiyaki. Again nothing spectactular, but it statisified my craving for Shabu.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2011-08-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Q3PTm7I9xAru4kd2mljM0Q', 'review_id': 'HoXDit8gbKfqcvePx1IjEA', 'text': "love the dipping sauce of their Shabu Shabu.\nordered mushroom Shabu Sahbu with salmon side dish and also\nwasabi octopus.\nreally good and healthy.\nif you want to take a break from the greasy food in Vegas, this is the place to go.\nBecause I don't eat rice or noodle so the server actually substitute more veggie for me!\nsuper good service thru the whole meal!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2011-08-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_k4YraIsteWuxtrAcnTGIg', 'review_id': 'gMMeeMja7Bh_au5gP7DxaQ', 'text': "Both the sukiyaki and shabu shabu styles offer a fun, tasty experience.  They promote Kobe beef, which I assume is Wagyu since there is no more Kobe beef in the world.  It's all fresh, tasty and fun to mix and match yourself.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2011-08-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '91t34mH0LKKL0itzdN8k2g', 'review_id': 'Z7GQ0G7fSTDsCAOpz6BbyA', 'text': 'This is the best Shabu Shabu place in town.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2011-09-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bfxL20YM3OqtIh1gzTKbfg', 'review_id': 'Me4XkYgtb3ksFaI0M89rGw', 'text': "Came here with great expectations after reading all the reviews and was in the mood for hot pot while on vacation.\n\nGot here at lunchtime ~ 1pm, and the restaurant inside was dark and cold.  I don't think it helped either that there was nobody in the restaurant except for 1 waitress and 1 cook.  \n\nSo we decided to give it a try anyway and ordered off the lunch menu- kobe chuck and combo seafood.  We did the plain broth which is essentially water, and the sukiyaki.  Each plate came out with very thinly sliced or fish for the salmon and I was thinking, ok, is this all I'm getting?  She came back with a bowl of rice each and a plate of veggies for each of us, which contained some napa cabbage, a few mushrooms, a tiny bit of udon, onions, 3 green onions and 3 slices of carrots.  We cooked our food and the shabu shabu had no taste at all (since it was just water) and the sukiyaki was just like teriyaki sauce.  $30 dollars later (we just ordered the 2 dishes, no drinks), unsatisfied, we left and went next door for malaysian food.  \n\nWe will NOT be returning to this place!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 2, 'date': '2011-09-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7mr__c9hWwk2CBrMsT19gA', 'review_id': 'QgwZYoGa1Jg2S4zp3rOgvg', 'text': "We were on vacation and figured we'd try out this Shabu Shabu place.\n\nIt was okay, the meat was a little bland, not much fat on it which made it kind've lack flavor.  \n\nI wasn't a fan of their peanut sauce, their ponzu was decent.  By the time we got out of their it was about $60 w/o tip for two.\n\nNext time in Vegas I'll probably try another Shabu place, or just go to Benihana at the Hilton to get my asian fix!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 2, 'date': '2011-09-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2Qg2ElBTpUehse0_JHtoPA', 'review_id': 'ArU2bDvCrHcGva6sttPxqA', 'text': "This is kind of a ghetto version of shabu shabu.  Usually the hot pot thing is built into the table but they have those portable ones with the gas canisters here.  The service has been good the couple times I've been here.  I've tried both the shabu and the sukiyaki.  I made the mistake of getting chicken last time, assuming it would be chicken breast but it was the dark meat.  It was only $2 less that getting steak so I was really surprised to get such crap meat.  Stick to the steak.  Try the sukiyaki for more flavor but if you are sensitive to salt you won't like it.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2011-09-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XR0Pk13i4y22we19tGjDBA', 'review_id': '6eF3Tf4B9fXtZG8FSTZ9tg', 'text': "Mmm, Mmm, simple but good.  I go for the rib eye, kobe is good but it isn't that much better that a good marbled ribeye.  Not a big crowd there, but I don't know how many people good for shabu shabu for lunch.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2011-09-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IIVCBQfKR80J6rNrUG7zuw', 'review_id': 'zc2x0TamgLz1m2DvJ_ZIcg', 'text': 'I am a huge fan of shabu shabu and this place did not disappoint.  Great portions, fresh veggies, great service.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2011-09-20', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 7, 'cool': 6}, 'user_id': 'ia1nTRAQEaFWv0cwADeK7g', 'review_id': 'JeKrZLTA6NQSf1xIkWJP9Q', 'text': "Yet another Groupon alert. \n\nI've been to the Swish on Sahara on quite a few occasions (usually when I scrounge up a coupon or two), but had never tried the newer location on Spring Mountain. When the Groupon popped up a few months ago, I snatched some up and have been planning my trip. \n\nWe ordered the Kobe large portion Sukiyaki and the mushroom party Shabu Shabu to share. I'm not a big fan of cooking food myself. I will often make the sacrifice for some AYCE Korean BBQ or Shabu Shabu and this was one such occasion. \n\nMy fella had never tried Shabu Shabu or Sukiyaki, but I knew he'd love it. What's not to love flavorful meat, rice, veggies and noodles. \n\nThe staff was friendly and attentive. The place was really empty for a Friday evening around 9, though. There are so many great places to try on Spring Mountain, I know there's a lot of competition for them, but I highly recommend this place, especially with a coupon. Excellent deal!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2011-10-02', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'XWtoW-j52ld7Kl7hBwhxIA', 'review_id': '_rN0WaiUA4ITpENYCHzG2A', 'text': 'I must admit I love shabu shabu and for something close to the strip it is pretty good.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2011-10-11', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': '42g4FeE8w1scpowvVb809Q', 'review_id': 'GfbtpXTnSwR7ZG5Fs_l0Pw', 'text': "I was really impressed with this place.  This place gets a 5-stars hands down!\n\nPros:\n*  Staff is super-friendly\n*  Food is amazing\n*  Informative staff \n*  Sushi now on deck\n*  Spacious seating \n* TVs and Bar seating\n\nCons:\n *  N/A\n * No Wi-Fi  \n\nTips:\n * Try the Garlic Chicken (appetizer)... It's amazing!!!!\n * They now have sushi, so if you are in the mood for sushi and Shabu Shabu.. this is a one-stop shop.\n *  Ask if they have any new flavors for their Sukiyaki.  \n * Don't be scared to adjust how much broth you use or the level of fire.\n * Extra Garlic and Extra Chili Paste is a must!\n  *  Drop off your business cards on their front table.\n\nOverall:\n *  I'd definitely come here again..  Read below.\n\n  When you combine good eats with good service, you can't go wrong.  This place has it all!  Not only was our service really friendly, but he was very informative and answered any question we had about menu items.  He even gave us a little breakdown when it came to Shabu Shabu and Sukiyaki.   We ended up ordering both and really had a chance to taste the differences in cooking styles / broth.  The pricing for Swish is really decent too.  They even have lunch specials for you early birds.  Everyone at the table gets a burner (if needed, depending on what you order) and the seating is quite spacious.  The overall ambiance of the restaurant was calming as the interior was red in color.  If you happen to be dining along, there is also a bar area with flat screen televisions for your viewing pleasure.  I asked the guy about the sahara location, but he told me that one was closed down and they relocated to this location (spring mountain).  I'm not sure if anyone has ever been to the older location, but this one is much much better.   I need not say more..  Come check this place out for yourself.  I'm sure you won't be disappointed.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2011-10-11', 'type': 'review'}
{'votes': {'funny': 8, 'useful': 15, 'cool': 10}, 'user_id': '-K3ZjROK0ml2P-Rk7ttHzA', 'review_id': 'lge2IpacVNt4yJYF69LLHg', 'text': "The place was very dead when we went on a Monday around 2pm. We were literally the only customers there for a good 30 minutes or so. Then the regulars/friends came in and started eating. I figure more people come here for dinner though. The ambiance was dark and intimate. There is a bar area where you can sit or many tables that seat about 2-4 people. When we sat down at a table for two, the waiter asked me if a wanted a chair for my purse. Let me repeat that...A CHAIR FOR MY PURSE. Well f*ck yes my purse would love a chair! I don't think I've ever been asked that in my whole history of dining. My boyfriend and I were both a little taken aback when he asked me that. \n\nWe started off with the Crispy Garlic Chicken ($7.95), which was phenomenal. The chicken was crispy, juicy and garlicky and the sauce was just oozing with all sorts of flavors. We were originally going to get the calamari, but if there's one thing we love more than calamari, it's garlic. After being schooled on the difference between Sukiyaki and Shabu Shabu, I opted for  healthy size (6oz) prime rib-Eye Sukiyaki ($14.95) and my boyfriend got hungry size (8oz) prime rib-Eye Shabu Shabu ($18.95) in their new Spicy Miso broth. These both came with a small bowl of rice and a plate of veggies, udon, and tofu. This was actually my first time ever having Sukiyaki, so I don't have much to base it off of, but I still found it to be pretty damn delicious. My boyfriend actually enjoyed the Sukiyaki more than the Shabu Shabu because it was just so flavorful, although a lot less healthy than the Shabu. The waiter told us to wait until the sauce got a little thick because it would make it have more flavor, so everytime I took out the cooked meat, it was drenched with all kids of goodness. The Shabu Shabu was okay, but just boring compared to the Sukiyaki. I'm sure if I tried the Shabu first, I would've liked it more, but my taste buds were spoiled from he awesome Sukiyaki. \n\n*Tips\n-Ask them what flavors they have for their Shabu Shabu broth. When we went they had Spicy Miso and for an extra buck, you could also get soy.\n-Lately, there have been a lot of Groupon Now deals for this place, so you should definitely check that out before arriving. We got a Groupon a few months ago, so our bill only came out to $17 for all that!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2011-10-12', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': 'oKo_6ooJt9PAenpG_LsyaQ', 'review_id': 'NH1vJXIE6IRyWJ1D-vUDJA', 'text': "I love Swish Shabu Shabu :-) I have been going for a good 4-5 years. I used to go to the one on Sahara, but the last few times we have went to this one. I get the same thing everytime (Rib eye Sukiyaki) and a sapporo, and usually some edaname. \n\nIts a fun place if you aren't looking to get waited on, cause you cook everything yourself. Its a different and unique dining experience. This location is quieter, and more cozy than the one on Sahara so I think I prefer this one. Everyone is extremely nice and welcoming.\n\nFood is fresh and taste fantastic. I feel like I am eating on the healthier side here, which is always a good thing. Everything is priced reasonably. I would recommend going here for a fun dining experience, either with a group of friends, or a quiet date night!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2011-11-01', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'R1xgU5qLdX43rY87jQcJQA', 'review_id': '7JSnQyZRovEI4BLzOeSxaQ', 'text': "I'm a shabu fanatic and idk maybe I'm just being biased because Vegas is just not up to par with SoCal shabu standards...? but this place did not impress me at all. The meat (I ordered kobe chuck) had great texture, but the flavor was off. The peanut sauce was sort of chunky and too sweet. The veggie plate was very very very minimal and not fresh. They did not have the option of brown rice. Service was super slow. The only reason for a star? The sushi chef was so nice! And one more star for the delicious spicy tuna roll. BUT isn't this place supposed to be known for its shabu? MEHHHHHHHHHH.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 2, 'date': '2011-11-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oFFr_xijw7Yb_gMegBi6tQ', 'review_id': '1qijBJGIlXV3KklwSKb58Q', 'text': "I've been here twice, the first time for shabu shabu, the second time for lunch. I'd never done shabu shabu but I was there with a Chinese friend who does it often, and neither of us were too impressed. We all got individual pots instead of sharing one, the liquid was just water instead of broth, and the items were all a la carte and a little pricey for what they were. It was fun, but not that yummy.\n\nThe second time I went it was for lunch. The place was completely dead, but I got the garlic chicken which is REALLY good. I'd go back just for that but something keeps holding me back... there are no windows at all in the dining area! The place is dark and downright dreary, especially since it's usually pretty empty. Plus someone needs to IRON that piece of fabric they have hanging on the wall, it's got creases in it from when it was folded and that just drives me nuts.\n\nBut seriously, a window is a MUST. They have a window that's blocked by peeling window decals and a wall, I say take both of those down and the place will get a lot more business!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2011-11-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VAhr7AeA4TfJkoy-axIM_w', 'review_id': 'DJUZX4VIopURk1vrQtDexQ', 'text': "Courteous workers, but not enough waiters makes for poor service.\n\nAlso, the Shabu Shabu setup did not come with any real spices to make the soup taste good.   The waitress didn't even give us any soy sauce or salt to spice it.  Even when we added it, the broth just ended up tasting horrible.\n\nThe soup can only taste as good as the ingredients they provide.  With bland spices, it's hard to make it taste good.\n\nIf you want hotpot, go to a Korean Hotpot place instead.  Much better than this place.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 2, 'date': '2011-11-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9Z2b2dpp-k4F4gceJfHgLw', 'review_id': 'hiS8kTkqu-mlEUdR4pyOIw', 'text': 'This place is less than honest. We turned up on a Saturday evening at 7 pm,  we were the only customer, afterwards, there were three more when we left. We ordered the dish "meat lover" for the hungry  at 39.95-, which was supposed to include prime rib eye, Kobe chuck and Kobe rib eye". To our surprise, a waiter came up silently with a plate that has one row of meat  undistinguished of any kind, Kobe or not, it all looks alike  . next, it was worse when we tasted it, it was less than fresh, and for a hungry meat lover, it was a real bad experience that mad us run away. We then tried to stop by Monday at lunch time, to make our complaint, the manager duly took note and said he would review the camera in the kitchen and contact us, alas, we never heard of him again, so we assumed the the camera did not lie!!!!', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 1, 'date': '2011-11-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xT3nCjsC6LHtrid-0LWQ_w', 'review_id': 'ZkcGxdYlG3djbSEV2RNvKw', 'text': "So far, every restaurant i've tried in this plaza (just two lol...) have not been that great. The restaurant was completely empty at 12 pm...only one waitress working and a couple customers went into the restaurant after us and she seemed quite frantic. Took a while for the food...a tiny plate of veggies with broth that tasted weird. Ponzu sauce had a strange taste to it. Meat still looked frozen and was not great at all...miso had a weird sour taste. Overall, I didn't like it. Sesame sauce was good, but I probably won't come here again...", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 1, 'date': '2011-11-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 5, 'cool': 2}, 'user_id': 'glRXVWWD6x1EZKfjJawTOg', 'review_id': 'gvLuEKdHzzQgmzJL-yBO8g', 'text': "Angela H. had a groupon expiring so the BF and I got invited to lunch.\n\nI got mushroom party lunch ($11.95) with sukiyaki and the BF got the seafood platter lunch  ($14.95) with spicy miso shabu, Angela shrimp with spicy shrimp shabu. All come with a plate of veggies and noodles and some rice. All the ingredients were fresh and good. I think out of the cooking styles I prefer the sukiyaki for the mushrooms and the seafood was better in the shabu. Their miso creamy sauce was decent, ponzu okay, but I was hoping for another sauce that was offered that is more savory salty for shabu (sukiyaki you eventually dont need it). \n\nWe had shit luck though and first Angelas burner ran out of gas, then it was the BFs canister and then mine. Made me wonder why they even bothered with camping burners that take little gas cans to power. After we go our food it got busier and it was hard to flag the waitress down for some drink refills and such. It wasn't bad, but just OK service. \n\nI think for the amount of food, it was a good value. I am a fan of shabu shabu style and haven't had it in a while. Definitely will return and hope for no burner fiascos.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2011-11-16', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': '4sVnHVZplik1XZgRZGMqYQ', 'review_id': 'uZV-lF3WSruFSu0zvdZZkA', 'text': 'BAM!!! That was  some gooooood eatin.\n\n10-15 minutes off the strip but so worth it. The spicy miso broth was so tasty especially after cooking the meat and the veggies. For $20 you get a large portion of prime rib eye and veggies. So worth it.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2011-12-27', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'u2Wmk90ocZadbljayDViFQ', 'review_id': 'rpTuHyHQvtW5zsTt98V4Kw', 'text': "Your standard Shabu-Shabu. I went for lunch and ordered the prime-rib lunch portion 4oz of meat plus veggies and rice for about 12 bucks. A little dingy inside just like the rest of this building and the burners are portable, not built into the table/bar.  Our server did a great job despite being the only server working there. I'll go back.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2012-01-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'gRYbAPrGHzsLVu98j-Depg', 'review_id': 'kU26y9vc0vt6zHM5vCzCeA', 'text': 'My boyfriend and I were looking to get away from the strip and wanted to eat somewhere the Vegas "locals" do and found Swish through Yelp.\n\nPros:\n-Cheap Shabu Shabu\n-Friendly service\n-No wait\n-Open late! +++\n\nCons:\n-While the service was friendly, it was painfully slow at times\n-The meat was not fresh. By its dark red color, you could tell that it had been cut in advance and stored in the fridge before it was served to us.\n-The individual gas-powered shabu pot ran out of gas in the middle of my meal! It was a bit awkward having the server reach around and plug in a new gas can to have it re-start.\n\nIn the end, I felt our visit here wasn\'t worth our time. I wouldn\'t recommend it as a place to visit as someone from the area or not. Maybe I\'m spoiled by all the shabu places in CA? Who knows...so sorry Swish :(', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 2, 'date': '2012-01-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'l-1Ti_hHb8QIJFG0CbINIw', 'review_id': 'tzjnT_N3lISPxKYA9rfSLQ', 'text': "My buddy and I came here looking for something warm.  The ramen place we wanted to eat at was crowded and we did not really want to wait so we tried out this japanese shabu shabu joint.  Apparently, there are not that many shabu shabu places in Las Vegas so this one is supposed to be the one to go to.  \n\nWe entered the place and it felt underwhelming from the start.  The restaurant is nothing more than 4 painted walls, a bar, and some tables.  We were seated and we took a look at the menu.\n\nSwish menu: http://www.swishlasvegas.com/menu.htm\n\nTo be honest, it is not the easiest menu to read and they use terms like healthy and hungry instead of small and large portions.  My buddy and I have been binge eating all week so we weren't that hungry so we opted for the healthy size.\n\nThe food came out decently fast and she turned on our burners.  They use the can of gas burners here and ours didn't run out but i can see that happening and being awkward.  But the food was just mediocre. The sauces seemed very salty and to me it just was very blah.\n\nThe healthy serving size is really healthy.  My buddy does not have a large appetite but even he was ready for round two of dinner after we left swish.. I guess if you are dying for shabu shabu in Las Vegas you should try here, but i've been to shabu shabu places that are much better than here.\n\nOh, tourists this place is about 10-15 from the strip, in my opinion not really worth the travel. To each his own though. It is safe to say I most likely won't be spending my limited meals in vegas here.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 2, 'date': '2012-02-12', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'Iu3Jo9ROp2IWC9FwtWOaUQ', 'review_id': 'WshyuICtfoRhD3vrRn1uvA', 'text': "I just don't get shabu shabu.  I've been wanting to try it for a long while and today was the day to give it a try as I was in Chinatown to see a matinee show and then was going to the Gold Coast for an evening show.\n\nThe woman greeted me warmly and she knew I was a neophyte.  She explained the menu to me.  I chose the healthy portion--6 ounces of rib eye and the vegetables that come with it.  She then helped me choose the cooking liquid.  I went with the spicy miso broth and it was very good.  \n\nShortly after placing my order, the platter of meat was placed in front of me and an assortment of jars of spices, sesame oil, mixed pepper spice and the vegetables were put down and I was left to do my thing.\n\nI really wasn't sure exactly how to attack the cooking.  Do I put in a fair amount of vegetables and let them simmer and then cook some beef quickly and then remove.  I just winged it and did things the way I guessed it should be.  I had one empty bowl, for liquid I figured, and a small plate for the solid food.\n\nMy thoughts range along these lines:\n\nIt's a lot of work for what? \nIt tended to be a bit messy for me.\nI think a slotted spoon or mesh ladle would have been nice to have to aid removing some of the harder things from the pot.\nThere was nothing that stood out about the meal except the spicy miso soup left after cooking the meat and vegetables in the broth.\nWhy is it that most Asian restaurants with a sushi bar assume that a person eating alone wants to sit at the bar?  I found the height of the burner and pot on the counter to be harder to get to.\n\nPrice with one iced tea (I was never asked nor offered a refill) was just under $19.  Add tip and you have an expensive meal for not much food and I did all the work. \n\nFor $20, I'll go to any other Asian restaurant and I'll be served and not have to screw around with a burner.  I'm glad I tried this once.  I'll be eating elsewhere in the future.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 2, 'date': '2012-02-19', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'fJ2LdyeojnIKx4waf_C_5Q', 'review_id': 'im7NYwSsxieEfkXG9SKkCw', 'text': "Wonderful! The service was excellent, and the food was great. For $30 we got an order of the Shabu shabu with shrimp, and a few rolls of sushi. The sushi maker, sorry if there is a better term, was very friendly too! The restaurant is pretty dark, but really nice and relaxing. I didn't notice a bar, but they do have a TV.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2012-02-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': '7gMsfouCnpNRQ8U-ovBKJw', 'review_id': 'wGcj4tYm_wLQFBsEoUYOjw', 'text': 'This place is the best.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2012-03-02', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'vCrvxPg0Q8cNpVIfYk52-A', 'review_id': 'xRXKAapoHo_UXqhpsYc2gA', 'text': 'I really like this place. I travel a lot see a lot of different styles and types of restaurants and this one I would have to say is probably one of my favorites. The food was good you get to cook it yourself, if you like spicy the miso spicy broth is what I like definitely try the shabu shabu. The sushi roll great also..', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2012-03-03', 'type': 'review'}
{'votes': {'funny': 5, 'useful': 5, 'cool': 5}, 'user_id': 'aAsxorMmHDNmZfx43h2rEA', 'review_id': 'NTl2iMIIBgMZsJYT8rZ9CQ', 'text': 'My first Shabu! It was fabu! (groan....)\n\nSeriously though.  I really enjoyed the experience, and the spicy miso shabu shabu was delish! I confirmed with our server that it (and the seaweed broth) were vegan, and I was good to go.  I got the vegetarian delight, and I was pretty delighted.  The soy-ponzu dipping sauce was tasty and a nice compliment. (The sesame sauce is mayo-based, so I skipped that).  The meal was light, but filling, and very fresh-tasting.... and quite a deal at only $8.95.  My only complaint is that my plate was about 1/2 nappa cabbage, with only about 1 oz of tofu, and a few slivers of other veggies.  I love me some nappa, but I\'d prefer a little more broccoli and udon noodles (OMG, the udon noodles are SO GOOD).  Maybe next time, I\'ll just order and extra portion of tofu and noodles??  \n\nThe point is, there will definitely be a next time.  I can\'t believe I haven\'t tried this before!\n\nI found my friend\'s seaweed broth to be a little bland, but they have nice containers of chopped garlic, onion, green onion, and chili sauce that you could use to flavor it up, if you\'re a DIY sort of broth maker.\n\nThe service was great, the ambiance was nice, I even enjoyed a little sake, which I don\'t usually care for.  They served our large group (10 ppl) as well as a full restaurant with grace and aplomb.  \n\nPart of our group ordered sushi and apparently, the "spicy" ones should say "THESE ARE ****ING CRAZY MAD SPICY."  So, if you\'re into heat, they can bring it.\n\nSo, who wants to go get some Shabu with me? UYE?', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2012-03-05', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'h1_96ObpG9MHq89QWsx8FQ', 'review_id': 'QKiu5ii7kFKTVOeJOhD7OA', 'text': 'One evening of uncertainty of what food to eat, I turn into a plaza to eat some malaysian food at the island.  Little did I know that my fiancee are not feeling it tonight, so I told her, no we are not eating malaysian tonight, we are eating shabu shabu. Its right there.\n\nI am crossing my finger hoping that I hope its pretty good. When we came in, its almost the end of the night I guess, cos there is only one other table that was eating and they almost done. \n\nThe place looks dead, so I was worried. Anyway, since we already in, might as well try it. Turns out, its absolutely wonderful. Enough portion of meat, too little vegetable, :) Good attentive service and most of all wonderful spicy miso broth.\n\nThanks swish shabu shabu, you made me a believer in shabu shabu again.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2012-03-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TK7UNtlWh97fFURNFSoxyw', 'review_id': 'TAmKJdlvRNU067z0XhSkzA', 'text': 'Simpy said this place is overpriced and the food is just average.  I ordered the Sukiyaki and there was plenty of broth in the pot but it was very bland!  Sigh, and what is Sukiyaki without the raw egg?!  Bleh, never coming to this place again.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 2, 'date': '2012-03-24', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 7, 'cool': 5}, 'user_id': '6d6PyGPyiw_mAcA030Cyng', 'review_id': 'lIStfHOlcp9lvEcMyDCrUA', 'text': "Will the real Swish Shabu Shabu please stand up??\n\nSo I had some issues with the faux Swish in another location, and was invited here after that epic Groupon fiasco but never got around to it until today. \n\nWell I am so sorry that I waited. This Swish is absolutely fabulous! (It also helps that I can go down the street for a Trader Joe's run afterward...) My husband and I both ordered the vegetarian platter and shared an order of edamame. The young woman who was serving us was very helpful and personable, and I loved that they brought all the condiments to you so you can more into the hot pot to your liking. She gave me a very healthy dose of garlic so I refrained from adding anything else. \n\nThis vegetarian dish was HUGE! It was one gigantic plate filled with lettuce, mushrooms, baby corn, carrots, noodles, a little tofu, onion, and green onion. Although it was bountiful, I would have personally liked maybe some zucchini, some extra tofu and a bit more mushrooms than the extreme amount of lettuce on top. Just my preference ;) It was really good though and I liked that the hot pot was right on the table and was in very easy reach. This also came with white rice which was deliciously sticky. I would have preferred brown, but white was good too. The edamame we had as a side dish was tasty. \n\nI cannot even begin to tell you just how full I was - well, am! It's been a few hours since eating and I am still pleasantly stuffed to the brim! Our server was attentive, and to have a ridiculously filling and healthy meal for two for under $30 was a great deal. I will definitely be back to THIS location and no others.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2012-03-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 3}, 'user_id': 'Ct75kKuLsXtncdD5SjBfJg', 'review_id': '07e-50hVtqtpF1av7X8H0Q', 'text': 'my party and i were accidentally charged for an $8 side of cabbage....so i yelped about it\n\na few days later i received a yelp message from the owner/manager who verified that the charge was accidentally made and then very politely offered a correction and $30 credit next time we went back!  \n\nim not sure when the next time will be since I dont live in vegas but i highly recommend swish shabu shabu on spring mountain!  service was great and im so surprised to see a business owner who takes responsibility for their business!\n\nthanks swish and hope to visit soon!', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2012-04-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '69g7n-G8hGpiu_v1hrvbcg', 'review_id': 'jKCF1UXhsW_VZ8Vz80uyPw', 'text': 'I really hate to write a poor review of this yummy shabu shabu spot. If I could eliminate the last 30 minutes of our visit it would easily be a five star place. Ordered spicy crab roll ($5.50) and edamame ($3.50) to start. Unfortunately they didn\'t understand and brought it out with our kobe sukiyaki ($20.95) and kobe spicy miso broth shabu shabu ($20.95.) We barely had room on the table for everything but it was all awesome. Veggies plate was 60% cabbage, which was tasty, but I would have liked a few more carrots, broccoli and tofu. No free refills on veggies and rice as other places offer. But we had more than enough and it was all very good. At the end of our meal a party of 9 was sat. We asked for our check. It arrived 10 minutes later. Tried to pay immediately since I wanted to get home but the waitress rushed off to the big table. I get it, big table = big tip, but we just wanted to get outta there. Finally she arrives back and I hand her the check with a $30 Crowdsaving voucher and some cash. She says they don\'t take that, maybe the other Swish. I show her their address on it. She says she will find out. Doesn\'t ask anyone, we watch her serve the other table for 15 minutes. Then she returns and says they won\'t accept it. I don\'t point out that she never check, just insist I am right. Finally she agrees and takes it only to rush back excitedly to point out it says ONE PER CUSTOMER. I pointed out we only had one and she said "but there are TWO of you!" Very odd, esp since the bill was over $60 so it easily could have covered one of our meals. I explain this a she grudgingly added it to our check. Was a very frustrating experience, and it was not a language barrier, as she spoke English very well. We escaped almost 40 minutes after requesting our check. By then I was pissed and basically forgot about how delicious the meal was - horrible customer service can do that.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 2, 'date': '2012-04-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': '69g7n-G8hGpiu_v1hrvbcg', 'review_id': 'mjifX3ptkoA1yBMdhBV39Q', 'text': "Received prompt email from the owner apologizing for the new waitresses not understanding. Honestly, it's nice to be acknowledged and apologized to when a business knows something wasn't handled correctly. Will certainly return and hope to upgrade to 5 star, the food is that great :) Here's an excerpt from my original review: \nOrdered spicy crab roll ($5.50) and edamame ($3.50) to start. Unfortunately they didn't understand and brought it out with our kobe sukiyaki ($20.95) and kobe spicy miso broth shabu shabu ($20.95.) We barely had room on the table for everything but it was all awesome. Veggies plate was 60% cabbage, which was tasty, but I would have liked a few more carrots, broccoli and tofu. No free refills on veggies and rice as other places offer. But we had more than enough and it was all very good.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2012-04-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'O4C7jIzu9SQ8w-JRMKJM7w', 'review_id': 'A8IOZyfqtNKNM69Q74i1gw', 'text': 'YES! this was my first experience eating shabu shabu and it was magnificent. We got there kind of late and had a huge party but the staff was so courteous. They helped us with the sauces , the stoves, and our food. It was soo good. Will definatly be back next time im in Vegas,', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2012-05-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'LX_mntojIUL7JZZuf4iWSQ', 'review_id': 'l0VPu85kTApflOMg8Q7ifw', 'text': 'kobe chuck with sukiyaki AMAZING!! if you havent tried this place or havent tried shabu shabu i highly recommend this place.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2012-05-17', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 3}, 'user_id': 'SAK2Db8RZo1Z9UhRjmUdEQ', 'review_id': 'HoZpTJxxI-AGa9uK0H3i6w', 'text': "This is one of my first picks when I'm in the area and craving Asian food. The service is quick and friendly, there was no wait at all.\n\nYou are given two choices: shabu shabu or sukiyaki. My friend recommended the sukiyaki, so i've always stuck with it. You get a pretty good sized meal for just $14.99. That comes with a medium-sized plate of veggies (greens, mushrooms, slices of carrots), really thinly sliced meat of your choice (highly recommend the beef or lamb), with a self-cook pan where you pour in their delicious soup base!\n\nDefinitely will come here again on my next visit to Vegas!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2012-05-31', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': '9UqNIFHfG_QPDHAd2opMDQ', 'review_id': 'fjyqGKunGkss-qZiNEogKg', 'text': 'Shrimp shabu shabu was excellent! Never having had shabu shabu I was feeling pretty lost with all the bowls and plates in front of me. The waitress was so sweet and helped me figure out how to put it all together. So yummy and lots of fun. The atmosphere was chill when we went and no one minded that we took a little longer than needed to eat lunch and just relax.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2012-06-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ABSPDh-YX380w4IicSoi5Q', 'review_id': '62Jgraqndd-0xyA3V6Q2bg', 'text': "I'm a big fan of Shabu Shabu.  So i went to Swish an had Sukiyaki, because apparently I'm a moron.  Anyway luckily my friend had the Shabu Shabu with spicy miso and I snuck dips of my beef in her broth if you know what I mean ; ).  \nI found the Sukiyaki a little salty and their selection of vegetables mediocre.\nThe service was nice and attentive and they did serve bottled and fountain coke, which is a rarity in Vegas.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2012-06-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'W0bElhPLD_-rKsBt3mc4CQ', 'review_id': 'EfeuzCnv29yK9d_Y1hGUXA', 'text': "Since I was in Vegas for edc weekend one of my friend suggest us to try the shabu restaurant. He had stated thats the only time he will ever eat shabu since he's not a big of a fan of shabu as I am. So as we get there I was like okay there's cars so were going to have to wait, as soon as I walked in there was only one couple in there *awkward cricket noise* I could've sworn this restaurant was super good and worth it by what my friend had said. \n\nAnywho, walked in sat down I was excited to try the ponzu & goma sauce the prices for the meat was decent but what I didn't like about it was that it did not taste fresh. The meat tasted & looked like it was bought from a grocery place and then they just placed it really quick onto the plate and made it look nice. The goma sauce was so sweet/ and the texture of it sucked I tried to add in as much items as I can to take the sweetness away, seemed like they bought that from a grocery store also. The ponzu was okay not bad thats probably the best thing there ... \n\nAs I got down to making my soup I asked the waitress for soup base but guess what nope they dont have soup base what the f ..  seriously? she didnt even supply us with the right tools to get our noodles with [thats no big deal cause either way I know how to use chopsticks] but when she brought us our bowls that just made me not want to be there anymore.. these bowls they brought to us are the bowls that is the smallest one how the hell are you suppose to enjoy your udon in that small ass bowl?! really .. I was just glad to leave .. NEVER AGAIN will I go to the shabu in Vegas.\n\nIf you want real shabu that will definitely not disappoint you, if you're in orange county eat at shabu bar I guarantee you will not be disappointed  in the service, drinks, food, & the awesome workers there.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 1, 'date': '2012-06-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cs37Ohgq7_g3grJNEEUi2Q', 'review_id': 'lDLLC_D3tIRZFPd9uVkP_Q', 'text': "The food was alright i wasnt to impressed. we ordered the Kobe Beef , thinking we were going to get plenty we listerally had 5 slices, after the meal my friend and i were still hungry we deicded to go upstairs to the Three Village. that's how little the food was either that we we are pigs! haha overall it was an ok place to eat i wouldnt go back, i must say it was somewhat aunthentic japanese food. I would go here if your super hungry!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2012-06-21', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 4, 'cool': 2}, 'user_id': 'NiCXaFN1b2LNLwOhO4eWjA', 'review_id': 'EysvJAxWmRlA53Je2eRUpQ', 'text': 'I could eat at Swish every day! The food is really good and I\'ve never been unhappy with the service. I highly recommend the Kobe Beef "Hungry Plate"', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2012-06-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'ymCR0bG63t2TH8JlkMZL3w', 'review_id': 'MIkztFm7JmUu9I2U9XiWbg', 'text': 'I had a late night shabu shabu here. Ordered the kobe chuck and it was very nice presentation. However they only provided the clear broth instead of the spicey broth. They did served with mushroom, vegetable, and other. Excellent service', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2012-07-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'AmO0eMXYkJKbcztXkMNT7Q', 'review_id': 'HNQ37bL6bv0YgDK6ZBrj3Q', 'text': 'THE place to go for Shabu Shabu in Vegas!!! Had the kobe chuck sukiyaki while the gf had the seafood shabu shabu!! Great service and amazing quality!! Will definitely come back again and recommend to all my friends who visit Vegas!! Yummmmmm!!', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2012-08-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SuP86PTwop1Zw2xZsSlmjw', 'review_id': 'IAQDCfwWL9HxtGocfkBVmg', 'text': "Shabu shabu in Vegas?....yes please!  I was in the mood for shabu while in Vegas and came upon this location based on the great reviews.\n\nThose giving this place high marks are outta their minds and havn't eaten at a true shabu place.  Nothing to rave about here.... Place was empty, I should have known.\n\nThinking of eating shabu in Vegas???... Skip this location.\n\nOh Korean garlic chicken?... Your better off eating chicken nuggets at McDonald's.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 1, 'date': '2012-08-04', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'iZxl3yuT2riDb9bKyXogWw', 'review_id': '3hGj0lpddN5oBpjWvKeGhQ', 'text': "First time I tried Shabu Shabu so I can't compare it to anything else just yet! I felt that the selection and pricing was fairly reasonable and the service was great for our group of 6. Granted, there wasn't too many people in the restaurant, but still. Good service is good service!\n\nWill try some other Shabu Shabu spots soon but overall, a good experience for my first time!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2012-08-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'o6EwbbcJQWEos7KPA35c5w', 'review_id': '5fOI5J6qAGFry8t3gGR7TA', 'text': "I am not quite sure what is wrong with all the people on this site giving this Restaurant high marks. I went based upon those and was extremely disappointed.  \n\nThis was by far and away one of the worst meals I have had in recent memory. The majority of my party felt ill afterwards. \n\nI would give it 0 stars, but Yelp doesn't allow that.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 1, 'date': '2012-08-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-eUm1iMePFFVMZ4m_eMyIg', 'review_id': 'S1XAzAjk4aWrAh7ZIsQckA', 'text': "Love the concept. Strange setup, love the hot pot! Not a fan of their sushi selection. The Kobe Beef chuck isn't bad for price, great quanity, especially on the Seafood platter.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2012-09-07', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 3, 'cool': 2}, 'user_id': 'kJ_cFfpQKW-cO68TavkmaA', 'review_id': 'sN1PAUeanA03Z13nIGxh_w', 'text': 'Loved it! Delicious shabu shabu! Great sauces. As good as the shabu shabu in Little Tokyo in downtown LA. Will definitely be back.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2012-10-18', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'uH5aBm25iBJ-W2UkroaigQ', 'review_id': 'fqJ_rIqZiq_WdVPpnyq25Q', 'text': "Food is good, but I wasn't too impressed. Maybe it was just what I got. I'll have to try more of their food to decide...However, the service wasn't all that great either. The crunchy spicy tuna is really good though & so are the jalapeno firecrakers.. But even the things that were really good, I think I could get at another restaurant for a better value.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2012-11-11', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 1}, 'user_id': 'Ov0aEN7LxyFsqehzpX1q6g', 'review_id': '5NhL5-NPIKZieRGJuWKRXA', 'text': "I'm always craving shabu shabu and having eating at some of the best places in LA and SF, I figured I would give this place a try and see how they stack up. For being in Vegas it's actually pretty good, but compared to other places that I have been it's ok, especially for the price. \n\nWe came for dinner on a Saturday night and it wasn't crowded at all. Be sure to check in on Yelp so that you can get the check in offer of free hot sake or 2 piece nigiri sushi. I chose the nigiri sushi and got the super white tuna (pretty good) and my friend also checked in and got the hamachi (also pretty good). Not the best sushi, but for a place that doesn't specialize in sushi, it was worth the free offer.\n\nI went for the shabu shabu dinner - they have a variety of meats that you can choose from and different grades of beef - for shabu it is on the pricier side - 8 oz for $18.95 of the regular beef (especially when you can get all you can eat in SF for $29.95 - maybe I should recommend this to them). They also have a few selections of broths - I chose my usual favorite of spicy miso. The flavor of the broth was good and the quality of the meat was good too. I think they could give you more of a selection of vegetables (and maybe just plain more vegetables). It comes on a small plate and definitely not a lot of it - cabbage, 2 pieces of broccoli, a few carrots, and 1 mushroom cut up (just regular mushroom, not enoki or any other kind). \n\nOverall, a decent place that I would come back to if I was craving shabu, but my search for SF/LA quality shabu continues in Vegas.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2012-11-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'FlGNVVkHW-gVLA5j9I1s1Q', 'review_id': 'bXFMUJsHdjDhk3-1b7uxlQ', 'text': "This was the first place in America that I finally had a good shabu shabu experience. The waiter was nice and attentive even tho the place became swamped! during lunch and he was the only guy there, I felt bad for him! Anyways the spicy miso broth with all the verities of mushrooms are a must have! Tons of flavor!!! I didn't really care for the meat selection because in my opinion, the meat cannot absorb the flavors of the broth well and for those who know shabu shabu, that is were the money is!  All in all the food was good, my only complaint is that they should have more servers on staff.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2012-12-02', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 4, 'cool': 4}, 'user_id': '8N73-TZXsLfk65Bk8JtyBA', 'review_id': 'a8a528dFyG-yquDzQJv3rQ', 'text': "These guys were really cool. Decent price, good selection, and nice layout. Worth checking out if you're bringing someone for a first time shabu shabu experience.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2012-12-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Bt3Cjlhn6Dfkf0zEx4nHCg', 'review_id': 'nvuvDkVGNR3b9Rn6an2rJA', 'text': "I love Shabu Shabu, and have been going to the Shabu Shabu in Henderson (I won't name to be fair) for a long time. We decided to try this place, Swish, to get something a little different. In the end, we were extremely disappointed and wish we could recommend it, but just can not. \n\nDecor and ambiance are OK. Waitress was nice. Peach tea was good. Prices fair.\n\nThe major problem was the food. We ordered chicken and beef with shabu shabu and sukiyaki. Firstly, the sukiyaki and dipping sauces were way too salty and just not appealingly flavored. Secondly, the chicken was in chunks, not sliced, and had all sorts of cartilage and chewy bits. The chunks wouldn't cook because they were too thick.. The chicken was completely inappropriate and also tasted bad because it was served marinated in some sort of sauce that neither of us liked. I just couldn't eat the chicken at all. My companion ate it just so we wouldn't waste it, but he didn't like it either. The beef was ok, and sliced appropriately, and I ate that in the shabu shabu, but without a good dipping sauce was ultimately just disappointing. I like cabbage, but they served way too much of it and not nearly enough of the other vegetables or tofu or noodles.\n\nThe minor problem was the hot pots. They were extremely shallow, and the waitress didn't pay attention to them, so they were constantly boiling down, and at multiple points were down to almost nothing, so we couldn't cook our food.\n\nI left hungry, and sad.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 1, 'date': '2012-12-27', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 2}, 'user_id': 'BUPOfSdUB80nFtBeAoKRSA', 'review_id': '-FVOCiGIe2XGbYs4EuK64g', 'text': 'came here with two friends i havent seen in a long time. i think its the same owner as the one on west sahara.\n\ni got the healthy 6oz prime rib with the spicy miso broth.\n\neverything was great and the service was good. the waitress came by often to check up on us and ask if we needed water. \n\nonly thing i wished they give more of is the udon noodles. there were only two noodles. =P', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2013-01-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'FcAmDk3PnieHkIai9AFZzA', 'review_id': 'kp1acaCbnbWSdjPMH_ls1Q', 'text': 'I was not impressed. I have to agree with the 1 or 2 star review where someone said whoever is giving this place good ratings has not had real shabu shabu.\n\nThe place was plain. The first thing I noticed when we sat down was that they had condiment settings that are normally used for things like chili sauce filled with what looked like grated ginger or garlic, scallions, and onions. I said to my boyfriend that these could\'ve been sitting out all day. I glanced at a table to the left of the bar and there were a bunch of these condiment sets sitting there, probably never used since they took \'em out of the fridge because no one comes here (it was pretty dead). Hmm.\n\nNext, I was looking at their menu and I was fairly disappointed. Everything just seemed to cost so much more than it should\'ve. When the waitress came to take our order, my boyfriend told her what we wanted, but she turned to me and asked what I wanted. My boyfriend was like, "We\'re going to share." I started to wonder if the portions were supposed to be for each person. If so, then I felt like everything was overpriced. When we got the food, we were able to share it just fine (though my boyfriend ate most of it and I am hungry now, a few hours later). At the end of the meal, I still felt like we overpaid. Our meal was $23. If we hadn\'t split what the waitress implied was supposed to be a meal for a single person, then it would\'ve been too much, imo. We just had hot pot at this great place in Rowland Heights, CA (called Kingswood Teppan Steak House, if you\'re ever in the area) and we had way more food and broth (two kinds, too) for $32. We had two different kinds of broth, four ingredients (chicken, beef, mushrooms, vegetables), and there was fried rice for each of us. Since it seems we split a single meal, we only got one bowl of white rice. The $9 difference would\'ve only gotten us... I think probably just the side of chicken (it was like $6.95 or something) and we would have a couple bucks leftover that wouldn\'t have paid for anything else. I wasn\'t happy with the prices.\n\nAs I mentioned before, it was pretty dead when we got there. After finishing our meal and reading the reviews, I was not surprised. I\'ve had hot pot before, but this is my first time having it in Las Vegas. I\'m hoping better places exist. I may just have to start having hot pot at home when I get cravings.\n\nI can\'t recommend this place nor do I ever plan on coming back.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 1, 'date': '2013-01-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qKOemCyW3oAWk4mUPsKP1w', 'review_id': '8WwHmQQBZVkkYuusnm1_XQ', 'text': "My wife and I's favorite place, we love the prime rib sukiyaki and the fun that comes with making it the way we like it.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2013-01-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'iZyguZf016iutC_AAbt-JA', 'review_id': 'F9JlT_O0FoNB4hoCge60WA', 'text': "after BEGGING my boyfriend to come try this place with me for the past 3 months, he finally gave in today! =))) and all i have to say is damn you yelp, my boyfriend will never listen to me again =(\n\ni've been craving shabu shabu since i've moved to vegas a few months ago. i had this place bookmarked because of all the great reviews but i was very disappointed. \n\nwhen we walked in, there were 3 men sitting at the bar drinking and that was it. The place looked pretty dead. my boyfriend and i got the sukiyaki and the shabu shabu. The vegetables that it came with were limited but the meat was good. We were hoping they would have a lamb option though.The free hot sake i got for checking in on yelp made the experience a bit better. it wasn't the worst that i've had but it definitely did not hit the shabu shabu spot :'(. i guess i just have to go back to LA to get that craving fulfilled.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 2, 'date': '2013-02-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QsAmsXMQ1M27WHzpR8yPbw', 'review_id': 'ThWp-EM2ItH4fX5PL9FPtQ', 'text': "Swish is a great place to have good food and a little fun. I usually get Sukiyaki, but the Shabu Shabu is tasty too. Go check them out if you haven't already!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2013-03-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'OqCgbvz3ZVsXzQreFvIWmw', 'review_id': 'aw_u4gUJpEU-7ugoIvQGXQ', 'text': "I ordered the shabu shabu and my friend ordered the sukiyaki. The meat was ok. I expected better quality meat. The food is okay. Next time I'm in the mood for shabu shabu, I'll look for another place to try.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 2, 'date': '2013-03-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'KAjX6AcK9auY0gzJj1Amgg', 'review_id': '0xXFjyZ1mXUG8sc7V6c0aQ', 'text': "I got pumped up by all the hype when I first heard of the new craze that is Shabu Shabu.  To all the fans, I'm sorry to say.. but I think Swish Shabu Shabu was a #FAIL!  Swish did not live up to all its Swash.  We ordered numerous items on the menu from small portions of seafood and the kobe.  The amount of food that you get for the price was not worth it.  Also, am I the only one here that thinks the broth, especially the sukiyaki was bland to the bone?!?  We dumped in a dribble of soy sauce, gave it a few shakes of pepper, stirred up some magic juju in hopes to re-engineer the flavor, buy no luck there.  The whole dining experience as a first timer was an ultimate downer.  I didn't finish first with this one, I guess I'm just not a Shabu kinda' guy..", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 1, 'date': '2013-04-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'c5_ehgPA6L33pmj8c4fgvQ', 'review_id': '3dq4ygBkMwyg907pNEninw', 'text': "I always enjoy the ambience that is Hot Pot but I my palette was left with the feeling that something was missing.  I had the spicy miso broth that had no flavor.  Not sure if I'll give the place another try!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 2, 'date': '2013-04-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'klTrlg165yVATm-b8uoBMA', 'review_id': '6W3gW3XLnd193CTe93wrAg', 'text': 'i love this place so much', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2013-04-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '0prpF7HxpW51UGFz7c4Asg', 'review_id': 'JoEnuPqM_T7DjtuSg6LBfA', 'text': 'the food was great,small portion tho. service sucked, ok maybe bec i came in with my family and we were a 50 top but still no excuse, we had 2 servers and they didnt even have any other customer. i ordered my son edamame it never came. the kids food came out when every one was almost done eating, no extra napkins came after we asked several time the thongs for the food that we were cooking on the table never came. the whole experience just was bad, i wouldnt recommend this place for a big top. but i will give it a try one more time just bec of the food.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 2, 'date': '2013-04-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 2}, 'user_id': '1GctU54Fu5vePOpg-RAI8Q', 'review_id': 'dDAcMW9Au5-Y9EBbg4BBxw', 'text': "I love this place but wonder why it's not busier!  The food is delicious, there are TVs to watch sports / the news, and the service is great.  They also have free wi-fi which is great if you need to have a lunch meeting.  \n\nOne strange thing I've noticed is that it seems their wait staff changes frequently.  I used to get a discount because I have been going to Swish since it was located on Sahara, but now none of the waitresses / servers know me.  I've been a loyal customer for about 7 years and they would always give me a loyalty discount upon every visit, which was always incredible!  \n\nI wish Swish would create a customer loyalty program, as I know once people enjoy a meal at Swish, they almost always go back again.  \n\nEither way, Swish is delicious and I hope they stick around!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2013-04-30', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'mgViQiuQG_3d2CmLTNW9rA', 'review_id': 'TfV86yI7LO9KTBkCNtIWLg', 'text': "It's Mother's Day and we've decided to meet up with a friend for lunch here. Have been wanting to try this place out and today was the day. \nWe got there and there were a few other tables going on, and one server. She seemed rather busy and told us to have a seat in the waiting area... At least twenty minutes later we were finally seated. \nWe ordered the Kobe Chuck and the Seafood Combo. One was Sukiyaki and the other was the Spicy Miso broth. Both were tasty. The Kobe was good. The Seafood... not so much, which is surprising because I LOVE seafood. With both orders we got a plate of vegetables and some Udon Noodles. \nI really liked the dipping sauce that came with... I couldn't ell you what they were. There was a brown sauce that looked like soy sauce but it wasn't, and the other was a thicker sauce I pretty much dipped EVERYTHING in. \nWhen I checked in I also got a Yelp deal for either a free hot sake or a nigiri. I opted for the Nigiri and chose Salmon - I thought the fish was VERY good quality and delicious! \nNext time I go though, I will stick to the Kobe and skip the seafood! Nom!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2013-05-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'hMk7RtUtKQQE5U4qCd91og', 'review_id': 'b7a64uK_haM_i_ZAgvweqg', 'text': "I was tired of eating at places found on the strip, and wanted some comfort food. I thought the name of this place was adorable and had to try it. YUP.. I came here because of the name.  I thought to myself, if i wanted to open up a shabu place, that would be exactly what I would call it!  \n\nI ordered the Kobe rib eye, which to me doesn't seem any different than your average cut of meat unless you're getting it straight from Kobe, Japan.  I dip my meat, watch the color change, dip the sauce, and consume.  Tasty and healthy; but pretty average shabu if you ask me.  Im a huge fan of the sesame sauce, and this one tasted a bit too peanut-y for my liking.  I also tried their garlic fried chicken which wasn't memorable. \n\nCome here if you're craving for shabu, but dont expect it to be anything more than average.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2013-06-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '30y3dfs5nJVUup5pzPcRrg', 'review_id': 'sYd7XmkjE1cHcu7k8VLb3g', 'text': "What happened to this place? It used to be so good. I opted for the Prime Chuck, and it was so thick, tough and chewy. Their beef used to be really good.\n\nService was not great. Never checked up on me, as I didn't have enough water to finish cooking my beef. \n\nSadly disappointed.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 1, 'date': '2013-07-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wezUxbvvLdnhT7v7D339fw', 'review_id': 'pKEforqv9eQsd2FfuAKmvw', 'text': 'only shabu in vegas... we are seriously lacking, but Swish will hit the spot when you need a shabu fix!!!!!!!!!', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2013-07-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'o75Jn-XYBUO_eJQXBnOl2A', 'review_id': '4_AVeG1mbirkgm5KVfaO3g', 'text': "Warning: When paying w/ a credit card they will ADD a tip to you on the iphone and show you just a signing screen. Sometimes they will even sign for it themselves. Happened to multiple people, if you're willing to come here even despite this review, PLEASE pay w/ cash or check with extreme caution of what they're trying to charge you. They will email you a receipt so that that will give them adequate time to get away with it, and deny assistance when you try to dispute it.\n\nService: The service is poor, inconsistent. They forgot our order, didn't pay any attention to what was being requested and ignored everybody us for the most part. We got our food late, the vegetables early, the meat at least 30 mins later (my friend got their meat 45 mins later). The meat was, even the expensive stuff, was less than mediocre. \n\nAtmosphere: The place had an odor to it that would make you sick after sitting in it for a while. It should have been a sign when you go into a shabu shabu house and you see the only clientele there to be over weight non-asian people. not to say that you need to be a skinny asian to enjoy shabu shabu, but every good shabu shabu place I ever seen had a bunch of skinny asian people in it.\n\nConclusion: Do not come here, if you do anyways, make sure they dont over charge you for service they did not do.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 1, 'date': '2013-07-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'D319J-qCgxaEEz2y7CQPvw', 'review_id': 'J-jOie2Bq-pNbAt8HUUiwQ', 'text': "When I came to this place it had a unusual smell, it wasn't pleasant.  I put up with it because my friend wanted to try shabu shabu.  The waitress did not do a good job explaining how the place worked and just pointed at pictures. When she gave us the pot she gave me the wrong broth, she gave me the spicy miso which I said I did not want spicy. And she forgot my sea food combo order which I had to request for near the end of my meal. When we went to pay for the meal, she made it very complicated adding a tip in the meal because we were paying with two cards, I told her I would just tip with cash to make it easier.  My friend was in the bathroom when she brought over the iPad to sign and she insisted for me to sign for him. When we got home I noticed they added an additional 15 dollar tip for themselves.\n\nDo not go to this place if you want to try mediocre shabu shabu, or get RIPPED OFF!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 1, 'date': '2013-07-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kGleKqDh8e9LyNHTK5Y0GQ', 'review_id': 'Wmm0oUPlHBXRUqgM1IUmwA', 'text': 'This is the worst shabu place ever! if you have ever eaten any decent shabu, you would know that this place is the worst!  ******DO NOT EAT HERE!******** they serve you on a portable gas stove. When we went, we were the only customers at the time but still took forever to bring out the food. Do not waste your money here!', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 1, 'date': '2013-07-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'V6yPUn8H3HWgNgDXz3TpdQ', 'review_id': 'a8gzGvwF22FP8y7JaXxPkQ', 'text': "I met up with a very very old friend here. I chose this place as i haven't eaten here before and i was in the mood for a bento meal. The service was great! The lady working there was very nice and she came by a couple times to fill our drinks up and to check on how we were doing. \n\nThe prices are a bit high, and the portions are a bit small but the chicken teriyaki bento box i ordered was mighty tasty, but not the best. There's also a happy hour that was available while on my visit. Also, i don't understand why this place doesnt get as many customers and guests as much as it looks like it should, great service and great food! Not too far from the strip either. Hope that changes.\n\nThere's nothing much else to say, other than i will be back to try their Shabu Shabu which is what they're named after lol. 4/5", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2013-08-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 4, 'cool': 0}, 'user_id': 'BNAV_ldKZ7uJh_7MFVImyw', 'review_id': 'tgEln6K91AKG5kF3Ec_26A', 'text': 'A bunch of lazy people! My brother and I Yelped the place and said it was open till 11PM. We arrive at 10:15(Note: OPEN light was on!!) and the waitress/hostess says they\'re closed already and that last call was at 10:30! We told her that it was only 10:15 and she responds saying, "Yeah but we\'re already closed!" So we left!! You can already tell that they have bad service and they need to learn how to tell time. It never even was stated anywhere that last call was at 10:30!', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 1, 'date': '2013-08-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'aK8shZb9dEQNyxk5ycfO2A', 'review_id': '-RxU-tBHQ1LDuNBBmu_xdQ', 'text': "Anyone who friends me on Yelp will probably quickly realize how much I love Shabu Shabu due to the sheer # of times I check into Shabu Shabu Paradise in Henderson (81 at time of publication).   Conversely, my mere 5 check ins to Swish correctly show how I rate my Shabu Shabu options here in Las Vegas, but that is not to say I don't enjoy a meal at here.  As a matter of fact there are even some characteristics of Swish which I prefer to Paradise:  options and price.\n\nI love the variety of options at Swish from the fact that you can venture off of Shabu Shabu altogether if you desire, or that even if you choose Shabu Shabu as your option (as I always have and probably always will) that you can choose a larger variety of protein options (salmon!) and different types of broth (spicy miso!).   I also love their tableside condiment tray options with garlic, chili paste, green onions and radish all being available at your disposal.  Please don't judge me by how much Garlic and Chili Paste I put in my broth, it's a free country.   Service is friendly and usually efficient, though they do sometimes get overwhelmed.   When paying by credit card the last few times the waitress would bring over one of those smartphone enabled scanners to swipe the card and then have us sign the touchpad.  Not a fan of this as it seems like they're hovering over you waiting to see how much you tip.   Fortunately for all involved, I'm an amazing tipper so it just made us all feel better.  \n\nThe cons to Swish when compared to SSP would be the quality of the food is slightly lower (though still a good deal considering SSP is more expensive), and it definitely skews younger and louder as far as clientele. That could be a pro to a lot of people, but I'm the type of guy who pays extra to sit in VIP sections if available for any concert I go to because I can't stand being mixed into a crowd or standing for more than 5 minutes at a time.  This is who you're dealing with here.  \n\nSo while Paradise has my heart, Swish is an excellent alternative on the nights I'm craving Shabu Shabu but feeling like salmon or wanting to spend less money.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2013-08-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'sMv_915EOvgKMYjs6bgoHg', 'review_id': 'F1OCwNuPtKx-t94NgcRnzA', 'text': "I should have seen the sign when no one in there when it's dinner time.  We went in and we got stuck.  Japanese Shabu Shabu was bland and no flavor.  Shushi was not fresh.  I am from LA, and this is horrible.  This place had 4 stars??????", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 1, 'date': '2013-08-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'klSJTNSCCbjP7ObQUXuoVg', 'review_id': 'PQC-IM6JWORbLR8V10Wv1Q', 'text': 'This place is pretty average.. \nWe came with a large group of people, probably around 12 people and there was just one guy helping us out. I think there was a second one somewhere doing something else. The food came out slowly.. I\'m assuming there\'s only one person preparing in the kitchen as well.\n\nThey serve you your pot on a portable gas stove that goes out sometimes. I would suggest to change these out.\n\nI got the spicy miso with hungry portion of the regular beef.\nThe broth was just okay, I felt like they got the soup base and just dumped some hot sauce into it. The beef was slightly below average in quality. The beef slowly breaks apart as it starts to cook. \nThe veggie dish was just okay as well. \nUdon quality isnt very good.\nThe sauces were also just okay. \n\nThere was a check in offer for a free sake or 2 piece sushi, we chose the sushi.. quality is very poor.. skip this! The "sweet shrimp" was actually just the normal shrimp. So they have both shrimps listed but both shrimps are the same. PASSSSSS\n\nIf you use card, the only option upon signing on an ipad is leaving a No Tip or minimum of 20% tip.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2013-09-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6DuBPBgCN6YMowFwrp_P5g', 'review_id': 'qPXz20W4tIkuNTbijKweYg', 'text': "I'm not a big fan of this type of Asian cuisine, but I will eat once in a while. This place is pretty good. The tuna appetizer was very good. The place looked clean and the staff was nice. If you like this type of cuisine, I would recommend it.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2013-09-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PEqBJ0zJ7JUbhSqBqcWtvA', 'review_id': 'hzcAoDyqIggZADhf1-d5Ww', 'text': 'We came here after the Boyz II men show (read: a little later, but not late relative to Vegas time) at around 1000 PM.  No one was here except for our three person party.  The waitress took our orders (we all had the same meat except my buddies got the sukiyaki style while I got the usual shabu shabu).  I also ordered the mushroom party because of my love for enoki mushrooms and....who doesn\'t want to say "MUSHROOM PARTY"?\n\nWe had some problems with the gas canisters: J\'s one was over zealous and causing her broth to constantly boil mine and L\'s bowls kept whimpering out.  I love rare meat but...uh not this way.  It took our waitress a bit to figure out what was going on even though we were the only customers in the room.\n\nThe meat was OK and the veggies were good.  We also used the Yelp check in special for nigiri sushi ....and that fish looked a bit suspect.  Come for the shabu shabu but not for the sushi, mmm kay.  My mushroom party came about 75% into the meal which meant I was so hungry and I probably didn\'t need to order the MUSHROOM PARTYYY.  In any case, the serving of mushrooms were generous but it\'d better be for the price.\n\nI\'ve had better shabu shabu and even better service than this place.  But I was full and it got the job done because I was very full.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2013-10-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ECgNkyzaHiLRoXMsgoiHFQ', 'review_id': 'FKmrJ6sI7vQueNnw3twQFg', 'text': 'I must say I was not happy with my meal service here. Typically , I would never write a less then favorable review . My friend and I arrived @ 11:30 am and ordered our food. Our vegetables came out & the waitress said she would be right out with the meat so we both put our vegetables in the pot. 15 minutes later our vegetables were more than cooked but still no meat. We kept trying to get the waitress attention which should  not have been hard as we were the only table in the entire restaurant . We had to ask 2 tines for the rest of our meal to be provided. Needless to say my vegetables were over cooked and not edible the meat came too late and ruined our meal !', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 2, 'date': '2013-12-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xq5KYn1vw1Db6__VmvJLKA', 'review_id': 'n30uHFT29cojjNxqPe2rRw', 'text': "Still the best Shabu Shabu I've had . I order the spicy miso soup broth. Tried and true - one of my favorite shabu places in the city. \n\nDelicious shabu shabu soup base that's full of flavor. The Spicy Miso really isn't spicy, offering just enough. perfect for when you're feeling a little under the cold weather. \n\nYammmmyy!\n\nLove their Spicy Miso soup base!! You can get this extra, extra spicy too.\nChoices of meat : Beef, Chicken, Pork & Lamb . For being an AYCE place, they have really good quality food and excellent service. \n\nGreat for large groups & birthdays! Wish they had something like vegas.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2013-12-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ukZiQO-jadNExn_QkE9Bhw', 'review_id': 'isQhqAQlhnDnuD7hczayHg', 'text': "Best customer service and quick! \nI love the food, they provided a good amount of meat and veggies. Along with numerous condiments to choose from.\nIt's some thing different from boiling point.\nIt's worth a try!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2013-12-28', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'GfREOmnIYRlVGpGMto1_qw', 'review_id': 'AewnM8xRHffQYnE7nEWecQ', 'text': "I usually go ti the Sahara location. Swish is my favorite restaurant and so I was given a gift certificate but only this location accepted it. First off: we were the only ones there and service was bad. Second off: food was HORRIBLE. I ordered the prime rib shabu shabu. The ponzu sauce is not the same as the other location. This ponzu had no taste to it at all. My vegetable plate was slightly smaller than I'm used to abd the udon was practically non existent. The broth was decent I admit. We tried some sushi to use up our gift certificate and order the Philly roll. What I got was not a Philly but a California with cream cheese and salmon on top. Disgusting. The waitress hardly checked on us and was too busy talking to the 'chef'. Thy didn't clean off a previous table until 20-30 minutes after they left. That's unacceptable when it was so slow.\n\nNeedless to say STAY AWAY FROM THIS LOCATION. THE SAHARA LOCATION IS A MILLION TIMES BETTER.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 1, 'date': '2014-01-02', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'wf3PjK645sEEMnmL6zD6ZQ', 'review_id': 'lWR9YEU8yYLg0TPLwHJUZQ', 'text': 'Expensive! Quality of meat is not that good. Stay away!!!', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 1, 'date': '2014-01-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'hFp52uhtBZVJ1hZlaIKHpw', 'review_id': 'l5iGrNfzgQkrdfg4N1cYNg', 'text': 'Verdict: Fast service and good food make this an ideal place for a family get together. \n\nThis was our first time out as a family having Shabu Shabu--aka "hot pot", and I\'d have to say that it was a success. \n\nI ordered the Shabu Shabu, with spicy miso broth, a "hungry" 8 oz. serving of salmon and an a la carte order of the Mushroom Party. My only gripe about my food, was that my salmon wasn\'t as fresh as it could have been and did have a taste that gave me the impression that it was frozen at one point. \n\nThe assortment of mushrooms in the Mushroom Party were fresh and earthy, just as they should have been. And I love me some mushrooms! \n\nAside from the fish being frozen, this place could have easily nabbed 5 stars from me. Maybe next time I\'ll try the Kobe Beef and that\'ll change my 4-star rating to a perfect 5. \n\nUntil next time, definitely try this place out and you won\'t be disappointed! \n\nI know I\'ll be back again.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2014-01-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1xBM_EFkCwEweLeKaxFe8g', 'review_id': 'QNKg_j9CQGQfC8E9vpfapg', 'text': "Place was empty on a Tuesday Night.  The Mexican Staff was helpful and nice but not Asian sushi chef.  The rolls were good.  3.5/4 out of 5.  Had three Rolls, miso soup and two nigiri cuts. They were out of Octopus.  Bill was 63$.  Pretty pricy for what we ate.  Good food but probably won't be back", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2014-01-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'XUuugPgaTWn3_zreYjK2Dg', 'review_id': 'R0rTWa5zKKVe7tzaTJJP-A', 'text': "Came here on two separate occasions. One with a groupon with a foodie friend. One for a friend's birthday. \n\nThe time with a groupon, came here for lunch. Had only 1 other table besides us. Granted this was mid-afternoon. Ordered a prime rib-eye and a mushroom party (friend was a mushroom fanatic so that was a must have for her). Sukiyaki style. Was a different experience from the traditional chinese hot pot. never had sukiyaki this way before. Cooked it in a cast iron pan thing with sauce. Flavor not too bad. May be a little sweet/salty for me. Overall, good deal with the groupon\n\nSecond time was for a friends birthday during dinner time. Check in for free hot sake (first time having hot sake so WHY NOT!? LOL) Sake was well.. warm alcohol so uhh... nothing to say about that HAHA (not much of a drinker anyway... wanted to try at least once anyway)\n\nOrdered a salmon shabu shabu in a spicy miso broth. Comes with a lot of veggies, tofu, and udon noodles. Decent amount overall. Not that much salmon (maybe 10 pieces if memory serves me right...) Not filling for me. Broth was light (before i added a bunch of green onions and garlic to it MMM GARLIC). I guess i can call this a healthier version of hot pot vs the chinese one with a heavy spicy broth. Guess in a way it was my wallet that limited me but eh.. \n\nService on both occasions were decent. Kept my water full.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2014-02-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Gdp9gKp2cKVTtkPTXPYTRw', 'review_id': 'R_c2pNCBKKaphBryHXlZXw', 'text': "The food is always consistent... but how hard is that it comes out raw. The service on the other hand is mediocre or worse. I have been here a hand full of times and the servers are not very attentive but it doesn't really bother me. The last time I went though man it was horrible! They only had one server and she was running around and you could tell she was overwhelmed. The worst part is she kept sitting people. I took about 30 minutes to get our food and another 30 minutes to receive our check. I haven't gone back since, I probably give them another chance after some time.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 2, 'date': '2014-04-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'LHYAzOD2cqDznTjnQE4xwQ', 'review_id': 'ySQqimOgx5XG067I7HKkIQ', 'text': "I'm pretty new to the Shabu Shabu game but this place has a good bang for the buck.  Spent many Saturday hungover brunches after partying on the strip at Swish.  They have cool check-in specials which got me even more drunk!  Good service, good meat quantity (quality is a-ok not the best), and pretty clean to my standards.  I can't get enough of this stuff, I'm pretty addicted.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2014-04-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'btSj0OEeVwepC6QhY_cxCQ', 'review_id': 'WYzOkW-_rGzSnGybZV1w6g', 'text': 'This is the best shabu shabu I ever had. If you wanna try the real Japanese hot pot, this is the right place. They serve food quickly and the lady working there is very nice. And the Kobe rib eye!! Yummy yummy..My favorite! Definitely wanna come back again and try the sukiyaki this time!', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2014-06-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'jzLyraImyGjWS5lSPv0DsA', 'review_id': 'p63dhi3jRcO4Cg8RYMbkOg', 'text': 'The service was great and the Chicken sukiyaki was absolutely delicious. The marinate that they used is insanely addicting. The broth was tasty as well. We also ordered a few sushi rolls. Crunchy spicy tuna was interesting. Crunchy sweet shell stuffed with rice and topped with tuna. The great white hype tasted super fresh and can feed 2-3 people.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2014-06-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jUAaODTEBPgUJkVNOTe-ww', 'review_id': 'aZCP9qc0FH03iqO7gDfdRQ', 'text': 'I have been here twice. Both times, great service, Fresh food, always clean. Everything I order there is awesome. Sushi is great. Very quiet. I really like it', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2014-07-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'JdecG06uFRVgpXkrVcwD4A', 'review_id': 'JIN-0_wQpiavqUv2v1J_rQ', 'text': "I love it here! I love shabu I'm general. Whenever I'm in town, I will make a point to go here. Their sauces are good, meat is great, and veggies are fresh. Next time I'm in town, will definitely come back!!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2014-07-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'BmIsOeRuOER7UDkCgBoRNg', 'review_id': 'zV7kEeBJnlRK7DgWKBCBmw', 'text': 'I love coming here and checking in on yelp for the free Hot Sake!! My favorite broth is the miso but sukiyaki is a must for newbies, very flavorful!', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2014-07-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'xK25zCuOWB-tugi0gDXpIA', 'review_id': 'j0wUC8UoiskN_WZ-iV6q6Q', 'text': 'Declicious food all the time. The meat is so tender and flavorful.  I dont usually eat vegetables but can clean out a plateful when eating shabu shabu or sukiyaki style. They have sushi as well. All you can eat options available.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2014-08-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'aGia7xidDgi5IMeAq3fsCw', 'review_id': '2Zx8-PoZ_-4-3eF7kYLKJA', 'text': 'Awesome place to go!  Good service and the black sesame ice cream is a must!', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2014-08-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BdntkoSslX1v3CG5lfOynQ', 'review_id': 'uqih3Kq7FphLQ6jMVGBA4A', 'text': "Great restaurant. In my weekly rotation of restaurant that I frequent. Shabu shabu and sukiyaki is so good. I usually go for the Kobe chuck sukiyaki with raw egg dipping sauce. Lots of flavor. The service is friendly and always have a smile on their face. Did I mention it's healthy. The decor is ok but does the job.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2014-08-05', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'sVS0a9QMBVrA5cJCZr5PqQ', 'review_id': 'F43TXHqiTBuAe7VYBPN2PA', 'text': "Awful, I will never go back.\nI came here with a friend after getting shaved snow from across the street. The first thing I noticed when I walked in was the smell of urine, my friend thought it smelled like bathroom cleaner- nonetheless awful. The menu options weren't great and there was no soy sauce. My friend got the spicy miso broth which was too spicy for her, and I got the regular seaweed broth which was just hot water with the slightest tint of green color- no flavor whatsoever.\n\nMaybe because i'm from New york and i'm spoiled by the good shabu shabu there, but this place might be Las Vegas' biggest let down, right alongside Yoshinoya.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 2, 'date': '2014-08-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': '9UcZW3o5zcmdiMtVo-fllw', 'review_id': 'YTjNgl_Htskdj7OWAKqteA', 'text': "I would only come here to eat shabu shabu/sukiyaki although they serve other things as well. The meat I had was good quality. After eating the all you can eat I didn't feel gross like I do when I eat other all you can eat places. I just felt full.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2014-08-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '12Dbsa_jAG_jzHWo8QmXxA', 'review_id': 'cmlcPGkcogpRV09FMGcXcA', 'text': "This place has amazing shabu. The service is amazing and their meat is true quality.\nCan't wait to come back here!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2014-09-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jm24bxs3P5ka6lAPy77gmA', 'review_id': 'u7WjrjgSLggclZm3rxzEhA', 'text': 'First time on this place..I tried the miso broth, shrimp and vegetables, they are good and very flavourful. The place and location are nice, simple and clean. Will try this place again and lookimg forward to try the sukiyaki.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2014-09-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'Hf1Ku2WxaHxhLAov6w9Fiw', 'review_id': 'IXJbPipxlujLVIXKkwSEZw', 'text': "This place is definitely a hidden gem in Vegas. I really enjoyed the garlic chicken and the miso shabu shabu was delicious. This will be my new go-to when I'm out here.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2014-09-06', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 4, 'cool': 3}, 'user_id': 'G2GjC8xdSi_Us-8X_N7NBA', 'review_id': 'bALCSos7LQuskMO9fAIxRA', 'text': "I love swish! My favorite soup restaurant! Every time I go here I always order salmon sukiyaki (all the time). I love how the service is fast and they're very friendly towards me. I always bring my friends and new friends here. It's worth it! If you eat here and the price is right too! What can you ask for?", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2014-09-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': 'u3XFH7L0l_L5dhuXLKuaRw', 'review_id': 'Wnwu2TcvXQAENsMH4PdGzg', 'text': "My fiancee and I took a friend of mine out for her birthday.  I came to this place a good 15 minutes before my friend arrive, so I had a look around before we enter the place.  \n\nTo my surprise, it was around dinner time and the place was completely EMPTY.\n\nWe ordered two hot pots, a couple of orders of sushi rolls, and a drink for each of us.  \n\nHot pot #1 spicy miso:  This pot was alright.  It had some flavor to it... at least more flavor than the other one we ordered.\n\nHotpot #2 seaweed:  This pot is literally just water and seaweed.  There was absolutely NOTHING in the stock except for water and a few pieces of seaweed.\n\nSince the place was completely empty, we got the table closest to the kitchen for faster service.  There was ONLY ONE PERSON at the entire restaurant.  There were NO OTHER customer, yet we still had a hard time asking for things that we need. Between the three of us, none of us liked the food.  It was an experience we didn't plan to repeat... Until when the bill was settled and... \n\nAfter the meal, I paid the bill, which came to roughly $63.  I gave them roughly$12 tip to make it $75 even.  I paid by credit card, tip and all.  As we were leaving the restaurant, the server saw that there was no money on the table since I included tips in my bill, so she literally ran after me and asked me if the service was bad that I didn't her tips.  I didn't tell her that her service was indeed bad, but I mentioned that the tip was given to her on my bill.  She proceed to tell me that I didn't leave any tips.  I told her to go back to the register and look.  Did I mention she didn't even give me a receipt???  Anyway, she saw the big tip ~20% that I gave her and smiled ear to ear.  What she didn't do is apologize for being rude to us and our birthday guest.\n\nThe bill came to $75 after tips, taxes, and food.  That's about $25/person.  It was rather overpriced for what we had.\n\nTWO stars for the food.  -2 stars for the service.\n\nNeedless to say, we're never going back there again. EVER!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 2, 'date': '2014-09-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'S8U-AfNnFgb8v_vytblOUA', 'review_id': 'fqdzite0cYVXJH7jisaXRw', 'text': 'Swish is the best!!! Bring my guests in town all the time and they all love it. Usually pretty busy every time I go there but wait is not too long. I usually go for the sukiyaki with egg dipping sauce. I like to caramelize my sauce for stronger flavor. Always look forward to coming here. :)', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2014-11-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'cSNzK-0BEXTmMWA_5amgMA', 'review_id': 'elbIu6tULEHMzyNnJpWJrQ', 'text': 'Love this place.   Good size portions, fast, the atmosphere encourages conversation, smaller, and personable.   This is my first choice sushi place everytime.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2014-11-10', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'rYw8Aa4BHtFc6mSmzVj14Q', 'review_id': 'qkWBRjJ2taQqBIh4kr5New', 'text': "Wowsers!!!!!!!!!! This was AWESOME ... If you look at my other reviews you'll see I've gone to tons of Shabu places. This place was really yummy. The sauces were really good, we put garlic and raddish ours... Yum. We used the spicy miso base--- great. We will be back next time we come to Vegas for sure. Please stop in, super nice a friendly and above all DELICIOUS", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2014-11-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'oGc4gTsUhZ-N1e00hd_HQQ', 'review_id': 'gZoWRo35aOj-nDH4Had9fg', 'text': "I have not been to this Shabu Shabu place  ever but have read the reviews, Most people write highly about and others really put it down. Im going to visit this spot today and I will write my opinion very soon.  One post said its along side with Yoshinoya, That's just a hater and says their spoiled because their  from New York, I been to  Fukuoka Shabu Shabu, its Japanese with Chinese food... That place was o.k. and claims they have the Best Shabu Shabu? AnyhowI Was born and raised in Los Angeles, CA with Parents from Mexico and I chose asian food over Mexican. I've eaten Shabu Shabu for about 20 years and eaten at the best one and they are awesome.  Couple of things to keep in mind, for a good Shabu Shabu experience they must have Fresh Sliced Meat, Fresh Vegetables. Kick ass Ponzu & Sesame, Well done rice and a simple broth with dried kombu seaweed. How hard is that?  not hard at all, anything less gets a NEGATIVE STAR. \n\nSwish Shabu Shabu, I will be eating at your place today and I will speak my mind if I'm Dissatisfied. You better take it personal because if I'm paying for good food in a what suppose to be a clean place, it better smell good, be clean and be of great service. anything less will cost you a tip and maybe even not pay for bad food. see you soon.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2014-11-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 6, 'cool': 2}, 'user_id': 'aYzA3OgsAN3f3WJPucYCAQ', 'review_id': 'jM2RgbZ7uTqPORAonCNRKg', 'text': 'We arrive mid afternoon Saturday and the place was empty, the staff was awesome, the restaurant clean, and the experience great. We both had the all u can eat hot pot at $27 each.  The food was so delicious we both had two places of steak. \nI have been to several places in southern. Ca and this is much nicer and cleaner. This is the first time I had an all you can eat option. \nI would have like to have seen some garlic and scallions to add to the pot but the hot sauce was tasty.  \nDefinitely will be back - with friends !!', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2014-12-13', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 6, 'cool': 3}, 'user_id': 'vI7wZxTprpMl2fj_IHU3iQ', 'review_id': 'WD5pH5UaPpdctnHL3lryoA', 'text': "We came on a Wednesday evening and ordered:\nShabu shabu (spicy miso)\nSukiyaki\n(Ea come with cabbage, carrots, green onions, mushrooms, tofu and udon noodles)\n- Prime rib eye 6oz 14.95\n- Seafood combo 8oz, 25.95 (salmon, shrimp, scallop, green mussel, oyster)\nfor 10 (used the $40 valued groupon)\n\n- We came here on a Friday night, around 845pm, and it was hectic. 2 servers, uncleaned tables. no acknowledgment upon welcome. We stood in front of the door for 10 min, other couples entering after us. Mistake to eat tonight. Left. Come next time. \n- So when we came on Wednesday night, around 8pm. Not crowded and more tolerable. Hello on entrance. much better. seated right away. \n- Got our order placed in about 10min. Got the food in 15 min. Wait seemed long for already prepared portions. \n- udon noodles rock solid. \n- One great hot pot and one faulty one. 50/50. \n- Extra sauce/soup? Yes! \n- Slow water refills. Subpar service. \n- Stinky men's bathroom\n- Excellent price with Groupon.\n- Not like SGV shabu shabu, but pretty good.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2014-12-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'CiVhwJ4HufvHk4MezmdDZg', 'review_id': 'WcfvhG6JFro09A0rLdkj7w', 'text': 'I usually don\'t write reviews, but the service here is so terrible I just have to let people know about it. First off, when we entered the building, nobody greeted us or acknowledged our existence for a good seven minutes. If you know anything about good customer service this is a red flag. It took them a good while to "clean" and set up the table for us which we didn\'t mind. When we were seated, we noticed the table was still wet, sticky, and disgusting. We had to use the napkins on the table to finish cleaning it up ourselves. The server didn\'t do such a good job at explaining the menu to us since it was our first time, it really felt like she knew almost nothing about the food here lol. After ordering, we waited, and waited, and waited. By now I was getting irritated because there was only a total of 3 small families in the restaurant which I didn\'t understand why it took them so long to bring the food out just so we can cook it ourselves. Usually when you bring food out, you should try to bring them all out at the same time, after awhile they only brought us lettuce and a small plate of thinly sliced beef. They had also brought out the two plates of mushroom that we had ordered but ended up giving those to the family next to us. COME ON, SERIOUSLY. We waited some more and they brought out a plate of assorted seafood. The funny thing is by now, we still haven\'t gotten our bowls of rice or noodles to eat along with the rest of the food. wtf. At least bring us small empty bowls so we could have scooped our food into it. Not once did they apologize for taking so damn long to bring us our food. When they finally brought us our rice, they only brought two bowls. There were six of us. Now, I\'m just really trying to keep my cool. By the time we were done eating, they still haven\'t brought out my brother\'s roll of sushi, so we just cancelled it. I was pissed because it was my idea to take the family out to eat for once and ended up going to this place. We ended up paying $80 for a small plate of beef, a small plate of seafood, and some mushroom, with a side of terrible customer service. A word of advice to the owners of this place, retrain your employees and brush up on your management skills along with your customer service skills. It\'s embarrassing, really. Don\'t waste your time and money here. You want some good hot pot and better service, go to Shabu Grill on silverado ranch, its all you can eat too for about $20 a person.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 1, 'date': '2014-12-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'A7wDkBMKD5e0TSzz8NYwkA', 'review_id': '3IatMj5kgleAeqR6jGNJpQ', 'text': 'Great experience for cooking for self. Fresh veggies and meat. Lunch portion was plenty of food and filled me up.  Sauces and condiments an added plus. I will return again. Be sure to check in for added bonus.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2014-12-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'B7Iop2x9NrAOfOUhtSWrRQ', 'review_id': 'm3FDeJcw3gdugZYyaKMOww', 'text': 'Great place for Shabu Shabu, been coming here for years but I noticed they remodeled the place and food improved. The rib eye meat is amazing plus all the vegetables are fresh. The customer service is great!! Highly recommend!!', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2015-01-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PqUbNZ5TUW1J_-iTkxgflg', 'review_id': 'tzFy-gWm00C7Gk3iLRZoIw', 'text': "Thanks to Yelp reviews & a Groupon, yes, I love my deals :) The place is clean, service is a bit slow as there were only 3 people that I saw the entire time we were there but it wasn't too bad.  We ordered the sukiyaki and the spicy miso.  A meat platter, seafood platter and extra veggies.  The sukiyaki was a tad too sweet for me but the miso was a bit too spicy so we ended up mixing both for a strange but happy medium.  I enjoyed my meal but I'm not sure if my family did.  I would try this place if you're wanting some hot pot.  It's worth the try, especially if you have a groupon.  Otherwise it's a little pricey for what  you get.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2015-01-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kEirVccGkT76dSF9CeeS3A', 'review_id': 'gp68ieVTIrP_-IRW3nZP1g', 'text': "We tried this place after purchasing a groupon. We were excited to try this type of dining. We went on a Sunday night and it was very crowded! There were many people crowded at the door and no one there greeting customers. Eventually we sat ourselves at the bar. We sat for about 10 minutes before ring acknowledged. We ordered our drinks and food right away so we didn't have to wait again. During the meal it was very difficult to get drink refills. The food was very good and this was a fun new experience. Bottom line- food=good, service=not so great...", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2015-01-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': '0JY31tfXTw8b3I4AEB1LWA', 'review_id': 'rhwccSp11shmDFxhUWrAvw', 'text': "I really enjoyed our meal here. The restaurant was tidy and the staff was friendly and attentive. Shabu shabu was a totally new experience for me but the waitress explained it all to us. Basically you dip vegetables, noodles, and meat into a boiling broth on your table. They have several broths to choose from, I went with seaweed. I had the prime rib which was thinly sliced and ready to dip in the broth. You have to be careful because it cooks very fast. The entree comes with a variety of vegetables (carrot, onion, mushroom, cabbage) and udon noodles. I struggled with the slipperiness of the noodles, I couldn't get them back out of the broth! I thought I was pretty handy with chopsticks but shabu shabu really put me through my paces! Anyway, it was a unique and fun experience and I would visit again.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2015-01-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'n8DJIN_sUHKUixube0G2SQ', 'review_id': 'GdVChj3tfbAZ2_nGz5etuw', 'text': "Don't go in with high expectations and you won't be disappointed...I think it's cute and it exactly what it's supposed to be. The Kobe was delicious, was able to have my family time - will definitely be returning", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2015-01-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 6, 'cool': 5}, 'user_id': 'GpWFOypEy5qB-gLpUXJn0w', 'review_id': 'exmicabCxYcChllw6ADGaQ', 'text': "Swish is one of my favorite places to eat in Vegas. At first I was skeptical to try it because I was going to the Sahara location before, but thank goodness for Groupon! It opened my eyes to a new experience.\n\nI always get the shabu shabu, and I always leave with a happy and full tummy. I've tried both the seaweed and spicy miso broth, and I enjoyed both. The seaweed is very light, and the spicy miso is definitely much more flavorful. If you don't like spicy food, then they can just give you miso broth as well.\n\nI usually get the prime rib 6 oz or the 4 oz lunch special. The meat is thinly sliced and is definitely a good amount of food. I go mostly for the vegetables, and it's such an easy and delicious way for me to get my nutrients. I love dipping my beef and veggies in the goma sauce. I prefer it over the ponzu, but that's just personal preference.\n\nThe servers are always really kind and hard working. Sometimes the service is a little slow when the place is busy, but that is totally understandable. If you want something, don't be afraid to ask. They will get you what you need much quicker, and they won't have to read your mind. \n\nOverall, I love this place! And so does my boyfriend. Once he brought me here two or three times in one week, but I didn't mind. The food is good, the servers are sweet, and with the Groupon, it's a deal that can't be beat!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2015-01-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'iRg71EvOjegzZkGgJUfW4w', 'review_id': 'CDEyk4nZyyOSEf4pW7C3bA', 'text': 'I\'ve been here twice and tried to like it both times, but this place is just so...unremarkable.\n\nThe best thing about Swish is the food, actually. You get a decent portion for the price and the flavor of the broth (spicy miso) is pretty good. Their ponzu tastes a little strange to me, though.\n\nHowever, the place lacks proper ventilation and feels extremely stuffy and gross. The atmosphere is awkward and the service is slow even when there aren\'t many tables. If I were to look up total opposite of "fung shui" on Google, I would get "Swish Shabu Shabu".\n\nThe door accidentally got locked and people couldn\'t enter. The waitress was nearby and I can\'t even give her the excuse of being busy since there were only 3 tables at the time. My boyfriend had to unlock the door. Ehhhh.\n\nCheck in on Yelp for free sake.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2015-02-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LqNb8H5njszsg9VTyU2jSg', 'review_id': 'iYgsCYcgx3KWuuyZmP9jwQ', 'text': "Came here to eat for lunch. Didn't even get the chance to eat not drink water. It was just me, my husband and son. No other customers inside. So I can't make a review of the food but customer service is HORRIBLE! The server just gave us the menu and left. Didn't ask for our drinks or anything! We were there waiting for a long time and she was just talking on the phone! Left the place! No wonder the place is empty! HORRIBLE SERVICE!!!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 1, 'date': '2015-02-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cehgMjUHqE11uo25rjueAA', 'review_id': 'TqfDt1JT1dA3u_ziPi7L5w', 'text': "The service here is SLOW. We waited ridiculously long to get anything from our server. The food was okay... I got prime rib with sukiyaki. I probably wouldn't come here again just because of how bad the service was.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 2, 'date': '2015-02-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'FuBubOVXAiYZKKyg87kDXg', 'review_id': 'NHB0boPpmF1W4FEmy_MJPg', 'text': "Maybe I am spoiled with all the great shabu shabu and hot pot I had over the years in LA and Orange County, this place is just not up to par. I feel so sad, because I know this is probably one of the better places in Vegas, since I live in Vegas now, I have to settle for a place like this. \n\nMy hubby and I went here for lunch today, and got a large kobe beef combo and a seafood combo. We tried both the seaweed and miso broth, both were so unremarkable, they were just sad. The meat was fine, but everything else isn't super fresh or tasty. I also found both sauces were overly sweet. The total bill came to about $40, and this was one of the worst Shabu/Hot Pot experience I've ever had. \n\nOverall I would not recommend this place. There are better places to eat in this plaza.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 2, 'date': '2015-02-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'YL6Lrp5hj_kMwqzmr8_C3Q', 'review_id': 'ijFOfWk8dL5X4WF4oiYaxA', 'text': "Stopped in this place randomly, craving Shabu Shabu with my boyfriend (We had some good stuff in LA). It wasn't quite up to the level we had in LA but the service was good! The ponzu tasted homemade and it was kind of cozy. Not bad!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2015-03-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lf3dn-R0vvtG-bI2ReAqzg', 'review_id': 'ikyzybAHwHMK4wOR0NOyMw', 'text': 'ordered the ayce hotpot rib-eye beef with the sukiyaki soup base, n it was delicious...', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2015-03-03', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': '83royu80HWQW6exb1v1g_w', 'review_id': 'GIUCplrgG0h5eT0GitbpFA', 'text': "I found this place through Groupon and my boyfriend and I decided to give it a go. \n\nOh my goodness. It was delicious! We each got spicy miso and we each got the Kobe chuck and we added one mushroom plate. \n\nNot only was it delicious, it was very fun! Cooking and swirling everything thing around. I can't wait to come back. \n\nThe only problem was that one of our stoves ran out of gas like 5 minutes in. Luckily our waitress replaced the gas very quickly!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2015-03-06', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'bk_0HUca1Te3uyiafSgo1w', 'review_id': 'LFNO5FFP2pWCbU5yMdNKKQ', 'text': 'This place was extremely rude. I went out to eat with my best friend and two year daughter, my friend ordered the bento box and I purchased the all you can eat. My friend was making my food for me because I didn\'t want my daughter to get burned. And when the bill came they charged us for two all you can eat. my friend did not eat any of my food and I made it very clear that my she was going to be cooking the food for me. When I asked the waitress why am I getting charged for two, she said she "assumed that my friend ate my food". You know what lady assuming makes a ASS OUT OF YOU. I have never felt insulted in my life. Please do not dine here..', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 1, 'date': '2015-03-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'D3SxVTpSN4dastEPaVUUBw', 'review_id': '3W04us7dS4i75fChwKn6fQ', 'text': "This is one is a very good place among the so many places the China Town has to offer. They offer both sushi selections and hot pots. Which is a pot with your choice of broth, meats and vegetables. \n\nThe one we chose was the hot pot with the spicy miso broth, just the broth itself was good. We also chose the seafood selection which came with mussels, shrimp, scallops, salmon, and veggies. I had read on Yelp how good the Kobe beef was, so we added an order into the pot, which i'm glad we did. There are two options in size, the healthy portion and i believe the other was called the hungry portion. We tried the healthy portion which was more than enough to share between two people. \n\nWhen i checked in with Yelp i got a free hot sake, so worth it.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2015-03-31', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'sAfDQjIjuRZebZzFi6jOTA', 'review_id': 'nVLLv4Jtlk7bmFDu4GMgbA', 'text': "The worst food I've had in Vegas no taste to all & to top it all its expensive. Not worth it don't waste your time & money", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 1, 'date': '2015-03-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BI_p06N1-WNPusxLcpU7tw', 'review_id': 'HvwM-pDeCrC1jXBR2X6FNw', 'text': 'Very little shabu choices. Not to mention how the soup tasted. Meat was too chewy, sauces were bland.  Customer service wasnt that great either. It had only 2 workers at the time I came so we waited awhile for everything to finally set up. I recommend hiring more workers and changing up the menu', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2015-04-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'igVnsAIjhKkGdwEWN5_ESQ', 'review_id': 'gYATEzwlG7U3KPgv4Blhmw', 'text': "Made the mistake of coming here instead of the one on Sahara since we were in the area.. Basically sat in their stuffy dining room for 15-20 minutes being completely ignored. So really I can't say how the food was or even their tap water because we got nothing.\n\nCurrently at the Sahara one and my meat is already cooking.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 1, 'date': '2015-04-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lgtQz_v7p7HnbrQMCbaBQg', 'review_id': 'QXP7wuFlU2Y6-WvLYchJMA', 'text': "Wow!  I had an amazing experience at this place on my visit to Vegas.  One of the best restaurants in China Town.  The sushi is top notch at a great price, and the shabu-shabu had the perfect flavor - I'm getting so hungry now thinking about it!  I wish I was in town now so I can try their hot pots... that will be next on the list. Next time I am in Vegas, I am definitely going to eat here again.  Thank you for the great experience Swish Shabu Shabu!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2015-04-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rYcGpW1WTUsdpwhr6kWBRg', 'review_id': 'gb0E4pept7QziYNVy93ivg', 'text': 'I love hot pot, so when I saw this establishment on Groupon, I bought a Groupon deal for this place.  So for our date night, I wanted to check this place out.  Weird-the restaurant was completely empty!  For a Friday night, we were the only customers.  Feeling skeptical, we still sat down, got menus and water (I already knew what I wanted to try from the reviews, the seafood hot pot and a few different nigiris).  I told the Hispanic server that it was our first time here, and she proceeded to inform us that "the chef" went home, and we can\'t order any sushi or seafood.  Great, the items that I was looking forward to try.  What in the world!!! The chef went home???  My husband and I looked at each other and decided to leave.  I still have the Groupon to use, so I\'ll update if we decide to return.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 1, 'date': '2015-04-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'za-RWjEpB9W_34NW4vS7HQ', 'review_id': 'YfoJ2H2eX7RqqT9h4jexhA', 'text': 'We got a Groupon to try out this restaurant and gave it a shot Friday night. The food was pretty good but the decor was pretty unimpressive. Our table was shakey and unstable, which made the cheap and open-flame hot pot on our table a little scary to work with. The place was also really hot and i was sweating! The restaurant had a few paintings on the wall but was lit with normal overhead lights and had a gross floor. Bathrooms had a bucket for a trash can and a gross shelf of supplies next to toilet.\n\nThe food on the other hand was really good. I got the sweet and sour broth to cook my meat and veggies in and did a three meat sampler with two types of Kobe beef. The beef was paper thin and cooked beautifully and quickly in the broth. Flavors were great! They didnt provide much instruction on how to cook the foods (ie suggested cooking times for each veggie). My boyfriend tried the miso broth with the same meat sampler and his was a lot less flavorful. Clearly the broth strongly plays into the whole flavor experience!\n\nOverall, this is a place to go for good flavors but sub-par atmosphere.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2015-04-12', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 4}, 'user_id': '7oLMXwqw5z8mtE3kZbOWGg', 'review_id': 'NsPs7DB6ZmtCSba1QeTCpw', 'text': ':p', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2015-04-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yg2afZ3BkkQVBrQXhydHoQ', 'review_id': 'yW67D6ouolZo3bp1e-MW-g', 'text': "And Groupon scores again! Frequented by yours truly and one of my dear sisters. I've explored the miso and sukiyaki broths with rib eye and seafood as the poultry choices. There was one visit, in which I explored a few sushi rolls. Did not disappoint. Such a limited selection of shabu shabu places in town, therefore I'm totally grateful for Swish!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2015-05-06', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'iBB1TXnAL_PKHWTXzv2Trg', 'review_id': '2vJhw1J35Vzlnohz_ybUHg', 'text': "I came here with a groupon for lunch. We ordered 1 kobe chuck hot pot with sukiyaki broth, 1 ribeye hot pot with miso broth, and an order of soft shell crab. \n\nservice - spectacular. Our waitress was sweet, friendly, and efficient. \n\nfood - pretty good. The meat didn't seem to be of the highest quality; they didn't seem ultra fresh or of the best cuts, but they were still good.  Can't really go wrong with the vegetables. The broths were flavorful. The rice was nice and chewy. And the soft shell crab was fried nicely. \n\nAll in all, I'm not sure how often I'd come back if I didn't have a groupon. But it's well worth it when you have one. While both my dad and I really enjoyed it, if I didn't have a groupon, I'd go to Shabu Grill and fork out a few extra bucks for AYCE, and you get a lot more variety. But I enjoyed Swish.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2015-05-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'P1UchS8HWRyneqhzvdkHyA', 'review_id': 'u_U5Rw3-c6C6sL3rbaoanw', 'text': "I don't even know how to describe this place. It's gotten downhill. Especially with their hours. I went one time because they open at 11am but didn't get let in the building till noon. Now I come at night and they're closing early than their usual time. :(", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2015-05-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-4EaWcHoFThR6h-SEZSESQ', 'review_id': 'r3iBD7sxi31tpbrqBoXfUg', 'text': "I've been coming here for a few years. It felt that their dipping sauce are getting better and better each time. Ponzu for Shabu Shabu is authentic. Similar to some great Shabu Shabu in Japan town. The meat is good quality. Gomadare is on the sweet side. Service is great.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2015-05-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'o3tI-qw64omM_TA75zbhlQ', 'review_id': 'pqHRy_wdXzMcrrosdW8Q9w', 'text': 'Excellent shabu shabu/hot pot in the heart of Chinatown. My friends and I love the experience.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2015-05-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'GqARBlnFZa3kJDRcZ2a77w', 'review_id': 'u167zICRSnhLhQn1K26xWg', 'text': "Food is not so good an service is very slow.  Not properly staffed .Ask for plates for the table of 6  an they bring you one \n\nVisiting Vagas as well an thought this was a good idea. I won't be back", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 1, 'date': '2015-06-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'g2yRZFh3BJ53Nav4NI5GTA', 'review_id': 'wlBjzbbsO7s97YNkVt5RaQ', 'text': "We were so happy to find a Shabu Shabu restaurant while on vacation!  If we lived in Las Vegas, we'd be frequent diners!  Very good dinner for a very reasonable price. Good job!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2015-06-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '95S2YWApQxdpaYwQL9ryAw', 'review_id': 'cy4dxGcueJKGtB2ZYcIXBQ', 'text': "3-1/2 stars if I could give it. Went on Father's Day and although the place was full but not packed, they were severely understaffed or unorganized. This is my goto for shabu shabu because they have really good ponzu and goma sauces. This trip the sauces were bland, goma was watery. When it came time to pay my waiter apologized for the long wait for a table and for getting the food out slow. That really meant a lot. I'd still go to this location over any other hot pots so hopefully the sauces will be better next time. I've been going to this owner's location back when they were on Sahara and moved to Spring Mountain their current location.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2015-06-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7EN3g5lg3wUIVfRHcg6Lrg', 'review_id': '_nVLB4S_VBi6HNrMA_pzsg', 'text': "The shabu here tastes really good - the broth is amazing. The service, however, is lacking. We spent over an hour there because the service was so slow. We had to ask for them to bring out a lot of things that are normally at a shabu table already (ie spoons, garnishes, ladels, water etc). We took advantage of the free edamame offer from yelp - I would not recommend getting the garlic edamame. There was so much garlic on it that we couldn't finish eating it. \n\nBesides the service, it's a great place to eat at to cure that Vegas hangover - the food really is delicious.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2015-06-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'J_NM2WG6uMeKsv20-41Flw', 'review_id': 'F30L1BqJfvZZJUMDdr4ZLQ', 'text': 'Enjoyed our time here. Plenty of space, excellent food to choose. You cook it how you like with your own spices in it. Very good food, good atmosphere, definitely will be bringing friends & family back here again', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2015-06-28', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'dOUrD9HuE-7We4FV-EPlEQ', 'review_id': 'vAt1my7yHflZCCqvvLhcjA', 'text': "We had a good experience. The service was great and the food was tasty. We got the spicy miso and the sukiyaki; I recommend the latter. Really great to have a Groupon as well. Not sure it's something I'll crave, but it's worth checking it out for yourself.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2015-07-05', 'type': 'review'}
{'votes': {'funny': 7, 'useful': 7, 'cool': 7}, 'user_id': 'IK-bpyw7JNVxkExX4eSHpA', 'review_id': 'E_9uR_ByqMMoGrLn-pDTug', 'text': "My family and I come here often for shabu shabu. It's tucked away in the same plaza of SF market and right underneath Bazic. The layout of the restaurant is somewhat off. All the tables are scattered everywhere, but it's nice to be able to sit at a 8-top table when it's only the three of us. \n\nService can be a hit or miss. The times we've been there, it's been a miss. The place was busy and attentiveness lacked so much that we got up to get our own condiments that we asked a few times for. Sometimes, even getting a menu could take a awhile. There was also a time when they forgot about our rice and I waved my hand in the air, but the staff that looked dead at me just didn't care. I was like damn he's faking the funk game is stuuurdy, real sturdy. It can get frustrating at times. When the service is a hit.. it's a wonderful experience here. Everything comes all at once, drinks are refilled, rice is given without being asked. So it's all about chance here.\n\nWe usually get the Kobe Chuck, hungry portion that comes with a small amount of sliced white onion, mushroom, tofu, cabbage, broccoli, green onion, and udon noodles. I love their dipping sauces which are a ponzu-based sauce for your veggies/noodles and the goma sesame-based sauce for your meat. I add the minced daikon, garlic, and green onion from the condiments selection to my ponzu sauce to intensify the flavor. I also add garlic and green onion to my goma sauce to give my meat the same effect. Delicious. If you don't get your white rice or condiments by the time your meat and veggies are done.. Ask for it! \n\nI highly suggest to avoid the soy milk broth. There isn't any flavor whatsoever and it's so translucent that it's almost all seaweed broth with a sake shot of soy milk. I was looking for more of a heavy cream based broth as in all soy milk not half or a shot of. I stick with the Spicy Miso Broth, which has the most flavor from the three of Seaweed, Spicy Miso, and Soy Milk. \n\nThe technique for shabu shabu is to you its own. I prefer to use half my tofu/cabbage/mushroom/broccoli portion, all my white onion/green onion, and save the udon noodles at the very end. While the veggies are almost done, I swish one by one my Kobe Chuck slice, then dip it in the goma sauce and get a veggie.. dip it in my ponzu, then combine both (meat/veggie) with my white rice and there you have the magic of shabu shabu. Lastly, I save my udon noodles for the broth that had everything boiled in it. Think seasoning the broth for a soup ;)\n\nShabu shabu is soul food at its best. I always leave here with a smile on my face. It's therapeutic, yet fun at the same time. Love the music they play here. Top 90's, Reggae, and some old school like Sinatra got me movin' while I'm swishing away. Keith Sweat - I'll Give All My Love To You... Ready For The World - Love You Down just to name a few. Dining here with music that I love is a plusplusplus!\n\nWinter, Spring, Summer, Fall.. I can always go for Shabu Shabu whenever. That's how much I love it. It's one of my favorite cuisine! And Swish is our Family's favorite place for it.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2015-07-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zyTyATKKAvwu9M8gmRxkrg', 'review_id': 'G-j5EO2q9bjm2WFWiW10Gg', 'text': "This is the original Swish, and by far the better one.  Not sure why the stars are low, but we have always had great quality, delicious food here.  It's one of our favorite restaurants!\n\nI always get Healthy Prime Rib-eye Shabu Shabu Seaweed Broth. My husband always gets Healthy Kobe Chuck Sukiyaki.\n\nYum yum yum.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2015-07-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'isywC5zXI_BQoWMFq9SvnA', 'review_id': '9dK6h9tfcVWgFcTVTkb6Ug', 'text': 'I am very picky with food, and coming from CA where shabu shabu is everywhere, this has to be the best in Vegas.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2015-07-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'eDx_m7ej9IrkfOVwaTLNWQ', 'review_id': '-GLgJts7qJbzeuS7AAtc2g', 'text': 'Excellent Shabu-Shabu outside the city center of Las Vegas. We made a reservation for 8:45PM and we were surprised to be alone. The restaurant was empty. We took place and ordered a glass of wine and a hot green tea. The glass of wine arrived 5 min after and we had to wait almost 25 min for the tea. Apparently long to be boiled. Not a huge issue as the staff was really smiling and happy to welcome us. We ordered the Shabu-Shabu with Kobe beef 6oz for 2. It was really good with the miso flavor. Overall it was a nice restaurant. The decoration could be better and offer more charm.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2015-07-12', 'type': 'review'}
{'votes': {'funny': 6, 'useful': 7, 'cool': 6}, 'user_id': 'OaFcpi3W4AwxrD8W2pgC_A', 'review_id': 'HlKov3uxeNWAwuisjymCkA', 'text': "I went here with a bunch of people. The place was not busy at all. Service was not consistent. It would good for a minute then they forget about us for a while. I was almost done with my meal and my friend's shrimp still hasn't gotten to the table.\n\nWe tried: steak, shrimp; miso, spicy miso, seaweed broth; sukiyaki. I enjoyed the sukiyaki. I don't remember being offered more veggies so, I'm not sure if they have unlimited veggies or not.\n\nOne thing we all noticed was the bizarre playlist. Tupac, Biggie, Enya, Whitney Houston...\n\nThis place isn't bad but I've had better.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2015-07-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'De7f75dLJ8TKh0qW8q0i9Q', 'review_id': 'sRd28txpwAfs3DfnTxYHGg', 'text': '***Disclaimer: this review is for location on spring mtn in between decatur and lindell.\n\nI\'ve never heard of shabu shabu until my friend took me there. Thanks to her, she opened my pallette even more than I could have done on my own. And thanks to her, an avid yelper, we went to a lot of places to try things out. I digress, here\'s my review on swish shabu shabu.\n\nLittle known fact, in the Philippines "shabu" means crack...as in crack cocaine. So when she said we\'re going to swish shabu shabu, I cracked the joke. Pun intended. We got there and the ambience was good. I ordered the hungry portion of kobe chuck, coz I\'m a fat kid at heart. I ordered it with the Sukiyaki broth. I also ordered eel special roll.\n\nFor the kobe chuck on Sukiyaki, it was great. The Sukiyaki broth brings out the flavor of the kobe beef. I like to cook mine where it just starts to brown the meat...so basically just dip it in the broth for about 10 seconds and eat it with rice. Overall, no complaints on that. It was phenomenal for a person that has never tried it before. \n\nAs for the eel special roll, it was good. Not great. If you want specialty sushi, go for a restaurant that specializes in sushi. Swish shabu shabu is for the shabu shabu part. I like my sushis, but if I go to swish, I go for the shabu shabu. \n\nOverall, this place is great, but even the the hungry portion is not enough even for me. Good thing that there\'s another location that offers all you can eat shabu shabu. The service is great, music is a little off for the ambience (they either play rock music or edm). \n\nAs for the part when I said shabu means crack cocaine in the philippines? Yeah, this place is crack coz I\'m addicted to it. I would give it a 5 star, but they don\'t have all you can eat like the other location, that\'s why I\'m giving it a four star. Don\'t take the 4 star lightly, though, coz almost everything about this place is top notch...except for the out of place music that doesn\'t go with the ambience.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2015-07-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Gkk5W7jpvSBJ0qybFetTPA', 'review_id': 'jOmpSfrNdWTsGeytNbbmLQ', 'text': 'Very classy,  great food, awesome staff was very polite. Enjoyed spending spending my birthday there.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2015-07-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cUMB9K45LATwY2GII2rpZg', 'review_id': '4i6f2MKhUuDGNdfcVo4Nqw', 'text': "I love this place! The reason why I went here is because there was a groupon so I figured why not check it out. There are so many restaurants on spring mtn but I never know which one will be good but this one I will keep going back to. It's like melting pot with out the pricey bill (and not as fancy). The two times I went, I got the spicy miso with the Kobe Chuck beef- delicious!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2015-07-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2V8hFkhMfF-UTV5lZR_XNg', 'review_id': 'qNsGEyDwNfaARap6jcpqgg', 'text': "First time coming here after a few months of wanting to try it out... I have to say I enjoyed my visit and wouldn't mind stopping by again...  Me and my boyfriend tried both the shabu shabu and the sukiyaki both pretty good, but we definitely favored the sukiyaki. Service was great, we let our host know it was our first visit and he explained the differences and made suggestions on what to try with our meal.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2015-07-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'kyDg10Hoxz9LdLniTNTIGA', 'review_id': 'KYQUxGRAnyvL9-_7TIB96g', 'text': 'Checked this place out because they were offering a Groupon and because we had never tried Japanese hot pot before. \n\nWe went on a weeknight and there was only once person in there at the time that we went. So we received very quick and attentive service the whole night. It did eventually fill up to about 10 people after a little bit of time. \n\nWe ordered one of them seaweed broth based and the other was the sukiyaki. Sliced beef, rice, udon, tons of veggies...it was a lot of food for two people! I will admit that I enjoyed the sukiyaki more. The sugars in it really start to caramelize and that is when the magic happens. \n\nI believe that it has a great value, great service, and a interesting dining experience in where it forces you  to slow down and enjoy the food.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2015-07-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UhExGSWZg_8n0_2sSbeC3w', 'review_id': 'M_cp1qNstI0_b-RdVmlwMA', 'text': "Yeah, tonight is my last night going to this place.  Teryaki beef bento box was horrible.   If a japanese place can't make bento right,  something is definitely wrong.   Meat was burnt to like beef jerky.  I ordered that for my 6 year old son.   Sukiyaki cook it yourself beef was good but NO BEER?  It's a Friday night?   Really?   Its not that they ran out. .. they just didn't put any in the fridge so all they had wad warm beer.   Wtf?  Even with a groupon,  i wouldn't come back.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 2, 'date': '2015-07-31', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 2}, 'user_id': 'cAs84AMuiSsgzlWv3JP1uQ', 'review_id': 'ezOejo3akFotvmZrbWmdFQ', 'text': "Great place and healthy (depending on what you order). Shabu shabu style is not only fun but a different way of eating. Entertained some visitors at this spot and they had never done it before, so I welcomed them to a new world. \n\nI ordered the mushroom party and I LOVED it. So good and felt healthy, fresh. Also enjoyed some prime rib and was a bit reluctant thinking it would be bland but surprisingly it wasn't. \n\nRecommend this spot if you looking for a new way to dine!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2015-08-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '95S2YWApQxdpaYwQL9ryAw', 'review_id': '9jCz8Tff29Lvejmj5H7x1A', 'text': "Upgraded my rating to 4 stars! Ordered the prime rib shabu shabu. The sauces were very good, just how I remember them. The rice nice and sticky. It was crowded like last time but they were well organized, didn't wait for food very long, especially for the number of workers visible. Like last time, our waiter was gracious and apologetic but there was nothing to apologize for.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2015-08-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hwkTaP01baTDvN9iA7MD1g', 'review_id': 'olGLGi2QyYFHNf5EmFagrg', 'text': 'YUM! \nTook my kids here for lunch with a groupon. We were back for dinner later in the week. Kids split a hungry portion of Kobe Chuck with miso, I had the healthy portion of the same with spicy miso. It was so good! The service was wonderful - very kind and very attentive. Veggies were fresh and there were a lot of them included. \nWe will be back, again, often!', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2015-08-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Trokrhrfh0IPBXA07906mw', 'review_id': 'jXxsA3U9pMB_x1c1M_7O1g', 'text': 'First off Phil was very friendly and professional. He showed us the ropes of hot pot. THE HOT DROPS ARE NO JOKE. My girlfriend made the mistake of putting it directly in her mouth. Love the vibe and the staff. I recommend for everyone. Make sure to check in and get a fanta.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2015-08-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6s1qDCHJG_51UYb5r-TTzA', 'review_id': 'zDKP_mJ50feHqnzBEhyGAA', 'text': 'We really like this place. Its something a bit different from the usual meal out, and the quality and price are right on par. However lately, we have seen the quality go down a bit - maybe we were just going there too much and got bored of it. We are going to give them another chance soon. Shabu Shabu is the way to go !', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 3, 'date': '2015-08-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '657EcnHIBYj_DIzy1CpQ2Q', 'review_id': 'm8FEGDl0q1vRkcXcVEjyIg', 'text': "We happened to stumble upon this place... My first impression was okay it was a little slow... The guy who sat us was wonderful he was very sweet, we ordered our food and I was shocked... It was really delicious and the sassy calamari were to die for, the passion roll wasn't to great it was a bit warm and soggy but everything else was great, the broth was perfect and after we ate all the meat and veggie we let the rice in the broth to simmer and mmmm it was sooo good... The guy serving us wasn't too attentive but I didn't mind it much. I will definitely be back soon.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2015-08-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'bWcCwGXbpw0FtVahuCo7AQ', 'review_id': '3iz05poq7RXhhssBhpZlnA', 'text': "Horrible service.\n\nWent to my friend's bday dinner here. I was late to get there w/ my girlfriend.\n\nWaited a while for them to bring us menus.\n\nOrdered the beef teriyaki bento & gf ordered chicken bento\n\nBeef teriyaki was good.. The salad was super bad.. Too much ginger.. Had a few other people try the salad & they all hated it\n\nWaited forever for them to bring us our check so I just went up to pay.\n\nThey added gratuity & then the tax came out to something ridiculous. They claimed a new IRS thing allows them to tax you on your bill + gratuity. It sounded bizarre to me but I didn't argue with them. I just paid & left because I was already beyond frustrated.\n\nNever coming back here ever again.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 1, 'date': '2015-09-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'pX-eNmQUGmBXKAms_PWLDA', 'review_id': 'hoTt37_0J-igbP_SviUmEg', 'text': "Had lunch and first time trying shabu shabu at Swish today to celebrate one of my good friend's birthday. Had to say it was SO GOOD! The guy who served us was very attentive and he was very polite and most of all was very patient with us because we took such a long time deciding what to order.  He was so kind enough to explained us how shabu shabu works. We had Crispy garlic chicken and Sassy calamari for appatizers. Let me tell you that these are must try appatrizers! They were BOMB! For shabu shabu we ordered Kobe chuck and Prime rib eye, both on hungry portions and miso for broth. After everything was done the server I am assuming the owner gave us complementary ice cream for my friend which was so nice of him!! \nOverall from food to service two thumbs up! Will be definitely going for seconds and thirds.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2015-09-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SK4s1lTKLwZCrC2sUyc3bQ', 'review_id': 'bMutH8SSyKCH5a5o0753lw', 'text': 'The restaurant was quite slow for lunch time when we came in. There were only two other patrons. Now, I know why. The food was Very disappointing! The shabu and the rolls were not good. I will not return.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 1, 'date': '2015-09-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8AulTDuO4CPr52JCGNyE7Q', 'review_id': 'fxqW0nC1erbwUQ9vFnPqdw', 'text': 'Love the Groupon they have. Good food I can eat something healthy but still feel like Im dining out, service is pretty good. No bar anymore which is a big thumbs down.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2015-09-28', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'fJzb0icWQTeH4Z8ouRlC-w', 'review_id': 'JkU27Cv2QnRYBqXY_qhebw', 'text': "Absolutely horrible service. We walked in and my family and I immediately felt akward. The waitress literally stopped talking to the table she was serving and stared at us like we were from another planet ?? The female waitress would just walk by us as we weren't even there when we would try to flag her down for an order . The guy was cool but didn't come around often. The food was mediocre but we did the all you can eat lunch and the waitress kept changing what was and wasn't included ?? I ordered a Japanese lasagne roll also and was not the best . Would not come here again ... pricey, average food and horrible service   not somewhere where I want to spend my money .", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 1, 'date': '2015-10-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Kq0xeRMCIi7Es5ISNYnaAw', 'review_id': 'jqYQhsRIcgYQBhNzrFbU3Q', 'text': 'Excellent food, and great service. A must try restaurant.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2015-10-11', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '0LEWSj98_9jY83BImrPQmg', 'review_id': 'tknzM97VtDydA123ulIWWA', 'text': "I have been coming to this place for more than 3 years. I love their Shabu Shabu and recommended everyone I know. \nSurprisingly I have never write anything about this place until now. \n\nYou gotta be patient when you eat here since most of the time there will be only 1 waitress running around serving 3-4 tables at the same time. But hey... More than a dozen times the did a good job! I really don't mind because I do understand why they only have 1-2 workers there in this economy. \n\nShabu Shabu is basically cooking your favorite meats and vegetables on the table by yourself then dipping in sauces which are 2 different types and enjoy them with rice. \nTheir Garlic Chicken here also fantastic. Crunchy and tasty. \nHighly recommended!!!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2015-11-05', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'G-tEGsTGC9qkg2_cv9aNVA', 'review_id': 'J-zavSmUHwxOnkSviRNBbg', 'text': 'We went herr beacuase of a groupon. The food was great we ordered the ribeye shabu and the chicken sakayki. We will be going back', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2015-11-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'H-XVCJaj7d60JXGTd32iRg', 'review_id': 'RgiKA5JMyyWUQ5KYZwxHzA', 'text': 'This place went to drain last few years. Look like they bring food from microwave heated. Order few rolls and chicken teriyaki for our kids. Salad was horrible taste and feel like you eat something smell like a toilet. Only two stars I give that lady was nice to my kids. I never come back this place and hopefully they will close soon and stay out of business.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 2, 'date': '2015-11-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GDleRKUqfsTEK5S-GS4YFg', 'review_id': 'CY9j6QAY9Cs6uwNSfJdnVw', 'text': "We came to Swish with a Groupon and found it to be an excellent value for that price point. The rule of thumb for our family is to always order beef for shabu shabu (not pork). Two large orders (hungry portion, 8oz) of prime rib-eye that come with veggies, rice, and sauces was more than enough for two people.\n\nWe opted for one shabu broth and one sukiyaki (sweeter broth) so we could try both. These two broths are totally different so it's based on personal preference. If you do sukiyaki you can get a raw egg as a dipping sauce (this is a real thing in Japan) and that was delicious. I'd come here again with a Groupon.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2015-11-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '6exheBEOgIWu7KmtBFFUSQ', 'review_id': 'C5NTJS-LB9DyxGREnik-qg', 'text': "Healthy and fresh eating is what this place is all about.  Love the shabu shabu during the winter months and I'll have the sukiyaki sometimes for more flavor.  Usually stick to the prime rib eye in seaweed broth but the Kobe chuck is great as well.  Friendly staff and service are a plus to this restaurant.  The dipping sauces are very flavorful and I like to garnish the ponzu sauce with garlic, radish and green onions.  Great recommendation for a group dining experience to mix and match dishes!", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2015-11-20', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 4, 'cool': 4}, 'user_id': 'MFPH3XwqurAOx-XzJ9myNg', 'review_id': 'i5po-CQ-pE6edX6DLredEA', 'text': "TLDR: Reasonable prices; offers sukiyaki as well; edamame or soft drink with check-in; full sushi bar menu\n\nSwish Shabu Shabu now operates only in their Chinatown location as a new owner has bought out the Sahara location. My friend and I have been wanting to try Shabu Shabu recently and we were lucky to stumble upon this location. \n\nConfessional booth time: I just found out what Shabu Shabu was. I honestly thought it was just hot pot, but boy was I wrong! This meal is like kbbq meats (see what I did there?) hot pot meets soup. Having learned it's the sound it makes when you swish the food in the pot, we were excited to try it for ourselves.We even tried the traditional raw egg dip. You can find out more about shabu shabu and sukiyaki if you just ask them. I think they love newbies. Just make sure you get the spicy miso.\n\nSo the first thing you need to do is check-in and either get a free serving of edamame of a soft drink. Next, decide what at meat to get. Now, it is my personal belief that an 8 oz portion is good enough to share between two people if you treat the meal as a soup, especially with all the vegetables and small serving of udon noodles. As a pescatarian/sometimes-vegetarian, I enjoy the 8 oz of salmon for $15.95. First off, where can you get 8 oz of essentially salmon sashimi-style for $15.95? It gets even cheaper at lunch time and if you just want chicken sukiyaki, it's $12.95. You'll sure be full, especially after the napa cabbage, carrots, onion, button mushroom, and tofu slices. \n\nService is generally good. I always have to ask for a refill or make eye-contact with a server to get their attention. It seems like there's one server and 3 helpers/bussers/cooks who cannot function in a waiter/server capacity due to a business model, but I guess that's on them. \n\nIf you're in the area, I recommend coming here. They sure won't disappoint.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2015-11-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '-9VyrJeU0e_04hnlZe8iPg', 'review_id': 'u0LqmiGf7KUJyqNXQxANUw', 'text': 'I LOVE this place. My bf and I got a groupon and decided to try this place out. We each got sukiyaki and two entrees of kobe beef and salmon and a mushroom party. The meat and fish were fresh and tasty. The service was great! I love the vibe on there. Will def be coming back for some more shabu shabu :)', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2015-12-03', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 3}, 'user_id': 'wRq6j5TozIiyPfVnZJX7gw', 'review_id': '1Fw6DDDOM0KpTz8eG6zOqA', 'text': 'Yumm! \n\nI have been twice to Swish for lunch (a friend bought a group-on) and both times were really good.\nSwish is clean and comfortable, the staff is very polite and helpful, the food was super yumm!\nDifferent raw protein sources, vegetables and broths are available to choose from. At your table you have a burner with the broth of your choice to cook your food in.. Pretty cool..\nIt is family style so you can share your food with your table mates!\nThey also use Square pay! Yahoo, that makes them ultra hip in my book, I love technology.\nGet in here, you will love it..', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2015-12-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'z9TftoZm8fUt1anZOq1xMg', 'review_id': '4SHJht4qEupkSQn0--CrUA', 'text': "The main server is awesome! It doesn't get too busy, which is great so that you aren't waiting too long for food. We always get the Miso shabu shabu with the 3 meat plate, their broth is tasty! Wish they had all you can eat, which is why I did only 4-stars. \n\nI suggest getting the groupon for this place too! there's no certain time you have to use it and it's $27 for $40 which covers the 'hungry portion' plate for the 3-meat plate.", 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2015-12-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xEqWIC5cHiMssr9qBARMXw', 'review_id': 'rDFxC2muL9qYhToMb-XnKw', 'text': 'Did a group on for this one.  I AM A FAN - Fresh Miso shabu shabu with the 3 meat plate - delicious.  What the place lacks in decor it makes up in incredible food.  Our server was also incredible.  It was our first time doing "Hot Pot" she walked us through everything. It was truly a evening to remember.  Going back with other friends next week to introduce them to this amazing place.', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 4, 'date': '2015-12-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vjXde2Qm8GqX9cS9mteefA', 'review_id': '3Oj-HC4hZZ6uDR0Epk5neg', 'text': 'Wonderful!  I got the three meat sampler! It was delicious!  Five stars! Our new favorite restaurant!', 'business_id': 'trC8BtTuNJniFaCaK1IQ4w', 'stars': 5, 'date': '2015-12-21', 'type': 'review'}
