{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'cl1LMRfak6gR3vqsEzRtHQ', 'review_id': 'P0p44TPO1woD-atXR7KLyw', 'text': "As Americans, we love choices. It is not unusual, therefore, that an American bistro and drinking hole offers a choice of beer and wine. But this place taps into just about more than any other place out there --- around 200 beers in all. Yet, is it all really enough? The answer, of course, is yes and no.\r\n\r\nI for one do not need 200 beers. I need one: Sierra Nevada Pale Ale. That they have Abita Purple Haze or Portland Oregon Honey or even the Americana trophy Pabst Blue Ribbon makes no difference to me, except, that is to say, that the Yardhouse cares that people drink beer not just wine. In any event, if you're looking for new styles or brands of beer on any given night, this is going to be a place for you to go (at least in eight mostly Western states).\r\n\r\nI've breached the threshold of the Scottsdale Fashion Square version twice. Both times were pleasant enough. The staff seemed young, good-looking and attentive. The prices seemed reasonable. The decor and atmosphere in the cavernous space are corporate (surprise, surprise --- it's a chain). There are too many televisions for my liking. But I'm not a sports bar kind of guy. While lots of square footage means plenty of tables (i.e. no or limited waiting for a seat), hobbling through this massive place to the restrooms from the patio could be dangerous and embarrassing for some with, ah, control issues.\r\n\r\nThe Yardhouse puts a lot of emphasis on eating. I suppose they don't want people getting too wound up on all those suds. With the exception of a handful of French fries, I have gone for the beer rather than the food. That said, the food looks good, the kitchen is open, busy and appears to be about as squeaky clean as the Yardhouse's image.\r\n\r\nPart of the fun comes with sitting on the patio. It's not that the atmosphere out there is all that great. Essentially you're sitting in a parking garage. But the people watching is spectacular. All the young Scottsdalians love valet parking, prancing around half naked and giving the impression that they actually have more than the minimum in their free checking accounts. Ah, if it were only L.A. Perhaps it wouldn't be so pathetic ... or funny.\r\n\r\nCheers.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2006-08-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ybnN1rEY9Fm_p2SPkv_-uA', 'review_id': 'UH3jhWD6hKT5F4scyazKPQ', 'text': "This place knows beer, that's for sure.  I can't be completely sure but it seemed that there were well over 75 beers on tap.  The food is pretty good and not absurdly priced.  The only problem?  Atmosphere.\n\nIt seems like the owners of the Yard House got together and decided to make a bar/restaurant for the Scottsdale crowd.  Noble plan, right?  So they listed all the attributes of a cool bar: lots of options, a signature element (more beers on tap than anyone in Pho-town), beautiful people, roomy booths and patio seating.  \n\nIt all comes across as pretty good, but there's nothing that really makes this place memorable.  It's actually like going to a mall versus going to your favorite little funky thrift store.  All the right elements are there, but some bit of soul hs been drained out, which is actually my critique of Scottsdale more generally.  \n\nSo if you're looking for a random beer or some bar food while shopping at the mall, the Yard House is the place to go.  But it's basically forgettable.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2006-09-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Ovpa3S8xD96dLE5eDxcxJg', 'review_id': 'yr9MCfM3HBHEcz7A82h6Lw', 'text': 'The selection of beer is impressive. If you catch a glance at the beer room teeming with flowing kegs of delicious import and microbrewed beer, it could make your taste buds water as it does mine.\n\nUnfortunately, beyond beer, the Yard House doesn\'t have much to offer. The food is average at best and is way more expensive than the quality justifies. \n\nIt, along with its neighbors at Kona and Z Tejas, have built-in the additional "scene premium" that make a five dollar chicken finger appetizer suddenly worth eight or nine. \n\nThe service is actually very friendly and knowledgeable, so it is a fine place to grab a beer en route to somewhere else, but I wouldn\'t go out of my way to overpay for average food. That\'s just me.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2007-02-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'kos4MkM2h0UAdupVDuTziQ', 'review_id': 'kLIPijk5YIHfdX1lW4q3qw', 'text': 'They have a lot of beer on tap, but it is almost not worth it just for the slow service ( I know other reviewers had no problem with service, but our server messed up our beer orders twice and was not quick about it, maybe she was having an off night) and the Snottsdale crowd.  When I heard the trendy girls ordering  mixed drinks it made me want to point them in the direction of the nearest scottsdale scene bar and give them a swift kick in their $150 jeans .  Why go to the Yardhouse where there are so many delicious beers on tap and order some sugary horrible cocktail??  Alas, I am not meant to understand and I accept and embrace that fact.\n\nThe food is ok, nothing special and certainly not worth the price they charge.  If you are looking for an impressive selection of beer, show up to the Yard House  for happy hour, order a good beer or two and then head on over to Papago Brewing for the rest of the night.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2007-03-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'wYzOrThSYP8WwioLfsu4vQ', 'review_id': 'pYkzVUBpbbc__SiH_bokCg', 'text': "I'll make this short, since the other reviews all seem pretty much on the right track. As everyone else has stated, they have a very large beer selection-- over 200 on tap. The keg room is really interesting, but S.P. nailed it on the head-- nothing here is exactly memorable. The food is good, the beer is cool, the atmosphere is so-so. I can't say anything bad about this place, really, but I can't say anything great either. Maybe if I went back at happy hour (Mon-Fri 3-6pm or Thurs 10-close) and got cheap beer and half-priced appetizers I would feel different as they were, in my book, pretty overpriced.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2007-05-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'E0WWNXVze_sfDCbM0oMYvw', 'review_id': 'iKkKpli94dq45T7sH5ddaQ', 'text': "Yard House definitely played a role in my killer hangover this morning.  Arriving at 5:55pm yesterday my friend and I were able to squeeze in two martinis and two apps at Happy Hour price before HH coincidently ended at six.  Bummer.  Especially since happy hour martinis are $5.25  but at the stroke of 6, raise up to a bank breaking $9.25.  And they somehow cant fill them all the way to the top.  \n\nDont get me wrong though, we stayed for another three martinis each, maybe because of the flirty, good looking mid-west bartender, or maybe because it was crowded and hot as balls across the way at Z Tejas and Kona.  Either way.  \n\nYard House is home to roughly half a billion beers on tap so if you like beer or just like to get drunk, $3.25 pints at happy hour are the way to go.  If you cant make it before 6pm, try waiting til reverse happy hour later in the evening.  Or you can drink straight through both if you have the cash to purchase regular priced drinks.  Which I just hate.  \n\nClassic rock is the only music you'll hear here, EVER, even during a Pistons game which to me, really doesnt set the mood.  Try coming during a Suns game and they'll turn on the sound.  Great place to watch sports but arrive early, although its a big place, it gets crowded on game days.  \n\nGood people watching, snotty valet right out front...everything we love about Scottsdale.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2007-07-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'nWouNfZD3Pw08RYizxkqcA', 'review_id': '98I71GN56CrFQYCnu0bOtQ', 'text': "I have mixed feelings when it comes to this brewery and restaurant, which has a prime location at Scottsdale Fashion Square. The food is good. I recommend the delicious baked macaroni and cheese and the martinis are excellent. However, the service at the bar is lacking. I've been to Yard House a few times over the last couple of months (I'm usually dragged here because my friends love the place and I  cave in because I don't want to be difficult) and the bartenders -- one guy in particular -- are extremely snooty. The last thing I want when I go into a bar is getting the holier than thou attitude from my bartender and that's all I get when we sit at the bar here. If you want good food and drinks, this is a good place to go, just be sure to sit far, far away from the bar. The wait staff is much more pleasant.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 2, 'date': '2007-08-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Cp-PV8rsypbO-xBrQ6KmQg', 'review_id': 'iQCWuFOAYj1MJQxPx-Kd1w', 'text': "I like the food here. They have a great menu. Some of the items aren't so great and they also aren't entirely consistant with preparation. They are very very accomidating though, so if they screw up they will do it over for you or take it off the bill. They also have tons of beers on tap. If you like beer - it's a great place to go. \n\nThey recently removed a bunch of bench seating in favor of tables and chairs... I wasn't a fan of them doing so, but it's no big deal... it just means it's now more likely to see other people there. Before, it was easier to just eat your meal with your friends in isolation - now it's more open and you have to be subjected to the douchebaggery that huddles around the bar.\n\nIt has become a bit of a hangout for the snottsdale crowd it seems. No big deal really - if you like that, you can hang out there and be seen. If you're not into it, at least you can check out a few fake boobs while you down a pint of fancy imported beer.\n\nIf you like beer, but hate this atmosphere - head south a bit to Papago Brewery. \n\nYardhouse gets my approval only because of the food and comfortable booths and great beer selection and accomidating service.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2007-08-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': '-E6yYsngVZqIUHlX856sbw', 'review_id': 'WRQ2YAbmYumkna-o3zz_TA', 'text': "How can you go wrong with some classic rock and an ice cold beer when it's 100 degrees outside? I'm not even a beer drinker and I enjoyed the Yard House.  \n\nI had some time to kill and I thought this would be a good, kick-back place to hangout...and it was.   Since it is all about the beers, I went along and ordered my ballpark standby, Fat Tire in a pint glass.  It was the perfect drink for a warm day.  \n\nThe food menu was good too. We settled on chicken nachos and watched some sports.  Then all of a sudden, I started to pay attention to the music, it's all the best classic rock.\n\nHow can you not like having an ice cold beer and hearing my favorite song to roller skate to as a kid- Another Bites The Dust by Queen.  Perfect way to start my weekend in Scottsdale, AZ.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2007-08-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'eFY6bJpTcpZPXK_2tuOj_A', 'review_id': '--kvJeCUkrXhTDsv--2sQQ', 'text': 'I love beer.  I acquired my taste for beer recently (within the last two or three years), so I feel like I have some catching up to do.  Not in the "I\'m on my way to becoming an alcoholic" kinda way, but in the "I want to dry a different beer each time I go out" kinda way.  That being said, this was a great place to do that.  We were looking for somewhere to just grab a quick bite to eat before we headed to the airport and this was a great solution.  The food was easy (the generic menu that you\'d expect--my burger was just okay) and there\'s plenty of grease to go around.  The service was fast and efficient, though not overly friendly.  The decor is exactly what you\'d expect from a place like this--a bit loud with way too many televisions.  \n\nHowever, you can\'t ignore the fact that they have more beers than you can count and the waitstaff actually knows enough to recommend beers based on what you like.  I\'m not sure I\'d ever head back for a meal, but appetizers and beers are a definite go.  My recommendation:  any kind of wheat beer and the tower of onion rings.  Yum!', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2007-10-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'jqVeTSin5GeRm0ceSg-PBA', 'review_id': 'XGEMMClxIbQ49mp7rI5jFA', 'text': "I've been to The Yard House at the Scottsdale Fashion Square twice now and, overall, have enjoyed my experience. The beer selection as all the other reviews have alluded to is lengthy, so there is definitely something for everyone.  Both times though, I have found the bar service a bit lacking. Now I understand during happy hour when the place is full and the bar is hopping, it'll take a few minutes to get service. But, when the place is pretty empty, I don't think it should take 10 minutes to get a drink sitting at the bar.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2007-11-17', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 0, 'cool': 0}, 'user_id': 'mZzCVgy4g30eLEbwUUGrNw', 'review_id': 'hTZh6rgteGojwy4sx9TyAw', 'text': "For once, I'll be honest.  I went to the Yard House because I wanted to drink yards of beer.  There's something about drinking from a giant glass beaker that makes me feel like a mad scientist of beer, which is enjoyable.  To my pleasant surprise, the food is actually quite good.\n\nI don't remember exactly what I ordered because I got drunk and the police tasered me.  If you must know, that's why this place doesn't get 5 stars.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2007-12-05', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 4}, 'user_id': 'APLIPfq1Rf8QyhHHk2uAyA', 'review_id': '8Yql_H2aiZMaFlJwwIzolg', 'text': 'Rogue Hazelnut Brown chilled and ready to be served? Well, that\'s worth 5 stars right there, especially since you can\'t really find a Rogue Ale in just any bar. It\'s true. I\'ve become somewhat of a beer snob. I also admire a place that proffers variety, building on the boring ol\' domestics that many people seem to enjoy (don\'t ask me how). \n\nThe Yard House is where I went to drown my sorrows. After a hard day at the office, I wanted a beer. And I wanted a good one at that. My friend and I scurried over to Yard House to partake. I even tried a Honey Ale (from another Oregon Brewery) and chatted up my friend who enjoyed her pilsner and ale. \n\nThe menu has good happy hour selections. The service is just alright. Weird, I\'d say, meeting several jaded and bitter bartenders. Ours was not too shy about broadcasting his "woe is me" stance to us. He turned out to be a Cancer. Figures. In any case, he served us beer, even if he seemed a bit impatient when we were debating on what to order for our last round. I stuck with the tried and true - the Hazelnut Brown. My friend went with her fave, Blue Moon. \n\nThere was no frenzy to kick us out, even after happy hour passed. The bartenders poured us generous amounts of water... and even seemed to be a bit flirtatious with us. Could have been my non-sober imagination, though. We ordered a couple aps - the poke and crab cakes. They were okay. A bit hard to eat, I\'ll admit. Never in my life would I imagine seeing a $12 Spicy Tuna Roll on any menu, but the Yard House makes no bones about it. If you want sushi, you\'ll have to pay a hefty price for it. Then again, sushi at a bar like this? You\'re better off ordering the spicy thai chicken pizza. I hear it\'s really good.\n\nInside, the Yard House looks and feels like a typical restaurant/bar. Sure, you see alot of beer selection when you mosey up to the bar, but nothing really wowed me about this place. If I could give it 5 stars just for the variety of beer it has, I would. BUT I happen to think a little thing called "atmosphere" is important, too. That\'s why you\'ll find me elsewhere, like at The Lost Leaf, where I can partake of my fave Rogue ale, as well as many others, including Hobgoblin from the UK.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2008-02-12', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 1}, 'user_id': '-F32Vl8Rk4dwsmk0f2wRIw', 'review_id': 'wZGpIA7W9yITqZKGqmpL7w', 'text': 'The Yard House is the Reggie Bush of Phoenix establishments.  O-ver-rated.\n\nUndeserving of accolades, superficially interesting, won\'t stand the test of time, all sizzle - no steak.\n\nI mean, what can one expect from a corny chain, where one is overwhelmed by Disney-fied cake and ale?  This place couldn\'t be less lame if they renamed it Chotchkie\'s and served Extreme Fajitas.  Actually, I\'m shocked that they don\'t.\n\nOkay, okay.  I like beer.  They\'ve got it.  But where is their sincerity?  They couldn\'t give a squirt of piss that they are serving rare Belgian pilsner.  I\'m supposed to feel okay about this?  I need authenticity when I\'m at a bar.  This is why so many Ultras in Scottsdale or LA or wherever fail with me, the dearth of convincing clientele, staff, and moreover, product.  Don\'t shit on my pillow and tell me its a little piece of chocolate.\n\nOverall, this is a genuine 1-star rating ... not one of those mealy-mouthed "oh, i wanted to give it LESS but I couldn\'t!" reviews.  Go grab a beer here, but don\'t expect anything more than a bridled time with the fancypants of Fashion Square Mall.  \n\nP.S. One time I saw a guy valet his yellow Testerossa here and got out like he ran shit ... until minutes later the exact same model pulled into the valet area right behind him.  Ha!  Nice rental, watermelon balls.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 1, 'date': '2008-02-12', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'hnirQYfI4cjrzSMENyQTWw', 'review_id': 'LFsKQHb46kj7FA4xD8HOmw', 'text': "I avoided the Yardhouse for a long time, thinking it was a little too Snobbsdale for me. But I eventually caved. And I'm glad I did -- this is a nice place to come for happy hour or for a late-night drink. I don't think I would eat dinner here, though, as it seems pretty pricey and the menu doesn't look that imaginative.\n\nThe atmosphere is nice. If you like beer, they've got plenty of it. They also have wine and cocktails. I wasn't a fan of the pomegranate martini I had, so I typically stick to wine. The appetizers, including the spinach cheese dip and the edamame, are pretty good.\n\nAll the waitresses I've ever had here are very friendly. The bartenders are a mixed bag. While I've found them to be nice, some of them are a little odd... like they say odd things or mutter under their breath or move your menu around on the bar while you're trying to read it, and then laugh. \nI almost feel like they're ready to throw a spitball at me or something, like a passive-aggressive high school bully that walks down the hall with you, then slams you into a locker and laughs.\nMaybe I'm just paranoid, though.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2008-02-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': '90a6z--_CUrl84aCzZyPsg', 'review_id': 'gVbMdjBDblxqsR3YSrdPgQ', 'text': 'Popped by here for lunch recently. \n\nThe place is absolutely huge... "largest selection of beer on tap in the world, etc..." \n\nI was presently surprised. The food was good. Had the Mac-n-Cheese with chicken, bacon and mushrooms... (it was loaded with mushrooms), and a club sandwich with avocado. The fries were thin and crispy with a light seasoning. Service was quick and friendly.\n\nDidn\'t have a beer, but I intend to come back in the evening soon and give it a go...', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2008-03-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 2}, 'user_id': '0F2TzQoC1KG1pOqe3wC6gQ', 'review_id': 'rf3eiC1DA2I7luumOLWOmg', 'text': "Love this place. This is great for large groups of friends. Excellent beer list with over 100 to choose from. Food is not bad but a little expensive. The atmosphere is loud and fun filled. TVs on showing sports and lots of laughter. They don't take reservations though.I recommend this place for the drinks and people watching.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2008-04-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'i2ckIH_V0wsEDHb23a_avg', 'review_id': 'zvfrUMiRE8z9t0zq91CYUA', 'text': 'Too greasy. I am sure that is their plan. Grease and salt the heck out of the food, so people will need to drink more beer. We will never the go there again.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 1, 'date': '2008-04-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 2}, 'user_id': '-3HkgwyxVPf49MXM4dT8Tw', 'review_id': 'Mdv441UirGW0NuDwF76YmQ', 'text': "This is where I want to come when I die.  I LOVE beer and you cannot beat all the varieties of beer they have on their menu here.  I shed a little tear each time I walk by the keg refrigerator and see the hundreds of kegs of beer in there.  It's just so beautiful.  Some I've never heard of, some I can't pronounce, yet others leave me scratching my head as to why they are even on the menu.  Why, with all of these great beers out there, would you have PBR on draft?  But I digest...\n\nThe food here is better than average with a large variety to choose from.  As far as food options go for happy hour, this place takes the cake.  It seems like half of their menu is on special during happy hour, all for a very good price as well, which is nice because the food here is a bit pricey.\n\nYou could honestly make a meal out of some of their appetizers, which stand out from the rest of the menu.  Great sliders, good wings, and a huge seared ahi sashimi plate.  The rest of your menu is your standard pizzas, burgers, sandwiches and so forth, with a few notable exceptions:  jerk chicken with shrimp stack and the mac & cheese are wonderful.  If you are not full from the beer, they have some of the better desserts that I have seen.  There are plenty of large screen TVs here for catching the game, and some pretty good music piped in all the time.\n\nService can be a bit slow, especially when it is busy, but the servers know a lot about the beer and can easily recommend something new to you based on what you typically drink and like.  They do have a full bar, but I think they should reserve the right to throw you out of the place if you order some foo-foo cocktail at a place with some of the best beers out there.  But that's just me...", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2008-04-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '17LPTsu4RgqTZ3SxsGzzxw', 'review_id': 'nbsKvNiYA64jMSP1-HVYqw', 'text': "Can't knock this place.  I know what I'm getting when I visit a Yard House, and I wasn't disappointed in going to this location after an afternoon of shopping.  Had a pint of Abita Purple Haze ($5.50) and a goblet of lambic framboise ($8.00).  If the happy hour lasted all day, I would have ordered an appetizer, too!", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2008-05-05', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'wHTzdGmt_W4eQ5YCuDO-VQ', 'review_id': 'IgLkKzyuPsuNWdc-5B7S4g', 'text': 'I was so excited to try this place, I mean their slogan is "Great Food, Classic Rock, World\'s Largest Selection of Draft Beer," what more can a girl ask for? I have to say the food was good, the music selection was awesome, and they did have an extremely large beer menu. I had the Stella Artois, which was delicious, but at $6.00 a glass I limited myself to two (I am a poor college student after all). The fish and chips was also surprisingly delicious, but a tad pricey at $15.00, although their fries were really good. The restaurant was very spacious, and nicer than I expected. The service was kinda slow, but I was with a group of fourteen. I would definitely like to come back here and try some more of the beers, that is when I have a little more money.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2008-05-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 4}, 'user_id': 'J72XoQspNBmPsX2iKl2YvA', 'review_id': 'mzuSCwDa6G85stXz7Kk5rg', 'text': "Hard to believe eating on the patio with the outside temp above 105 isn't it?  Well, we were somewhat amazed how the shaded patio  with misters and fans worked at the Yard House.  \n\nWe were going to eat inside but it was crowded with a high decibel background.  No one was sitting outside so we sat down to see if it was tolerable.  The U.S. Open Golf Tournament from beautiful Torrey Pines was on so we grabbed a couple of comfy chairs near the misters close to the large HD screen.  We ordered cold ones and the Spinach Appetizer with flat bread.  It hit the spot while watching Tiger come from behind to finish first for the day with one day to go.  It was so comfy we then shared a fresh summer salad with strawberries and candied walnuts or pecans (either one or the other). \n\n Next time it is hot (which is until October) check out the efficient misting system at the Yard House.  There's a lot of cold drink choices...", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2008-06-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VUOtKrXdJ_5ddqmdUlCyMg', 'review_id': 'f5wF3vqdoBLzKKW53yL2sQ', 'text': 'My husband and I were going to the Camelback 5 to see a movie and decided to have dinner at the Yard House.  I must say that the staff and the food were both wonderful.  I ordered the vodka shrimp pasta and it was delicious.  My husband ordered the clam chowder and the blue crab cake sandwich.  Although he said that the sandwich was very good he could not stop talking about the clam chowder (and when it comes to his clam chowder he is very picky).  I did taste the chowder (actually I did more than taste it) it was very, very good!  The beer selection was amazing...we did get to check out some yummy beer.  I have nothing but wonderful things to say about the Yard House.  We will be going back to the Yard House again.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2008-06-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8K-MwDsF42xin_zPbKcZFg', 'review_id': 'vx5UYFHmcB-nSXBi_qV-Rw', 'text': "My brother and his GF were in town this past week and since she wanted to hit the mall, my brother and I did some brotherly bonding at the Yardhouse for lunch. Great Draft selection... so many to choose from!! The food is decent, service was a little slow but maybe thats cuz after a few drinks my brother kept asking our waitress 'When are you gona open one of these in Northern CA.?!'\nThe we ordered the spicey tuna roll and wings. The Spicy Tuna Roll is made much different than you would normally get at a sushi place, but it was surprisingly very good  and spicy!\n\nThe Yardhouse isn't at the top of my list of places to hang at, but it's certainly not at the bottom.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2008-08-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5T9sj2cjsXQsPy4phfsFrA', 'review_id': 'F5wcsuOJq4pkF2b1eRpPPg', 'text': "My shopping partner and I were at the mall when all of a sudden -simultaneously - we both got the urge for some beer and bar food. Hence, we found ourselves at the Yard House. It's in the mall. This was my second time (Indian Wells) and my friends first time. I told him that he was going to be in for a treat with the beer selection. Lo and behold they have over a 100 beers on DRAFT! It was a bit overwhelming so it took us almost 10 minutes to decide what drink to order. I got the Oregon honey and he got the half & half. Both of us were not disappointed. We ended up ordering several appetizers We got the sliders (ok, too much bread, not enough meat & side of fries), crab cakes (2 pieces, average tasting),  lettuce wraps (grounded chicken with tofu, tasty), & the ahi tuna (unusually served as a round pie, good and super filling). This ended up being more than enough food for two people. It didn't stop there, though. We ordered the trio sample for dessert. We couldn't resist. It consisted of a small ramican of lemon souffle (yumm), chocolate fudge (yummier), and apple cobbler (heavenly). Overall, the service and food left us with a good stuffed feeling. I would definitely stop by and try it again. Unfortunately, we don't have one in the Bay Area. Wait, maybe that's a good thing?", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2008-09-03', 'type': 'review'}
{'votes': {'funny': 5, 'useful': 6, 'cool': 4}, 'user_id': 'wHg1YkCzdZq9WBJOTRgxHQ', 'review_id': 'iA9GjDWpzsuUO-JywqHiTg', 'text': "Great menu with lots of choices and classic rock music (that means the 70's, not the 90's little yelpers).  I have found the food to always be good, although they sometimes run out of things (ahi or crab cakes in particular).  I do think it's a bit expensive, but I really have to knock down a star as service is so erratic.\n\nHad great service the other night.  But the visit prior, we left before ordering, after a good 10 minutes with no one to take a drink order.  The best part, the hostLess who took her time in seating us while she finished her personal conversation, thanked us for coming in as we walked out.  I guess they didn't hire her for her brain.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2008-10-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 2}, 'user_id': 'dWwaTl_Fmvl8djX0bVVTMQ', 'review_id': 'MpiJhUCx_xKv-Ht3TZXAYg', 'text': "Here is a great example of why I can't seem to lose weight...\n\nGreat beer and awesome food.\n\nCalamari was good--tasted like anywhere else.\n\nBUT the mac n cheese is the real deal. Boyfriend and I split it and it was more than enough for both of us. Rich, delicious heaven with roasted chicken, mushrooms and bacon pieces in it.\n\nService is okay...one of those places where the server takes your orders but doesn't deliver the goods. It's fine, just seems like they're held less accountable for good service.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2009-01-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': '330uVLSamVfBMHDvvhAprw', 'review_id': 'dVc2cnBhcGPl6ogqTjz3mw', 'text': "Too expensive.  A beer, after tax & tip, is $7+.  that's just too much.  Four peaks beer is $6, while same beer at the actual 4-peaks is $4.  \n\nThe atmosphere is great.....and the food is pretty good.....but give 3 stars because both food & beer are just too expensive compared to similar joints", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2009-03-01', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'JjyIdUHJ6StK4a9vjIpVmQ', 'review_id': 'sepdRaAZSbebg6JT47H2WA', 'text': "While on vacation in AZ on my last night there I found myself sitting around a fire burning marshmallows and chatting with friends. As we talk  the subject of Yard House henceforth referred to as Yardstick comes up. I have heard of this mythical place but as I live in Northern California and the ones in CA are in Southern California I had never been. A friend mentioned that Yardstick was in Scottsdale and I jump out of my seat and ask why I had wasted my whole vacation without going to this one.   My friend who also has a love of all things beer said that we should leave the fire and go. After extinguishing the fire (safety first kids). We were off.\n\nI was impressed with the restaurant it was fairly new and had a big open feel to it. Their beer list also included 100+ choices.  Which brought a smile to my face. \n\nAfter removing all the beers I have had on the menu I was left with about 57 choices. I spent a few moments figuring out what I wanted. I went with a Dunkel. A good choice.\n\nThe rest of the night went well. I ordered a French Dip and it was pretty good. The rest of my beers were good too. Although a bit on the pricey side. \n\nOne of my biggest problems was our waitress kept forgetting to place our orders for beer and since the place wasn't packed we had to wait longer for beers. If we weren't waiting for beers we were waiting to place orders for beers. After being told she had forgot to bring a round that was ordered she did give us two free beers which was nice.\n\nI'd go back to Yardstick again simply because I like beer a lot and do like their selection.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2009-03-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nGOh3QqKtjBI5m_6HSIZdA', 'review_id': '84jxbVWk4GUL0u_teEIPDA', 'text': "Happy Hour Review Only\n\nMet up with some friends here for half price appetizers and discount drinks before the Giants/Cubs game on a Thursday evening.  Between four of us we split 2 orders of chicken nachos (extra cheese), 2 orders of sliders, calamari, and the poki tuna stack.  My favorite by far was the poki stack with this kick ass soy/wasabi dressing circling the plate which will clear your sinuses in no time.  The nachos and sliders are my friends' favorites.  They were okay, nothing special.  Calamari was not all that special either, bread crumb crust with marinara instead of battered with aioli.  I do however, highly recommend the $4.50 margaritas, big and tasty.  With all that food and two drinks each the bill came out to $20 a person. We left stufffed and still probably spent less money than we would have on ball park food.  Our server was chipper and accomodating even timing our last round for right at the 6pm happy hour cut off buzzer.  I would definitely go back again for happy hour, I don't think I would want to pay the regular prices after all that.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2009-03-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Jou7l2wJvM7ZgqspikTw9Q', 'review_id': '3fxl8tF5JVZdBqjakAUEGA', 'text': "i don't drink, so this is a review purely on the food.  i had the blue crab cake hoagie (which is like a BLT with crab cakes).  bad idea!  it was the worst crab cake in the world, and it wasn't fresh!  it tasted like it was canned crab (which was probably what it was) that was sitting out too long in the heat for days.  it also had carrot chunks in it... what?\ni had an order of the sweet potato fries, and it was nice that they drizzle honey on it, but not nice that it was over-fried and burnt.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 2, 'date': '2009-04-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'joIzw_aUiNvBTuGoytrH7g', 'review_id': 'Xv_wEQA1tONRM6VtUquwfA', 'text': "This is the worst of the Yardhouse locations in Phoenix.  The parking is a royal pain, there's often a wait, and this place gets annoyingly loud during popular sporting events.  Somehow this semi-yuppified place manages to attract all of the thugs who would normally go to a sleezy sports bar and scream at the TV there when their team is losing.  This Yardhouse is in a shopping mall, please go somewhere else.\n\nService & food quality are the same as the other Yardhouse locations in the valley.  Beer selection is great but not so great.  If you're a beer enthusiast, you've already tried at least 90% of the beers.  If you're not a beer enthusiast, you probably won't care that there's so many beers to choose from.  I think they missed the mark by having tons of widely available beers at one place rather than having a lot of hard to find beers that people will like to try for the first time.\n\nPrices are too high - $6 pints, $10 for most appetizers, and again - this location is bad for parking and customers.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 2, 'date': '2009-05-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VmwryPCpVVDU232eNYdLIA', 'review_id': 'g3jKzgysMEFEejVCYyFLww', 'text': "I haven't visited any of the other Yardhouses but I love this one. I have only had a problem with their staff once and that was a long time ago. Every other time i have been here there service has been amazing. \n\nLast time i went there i had a million special instructions on my meal and felt like a jerk but I am trying to eat meat so I needed to substitute a few things. The server was amazingly accommodating and came back to check if I could have different items since they had meat stock or to inform me of different things just for my order at least 3 times. If i were serving the table i would have been annoyed but he had a smile and was genuinely nice every time he came to the table. \n\nI can honestly say that i have NEVER ordered something that i didn't like at this place. They have a huge selection of food to pick from and offer everything from Chinese to Mexican to amazing deserts. \n\nThe restaurant itself is very clean and well maintained and I have never had a problem with parking literally there are like 3 parking garages within a 100 foot radius of the restaurant plus they almost always have valet available. \n\nGreat place, great food, great service!", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2009-07-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'f5CqKZlqK9Sox9z9wuooCQ', 'review_id': 'NbqA4bPG-OQXfJDe6qyiWw', 'text': "When we want to watch a game and have a beer this is a nice choice.  Also, the happy hour apps are pretty good.  Like Kona, not 5 start dining.  This is a place with maybe 100 beers on tap so that's why you go there.  The food is average to good, at times there is a crowd, occasionally worth people watching, fun to hang out with friends, and it's right by Kona and Z Tejas.  It's convenient and another alternative.  Have a micro beer, they have some great ones.  Ask the bartenders for recommendations as they typically really know the options well.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2009-07-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'eIDnn3qk2kRfN_S1Hjoyxg', 'review_id': 'z0xWMz_VZ-z3l4X7zQSfpA', 'text': 'I had a decent cheeseburguesa here, and the beer selection was second to few, but these fuckers know nothing of rock and roll... It pisses me off to no end when fucktards like whomever owns this establishment bill the place as a rock and roll hangout and then play stuff like jill sobule and some sacklless fucks trying to cover beatles and stevie wonder songs. Stevie wonder covers??? Really??  Fuck you. the yard house does for "rock and roll" what fox news does for "fair and balanced." but yeah, the food was decent.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2009-07-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'eEo1W07PkjR0jLRkMF5m1g', 'review_id': 'J03ogsgJ88_WE5eUKcPt1Q', 'text': 'Man is this place high dollar but MAN is it worth it.  i got some gift certificates from work (otherwise my broke butt would never be able to afford to feed 2 here) and i gotta say i had the best steak Ive had in my life.   Also they have probably the most impressive beer selection in town.  Not the best beers always, but the biggest spread.  its a good place to listen to top 40 classic rock or see a game when you have a hundred bucks to blow.  This is my "special occasion" place.\n\nmy only beef with Yardhouse is they claim to be a rock n roll bar but all you need is a billboard chart on shuffle to match their knowledge on the subject.  Think upscale Hard Rock Cafe minus any redeeming memorabilia.\n\nAttire was typically business casual, which i didnt know when i showed up in my ragged jeans and black flag t-shirt.  Oops.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2009-08-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'g6rlp5No6GjEDXkrjvg1kQ', 'review_id': 'UN3vboImqAGCnEZDf_pcwA', 'text': "Okay the first time I ever went i had a dinner entree and it wasn't that great. Second time I had the Bernaise sliders and I fell in love. Can't seem to order anything but them, since. However I did try the Ahi Steak sandwich once and that was amazing as well..Not a big beer drinker so really can't comment on that.. But the music ...if you like classic rock and/or 80's rock.. this is the place to be!!!There's just something about hearing Boston being played....", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2009-09-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'troGv2y-fUP6oMyVku5jbw', 'review_id': '06AR1uEWUuLCn8BOqWShqA', 'text': "This is our DEFAULT happy hour.\nI won't be reviewing their dinner as I have never had an actual meal there.\n\nI'm not really a beer drinker, but they have such a big selection, I always find something i like. And I've been told they have a martini specials, but you don't go to a beer place and get martinis... come on.\n\nPretty much their entire appetizer selection (which is what, 20 items?) is on the half price happy hour menu. You know what that means? Four sliders and fries for FOUR dollars. (Also recommended... Hawaiian Poke Stack).\n\nIn summary, I can wrap up Yard House in two words.\nHeck. Yes.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2009-09-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ACCUr3Ydw5XyPCmoIEdnpw', 'review_id': '5VR_SjpRtyqKxMvlv2vhbw', 'text': 'The location is stupid, it is in the middle of a weird mall type place with a patio underneath an overpass. It reminded me of Las Vegas. The beer list was alright. The food was decent for the price. The hostesses were nice girls. The waiter had some beer knowledge. I still felt like I was in a weird place though. Something about it. Like a BW3, but nicer.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2009-09-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'f5CqKZlqK9Sox9z9wuooCQ', 'review_id': 'OYJwq7r2CSJ5TYceBKOTfw', 'text': "Been her several times and always found it to be good.  This time it was even better.  Glad to see they are stepping up their game a bit.  The 100+ beers on tap are always good and the wines by the glass are good enough (not great but what you would expect).  The sliders and fries are always good.  My friend ordered a spinach dip of some kind (app), he liked it very much.  Suprised he didn't swallow the plate and a piece of the bar with it.  It was busy, the bartenders were very attentive, and I will be back.  Happy hours here are good as well.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2009-10-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MWrHDYvOa5ioH7MugymVng', 'review_id': 'QIoDIuyRuXjXeemJmdAPow', 'text': 'This place rocks it! About 1 million beers on tap and yummy food. Kind of pricey, but sooo worth it.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2009-11-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1Fm7fpJq15ggZHJuYPkKRA', 'review_id': '9J16oB_rvHzu9WzBYEfMgA', 'text': "If you like a big selection of beers, both micro and major brands, than you'll like the Yard House. Located on the bottom of Fashion Square, the Yard House has great atmosphere. It looks very modern and hip which matches the surrounding fancy mall very well. It is an actual nice restaurant and not just a bar making it an appropriate place to bring children. The type of atmosphere they are aiming for, the prices and selections of food remind me a lot of a BJ's Restaurant. The portions are generous but unfortunately, the food I had didn't really impress me.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2009-11-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'NDmtjLBVvT4ICo4vRpe9Pw', 'review_id': 'qXNvXS2cLZj8tix13Jlo1g', 'text': "The wait staff was very accommodating :) My boyfriend of 4 year proposed to me here and they were willing to take the ring from him in advance, and bring it out on a nicely decorated plate with dessert! The food was delicious. I ordered the Mac N' Cheese squared, and if I was old enough I bet anything the beer would  have been great, my fiance seemed to think so. The dessert was so-so, I ordered the creme brulee and I'd prefer mine without banana's on the top, the chocolate in the bottom was awesome though.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2009-11-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'UoBfwbXaixelZBghbJ2cSg', 'review_id': 'nf2NGN0R_P1XIY2fWLKUiQ', 'text': "Four little words: Gulden Draak. On draft. FTW!\n\nBecause my SO was kind-hearted enough to come with me to Fashion Square on the Saturday after Thanksgiving DURING the ASU-U of Gay game, I thought it was only fair we make a pit stop at the YH to catch the last quarter. The 10.5% alcohol in said Gulden Draak was probably not the best thing for our rabid, violent Sun Devil fan to consume, in retrospect, but I had fun anyway, people watching on the outside patio in the gorgeous cool cloudy weather while my SO foamed at the mouth. The service was excellent and the neighboring tables' food looked and smelled quite tasty. We'll be back! No better way to recharge, mid-spending-spree (although post-cocktails drunky shopping may get you in a bit of trouble).", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2009-11-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'j4_o6f96akTjN3e8fHFj8g', 'review_id': 'PTyw5NIhc_4AL_g_WNZt7A', 'text': 'So many things went wrong when we went there yesterday.\n1. Once our server sold us on the beer samples he stopped paying any attention to our table. Yes, we get it, you LOVE the beer samples but I am pretty sure your job does not end once you convince us to try them.\n2. He forgot our sweet potato fries. Since they were not on the menu I asked if they had them, he said yes. So, it was not that he did not hear the order. Granted we all make mistakes, but there was no apology. \n3. The fries were comped... good thing too since they were the greasiest and most burnt sweet potato fries ever encountered. Oh and I must not forget, they came with a mysterious piece of something gross fried with them. YUCK!\n4. If everyone loves your tomato bisque and you even have a grilled cheese and tomato bisque menu item, you should probably make LOTS of it on December 26. You know, if you are located in a mall full of people returning their Christmas gifts..... JUST A THOUGHT\n5. So you have tons of beer on tap, but really so do other places. Lucky for the rest of us, these other places also try to have good service.\n\nWon\'t be back....Unless I have a craving for nasty fries and suspicious fried "blobs". DOUBTFUL', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 1, 'date': '2009-12-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1MXBsYJr8a2IzMT0Dp9rdQ', 'review_id': 'KZ9Dp_AQ-JptSiPPPTjkoQ', 'text': 'Very good food and great draft beer choices. I went for the halibut which turned out to be a good choice. I also had several beers to', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2010-01-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'K-CfSS-Ep56g1NmW5lz07Q', 'review_id': 'UyYganXiz_CmZ6RndUe2Ew', 'text': "Two stars are for the adorably sweet and energetic waitress.  The other missing three are for the less than sub par food. Which really bums me out, because I have experienced nothing but deliciousness at the Desert Ridge location.  The normally wonderful grilled cheese (that I had been craving all day) was nothing more than two crusty pieces of toast with some burnt cheese around the edges.  And the boyfriend's mac and cheese was a whole lot of macaroni and pretty much no cheese. However like I said the service was really good and fast too.  Yard House, I'm not giving up on you yet.  Just giving up on this location.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 2, 'date': '2010-02-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0NckJhx0qXykvvhsm-p7MA', 'review_id': 'DwKsbwtWUGQwPM-74UixfA', 'text': 'OK, I\'m trying to pay it forward to Yelp, and I am starting on a journey to enter my many reviews (all contained within my faulty and not always functioning brain/computer).  So, naturally I am starting with something I know well -- beer.  OK, fashion square and beer is an odd combo, but not so, 45 year old men have no fear hitting on 25 year old women during bowl season and offering up "box seats."  This important aspect aside, let\'s talk beer.\n\nThey have Gulden Draak and Dogfish Head 90 Minute IPA on draft most of the time.  This automatically warrants 3 stars.  Add in a great sampling of craft brews and things are good to go.  However, (yes, now I taketh away), if you have nearly 100 taps it doesn\'t mean you need to offer Coors, Coors Light, Bud, Bud Light, Miller, MGD, Duff, etc...come on!  I don\'t need to go to the 100 tap joint to get those things and why waste your taps on more than a few mainstream domestic/SAB/InBev products?  Offer em\' in the bottle and move on.  If you have 100 taps, I want to come in and say "Wow!  I\'ve never seen that on draft before!"  I know, the guy in town for the K-State bowl game needs his Coors Ice Light 64 Calorie Energy Beverage...but does he need to have it on draft? \n\nGood appetizer specials, quality, if not adventurous, food, and the staff is friendly.  That said, service can be slow sometimes, painfully slow, but always friendly and hey, if you need to chat up the cougar at the end of the bar, I get it.\n\nThat said, solid place to stop for a beer after hitting Gucci, Armani, 7, Burberry, Cartier, and Crocs (which one, or two, of these doesn\'t belong?) \n\nOr, just go for the beer and look at the map of stores you won\'t be shopping at, and enjoy the show!', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2010-02-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'md3AzhBc7tHWz7qRN2ILBA', 'review_id': 'TpvIz23RYqc6O00dkJS0Xw', 'text': 'Had a great time.  Enjoyed the tomato basil soup and grill cheese and honey blond ale.  A big plus was the great service.  Definitely  recommend', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2010-04-12', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': '-pDdkPwZK5l47O7yu5qNxA', 'review_id': 'EnAFdpGh23YQedBTFs8VhQ', 'text': "The yard house, where to start on this pretentious place.... Oh i know i will start from the bartender. OK so me and a few friends went here for a few drinks and maybe to talk to some ladies or possibly trannys my friend Sean is all into that, and i say don't knock it till u try it, anyway we sat at the bar and waited for our list of beers, when all of a sudden a man/pedofile crept out of the shadows gliding towards us as if he was wearing heelies or he was a fucking vampire!! he was very creepy and was wearing a trench coat and and a strap on, this guy was fucking creepier than Willam Defoe and it the clown combined!! I am almost 90% sure this guys is on AmberAlert.com, so he crept up to us and was like what can i get u guys...perhaps a beer, appetizer, or maybe a sacrificial virgin!! lightning struck at that very moment as my friends and i screamed like we just saw a picture of Al Roker's vagina!! we tried to keep it cool because we didn't want to end up in a dog kennel in the back of this guys van. I ordered the greatness which was Great white coastal stout and Guinness, it was pretty good but for 8 bucks it wasn't that good. My friends ordered some fucking daiquiris or some fruity shit like that cause there a bunch of pussies. We were thinking about getting another drink and the bartender rose out of the ground as if he had an elevator shoot him out of the darkest depths of hell!! I asked him what type of beer he liked and he said whatever makes an 8 year old girl pass out the fastest, i looked over at my friend and said they serve colt 45?? I ordered a Black and tan cause fuck it you cant go wrong with that...WRONG, my beer was completely flat and warm, so i asked the candy man for a new drink. he told me the beer was suppose to be flat so that way u can drink it faster, right than i knew....i had been roofied!! he winked at me and started to laugh so sadistically that the walls were crumbling and people were fleeing the bar like it was 9/11!! he pulled out a 2 foot machete and licked the blade and said....Can i get u guys any appetizers?? I said i think were just gonna get a booth, he replied ahhhh the bar is way better, u can see all the kids eating with there parents from this view, and its easy to slip roofies in the beer from here. I shook off the worlds scariest comment, and me and my friends grabbed a table. we looked at the menu for appetizers and i was gonna pass on the food, looked a little over priced. My friend ordered the coconut shrimp and my other friend ordered the spicy Asian glazed wings. When the food arrived my friend got 3 little shrimp over a pile of vegan diarrhea, for about 14 bucks. My friends wings looked pretty good, i tried one and they were alright nothing special, like my beautiful baby Tender Greens! We stuck around and tormented our waitress like the bartender taught us, we got the bill it was pretty fucking expensive for a round of drinks and 2 appetizers, but whatever my friends r rich assholes so they paid....i mean rich sweethearts ; ) as we were leaving the bartender flipped down ward from the ceiling like a vampire and said hope u guys have a .....lucky night!! we said, trembling with fear, alright cya.....he replied oh...you will.....you will and let out the loudest creepiest laugh like at the end of predator. the next day my friends went missing and the only evidence that was left of them was a comped receipt from a bartender ...who never existed!", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 2, 'date': '2010-04-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WPorw7WCw3YPVjR-2pesrQ', 'review_id': 'b24m8VyosIVJdTm_gyLQbw', 'text': 'Stopped in after doing some shopping at Fashion Place. I loved the rock n roll music. We had the bbq chicken salad and my wife had the penne chicken pasta. Food and the service was good. We would go back next time in Scottsdale', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2010-04-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qABKRj1ggJmtvrL9FMFtuA', 'review_id': 'soA1xb5ug18f0Mb_sDwaVQ', 'text': "This was another stop on our pub crawl and I only had one drink here so I don't have too much to go by for rating, but they had a nice selection and the cider realler hit the spot.  They had a nice big patio outside that accomodated a ton of us and when the birthday boy was ready to leave, the waitress tallied everything up nice and quick.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2010-05-13', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 4, 'cool': 3}, 'user_id': 'a8gpBi7biN9VAoJwKgl3Xw', 'review_id': 'duF_lCIhnKoXk_wZUdsqFw', 'text': 'I don\'t like to be a pain in the ass vegetarian, so I rarely will oppose a restaurant suggestion because of my meat-free diet. If my omnivorous friends want to go to a steak house, I always know I can- at the very least- enjoy a salad or french fries. \n\nThe Yard House was suggested for a business meeting, so I agreed, not expecting too much and just hoping their fries were good.\n\nI was pleasantly surprised by the "summer salad" option on the menu, and it did not disappoint! It was one of the most flavorful, delicious salads I\'d ever had. We also all split a desert- and the Peach and Apple cobbler is ridiculously good, too.\n\nI never had to ask for a refill of my iced tea, and our adorable server was in a really good mood. \n\nOverall, I was impressed with this place and am looking forward to coming back.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2010-05-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'h4mKrwj7m6SAm2llitAjkA', 'review_id': '6FYbtzsX4VXcV3PU83jwng', 'text': 'This place is great.  The weekend bar staff, Dana, Shawn, and Sal rock.  We always receive stellar service and the food and beer selections are outstanding.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2010-05-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qyR0lCqq1-H6q8HAyrG6bw', 'review_id': '6zIm_3NjutGScp0KuSF8VQ', 'text': 'This is the only place I can get my favorite beer on tap, Tripel Karmeliet from Belgium.  They also have a good selection of local beers and just a good variety on tap overall.  The food is very good for bar food and I can easily overeat my way through their menu, especially during happy hour.\n\nThey have a separate gluten free menu.  I do not eat diary and they are very accommodating to leaving off any items on request.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2010-06-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'ZMXfIGWKLr5cq4TIlKTQpQ', 'review_id': '1aMBxQWMQXt4mOBiHjr_LQ', 'text': 'You can read all the reviews you want on the beer selection below.  I would like to discuss the (MAC + CHEESE)2.  Holy cow, this is world-class if you like mac&cheese.  \n\nIn fact, it\'s so much better than anything else, it could be argued that its unfair to compare to regular mac & cheese.  It should have it\'s own category called "Awesomeness".  \n\nIt\'s non traditional mac noodles, which is a nice touch.  Once you read the description you should just close the menu and order up!  A la: chicken breast, applewood smoked bacon, wild mushrooms, cheddar and parmesan with campanelle pasta and white truffle oil.\n\nNo joke, it\'s the real deal Holyfield.  You can definitely taste the truffle oil, but it\'s not overbearing.  It really adds an amazing flavor.  I guarantee you a happy foodie.  It\'s a rather large portion, so feel free to get a doggy bag.  It\'s not a bad idea to do a half portion, I\'m sure it\'s not on the FDA\'s most healthy food list  ;-)\n\nSplurge on this dish.  Trust me!!', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2010-08-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'kLJsqZ3nwA3DBRd0tmBR_A', 'review_id': 'y4_I882QjixT0ZRwe6ARRQ', 'text': 'I had the worst experience at this location. I was in town on vacation and my friends from PHX suggested we go here. Our group was about 12-15 of us and it took us a while to be seated -- fine, whatever, no biggie.\n\nBut once we sit, out waiter takes FOREVER to even say hi to us, small talking with the table behind us (the only other people he was serving). So finally he comes over and before we ordered anything, I wanted to get a round of shots to start off our vacation. Six shots took TWENTY MINUTES to come -- and the bar was an arm\'s length away. So I wanted to saddle up the shots bill right away -- I was charged GRATUITY for shots. Whatever, I just won\'t tip on it and let it pass.\n\nAlso, as someone mentioned above -- all of us were carded and hassled for our out of state IDs, even though everyone in our group was over 25.\n\nThe waiter continues to take forever and becoming frustrated, I just start to go to the bar myself to get drinks. After my 2nd or 3rd round, the manager tells me I need to stop going to the bar to get my drinks and I HAVE to let the waiter serve them (they really want that gratuity). He sits down and I tell him how slow and frustrated I am with his service. He tells me he\'ll make it better, asks me what I want to drink and says "I got it."\n\nSo, you\'d think free beer on the house, right? Nope! I get a tab at the end of the night for that drink. I hand the bill to the manager and he says, "I never said it was free, I said I would GET IT FOR YOU." Oh, thanks for your great service.\n\nWill never EVER step foot in this place just because of the customer service. Food and drinks were fine, but up there with some of the worse service I\'ve had.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 1, 'date': '2010-09-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '3TGup17SCV6uHsifmTKirg', 'review_id': '22hrbzSRlMLZtcR1byrOGw', 'text': "If you love beer and bar food, you gotta love Yard House.  The beer selection (both on tap and by the bottle) is incredibly impressive, and the list of appetizers is almost as long (not really, but you get my point).\n\nI like coming here, because there are loads of flat screen TVs hanging out throughout the restaurant tuned to all the different channels you'd want to watch at a bar, I never get bored with the menu, and the service is reliable.  The service isn't outstanding, but that's okay.\n\nLast time I was here, I shared the chicken nachos and lettuce wraps with friends.  The chicken nachos were a little short on the chicken, the chips were just a little too soggy, but I'd probably still have them again because of the substantial size of the plate and the tasty guacamole.  The lettuce wraps were just right.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2010-09-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'XqMkm-DD9VsdcKx2YVGhSA', 'review_id': 'komQ2GUB960Ec77Jth_12Q', 'text': "The Yard House -- what happened to your yarders man!  You used to be cool, but now you submit to the man!  Darn you!  Anyways, Yard House has always been my favorite spot to try new beer.  I really do miss the yarders.  Now they have the footers (yah....)  It'll still get you whacked up for sure.  I like this Yard House for one thing - the nice rides parked in front.  Feel like a kid every time I walk by (Oh that's my car!)  Reverse Happy Hour at this place used to be the place to be, but with Kona Grill stealing all the attraction it's hard to compete.  However, if there's a game on; forget about it! :)  Appetizers here are the best order a few and share with your friends - (spicy wings are really spicy - youch!)  If you don't have friends to share with -- well that's why I miss the yarders :) - enjoy!", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2010-09-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uEG5uD9wMJixGWxaq34IEw', 'review_id': 'IlVdp1W19f9Od4xOwouvgg', 'text': "This restaurant/bar is conveniently located in Scottsdale Mall. I've had a lot of items on the menu and they are all pretty good. This comes off like high quality bar food, but the execution isn't quite there. They have something like a 100+ beers on tap, but nothing they have is really unique. As a beer connoisseur, it's all fairly standard stuff I've had before. A lot of flat screens for watching sports. If you are hanging around the mall and want to relax, it's a reliable place.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2010-09-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'PCiFgXlpRpkYyMISX2uajg', 'review_id': 'AkJ0fW7_QNGWSIm7PUZ7mw', 'text': "We flew in late on a Monday evening and decided to swing by Yard House for some drinks and appetizers.  There weren't a lot of folks out, so it was nice to have the bar practically to ourselves. \n\nWe kept it simple with some beer, a mojito, fried calamari, and crab cakes.  The food was not spectacular, but I suspect the venue is more about beers, sports, and a nice healthy dose of sports fan rowdiness.  I would love to see this place come alive on a Friday, Saturday, or Sunday.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2010-10-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Tq-Gr5ru4tiwF4IHmIzQYg', 'review_id': 'WBwHSz8kTA45iZoAazfcUw', 'text': 'Review: The veggie Mac and Cheese (squared) is the single best plate of food I have ever eaten in any restaurant.  End of review....', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2010-11-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Kqvfep2mxS10S50FbVDi4Q', 'review_id': 'd4r2MiGsF1Uc4OOTrsmFMw', 'text': 'I stopped in this week for lunch and sat at the bar.  Plenty of beers on tap and flat screens for watching sports.\n\nWhat made this lunch so great was the (mac+cheese)2.  This is simply the best mac and cheese dish that I have ever had!  It has chicken breast, applewood smoked bacon, wild mushrooms, cheddar and parmesan cheese with campanelle pasta and white truffle oil.\n\nI ordered the lunch portion which was more than enough for one person.\n\nGood service and reasonable prices.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2010-11-20', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 4, 'cool': 3}, 'user_id': '8cJ-n5BEb1LAR0qFM9zrxg', 'review_id': 'oo5NgoBfbo4SUOJGoZQnMg', 'text': "Much better value for your money and much better service available elsewhere, even in the hipster doofus paradise which is the Scottsdale Fashion Square.\n\nI should have known we were in trouble when I noticed an onion ring tower sitting in the kitchen area as we walked in, which subsequently disappeared when we ordered one ten minutes later. The server was very nice but overly agreeable and acted like everything we ordered was his favorite thing; I don't think he knew much about the beers or pairings. I probably could have ordered a Reichschwagger Golden Bandito which he would agree was the best beer on the menu until returning a few minutes later to inform me it's not something they carry.\n\nThe main dishes were pretty good, but didn't make up for the patchy service and disgustingly lukewarm appetizer.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 2, 'date': '2010-11-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 4, 'cool': 1}, 'user_id': 'CHnSp6logJJND0Tx86LTgA', 'review_id': 'W9cUwVdebJ4SJmLwUy8Kiw', 'text': u"One of my idols is vegan Chef and New York Times Bestselling cookbook author Tal Ronnen. Tal was recently involved in the launch of 25 new vegetarian and vegan options at The Yardhouse restaurant, which utilize Gardein (plant-based lean meat products).\nI got a text from my friend asking me if I would want to go to dinner with him and Tal, who was in town for work. I wrote him back and said that I was a big fan of Tal's and would be honored to join them for dinner. I didn't see the exact vegan options on the Yardhouse menu online, but I apparently didn't click on the right link for AZ printable menu, which shows all the available Gardein options. As I was looking over the menu, I was so impressed with the variety of menu items available-from appetizers, to salads, to burgers and entrees. Tal suggested that we order a few items, so that we could sample a variety of plates. We ordered a chopped salad, onion rings, veggie beef sliders, veggie BBQ chicken pizza (for our non-vegan friends), veggie chicken rice bowl and veggie orange peel chicken. If you are vegan and you order the veggie beef sliders, just make sure you order them dry.\nEverything I tried was super delicious and flavorful. I know that I will be back 10,000 times in the future because it is a place I can go with my non-vegan friends and not sacrifice on my vegan options.\nI found out tonight that chef for the Yardhouse in LA took over 6 months to find the perfect pickle to accompany the veggie beef sliders...guess a good pickle is hard to come by!\nIf you have an opportunity to eat at The Yardhouse, please support their vegetarian and vegan options. I can honestly say you will love them!\n\nHere are the vegetarian and vegan menu options available nationwide at The Yardhouse:\n\nVeggie Items Made With gardeinTM (gardeinTM is a chicken or beef substitute made from soy, wheat, pea proteins, vegetables and ancient grains) \n*Veggie Boneless Wings buffalo | firecracker | jerk 10.55 \n*Veggie Fried Chicken Strips fries, maple dijon & ranch 9.65 \n*Veggie Beef Sliders classic or b\xe9arnaise served with fries & pickle 10.45 (vegetarian off the menu, could ask for no sauce or cheese to make vegan)\n*Veggie Thai Chicken Noodle Salad egg noodles, grilled chicken, spicy peanut vinaigrette & broccoli-carrot-sprout-cabbage-cilantro slaw 13.85 (vegetarian-could modify to vegan possibly)\n*Veggie BBQ Chicken Salad avocado, pasilla, corn, jack, tortilla strips, tomato, pinto beans, citrus bbq, fried onions, cilantro & chipotle ranch 13.95 (vegetarian-could modify to vegan without cheese)\n*Veggie Chicken Caesar Salad grilled, breaded or blackened, hearts of romaine, parmesan crisps, croutons egg free caesar dressing 12.85 (vegetarian-could modify to vegan without parmesan crisps)\n*Veggie Spicy Thai Chicken Pizza firecracker sauce, mozzarella, macadamia nuts, carrots, green onion & cilantro 12.75 (vegetarian-could modify to vegan without cheese)\n*Veggie BBQ Chicken Pizza mozzarella, cilantro, red onion, smoked gouda & bbq sauce 12.75 (vegetarian-could modify to vegan without cheese)\n*Veggie Chicken &amp; Avocado Sandwich swiss, lettuce, tomato & mayo on poppy seed onion bun 11.65 (vegetarian)\n*Veggie Spicy Chicken Sandwich grilled with blackening spices, cheddar, jack, cabbage & cajun a\xefoli on cheese flat bread 10.95 (vegetarian-could modify to vegan without cheese)\n*Veggie Chicken Rice Bowl bok choy, baby corn, snap peas, carrots, shiitake, celery, peppers, broccoli & jasmine or brown rice 12.85 \n*Veggie Penne with Chicken crimini mushrooms, asparagus & sun-dried tomatoes tossed in marsala cream sauce, dusted with parmesan 15.95 (vegetarian-could modify to vegan without the cream sauce)\n*Veggie Chicken Enchilada Stack pasilla peppers, garlic cream, jack cheese, corn tortillas, pinto beans, tomatillo, red chili sauce & sour cream 15.85  (vegetarian-could modify to vegan without the cream or cheese)\n*Veggie Orange Peel Chicken crispy chicken breast pieces, baby corn & bok choy in spicy sweet orange glaze with jasmine or brown rice 16.85 \n*Veggie (Mac + Cheese)2 chicken breast, applewood bacon, wild mushrooms, cheddar, parmesan, campanelle pasta & truffle oil 16.25 (vegetarian...probably not easily veganized. I wish they had Teese or Diaya cheese!)\n*Veggie Burger gardeinTM substitute available on all burgers", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2010-12-04', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 4, 'cool': 4}, 'user_id': '-zzhFGw6I9wA5EtivKn89Q', 'review_id': 'U9hz_8kVFP3saLvopskZ9w', 'text': 'HOPS ON TAP AND GREAT ON APPS!\n\nWe love, love, love the Yard House!!! We are beer drinkers, and the beer selection on tap is one of the best in AZ!! The menu is great & the food is always delicious! Awesome happy hour- an extensive menu to tantalize your taste buds!', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2010-12-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'My9DUYlhgwARA-6JJ8_Y6Q', 'review_id': 'stq134SGBw4uGc2H08BwxQ', 'text': "I love this place, but if you are going to check it out I recommend going for happy hour. They have a couple hundred beers on tap which is their most attractive quality, however, if you don't go during happy hour you can end up paying $6 for a pint. If you are a beer lover like myself, and you have not been here yet, you need to stop in!", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2010-12-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Mex8qXT7nR89uTKX_qtgSA', 'review_id': 'Si-Ibb0GlSLJnbVy1Vfpew', 'text': "When we found out that the movie we wanted to see at camelview was sold out and it was another hour before the next showing, we decided to hit up yard house for a quick beer and maybe an appetizer. \n\nThere wasn't much of a crowd so we sat at the bar right away. We ordered our beers and the bartender asked for our Id's (which I don't mind) but this guy literally leaned across the bar really really close to look my wife in the eye and compare her to the photo on the ID, it was really uncomfortable. He even stated that it was fine but continued to give a suspicious look. Now I have a job where I look at Id's all day long, some people don't photo well but she looked the exact same on her id as she did sitting there. After that he demanded a credit card to start a tab, since we were in a hurry we just asked to pay for it now so that we could leave when we were finished and when we put down cash it just seemed like it wasn't good enough for him. He was just a strange man. \n\nWe also ordered the chicken tenders, and I just wasn't that impressed with it. I have had the pastrami sandwich there many times and love it, but the honey mustard tasted funky and the chicken just tasted like the oil it was fried in, almost no flavor. The food was fine though we ate it and still made our movie showing. Just the experience with the bartender made it an awkward experience.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2010-12-21', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 0}, 'user_id': 'UoBfwbXaixelZBghbJ2cSg', 'review_id': 'F85ZS5mnIAcfInmGVp6r3g', 'text': "This place has become a vegetarian's wet dream. In addition to having a killer beer selection, they have incorporated faux meats into their menu, thus veggifying over a dozen selections. I've had the fake meat in a salad, and it's very realistic - almost too much so! However, the most amazing item on the menu has nothing to do with fake meat: the grilled cheese. \n\nTO. DIE. FOR. \n\nSeriously one of the top 5 grilled cheeses. The tomatoes inside are roasted so they're sweet, warm, soft, and flavorful (as opposed to the usual sad treatment tomatoes get: simply sliced and put in the middle, cold, thus ensuring the surrounding cheese will never get hot enough to melt). The accompanying tomato soup is delicious as well. I snarfed it all down and practically licked the plate clean.\n\nThe service is always prompt and friendly also. \n\nMinus a wee fraction of a star because smoking is allowed on the patio.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2011-01-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'YK-g0g4HbI6uVegt2ac8xA', 'review_id': 'LxRoGAtwH4Ao4bVlb-5NiQ', 'text': "Food is good, but the service is always soooo slow!!  Definitly order an appetizer cuz you'll be waiting a long time for your entree. I've been there four times, and every time it takes about 30 minutes for the entree to show up.  Just don't go if you're starving cuz you'll be miserable. Also a little pricey. But great veggie options and good food and drink menu.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2011-02-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'qZrArI2ohkYkQlELl13BKQ', 'review_id': 'dDkYLGLsPlvy2tiCGYXA2w', 'text': "I like this place; I wasn't expecting the food to be good, but I was pleasantly surprised!  The service was great, and the menu was huge!  We had just missed happy hour, which was disappointing, so I had to pay the full $8.50 for a Malbec...The beer sampler looked tasty, it had six different beers in smaller glasses and came in a tray.  Next time I'm at Yard House I'm getting that. \n\nI had edamame to start and a spinach salad for my entree.  The spinach was fresh and had the perfect amount of balsamic vinegarette.  All of the components were balanced:  candied walnuts, bleu cheese, mushrooms, spinach and croutons.  It felt complete, even without a protein.  I dream of this salad.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2011-02-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'EcV7ODdSwbbRBRUsXlgiaw', 'review_id': 'vEF4IcEoKPZ6axjCu6Tj6A', 'text': "Didn't have our table ready for a bachelor party that we set up two weeks prior and then forgot to bring out all of our food. Terrible service and food wasn't great. Made me sick. Wouldn't recommend for big groups. Maybe they can handle 2-4 people. Really just ruined the night for us.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 1, 'date': '2011-03-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'czRDJwMKXhrLSt6NqWmFlA', 'review_id': 'wcuHI__ATSSuwI5VTMX9pg', 'text': u"Went for a lunch for a friend's birthday. It was my first time here and I loved it. I had the sweet potato fries which came with a maple syrup dipping sauce - amazing! I also had the thai chicken pizza - this was sooo good. Love the crunchy crust.\n\nOur waiter took very good care of us and when he noticed my Australian accent he introduced me to their server who was also Australian. It was really nice to chat with her and I appreciated that personal touch.\n\nWe also got a delicious chocolate souffl\xe9 to share for my friend's birthday. Came with a happy birthday message written on the plate in cocoa - nice touch.\n\nAll in all a great experience and delicious food. I'll be back!", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2011-03-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VPXgY9lGJF3XC4ZpusxNuA', 'review_id': 'SOy_ZqauOZwbrbzDVjlnpQ', 'text': 'The food and service are just average but this place has a great vibe and it is so much fun getting to sample items from the huge beer menu. If you are a beer lover, you will feel like a kid in a candy store. If you are lucky enough to get a knowledgeable server (hit or miss) they can even recommend combinations of beers that can make the experience even more interesting. Same concept as ordering a Black and Tan or Snakebite... but the flavors can get even more complicated if you are adventurous. Its best to go with a large group so you can all try each other\'s drinks if you really want the full tasting experience. \n\nThis place also has great options for lunch when you are at the mall and they don\'t seem to get busy until happy hour time. But for me, it can be torture to come here and not be able to drink since I am still "on the clock".', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2011-03-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'aBps9nTCyYhXaubGmfOgpA', 'review_id': 'p2ew7Tl1Noi7iXzE8wIOcA', 'text': 'I came here after I landed in Arizona and the first evening the food and drinks were wonderful as well as the service. The waiter was nice and helpful etc. Overall a good experience the first time. Then we had lunch there the next afternoon. Service was seriously horrible!! We had the rudest waiter, Brandon. He seemed as if he hated life, including his job. He never came back to check up on us. Some other guy brought us our food and he was a lot nicer and friendlier. I was tempted to ask for a switch. Anyone ever hear of a little thing called customer service??? I only gave it a two star rating solely because of that one experience but not for my overall accumulated visits there. Also I must say, I will continue to visit Yard House because it is a great establishment.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 2, 'date': '2011-03-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xuIeFhoebXnwnO41wu1UXg', 'review_id': 'rGOo2aXp4PPQ_kJiXmXxeQ', 'text': 'Best Happy Hour food bar none! (so to speak!)', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2011-03-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '8wBLBILc3TA04PFgNw2cZw', 'review_id': 'ZYx-3oxy2ElsD4d70slQqQ', 'text': "Well, I have never written a review on Yelp before but after our experience at Yard House last night, I felt it was necessary!\n\nI called 2 weeks ago to make a reservation for 16 for my fiance's birthday. I should have known things would go wrong after the conversation I had with the girl trying to make my reservation.... I told her I wanted it for Saturday March 26th at 7:30pm for 16 people. She said OK so the 27th? I said no, the 26th at 7:30 for 16 people. She was about to hang up and said OK, see you next weekend. I said no, 2 weekends from now... so I thought we got it settled.\n\nWe were driving to the restaurant and someone from our party calls to say they don't have our reservation. I should have known! I immediately called and was put on the phone with a manager. To say the least, he was a total jerk on the phone. He said he had already spoken with the person from our party who was already there and they have no record of my reservation... anywhere! So the manager says there is not much he can do. He asked who I spoke with to make the reservation but I didn't know her name and what difference would it make anyway? THEN... he asks if I was sure I made the reservation and was almost blaming it on me... great customer service!\n\nWe finally arrive and I approach the manager and show him my cell phone with the phone call I made to them 2 weeks ago to make the reservation. He finally found a place to put us outside. He said we could either sit outside or wait 3 hours... so we chose outside, better than nothing! It was pretty chilly so a girl in our party walked into the mall to get a hot coffee. She came back and the waitress told her she could not have the coffee in  the restaurant because it was from another place. The manager came over and said she needed to get rid of it. She asked if they would make an exception because our reservation got messed up and we ended up outside and she was pretty cold. He was almost asking her to leave. It was ridiculous! I understand that you can't go buy food and bring it into another restaurant... but it was a cup of coffee! And you would think after the manager was so rude to begin with, he would have just let it go.\n\nAnyway, the whole experience was kind of a disaster! If you make a reservation here, I suggest calling the day before to make sure they even have it! I usually don't get upset about mix ups because managers/staff are usually very willing to fix it but the manager was rude and he didn't really seem to care about helping or not. Thank goodness we ended up with a table.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 1, 'date': '2011-03-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'aBps9nTCyYhXaubGmfOgpA', 'review_id': 'l25mHooVj0e_SbcKao-NJA', 'text': "I added one star because I only gave it two stars solely on the 2nd experience my friend's and I had there. Thanks to the owner for a nice respectful response and the manager was pretty friendly here. The establishment is wonderful, plenty of choices of beer, a full bar as well as many many selections on the menu!", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2011-03-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'IO3AsR6cdMto7VCwfPzf2w', 'review_id': '9W6Bc3DsCEvTCJBsJAeCVg', 'text': 'I walked in and felt like a kid in a beer errr candy store. I have never seen so many beers on draft. I was salivating just looking at them all. I ordered the devil eggs as a "snack" and the crab cake sandwich for my meal. Everything was really tasty. I\'ll definitely be going back to try more of their extensive menu and try every beer they have on tap.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2011-04-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': '8wBLBILc3TA04PFgNw2cZw', 'review_id': 'E4TokQ2Zua63jefcGjwoHw', 'text': 'Well, after my terrible experience a few weeks ago, I wrote all about it and I was contacted immediately by someone from their customer relations department. I spoke with her on the phone and explained the situation and she was very kind and understanding. A few days ago, I received a Yard House gift card in the mail from her... now that is what I call customer service! I am not usually one to complain in order to get free meals but I feel that they needed to know there was a problem and she reassured me that they would work on it. So, I am sure our bad experience was a fluke (hopefully) and we will be returning to use our gift card :)', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2011-04-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'XXVfsLunIiz3xDeK17aHFQ', 'review_id': 'm39qK06tnpHAgbf5PqxmPw', 'text': "I love the vast selection of beer and the ability to taste a couple before making your decision. It also helps to have a server be knowledgable so you can pin point what type of beer you might like. I ended up getting the Leinenkugel's sunset wheat. It tasted like fruity pebbles! I found the food to be a little pricey. I would suggest to come here during happy hour. We had just missed happy hour, so we shared a small pizza and a salad and the bill came out to almost $50 with 2 beers. Also, I love the music that plays here. Overall, it's a nice fun place to eat, drink, and dance in your chair.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2011-04-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'X_kPh3nt0AJPNPHye2rTlA', 'review_id': 'lL8YBZtRGzPzMD9kFEX6XA', 'text': 'I love this place for their fantastic martinis!!!!! YAY for great tasting drinks!!!  the sweet tart, hpnotini and the gobbstopper are my favorites...they have a decent mojito too...I like to go here with my friends to catch up and get a lil tipsy!!  It is a large restaurant with lots of space and many tvs everywhere...fun little scene...they have great appetizers...I like their spianch dip and their chicken tenders!! Yum...great bar food!!!', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2011-04-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'B63qAIvH3jVUlA6ssqVSnA', 'review_id': 'BCyjKq4taZqh8mkncJRYBA', 'text': "The staff was nice and friendly but the weight time for the food was very slow. I ordered something simple, a chicken ceasar salad but the dressing seemed to contain a strong taste of vinegar. I enjoyed the music, played rock n' roll.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 2, 'date': '2011-04-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Hkx9AvnmY_aFXb_mEAS6sQ', 'review_id': '-lXdjAolB3ztoL63KWpvHA', 'text': "Last night was the cherry on top of a perfect Sunday! A friend and I stumbled into the Yard House (Glendale location) after the Kenny Chesney concert at the Jobing arena for a late night snack. \nSunday - Thursday The Yard House has a reverse happy hour from 10 - close. This was music to our ears!\n\nAfter settling into a patio table , we ordered the Hawaiian flat bread pizza and chicken lettuce wraps, both of which were half-price. Having drank all day at the Diamondbacks game, I opted out of a beer - however my friend ordered the Four Peaks peach. I think it is safe to say she like it when she was giggling 2 glasses later! The food came out in a timely manner and both the pizza and warps were to die for! 9 times out of 10 we leave with a to go container, however last night was the exception as we couldn't stop eating! Our entire bill with the pizza, chicken wraps and 2 beers was only $23 with tip! \n\nLate night snacks will now be a tradition after Coyotes games and concerts!", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2011-05-02', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 2}, 'user_id': 'hFtlFksrcLaWHGPNa6SmeA', 'review_id': 'tL0mpDxyMDb__3qCmTiOHA', 'text': "love their turkey burgers. \n\nthe service is friendly but slow. \n\nthe prices are reasonable. i really don't have much else to add except to tell you to order a turkey burger. \n\nturk turk burg! get it!", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2011-05-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'IhcTLLWKS6ZiNyIX9oQQPQ', 'review_id': 'nukR2CBtA2YIsJoT2HZ_9g', 'text': 'Great service, beer, and food.  Everything was above excellent.  I had a tuna appetizer that was delicous and fresh.  A beer that was outstanding and makes me sad that I am such a light weight when it comes to alcohol.  For dinner I had the New York Steak Salad that has everything you could want in a salad.  Our server was great and quick to clear and refill drinks.  Also, she was helpful in reccommending a malty beer that was smooth.   Great memu selection.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2011-05-07', 'type': 'review'}
{'votes': {'funny': 8, 'useful': 9, 'cool': 10}, 'user_id': 'MWt24-6bfv_OHLKhwMQ0Tw', 'review_id': 'ubWBcqhVNISBb9GSKEd_7A', 'text': "Hands down my favorite place in the Phoenix Metro area right now.\n\nThey have a really great happy hour, an extensive tap beer list, and a life changng veggie/vegan menu!\n\nI am absolutely addicted to the Gardein Veggie Buffalo Wings. Beyond amazing. The tofu lettuce wraps are delish as well.\n\nI'm really glad to see major restaurants catering to all sorts of dietary varieties versus leaving us veggies with the option of a side salad or plain pasta!\n\nChances are you will see me here at least once per week with a Dogfish Head 90 Minute IPA and two orders of the Buffalo Veggie Wings ... sometimes twice... so if you have been waiting for that perfect moment to make contact with me, well, I suggest you hang around YH each night about 530.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2011-05-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '69oFObWRSqAPFEnxwARXig', 'review_id': 'enD8pkF0D1J3UZ9pOqyLuw', 'text': 'Great happy hour eats.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2011-05-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KSTOdz0lSFCkqBSRNwjERA', 'review_id': 'AqlBax7cE6Kt-w1xeR1mKw', 'text': 'Yardhouse is one of my favorite happy hour choices. The beer selection is huge and the food option is extensive as well. Half price appetizers during happy hour and over 10 items to choose from. I always have a hard time choosing because they offer some great choices. Lettuce wraps are always a must and only $5(ish) during happy hour.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2011-05-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 3}, 'user_id': 'AeucYo8J-rZjcq09Wuqsjw', 'review_id': 'dlzMlS8mZ3BBYqs7anZSUA', 'text': 'Stopped in here for some drinks after some shopping and was SUPER impressed with the beer selection at this place! They have a HUGE selection; you are bound to find something to fall in love with here. I love going to places and being able to try a new beer that i have never had before and even better they had one of my favs that is really hard to come across...double score!!\n\ninside and outside seating, bar seating as well. Did not eat during this visit but i did look over the menu and they had a lot to choose from and some things did catch my attention.\n\ni will be back !', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2011-05-31', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'vuUddBhwlrVijAAFvK5UTg', 'review_id': 'cUo_v7wdvlx4SY9FAB--5g', 'text': 'I went to the Yard House yesterday on the hunt for Yuengling Lager (out of Pottsville, PA)... Being from the East Coast, it\'s something you miss when you move out west. See, you can\'t get Yuengling anywhere west of the Mississippi... My sister swore to god they offered it to her here before... so I called to inquire... and wouldn\'t you know? They said they had it on draft!! Why didn\'t I think to check here before? This place features 100 rotating drafts! So my wife and I did some shopping at Fashion Square, all the while I\'ve got this beer on my mind! Finally we sit down at the bar and order 2 Yuenglings! The bartender looks at me and says... "you can\'t get that beer anywhere west of the Mississippi... Did you know that\'s the oldest brewery in America?" YES I KNOW!!! \n\nNeedless to say, still a cool place!! Still a little pissed I didn\'t get my beer... but I had a different beer anyway...', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2011-05-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '5bs9-7Fwjuv4HiQNFVZTEw', 'review_id': '58UCKp4kdbAKZtjOn2ubsw', 'text': 'My favorite happy hour on the planet.  \n\nI would travel many miles to get my hands on their Spicy Tuna.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2011-06-05', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 6, 'cool': 3}, 'user_id': 'o2CGc1kQHEFkYOECM3NFdg', 'review_id': 'vvem_vtcWrTkGeX3etX46g', 'text': "I'm sort of hanging my head in shame writing this review because I'm normally very vocal and blunt about my hatred of chain restaurants. However, my heart swells with joy when I think about all the vegetarian options available at Yard House. \n\nI wish more restaurants would follow suit and use meat analogues like Gardein or Quorn. It's so refreshing to have a large selection to choose from instead of a veggie burger or portobello sandwich. I'm at a bar; I want buffalo wings, dammit!\n\nThankfully, their awesome veggie buffalo wings are on the happy hour menu. My sister and I split an order, we each got two drinks, and our bill was only $26!\n\nWhen you're organizing a large group, it's hard to find a place that will please everyone. Many of my acquaintances are fearful of ethnic food and/or independent restaurants so often I have to surrender and eat at a boring chain restaurant. Now Yard House will always be my first choice.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2011-06-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TI5k5Pvc7eWuInFB8X92lg', 'review_id': 'NsuDDriDHy4Bb42HS6ulXw', 'text': "This is a great place to enjoy a cold brew on the patio, and if you're really thirsty you can drink it by the yard. The noise level is moderate enough that you can easliy catch up with friends and hear what they're saying and you can laugh loud enough that the folks around you won't care. TV monitors are plentiful so you can always catch a glimpse of the game. \n\nYard House offers good food at a good price, with a respectible beer menu.  Bring your friends and enjoy.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2011-06-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'bDBJUBTc6aD3sVdKftjbWQ', 'review_id': 'INXJLXHiBT6akO2ZSoPbzQ', 'text': 'Let me start by saying I am not a huge beer drinker, but the selection was outstanding. I was impressed with the volume of beer choices. Having said that, two of the people in our party, who had identical cocktails, asked for them to be remade.  The waiter, probably just doing his job, said the drink would be made exactly the same way, which seemed odd to me as a guy who bar tended for over 15 years, but it got worse. The waiter asked the bartender and the bartender agreed, the drink is what it is. No attempt to fix it for either one was made. On top of that, we waited over 10 minutes for our bill at midnight on a sloooow Friday night this past weekend. Surprisingly enough when the bill did arrive, it was separated and gratuity was included on all tabs. That is a real gamble. I have never seen it done when the service was good, only when it was marginal or worse. After 15+years in the industry, I would say, maybe it was a bad night....but I am apprehensive about a return visit.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 2, 'date': '2011-06-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MtwKgPbXr71HumNRtZ7YEQ', 'review_id': 'KAubaoW1N9-Z7uJoLi6roA', 'text': 'Service was ok, food so so.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2011-06-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fksrAfKZYrhCzOjUIoFudw', 'review_id': 'FKmIS3zQtRXK8cf2t_RWWQ', 'text': "luckily i had a gift card to use!  i usually have a great experience at yardhouse but this time not so much.  i ordered a blond (beer) and it didn't come out until my food came to the table.  i ordered the hummus and wedge salad.  the bread that come with hummus was super hard so i didn't really care for it.  loved the wedge salad and ate the whole thing.  altho the restaurant was mostly empty it was super loud inside.  don't think i'll be back to this yh.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2011-07-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2xBwQjK0o_eBNuBKtybuqA', 'review_id': 'f2qJoQPanUNLROHD2D2Yew', 'text': "If you are into good beer, this is a great place.  We went for happy hour and got their biggest size (an embarrassingly large glass) for a great deal - and the beer was delicious.  The menu was extensive.\n\nIf you are into great food, this is not a great place.  We ordered 4 or so appetizers and nothing was special.  It almost felt like we were eating at an applebees.  \n\nI'd be most likely to check out another place in the mall before going to Yard house again for dinner, but now I know where to go for a truly refreshing fancy beer.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2011-07-05', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 0}, 'user_id': 'dDdinrAqDdeR-LVhAuiOyg', 'review_id': '7O8s7QRrlfZmjJ-hTCl-uQ', 'text': "This review is for 07/16/2011. After leaving the Well, I had to eat up before the Arizona Diamondbacks vs Los Angeles Dodgers game at Chase Field. On my previous visit to Scottsdale, I drove by the Fashion Square Mall a couple times, but I never got to visit. With the help of Yelp, I found the Yard House.\n\nI arrived around 12:30 to a nice part of the Fashion Square Mall. I don't know the exact location of the Yard House, but I know its around the valet service that the mall provides. The location where the Yard House felt like I was in Las Vegas, but it seemed that way. This Yard House vibe was excellent. \n\nI walked in and sat at the bar since I was alone. I was greeted by Steve and ordered a Cape Cod ($8.75 each) right of the bat. Yeah, I love my Cape Cods. Steve used Ketel One Vodka ($8.25) with Cranberry ($0.50). I can't believe they had to break the price down on my receipt. I was very hungry and I got ordered the Parmesan Crusted Chicken ($16.95). \n\nThe wait for the food was about ten minutes. It is my second time to ever be at Yard House and I am still surprised to see so many drinks served on tap, but a lot of the drinks were sold out and had to be served by can. I finished my Cape Cod and ordered another one. Too much for one day?\n\nMy food came and I, immediately, smelled the mushrooms. No, not that those mushrooms. The chicken was very crusty, but the sauce definitely complimented the crusted chicken like it was butta. Awesomely delicious. Steve had to take a break and I had a female bartender. We stroke a small conversation and Steve came back. Sorry about that....I was starting to have fun with the talk. My total came out to be $37.54.\n\nI had to go in and out fast to get ready to get to Chase Field, but with my stressful morning and celebrating at a dive bar to eating at a restaurant, half of my day came out to be just a perfect morning. Glad that this place was next to my hotel, but like an Angeleno, I drove instead of walk.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2011-07-17', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 2, 'cool': 3}, 'user_id': 'WEXsw5ads44QmglVA-t1GQ', 'review_id': 'cHzy8hbxJhqSDLPR8Kj-QQ', 'text': "Made the trip into Scottdale to visit Yardhouse Craft Beer Bar & Restaurant to see what 125 Tap Beer Handles looked like.  A mix of true craft, semi craft, pretend craft, imports & domestics.  I'll say this, there is certainly somthing for everyone.   I would like to have seen more true craft but with a selection that large there was quite a bit of beer to choose from. \n I've heard more than a few complaints that all that Brew tends to sit in the beer lines far to long before being poured/tapped & goes Flat.  Having said so, we visited on a Sunday morning hoping the busy weekend would see all those beers poured through.  We tried quite a few different brews & only found only one truly out of sorts.\nThe Belgian Sampler/ Flight was nice & the food was really quite nice.  The Sushi was oddly prepared, much like a small cake, but more than acceptable.  As their name might suggest, the Yard House had 1/2 yards of beer although I didnt see anyone drinking them. Can you drink a Belgian strong ale from one of those?\nAll In All, not a bad trip.  3 Stars, could be better with more true craft beer.\nPS. It was truly difficult not letting any Scottsdale Stereotypes invade this review. Sure there were cougars galore & 30k millionaires eveywhere the eye could see. And yes, I'm pretty sure I saw Mike Tyson!", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2011-07-26', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 3, 'cool': 3}, 'user_id': '0CY9WLYFbVJfOMV2-B88oA', 'review_id': 'HJkZXM50uwouGEgjOnMvVg', 'text': "Super, Super COOL! I walked in and saw 125 beers on tap! WOW, I think I could be there all day - pass out and make another day out of it! Not that I would ever do that, but the thought just briefly passed through my mind. \n\nThere are loads of craft beer and then some of our old favorites, so something for everyone. What I liked the most is that there are two flights of beer to choose from - the normal flight which includes several IPA's, Ales and what not - I don't care for IPA's so I skipped this one!!! But woo hoo! They had a Belgian style flight - which is my total favorite!! \n\nMy flight had Goulden Drakk - Tripel Karmelite, Frambouise and a house Belgian that is made my SILLI! Too cool! \n\nI was there with my husband and a friend of ours and we ordered a California roll and a spicy tuna roll! They are HUGE! These are not served in the traditional roll but it looked like a round layer cake! There was plenty for three people and some left over! \n\nThis was great fun! The music is always great at the Yardhouse with the great beer and food - Just a fun time waiting to happen!!! \n\nSee you soon Yardhouse!", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2011-07-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'thdVzCfKx-DV0zYWqId3pw', 'review_id': 'CKiXQPXpbaN_OzDJPZ4Y5Q', 'text': "125 beers on tap is awesome.  Not putting the prices of said beers on the menu is not.  The food is also really good, but food prices are also very high.\n\nThat aside, Yard House is a pretty cool place to grab a drink or a meal.  It's big and spread out and rarely feels as crowded as the rest of the bars in Fashion Square Mall. There's also dozens of TVs set up around the place, making it a good place to catch a game.\n\nWe had a send off for a coworker on Saturday night.  It was a big group, and the servers did a great job.  We took up a big table and three or four booths.  The solution...  They arranged a letter and number system with each of us, which allowed us to order drinks and food separately throughout the night, and it gave us a stronger guarantee that there wouldn't be a mistake on our tabs.  It was the letter of our waitresses' first name, and the order which we were served.  They wrote it down for us on piece of paper.  Even the drunkest person in the group couldn't get it wrong.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2011-08-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nkVrJzwHyLgPi07wUg_Xdw', 'review_id': 'qPnZl1OMN3Nv6ui175eK2g', 'text': '125 beers on tap and add boneless wings well you just got me coming back here for more', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2011-08-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'ziCKT5n58tcVfgksImx0VQ', 'review_id': '78hjODTE2nS2DZIbFae73w', 'text': "What can I say.........It's a good place to get beer. If you go into your dinning experience knowing that it is a chain restaurant, then you won't be disappointed. Next time I'll just stick to the beer.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2011-08-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ITQ8anChFzFdw058JYydWg', 'review_id': 'FHgTUgM8kRaeMAKk0ifzdg', 'text': 'Awesome selection of beer and food is good and consistent. Not what I would call a cozy restaurant, but service is still good. Good fish n chips to go with the beer.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2011-08-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'nyHh14Vb9S269-kGKaUelg', 'review_id': 'FrCh-o0-rdmfYklgMEFraA', 'text': "Nothing special anymore. \nYardhouse used to be a cool place to go because of all the different beer on tap. Its a nice novelty and the beer is served cold(one of my pet peeves). The food is overpriced in my opinion, but its good. \nHere is my contention: why get a steak at Yardhouse when the metropolitan grill is less than a football field away? Why get fish when Kona grill is next door? Why get a pizza when Ztejas is a short walk?\nSo, why get anything but a burger at Yardhouse? Their menu is all over the place. Jambaliya at Yardhouse? Common. \nThis is a good place to hit happy hour and grab a game. And, they do have a good happy hour with half price app's. Keep your food orders to the basics----sliders, chicken wings and such which will contain your food bill. \nService is good. At least it wasn't Johnny tackle box or Jenny etch-a-sketch serving me this time. Parking can be a hassle at Scottsdale fashion square.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2011-08-31', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': 'LvWV9PrWoqcX3WHs5O-q_Q', 'review_id': 'Mc3iVIxso-BrGjTm8H_vDg', 'text': 'I love coming here. When ever my wife says we are going to yard house I get so happy. I love all the beers on tap, and the sampler which rotates every Tuesday is a nice starting point. I get the same feeling of getting to go to chuck e cheese as a kid when I go here. \n\nI love yard house.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2011-10-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'M6oU3OBf_E6gqlfkLGlStQ', 'review_id': 'FbOMm3mAEDzcaZttwabi9g', 'text': 'Corporate blandness redeemed by many vegetarian options.\n\nWith a name like yard house and the huge beer selection one might overlook the food here on first thought as I did. I was wrangled to go here on a triple date. \n\nOn first glance at the menu I saw the usual burgers, salads and sandwiches one would expect. But I also saw a section called Gardein, which has menu faux chicken veggie items. From faux wings, rice bowls, pizzas and salads all with fake Gardein chicken. \nWE started with two orders of the Gardein wings $9.95 each. One order buffalo and one Jerk. The jerk ones were a bit bland but had a nice fried crust to them so they were satisfying. The Buffalo ones were a bit soggy from the sauce but overall a nice app.\n\nFor my main I selected the Ahi Tuna Sandwich 13.95 Seared very rare. It comes with a pencil holder of thin fries. The fries were good but a bit cool when they arrived, not the freshest. The Tuna was nicely rare and a pink color as it was not a the best sashimi grade. All together it did not work as the caramelized onions and Swiss over powered the tuna. Dismantle the sandwich, eat the tuna with soy and then the bread with the cheese, tomato, spinach alone and it works as two good mains.\n \nMy date had the Gardein rice bowl, (11.95)  the name is apt as it was mostly rice, with a generic soy based sauce, and mixed veggies. It was decent and nice it was on the menu but not gourmet, it needed some spice and less rice more vegies. \n\nI also did like the fact they had a local seasonal beer on tap (4 peaks pumpkin porter)\n\nIt was also nice they could split an app 3 ways with no issue at all. So bring in a group and paying will not be the usual headache.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2011-10-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rO3WEI9L-_deUR9-JHuNQw', 'review_id': '8lDBVWntHKCIvSAetmX_Ag', 'text': "I have been to this location and the one in Glendale so many times i cannot even begin to count everything i have ate. But i usually get the same thing every time but i have ventured out of my comfort zone plenty of times. Service is iffy sometimes its stellar sometimes its decent sometimes its just okay. I usually don't pay attention because of the fact that i am more absorbed in the family time talk aspect so they really do not have my full attention span going. \n\nAnyhow for food, i have tried the jambalaya every way except with noodles! still need to try it! Sooooo good though. I know i have tried some sort of chicken with a gravy and corn mashed potatoes i think that was awesome as well. But those were my top two. the mac and cheese squared is okay i am not a fan of all the portobello mushroom or baby bello mushrooms i just don't really care for the after taste. Now if they just gave me extra regular button mushrooms I'd be in heaven especially extra mushrooms and bacon! I have also tried their chocolate souffle for my B-day 2 years ago which was awesome!  \n\nMy boyfriend had tried a sandwich before and was not too thrilled with it. But their shoe string fries are yummy. So its just about what you order that is important i just stick to what i know is safe for the most part.\nThe ahi tar tar is bomb too. YUM.\n\nThats all i got for now until then....\n\nThis will definitely be to be continued....Stay tuned\n;)", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2011-10-05', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'e5YZvlSRknGmROE209SF3Q', 'review_id': 'trw8lD3uzoTm61wNcryOMg', 'text': 'I dont usually go to chain restaurants but my roomie was craving these veggie faux chicken wings (which i sampled and were pretty decent. I agreed to join her and must say was fairly impressed with the Lobster & Asparagus burger (natural meat, cooked perfectly medium rare). Even more so i was impressed by the attention paid to us by Emily the waitress. This nice young lady was on task! She made a great wine recommendation, subbed out the fries for steamed veggies, and what a great meal! Also picked at the fries my roomie ordered and wished i could have had a bit more restraint on them, cuz they were great, but not in my diet!', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2011-10-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jlr3OBS1_Y3Lqa-H3-FR1g', 'review_id': 'Z8ODlW6-S4DVx7AUNpmcaw', 'text': 'another great meal and half yard at the yard house.  great tunes always playing, very attentive staff and a huge menu somewhere between eclectic and funky.  always a winner in my book, but alwasy cold, bring a sweater!', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2011-10-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KJo0cru2sBJyufnGkdHgHA', 'review_id': 'yaCH-5H6BTeu3hJxXrMPZw', 'text': "Living down in Sierra vista 2 years killed me knowing that there is a few yard houses couple hundred miles north. \n\nThey have the BOMBEST onion rings than any other place I've been to! I think there batter is laced with crack. I can eat a entire tower by myself there that good. Though I wouldn't recommend it since your stomach won't like you if you start pounding down all that beer they have with it.\n\nFood there is on the high side but it's worth it. Havnt ordered anything that didn't taste like it came out of a freezer bag. You wont be disappointed. \n\nEvery time I come here I always start with there sampler pack which consists of 6 beers they choose for the month. Your bound to find something that you will like. \n\nSeriously don't come here and order a bud light or a corona. I mean really im sure there are people that just won't try anything new but really though... There will be something you will love just as much if not even better than your pre existing favorite. \n\nThere is usually a tall guy with a beard working the bar every time I come here. He has been here since it opened ad he will find something to quench your thirst :)\n\nIf your like me and have a few to many of those half yards and feel like you may have had a few to much. Dont be a dummy and drive off so the scottsdale PD can give you a DUI. Big no no! then just go walk it off in the fashion square mall.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2011-10-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'QYgcusG-G0bwUOt0b5rT6w', 'review_id': 'HsoImjeMVSF-Fqk5VSZc-Q', 'text': "Love Yard House!  The beer selection is amazing and the food is really good also.  \n\nGreat for large parties.  The server I had was awesome and not only split the checks correctly, but also split the guest of honor's check evenly among everyone else.  Make a reservation first for a large party.\n\nI like the dim lighting and atmosphere.  The only thing is it gets loud, so loud that you can't really hear the music that's playing.  But who really cares to listen to the music when you're having fun?", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2011-11-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nGvxLe5jdJGbxTYt9XjScw', 'review_id': '5o0eg-FC5roM3oMWkf3-kA', 'text': "Went here for lunch today. The service was great and the food was decent I'm on a diet so I checked yelp for some reviews. Someone recommended the mock chicken wings. So that's what I had and my sister had the soup and salad. I thought the mock chicken was good but not as good as Green. My sister said her soup and salad were fine.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2011-12-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0sqJ3h7sxqaEvqNzO2b29Q', 'review_id': 't2oxEJ9-TpkvQWS56MJVVA', 'text': 'While I have not tried the food here, I cannot comment on that. I have although tried many beers here. Excellent and numerous beer choices on tap to suit anyone. Atmosphere at this location at Fashion Square is great.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2011-12-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'hvIJcSMnz3h6LRk2sVAVXQ', 'review_id': 'vrrKjLkAjegJVAu_ZiDoJA', 'text': 'Yes I am a fan of this particular Yard House at Desert Ridge. Let me tell you why....first of all the staff is friendly and ready to help. The decor is casual with lots of large screen tvs without being over the top sports bar. There is a center bar with tables surrounding it and large booths along the walls. Seating is plentiful with outdoor seating also. The menu is extensive and has something for everyone. Along those lines, the beer selection is amazing. Try the tasting the beer sampler. We narrowed our orders down to the appetizer size of Korean Beef Taco and a Hawaiian Poke Stack to start. The taco was a small flour tortilla topped with marinated grilled beef, Asian slaw and a spicy DELICIOUS sauce. The Hawaiian Poke Stack was visually beautiful. Sushi grade Ahi cubed and sprinkled lightly with black sesame seeds topped with a layer of Asian slaw then a crispy wonton, finally slices of avocado and ANOTHER pile of ahi with a few sprouts. All this surrounded by a soy/wasabi sauce. Yes, it was fantastic. For entrees, we selected the Lunch Pairing of Margherita pizza/spicy house salad and an Ahi Crunch salad. This place knows how to do salads....Mixed greens with shredded carrots, perfectly steamed broccoli, a few crunchy wonton chips, sprouts and a wonderful spicy salad dressing. We were really impressed with the quality of the sushi grade Ahi...We also decided to try the "Eclipse" beer which was a Blue Moon Pale Ale with a float of Guinness on top. Yup, we are fans. I\'m going to try the Porcini crusted Halibut next time. Just GO!', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2011-12-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': '3gIfcQq5KxAegwCPXc83cQ', 'review_id': 'mFylVD88weiRz0eBoyfoqQ', 'text': "I found the secret (or not so secret...) thing about this place! Happy Hour! I got the rose gaarden which is framboise and hoegaarden and it is wonderful...usually 8$, during HH it is 5.25. I went here yesterday with a group of old friends and we had a good time. The service was spotty, with us waiting for long periods of time to order...so much so that although we got there at 5 and HH is over at 6 we could only order one round of drinks before it was over. Pretty lame. I had the four cheese pizza (which was half off) but it wasn't anything special. This place is a serious ripoff generally, but the HH makes it tolerable.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2011-12-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jVtBPomsJOL8Fc0Huo-e2Q', 'review_id': '57K4DDM-UCQLlTcifIg-lQ', 'text': 'Truffle fries are delicious. And free\nSamples of beer are a plus. Only downside... No pitchers', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2012-01-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1wDRzj5wwlxEvAvqMpV8eg', 'review_id': 'ftcWVHPu5u9idX1JN-n5Rg', 'text': 'I had the vodka angelhair pasta it was yummy even Carmel icecream was even better lol', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2012-01-04', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 5, 'cool': 2}, 'user_id': 'JffajLV-Dnn-eGYgdXDxFg', 'review_id': 'lrbjAXjg8gNs3cm-Oa8zqg', 'text': "I can't believe I waited this long to come here, and regret not having been in sooner.  My friend Austin went to the Yardhouse recently, and said it was good, so we went today for some lunch and what a great time we had!\n\nUpon entering, it has a really nice open feel.  Clean, well decorated, with great staff.  HUMONGOUS beer, wine and alcohol selection! OMG!  They seem to really have it all here for just about anyone!  Austin ordered a huge beer, and we split a pizza with french onion soup.  The food was tasty, and we both walked away satisfied.  What also impressed me was the staff.  We were always getting checked on by someone, weather it was a server, the manager, or the bus boy taking our plates.\n\nYard house also has a lot of TV's for your viewing pleasure.  Ample space to sit and watch, weather its at the bar, table or booth.  Open space, with lots of elbow room.  No one's sitting on top of each other.  Love it!\n\nI will be back in the future, weather its to this location or another one.  I was really happy with my time here at Yard House, and will gladly return with more friends in the future.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2012-01-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'palND-kF1qpMLhkcgAnSxA', 'review_id': 'n_8WTJB2TXv5l74JmWpBGg', 'text': 'Beer. Beer! BEER!! \n\nAs far as the eye can see. Beer.\n\nAnd football on more TVs than you can count. \n\nThe food wasn\'t too bad, I had the chopped salad and an order of sweet potato fries. The salad is pretty interesting, it\'s one of those "no lettuce" salads, it\'s loaded with corn, cilantro, celery, bacon and tomatoes with a bloody Mary vinagrette. The sweet potato fries are served with a maple bacon cream which could have been good if there was more bacon flavor and way less maple. It tasted like cupcake frosting. \n\nThe service here wasn\'t too bad, the bartenders were friendly enough but they got completely swamped at around 4 when the place started to fill. My bartender was nice but didn\'t really listen when I ordered so I got the wrong fries delivered. Easy enough mistake to fix.\n\nI wouldn\'t go out of my way to come back here, but if I\'m in the area I would definitely stop in for a quick beer before shopping at the mall.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2012-01-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'Am7_Iv-T04S80ilhhV0TQA', 'review_id': 'h6Kl0OLRZskVM-r7s39ztA', 'text': "TONS of BEER, good food, and great atmosphere.  Some say its over rated but you need to give it a shot because this place bolsters on a lot of offerings. \n\nWe started off with Lobster, Crab & Artichoke Dip which for the price was a little bit of a disappointment but had some brews.  With so much to pick from, it was difficult but I started out with the Flying Dog Pale, good finish, then kilt lifter** get it!\n\nI have found the food to always be good, I have been there when they have actually ran out of things particularly because their menu is a decent size.  Since I have been there a couple times I really have to take down a star because the service is so unpredictable.\n\nThen the meal came, I got the Jerk Chicken & Shrimp Stack...you guys need to try this.  So much flavor with the peppers and the red chili sauce had a bit of a kick to it.  I fully enjoyed this.\n\nNote:  From around 3-6 every day, they have a pretty sweet Happy Hour. With $3.25 pints you can't go wrong with their over 200 types of beer.  To follow that brew they have half priced appetizers.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2012-01-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1RbwYDIbu2D6pNZ_6ykQew', 'review_id': 'LR8kaSzMBUFEQ7oGCiBECg', 'text': "On beer alone they get 4 stars - 4.5 even! Wonderful selection with half yards available. Service was good. Didn't have to wait too long for food. Got a pizza and it was solid. It is odd being inside the mall but oh well.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2012-02-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '2FtCOwNwd6UsBgScSc1_Ug', 'review_id': 'x9T-8V-I6szISMxt1pz-Ng', 'text': "The Yard House is my go to spot in the afternoon--not because they have super awesome food, but simply because they meet my particular lunchtime criteria:\n- prompt service\n- broad lunch selection, that include edible salads\n- skinny margaritas\n- booth seating in a dark corner (so I can read my smutty novels in peace)\n\nIf you have the same set of requirements as above--Huzzah! Yard House is the place for you!  If you just want to sit around and drink beer--Yay! You are still in the right spot.  If you want really great cuisine?  Hmm, Maybe you might try another restaurant... not that Yard House is bad (it isn't).  It is just more of a socializing place than a place to really sit and enjoy the food.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2012-02-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dW7dXceuBcQ2UgNbEmAiZQ', 'review_id': 'zhBLYy3c6MXyKyBZcR-hNg', 'text': 'While visiting Fashion Square Mall, my friend suggested we splurge and have a nice dinner. After looking at the menu, we decided to try it.\n\nI enjoyed the Mac + Cheese- which was a large portion of  chicken breast, applewood bacon, wild mushrooms, cheddar, parmesan, campanelle pasta & truffle oil. It was truly delicious and I enjoyed every bite of it. I paid extra for a ceasar salad that was nothing special, but still good.\n\nMy friend enjoyed the  Rib Eye (12oz) with garlic mashed potatoes, green beans & shallot butter. She stated it was the best steak that she had ever had. She also paid extra for a salad, and felt the same about her salad, but she also asked for extra ranch dressing, which never arrived.\n\nMy friend  also enjoyed a bikini martini that I had a taste of. It was just lovely but due to the prices of the drinks, opted to not have one. \nThe prices were kind of high to us, and our server didnt really give us warm fuzzy feelings, and at times we felt sort of rushed to complete our meal.\n\nI think perhaps as a special occasion I would go again, perhaps not. \nBut it was definitely worth a try and the menu is diverse enough to have something cheaper.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2012-02-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'Rc83ZTD6YhtdJgHSmaTlfw', 'review_id': 'N2LlEAHlo7-MN3hnF8s6Fg', 'text': "If you are a lover of good beer or a vegetarian, this is THE spot....\n\nI've been coming here for years with my baseball buddies, and it just gets better and better... \n\nOur group of 20 stormed the place starting at happy hour... amazing prices on craft & unusual import beer! While they have the usual bar apps, you really have to try the unusual such as the portabello lettuce wraps...Hawaiian Poke Stack & the Garlic noodles! \n\nUnlike most chains, they have a full vegetarian menu that covers apps, main courses & salads. They use a vegetable protein mix that truly does mimic the taste & feel of chicken and beef. All the taste, none of the moo, oink or cluck!\n\nService: Most chains it's hit or miss... with our huge party, the bartenders were awesome! Smiling, helping us choose our beer... a nice surprise. The wait staff after we sat down were just awesome! \n\nIn a nutshell, there's something for everyone here... and you won't go broke in the process!", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2012-03-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9xgwk-4c9JA66moxMk0AMw', 'review_id': 'xs6HIBAxnuaArEHmC1LZUw', 'text': "Service is okay and the beer selection is cool as well.\n\nThe food is meh. I have tried a few different items, but will stick with liquid meals at this establishment haha.\n\nThe service is so-so as well. It's slow and they can be rude.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2012-03-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'BWodVnFbZE04oFc5fKsykA', 'review_id': '5se2uskEiSvk0Rpqvebp2w', 'text': "It was one hot afternoon, the boyfriend wanted to take me check out how Scottsdale was and so he did. We happen to come across Yard house in the mall. The patio was sort of outside of where cars were getting valet parking. Might be a bit noisy for others but hey, not bad to check out fancy cars. :) After a long walk, we decided to come here for the happy hour and man was it worth it. We started it off with two half yards, one ECLIPSE (Blue Moon & Guinness) and one Guinness. We thought we weren't going to finish it but it made us feel hungry so we got some appetizers on their happy hour menu. The  Hawaiian Poke Stack was yummy, that is if you can eat raw sushi. It looks like a burger but they stack it with poke and use fried won-ton strips to separate the poke, avocados and ginger. I think they mixed the poke with some soy sauce and sesame oil. It was good. Then we got Seared Ahi Sashimi. (yes, we are into our sushi rawness) Small portion, theres maybe about 5 slices at most, and some greens on the side. Not bad. I think it is only worth it for happy hour price. \n\nAppettizers happy hour price\n- Seared Ahi Sashimi (reg: $11.95) $5.95\n- Hawaiian Poke Stack (reg: $12.95) - $6.50\n\nDrinks  Happy Hour (half yards) -$7-$10\n-  ECLIPSE (Blue Moon & Guinness)\n- Guinness\n\nCheck out the website. http://www.yardhouse.com/happyhour/Default.aspx\n\ncourse I would go to yard house again, for the happy hour :)", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2012-04-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'yWBwbPCOy8eBD1wWSH6s_A', 'review_id': 'RTrMrd4Ea7TjmmnAMzbXpA', 'text': 'hands down one of my favorite places to eat. Beer selection is probably the best with over 100 beers on tap and there food is awesome. Ive had there burgers which are awesome as well as there NY steak sandwich also there mac and cheese is to die for.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2012-04-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'aTi0NVrcPJWbN6jAsJVcAw', 'review_id': 'eGkrnHeZofryTtANjFnmLQ', 'text': "The Yard House is a nice sports bar, but you don't need to be dressed to the nines to eat here. The menu is quite varied, and I've never had anything I didn't like. My favorite is the Penne with Chicken and the Mac 'n' Cheese dish -- both are fabulous. \n\nNumerous flat-screen TVs abound, inside and out -- sit inside or out on the patio. The bar looks cool, though I haven't sat there. \n\nIf you're shopping at Scottsdale Fashion Square, this is one of the better places to grab a bite.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2012-04-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'DuwTSY4hS03iHS_UuBW3_w', 'review_id': 'QjJH28v95FgymaQovY7uFQ', 'text': "Great and friendly bartender. Just like hawaii's yardhouse with all the choices. We didn't get any food, so I can't rate it.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2012-05-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'pUYD89iodWvkQwcEpeacMA', 'review_id': 'QtEAFaZFtvCrpvGyIfuI8w', 'text': "It's the yardhouse...Hello BEER! Yummy. My husband and I sat down for a beer after going through that huge mall. We love the beer selection however still have to try the food sometime.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2012-05-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LdhwY7eudLlx1KFQQe9GwA', 'review_id': 'nGogJpKg97jnMC_CqhdLWQ', 'text': "Edit: I'm a terrible person, this update took way too long. A manager reached out to me and made the situation right. I've been back a couple times since and had good experiences. I do love beer, so it's hard to not love Yard House. \n\n-\n\nIt's overall a meh experience. Service can be good or poor, food is OK, happy hour pricing is pretty good. The selection of draught beer is really impressive, and worth coming for alone. \n\nIt's a typical sports bar/grill type setup, large bar in the middle of the space, lots of TVs. It's a fine place to catch a game, but you'll have better luck with food, service and price at a few other places around town.\n\nLast time I was here for HH, we had a table of probably 12 people, with napkin setups for about 9 people. Someone who looked like a manager walked by and asked if everything was going well. I asked for a few napkins for the people at the table that didn't have any (including myself). He walked away and brought back 7-8 tiny cocktail napkins. That was weird, not to mention unhelpful, and a pretty good way for me to sum up my experience there.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2012-05-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'NXCG7EJEY76LiVqhTz64og', 'review_id': 'lLiLTOB8a8KQwbnhT9SbRg', 'text': "Decided to try this place with a girlfriend and have some dinner and drinks. I've heard a lot about the place and I work really close to it, although I didn't know exactly where it was. \nIt is really confusing getting there when looking at GPS. You kind of already have to know where this place is to go there. Whichever, we found it. \nI had the spicy chicken breast sandwich. It was really good. My french fries were cold when they came out. A bit disappointing for how pricey a sandwich is. I told my server and he ran straight back and got me some hot fries. My girlfriend had the chicken tortilla soup. I tried a bite. Oh, the flavors in this were amazing. So good. She also had an asada street taco. Smallest taco with the biggest price! It was too spicy for her until she took the peppers off. But otherwise, she thought it was pretty tasty. \nThe beer, oh the beer. I love beer. The beer menu and the beers on tap is the amazing part of this place. Over 130 beers on tap! Love it. I was feeling fruity so I tried a Four Peaks Arizona Peach and a Sea Dog Bluepaw Wild Bluberry. Both were very good. My girlfriend got a House Honey Blonde and a House Belgian Amber Tripel. Both of those were delicious as well. That is the best part of this place. \nThey did have sports going on, but I'm not into basketball, so that didn't do it for me at the moment. Maybe if it was some hockey going, I would have been into staying longer. \nThe service was excellent. Our server was always there asking if we needed anything else. Totally on top of it. \nToo highly priced. A sandwich and 2 beers for over $30 with tip is too rich for my blood. I'm sure I will visit again. It was a pleasant experience. Great beers, good food and great service, just way too expensive.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2012-05-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'muU7S-YE8D3FM5KgxOtFCw', 'review_id': '23idU7gcCrSZbHG2X7JZxw', 'text': 'Everything was yum here. Server was attentive even with a heavy crowd. \nWoodchuck was on tap. We splurged here in an over eating extravaganza.\nWorth mentioning: Artichoke was hot when I requested it out quick. Now you think this would be the norm, its not. Usually everywhere ends up waiting til its cold to serve you the artichoke at least luke warm. \nWe also had the mac and cheese (squared?) vegetarian style and it was really good!  Truffle fries: YES. Calamari was a hit, and my darling date enjoyed gardein chicken strips. \nMy daughter (18mo) enjoyed her grilled cheese, fries and a cherry lemonade. \nThe whole mean was yum. Glasses stayed filled. \nWe will be back...', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2012-05-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'asc8g0z1Pank5y-l1TX2bA', 'review_id': 'KRSnU1NvMF0zfHcNOTbdzA', 'text': 'Yardhouse has an over the top beer selection. I love Purple Haze and have yet to find it anywhere aside from Sprouts or Sunflower m,arket. well here they have it on tap! I was extatic! I have only gone for lunch, the hummus is to die for and the sweet potato fries are delic. The first time i went i got the bbq burger, i was not a fan, but the beers and appetizers made me come back for more. My second time i got the crispy ahi tuna salad. The dressing was greak the fish tasted as fresh as it can in arizona. The service is great my sister fell hard on a wet floor and we got our meal free and they did everything to make sure she was okay and didnt need to go to the hospital. The only reason they aren\'t getting a 5-star is that when you sit on the patio you get less attention and the servers do have a kind of "do not want to be here" attitude. Love it though and will go back.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2012-06-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GKdYT2Qr7BsqZNrL-pjXCg', 'review_id': 'ThOT5P38tchh3utD7uNiiw', 'text': 'Went to Yard House 7 July 2012 for a bite.  I ordered the Hawaiian  First I must say the service was great...There was nothing wrong with the service. Totally available, even ahead of what you needed.  The food was the problem.  The Hawaiian was ok I have tasted a lot of better burgers even Carl\'s Jr\'s Hawaiian is better.  It really didn\'t seem like a "Real burger"  I only ate only 1/2 my burger.  when I reheated my left overs at home.  I notice one thing I hope nobody goes through.  the hamburger had some type of filler in it. (when you heat up a burger it stays together not fall apart into pieces)  This burger feel completely apart it was very odd. When eating a hamburger I expect there to be more meat than filler and for it to stay together not fall apart.   This was my first time visiting the Yard House.  I may try it again but I will NOT order any hamburgers if this is how they make them.\n\n********I have to change the rating from a 2 to a 4 because a Yard House got a hold of me and was interested in my story.  I was going back to work,   things were crazy to say the least and then I moved out of state.   They listened to my concerns and wanted to make a change my impression about them and they did a great job.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2012-07-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'YrBun_Gx0wt3bTRCUNEH4A', 'review_id': 'hpOVCXav4pkxde44Vaoj7w', 'text': "I've come here a handful of times for Happy Hour and boy am I happy when I eat here.\n\nFirst off , the selection of beer is magnanimous. I don't know too much about beer, but when I see a menu of 10 pages devoted strictly for beer...legit is all I must say. Very tasty beer, and a +1 for having my fav beer, Guinness, in stock.\n\nThe HH menu is also very large. Some of my favorites are the wings, sliders (turkey, kobe beef, classic), and nachos. Tasty.\n\nDefinitely my go to spot when it comes to HH.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2012-08-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'v26k4Bzy9GiLLlSmDk8LfA', 'review_id': 'm5nOJxK8lDBRvlfWuQCfGg', 'text': 'Food is always good. Amazing happy hour 1/2 price apps.  Try a BBQ pizza here. Hamburgers are really good.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2012-09-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FevBcg69uao1b4CSW-PKBw', 'review_id': 'VoNtNOQE5PLhWeZopk3ETA', 'text': 'Wide beer selection, but not a lot of rare/unique ones. Good food, but overpriced. No sound for NFL games was kind of a bummer.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2012-09-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GvubN02IRi0Yy7h_QRe9OA', 'review_id': '0-esa8LMACANlBY3mIRyFw', 'text': 'I have never been to the Yard House. I liked the outdoor patio. Our server was so great. And the grilled cheese was perfect.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2012-10-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dRfuAF1X90yB-B8jTaqutg', 'review_id': 'sFWqjsL23L7D9E4k0lfkxQ', 'text': 'Over 100 beers on tap, food menu is surprisingly good for a place I typically associate only with beer.  Can do large groups.  \n32-oz half-yard glasses are a fun way to potentially pour beer all over yourself.\n\nCount on spending at least $30/person after tax/tip...', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2012-11-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kBaItLrRUKJ6_K5xzNo7_w', 'review_id': 'xvq9wzD5JvGw8GMon5S3eA', 'text': 'This place used to be in our regular rotation with our visiting it weekly. Over the past year, service is sometimes spotty and we have been going less frequently. Food is usually pretty good although there is no excuse for well done burgers or cold fries.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2012-12-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'm6KZZskPLpCnFoRl2iA1tA', 'review_id': 'mQKvma4vlufvU-5uNOEQFQ', 'text': "I have lived in the Phoenix area since 1977 and have tried restaurants all over the state. If you are looking for the best Chicken Tortilla soup EVER, you need to go to the Yard House. I always go to the location at Scottsdale Fashions Square - usually to meet family & friends before a great shoppping excursion. We make a point to have lunch here. I absolutley LOVE the Chicken Tortilla soup! I always order a cup of soup and a small salad and I'm never disappointed. The soup has HUGE chunks of chicken in a lightly spicy & creamy sauce that will keep you coming back. I love that they top the soup with chunks of avacado, tortilla chips and cheese.I guess I really don't need the salad because the soup is so filling, but I have to get my greens! The service has always been great.\n\nMy friends and family have tried other dishes as well and have always had a favorable review. They have many alcoholic beverage choices and something to please everybody. I would higly recommend theYardhouse!", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2012-12-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1qEWNA1otqI-0vW9BJ41_Q', 'review_id': 'kZWIH9exrXelPhW8C2eQ4A', 'text': "i don't know if it's because i've been to the original yard house and it was so good... but, i was kind of disappointed with the quality of food here.\n\ntruffle fries were not hot & crispy. they were at the point where they were like cardboard. the pizza i ordered was alright. just didn't taste as flavorful as i expected it to be.\n\nwill give another try, but probably won't go out of my way to come here.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2012-12-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'YPjsunOnEjMgMGPSHlUfxw', 'review_id': 'PoqI_V1h7u-gyW5eDbPJLg', 'text': 'Don\'t quit smoking!!! Apparently you can\'t inhale water vapor approved by the FDA at 10:30pm on a Friday because the "old people are offended" I was just told. They rather have you smoke cigarettes and die of lung cancer. So if you just quit smoking this is not the place for you. \n\nPS- I am not seeing any "old people" as the bar staff just referred to. And I think that is actually discrimination. Just leaving with Bob Ueker and Mark Grace. And we will not be back. Back to Don and Charlie\'s!!', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 1, 'date': '2013-01-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'llu0xnAghOiQ1y22J-tK1g', 'review_id': 'ogcIvfMJhswwm0l2Uz-PtA', 'text': 'I enjoy coming here for a nice night of casual drinks and light dinner. They have a great food selection on the menu as well as a great variety of drinks!! It is a long way to drive from me so my friends and I try to meet up once every couple of months and it is always spot on.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2013-01-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KlLDE4egzf9VruPheiXHMA', 'review_id': '13thNV-16f4uvC0wSfGi0w', 'text': 'Beers!!! Holy cow what a selection. Had a Thai chicken pizza and a couple great beers to wash it down. Told the bar tender the things I liked in beer and brought great selections. I might go back tomorrow......', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2013-01-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'RPiQJttbDKHic3hITLJEpg', 'review_id': 'V0PRyYYkTGksJanTPNEX4w', 'text': 'Great choice of food for omnivores, vegetarians, and vegans!  Even better choice of beers!', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2013-01-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'b2DKC4kC8-QeSeGZ_MF3XQ', 'review_id': '8o25f5c9FFEbads1fQGaHg', 'text': "CORPORATE!!!  If you don't mind a cookie cutter stale place with zero personality or charm than the Yardhouse is a good place.  However if you want something with personality and charm go elsewhere. Food is sterotypical california cuisuine.  Lots of beers on tap, a lot of mediocre beers but a few good craft beers to satisfy craft beer junkies like myself. Servers are ok but no very little about the beers.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2013-02-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'e3qI6CxuifnsdqX2l-pySA', 'review_id': 'YTxQfnfqyAAA27urYKefbg', 'text': 'Enjoyed Happy Hour the other evening while engaging in a short business meeting. We really had excellent service (Sal was our bartender) and excellent food. The Ahi Wontons and BBQ chicken pizza will definitely be a re-order on our next visit. Very large bar area, but we felt very comfortable and were well taken care of. Our waiter and bartender were genuinely interested in our food choices and were very knowledgeable of the menu. We will return and bring friends!', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2013-02-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'rotKO3R8h23YbiLFaZ-BLg', 'review_id': 'o2-AI-xqtnIaUXgIfK5yLg', 'text': 'This place is great!\nTheir Happy Hour is great (regular and late-night), they have great drinks, great food (I love the Summer Salad, not to mention their HUGE sandwiches/burgers), and great service.  \n\nPlus there are a ton of seats so you rarely have to wait too long for a table.\n\nENJOY!', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2013-02-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'sQtKdlC52pKSmJScX-rZPw', 'review_id': 'ivpUUjB7bYCAIzloS1yCiQ', 'text': 'Only thing here good is the beer. Food was bland and service sucked.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 2, 'date': '2013-03-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'DQURv5CKj7iRdiXyS_Eikw', 'review_id': 'tTzOr7g33XeBP2OLjXqurQ', 'text': 'Their food is ALWAYS great, and has never been disappointing by any means. Their menu has so many options, you could eat there very frequently and not eat the same thing twice. Their extensive beer selection is unmatched.  Service has always been both professional and accomodating. The atmosphere rocks and they usually have great music on. The Yardhouse makes it easy to take my picky mom out for lunch!', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2013-03-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'smHUxTd3Y0kxCxgnRSu5Mw', 'review_id': 'WhaSthk2hTd13WQFfePHzw', 'text': "Ask to seat 8 it takes 15 min in an empty restaurant.  Ask for 6 IPA's. wait 5 min for them to tell us they are out but no worries we have all the other beers we ordered.  10 min later come back with 5 IPA's and tell us the other beer is out too.  Just ridiculous...  Yardhouse should be ashamed, I used to book my sales team into the Irvine Spectrum one for fun but they just lost that business too.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 1, 'date': '2013-03-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'VqSCQCva71Q-ZVcMsYfQuw', 'review_id': 'ZM0X0lBGXRBNZPJ2igPvqg', 'text': "The YardHouse chain of restaurants are generally consistent in terms of food and service. This location is a little unique in that it's located in a very high end mall. The location isn't as large as the Costa Mesa location, but seems larger than many. Service is pretty good if they are busy. If the are not busy, they somehow have really slow, inattentive service. \n\nNot bad, but there's fierce competition for $$ in this area and this is an average experience.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2013-03-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VZSt8Sj6maMnNl5epDD7_A', 'review_id': 'IDU-ysmRy6hNEc6sL1rhnQ', 'text': 'Great Beer Selection and Spicy Tuna Roll!', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2013-03-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'q3Fa0PhTGzRl-05fXHIi4g', 'review_id': 'BN0N46YQu8ohziTiXpjUcA', 'text': 'I want to give this place a 1 star rating but my food was actually pretty good.  The service on the other hand was a COMPLETELY different story.  A couple girl friends and I decided to meet up for dinner on a Wednesday night after work.  When we got here it wasn\'t slammed but it was definitely busier than we expected.  Since it was nice outside we wanted a table on the patio and were told it would be a 5-10 minute wait but that we could sit at the bar with a buzzer in the meantime.  The hostess was friendly and helpful.\n\nWe get to the bar and make our drink orders right away.  When they were brought out the bartender asked if we wanted to keep a tab or pay as we went.  My friend explained that we were going to be moving outside once a table became available and wanted to know if the tab could be transferred over once we did.  He snapped back that we could do it either way, it was up to us but that it would take longer if we transferred it.  Now let me just say that I know reading that line doesn\'t seem especially rude, but the tone he used was extremely impatient and condescending.  We decided to just pay as we went since it seemed to be such an inconvenience to do anything else.\n\nAnother thing that apparently bothered him was one of my friends commented that she thought the beer she ordered was supposed to be darker, which she didn\'t even say to him, she was just commenting on it.  So he grabs a shot glass, pours the beer into it in front of her, slams it down and says, "See?  That\'s just what it looks like!"  At this point we were all looking at each other like "What is wrong with this guy?"\n\nLuckily the hostess came over right at that point to let us know our table was ready.  When our waitress came over we already knew what we wanted since we\'d been browsing the menus while we waited so we got that out of the way quickly.  We also all got glasses of water.  Our food came out after a reasonable amount of time for how busy they were and as I stated above it was all good.  I got the Chicken Tortilla Soup which was nice and thick, had large chunks of chicken in it and was all around a great combination of flavors.  Unfortunately  after our food was brought out we didn\'t see our waitress again for probably 20 minutes.  So we were all sitting around with empty water glasses until she brought our check out.  We were not happy campers.  So while I did enjoy the food I don\'t think I\'ll be returning with the prospect of receiving this kind of service again.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 2, 'date': '2013-03-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'xf_jvJzWWOxv2DdKvP7Ubw', 'review_id': 'Km7Ai9BaLotRzY3cozrPYA', 'text': "Food is good for the most part. Service not bad. Lots and lots of different beers.\nNow let's get to the stupid part of this place. Grab a seat at the bar, order a little food and a beer. They ask that you pay first. They won't do this if you sit in a booth or at a table. But in a hardly-anyone-there-at-ten-on-a-Saturday-night:  hand over a credit card or pre-pay? Nobody. I mean nobody in Scottsdale that even resembles a classy place does this. I'm not talking about The Mint crazy bar scene where it is reasonable to ask for the plastic to start a drink tab. Not even Denny's asks for cash first before food delivery. Idiotic.\nAlso, lots of TVs but don't get too caught up in one thing because they like their soccer in there and they will change the channels without warning. The good sport you might be watching can easily turn into mostly bright green pixels with shirtless and  knee-grabbing Euros trying to score what would be about the third goal ever successfully made in the history of that sport.\nWant a great sports bar, one mile away? Go to Zipps on Camelback. Down to earth, friendly, great food and easily 2/3 the price of the Out House.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 2, 'date': '2013-03-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '7nZ7LSMxPqr1zeps6HPi8g', 'review_id': 'BfP8ukv9A1bqKavQcWc_yA', 'text': 'I would like to start off by saying I am only giving this two stars instead of one just because they have a large selection of beers.  However, it is the worst food and service I have had living in Arizona for 4 years now.  The first time I went it took 10 minutes for someone to even take our order and the food was mediocre.  I decided to give it a second chance thinking maybe this was a one time thing.  The second time it took 15 minutes to get someone to take just our drink order and then it took them 3 times to even get that straight.  The person who took our order ended up handing off the table and that person brought the wrong drinks three times after we repeated our order to him every time.  We did mention this to a manager that came by but he seemed unfazed.  After we finally got our drink order we decided to order 2 spinach dips.  One came partially cold.  After all of this had happened we wanted the check which also took another 15 minutes after telling our waiter.  Honestly do not come here! Culinary dropout has the same sort of casual menu and good beer.  There is no need to waste your time here.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 2, 'date': '2013-03-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'hmGr2cM8jQ8SbRvkdk9vJA', 'review_id': 'sdpsYlabJ-W_nQUdfg1RGA', 'text': "My friends and I eat out a lot so saying this was the worst dining experience I've ever had is really saying something. The evening starts out with me washing my hands before we are seated in a vomit filled sink. When my friend went to the bathroom about an hour later the sink was still filled with vomit. When the bartender was informed of sink vomit he chose to stare daggers at my friend as he walked away and then stand there staring out our table as if we had thrown up in his sink at his studio apartment. Obviously the staring became disrespectful and management became involved. The bartender told the manager that we were shouting obscenities at other patrons which was totally false. There were maybe 5 other tables with people seated at them, it was a very dead night. We had no interaction with anyone but staff. Juan our waiter was great he did his best to smooth the situation out but obviously it was time to leave. We all paid cash and one of my friends handed the bill to the manager personally. We left but felt we had been treated unfairly. One of my party called the restaurant to speak to whomever was running the show to complain. She took down his info and then informed him that we had skipped out on our bill and that they would be following up on this!! Not only did we not skip out on our bill but we had left a generous tip for Juan because as I had said he was very nice. Long story short if you like vomit, bartenders that will stare you down for no reason and then lie about you, management that will steal your money and threaten legal action for something you didn't do then go to the yard house in Scottsdale. Also the food is nothing to write home about.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 1, 'date': '2013-04-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ki71iAFTxsPPQfX430c99Q', 'review_id': 'gPfFK6giMQtzppDkN0l-Fw', 'text': 'One of my favorite places to go for reverse happy hour! They have good food (ahi poke, wings, sliders) for a great price and a LOT of beer on tap.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2013-04-10', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 0}, 'user_id': '2KNPtV5E44vAiEr5BvMkUA', 'review_id': 'itBgBYq0RkDx88-U7OVeoQ', 'text': "*sigh* What happened to you guys? =( I'm so bummed out right now, I used to adore this spot. Great service, yummy drinks, tasty food and lots of choices...ugh, now a thing of the past I guess.\n\nOur office ordered Yard House through Delicious Deliveries for our sales meeting and it was absolutely awful. I ordered the mac & cheese and if I didn't know any better, I would say that the food was cooked last week.  It wasn't even on par with next-day leftovers. The noodles were weirdly chewy, the smell was uninviting (how do you make garlic smell bad??!), I don't think there was any cheese, the bacon was squishy, there was some large grey-toned pieces in it and I'm still not sure if it was meat or if it was some weird looking mushroom thingy. If I didn't know any better, I would think that this was some sort of prank, but I don't see Ashton Kutcher anywhere and we are two weeks past the statute of limitations on pulling an April Fool's goof. \n\nNot impressed and not ordering it again.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 2, 'date': '2013-04-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ICzHFtcUQlK9mcDF0U_tAA', 'review_id': 'ZtTMI_-q8BbPZomiQN82aQ', 'text': "Meh.  Sports bar.  Worse, a sports bar chain.  The outdoor patio was more attracitve, even if was part of the mall's covered car park.  I don't tolerate the smell of stale beer.  That's what greeted me at the inside podium.  There's bar food on the menu, of course.  Fried next to more fried stuff.  Come here after work and throw down some beers.  That would be fun.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 2, 'date': '2013-04-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '16djaKDikBivsWVKtYTchA', 'review_id': 'JnFfacsdMymUng-N5p-KHg', 'text': 'I sit at the bar so service is fast and the bartenders are friendly sometimes even funny. ;)', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2013-04-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'y8ZCNq8HSGDSx7Vm-NYEOw', 'review_id': 'qVoBWRzVl-JmugSeiOlCJw', 'text': "I'm a fan of the Yard House in any city we visit. The upscale beer bar boasts more taps than most and unique to the local you are in. \n\nAlthough they have the usual suspects, each city adds more local brews. So if you can't work your way around the area's brewing companies, you can sample a couple there. For that alone, I remain a fan.\n\nThis time, we weren't very hungry so decided to ordered the grilled cheese and tomato soup combo. Truly a nice looking and upscale version of the comfort food favorite.\n\nI'm a fan of Yard house and you really need to sit at the bar, for the full experience - so many beers on tap, so few hours in the day...", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2013-04-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'q3Fa0PhTGzRl-05fXHIi4g', 'review_id': 'pmCNse4PLeh3XEq6OsLQVw', 'text': "I decided to give this place another try so when the bestie suggested meeting up for dinner I figured this would be the perfect time since she works right down the road.  We were greeted right away when we walked in and the hostess was able to seat us without any wait.  Our server then came over right away to see if we needed any drinks but he literally came over so quickly we hadn't had time to look over the menu so we just got waters to start.  Once I'd glanced over the menu I decided to go with the Sweet Tart Martini which was a concoction of raspberry vodka, sour apple pucker and tropical punch.  It's hard to go wrong with a mix like that.\n\nFor our meal we both decided that burgers sounded good so BFF got the Pepper Crusted Gorgonzola burger and I got the BBQ Bacon burger.  Right after we ordered my martini showed up in all it's turquoise colored glory.  First sip and I was in love.  This thing literally tasted like a sweet tart candy but with alcohol!  Somehow I managed to keep my composure and sip it like a lady rather than chugging the thing like I wanted to.\n\nThere was a little bit of a wait for our burgers but it wasn't too bad and we had a good conversation going anyway.  Once they did arrive I was pleased to see that my burger was actually cooked medium-rare as ordered.  I know I mention this a lot in my reviews but a lot of places don't get this right and I like my meat bloody in the middle so it makes me happy when a restaurant can accommodate me with that request.  I was in love with the garlic aioli that came on the side as well!  I was dipping my burger AND fries into that creamy goodness.  All in all I think Yardhouse definitely redeemed itself after my last visit.  The service was MUCH improved and the food was great as expected.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2013-05-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ag3x9Tz1Kc1FTxdtkxgL2Q', 'review_id': '82kggT7nIWPHy8fyoqRzkQ', 'text': "It was over priced, the food was poor, and the atmosphere was nothing special.  They have a good amount of beer to choose from, but that doesn't make up for the other short comings.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 2, 'date': '2013-05-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Fu5WbEYvYANGVxwBuYgMkw', 'review_id': 'yZb_c93PmsHrmITkHU9L4A', 'text': 'Diverse beer selection and great food. The lobster artichoke dip  is fantastic and the salads are great', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2013-05-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'unT-D4Cx5VhVMT3ocyJF-g', 'review_id': 'gbvlGayv7L2_sQGg0_tdAQ', 'text': 'Love this place! Awesome beers on tap, and love the service. Best part of service is they are very good at recommending beer! I love going to places that the servers actually know what they are talking about. Go there for happy hour, the food is bomb and the beer is even better!', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2013-05-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'pQ6ij6cOBRB3yJGHbVZHUQ', 'review_id': 'ZDt7fQ2QX2HTLmVyIfEW1w', 'text': 'We had our first experience with Yard House in Hawaii and it was great. This location, not so much! My wife had the French Onion Soup which she described as bland, overly thick and just so-so overall. She also had the Ahi Tuna Salad which was equally as uninspiring. My Son had the Caesar Salad which literally had two croutons and some lettuce for $6.95. The Turkey Burger was overcooked and just kind of blah. I had the BBQ Ribs which were unusually tough and barely room temp. The creamed style corn was made with fresh corn. I know because mine was soupy, way too sweet and it was full of corn silks, corn husks and little pieces of corn cob! The BBQ Beans were way over-seasoned with cilantro? Just tasted bad! A GENUINE COLOSSAL DISAPPOINTMENT!', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 2, 'date': '2013-05-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'rjsx6_pSqwl0zuiwa_tI2g', 'review_id': 'ELJGhMS4JGvIbYOGMLNl_w', 'text': "Did you know this Yard House location has 38 TVs? THIRTY-EIGHT!!!!! There isn't a table / booth in here that doesn't have a up-front-&-personal view of live coverage of the latest events. THIRTY-EIGHT!  \n\nFriends and I stopped in for Happy Hour a few days ago before a flick and felt cool, cozy, well fed and well educated (we watched a segment of the Spelling Bee) on the two TVs that were practically on our table. \n\nHappy Hour food was good and servings were generous. Next time I am looking for a place to see my favorite teams play, I will look no further than Yard House - Scottsdale. I know there isn't a bad seat in the house . . .", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2013-06-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5XfAUaix9pBTgreBG79I9Q', 'review_id': 'UF4elHOesLib-H6k1Y9iaA', 'text': "Great evening with my grandparents. I had the NY strip, Grandma had the halibut, and Gramps had the jambalaya... We had a great time. We had a server who was training a guy named Tom, the trainee was great. The only downside was that they were not quick to refill drinks, even after my grandpa specifically asked for consistent refills because his jambalaya was so smokin' hot. Otherwise, great time, great menu, and Tom the Trainee-- you rock!\n\n\nAlso: There is a super tall bartender who is amazing. On the night I found out I am mildly gluten intolerant, I went in for dinner, sat at the bar with friends and he was so attentive to us and so helpful with me for ordering a gluten free meal and beer. He also took such good care of my friends and I, even though we were probably giggly and obnoxious because we were excited to shop for Vegas. Thanks again!", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2013-06-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jXqHqjC8Psez_alDM33E-Q', 'review_id': 'hSQQR2aKGts_9_vPRArQFA', 'text': 'First time at Yard House last night. The service was beyond outstanding. Shanna was the best server I have had in the 2 years I have lived in the valley. Her energy was amazing. The food was good but the 5 star rating is based on service. The Steak sandwich was good. the garlic shitake noodles were outstanding. The Smores brownie was out of this world. Mudshark caramel vanilla porter was great', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2013-06-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hn_DclKLzdxABRGGAuqKgg', 'review_id': 'ZoKVHWnMG5TUVsAVptQj1w', 'text': "This place is alright. It's large, and has a ton of large TVs which I think would be good for watching a football game. The beer selection is large, the food is average, and the service is good. I'd go back, but probably just for drinks to watch a game.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2013-07-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'YQ5GtQxk0llKxudYGMPxZg', 'review_id': 'rL_3YH7eaBH1wTOiCj_gRQ', 'text': 'Beer selection VERY GOOD. Too bad many of the brews you can NOT order by the half yard and get in a fun half yard glass.  \n\nFood is terrible. Nothing we ordered was good. Cheap quality and prepared poorly and a lot either burnt or dirty grease. The "cold" food items tasted poor, wilted and cheap quality for high price. \n\nService was slow. We went midweek and mid-day. Very few people in there. Sad to see an old man in a wheeled chair using a bar stool for a table. A bar seat, yes where people put their butts, he was using in a restaurant for a table. I don\'t know if his wheeled chair wouldn\'t fit at a table or what but that is un-called for. Sad really. \n\n3 stars just for the huge selection of beer. Nothing else.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2013-07-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xcp4S_0GINeO20sKvBqT9g', 'review_id': 'dMbm6HfNMxXKrKr6nkJArA', 'text': "My friends and I decided to walk across the street and grab a drink on a slow weekday about a half hour before closing. We, combined with two other people way across the dining room, were the only ones there. The other people left and we decided we should go too. (Being in the service industry we know what its like) Unfortunetly, I ended up leaving my brand new phone on the table and didn't realize it until we were home and they were already closed. I went back the next day as soon as they opened and was told they didn't have it. (We were they ONLY ones there) I asked them if they could please ask whoever was working or possibly check video footage if they had it and was met with a very rude, 'sorry can't help you.' \n\nNot good, not good at all...\n\nI guess one star for the beer selection?", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 1, 'date': '2013-07-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'sDyaN_3DEZyhnJPUFIwoEg', 'review_id': 'Sx9vtPuWkA92vCsnaoqpZg', 'text': "Beer, can I just say BEER! They have so many on tap it's hard to choose. They have the Four Peaks Peach Ale- which is my favorite beer of all time! The food is great, I have had their mac n cheese and also the sliders. You can't go wrong with Yard House! I also love it is in the Mall- I went shopping right before!", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2013-07-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': '82tSm6A56DMQgE9mSR91AA', 'review_id': 'qaC5nz_uH-1CCqSNa28HuQ', 'text': "I think this is my first 1 star review. I usually wouldnt leave 1 star, but this visit was the worst Ive ever had.\n\nIve been to this yard house a bunch of times in the past few years as well as many other yard houses in the southwest. Ive never been so dissapointed before. I usually get the bernaise sliders but this time i wanted to try something new. I tried the monte cristo but it wasnt good at all here. im surprised its even on the menu. We got a few other things and it was just okay.\n\nService wasnt the greatest, it was very slow, but the real reason this place gets a 1 star is because of the manager. I was meeting a few friends there. 1 of them was there when i arrived and we got the table, the other came in a bit and we all ordered. The last person was just coming to meet up and she arrived either close to closing time or maybe a little bit after closing. But we were still eating. She wasnt going to eat or anything, just meet up with us and hang out till we were done. My friend went to get her and the manager came up to us and said something like, you cant do that, we're closed. We told him that she wasnt ordering anything and that she was just meeting with us until we were done eating. He said a few other words and while im eating this horrible monte cristo im thinking, are you serious right now?? Shes not ordering anything, we are all together, we are gonna finish up eating and then we are all leaving together. Does he expect her to just sit outside and wait for us?? I would NEVER expect this at all from any restaurant and the worst is that it came from a manager. Yard House should send this guy to a customer service class. Not sure if i'll return but hopefully that manager learns how to not piss off his customers.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 1, 'date': '2013-08-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '-3m5dYZDRbqMIwNiL1g_eQ', 'review_id': 'CoxImX4n-z_Y6Q4YKqL9Pg', 'text': 'I could have cried, everything here is perfect. The best beer selection in the world, and the food is OUT of this world! There are items for every diet, whether vegan or meat-fanatic, lean and "comfort".\nWe started with mu shoo egg rolls (in addition to being fun to say, it kicks taste bud booty) and Korean BBQ beef (SUPER authentic and delicious!). The honey ale is great and the Rogue Hazelnut Brown Nectar is superb. I got the Hawaiian burger and it did NOT disappoint. Truffle fries too?! Oh my goodness.\nI have gone around the menu and everything I get is unbelievable, seriously throw a dart at the menu and get that item, because it will be awesome.\n\nMy only qualm- open one up in Chandler!', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2013-08-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wMFdeZRGbEnIPqUPjPeySw', 'review_id': 'D5AtmbFfqahCi6b24PdSAA', 'text': 'The food was great but honestly who cares, they have 115 beers on tap.  Went twice last week while at nearby conference.  Both waitresses were super knowledgable about the beer, brought samples to try, and helped me choose a great brew every time. I think I might move to AZ!', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2013-08-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GzG6ebrV8Q1nsnz0i1Hqfw', 'review_id': 'C8P44o0WcPYXt0Luc-P9eg', 'text': 'I have never had a bad experience at this place. I used to come here on the reg because I used to live at San Marin Apartments down the street. The parking is sometimes a little rough because it is right next to/inside the mall. But I would 100% order the gardein boneless wings as an appetizer and get them as a meal because they are heavenly! I also had the surf and turf with the turkey burger and that was great as well. The service is also great here, all the servers have always been really nice every time that I have been here. Whenever I have come here and friends have ordered something else, they have always loved it. They also have a good happy hour and like a million beers on tap!', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2013-09-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oUdDn56Be1o8XP0tt0S1bA', 'review_id': 'bA5NNPKJejjO1A5s0VOUyw', 'text': 'Broad variety on the menu and draft beers, so something for everyone and the food and service rarely disappoint.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2013-09-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'IhcTLLWKS6ZiNyIX9oQQPQ', 'review_id': 'sP3oDGCQMqrPArG2X-z-Sg', 'text': 'More great service and food.  I was dining with a teenager and a 5th grader.  The service was very attentive and helpful with the kids.  We all enjoyed our meals.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2013-09-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'NZTKuqR6R_NwT5tiIvnkZQ', 'review_id': 'aHKQCH-mwkuNTA53efazVA', 'text': 'Best beer selection in Scottsdale.  Best prices are during happy hour, make sure you get the chicken nachos!  Great place with a huge food and drink menu.  I was even able to take our Vegan friends here and they had plenty of food to order from.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2013-09-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HVqnEnkir1iGG0185VzYRA', 'review_id': 'lsvSU9rp3KUzrpMGEvPzIQ', 'text': "Stopped in for a quick beer. After finishing my usual beer the bartender recommended something off there limited menu, it wasn't my kind of beer so he exchanged it for something else. Friendly service for sure. Will always return for there large selection of draft beer.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2013-10-02', 'type': 'review'}
{'votes': {'funny': 5, 'useful': 5, 'cool': 5}, 'user_id': 'f4CExFYr3GTMSBD4BccDQw', 'review_id': 'Gvln20V6sDV2c5epX9TK-Q', 'text': u"If I was a beer lover this place would be a cool place to visit, for they have over 100 beers on tap! Since im allergic to beer I came here for the food! LOL! The ambience is nice and relaxing. The dim inside lighting, with booths and tables take up the spacious amount of room they have in the restaurant, with a nice sized bar in the middle. They have an outside patio that is covered by the mall, It pretty spacious out there as well. This time of year the outside was definitely more hoping then the inside, people enjoying the cool weather. The staff was very friendly when we arrived, on a Tuesday night we only waited about 5 minutes to be seated and had our drinks served to us within about only 10 minutes of being there. Our server was very polite and quick. They have a decent menu to choose from, from burgers to pasta! I ordered a basic garden salad before dinner and was very pleased with how fancy it was. It was a mix of lettuce, tomatoes, croutons, corn and delicious buttermilk ranch; It was a great basic garden salad. For dinner I ordered the parmesan crusted chicken and my friend ordered the southern fried chicken breast. Unfortunately they cooked me the wrong meal but had my friend's meal out very quick. As the server apologized and had the kitchen cook me the correct order, the manager came over and apologized for the delay, everyone was very nice about it and mistakes happen so no reason to throw a fuss. After my friend finished over half their meal (after I snuck a few bites) my order finally came out. I think I enjoyed more of my friend's meal than I did my own. The Southern Fried chicken was huge and delicious. The spinach-corn mashed potatoes had a great flavor to it and the gravy on top brought everything together quite nice. My dish was kind of bland and was over powered by the mushrooms. Usually I LOVE saut\xe9ed or sauced mushrooms but this particular dish, the mushrooms tasted...... well.... Ill use the word icky! \n\nShortly after trying a few bites I just couldn't finish the meal, I went ahead and had the server take it and we asked for the check. I don't like complaining unless it was a big deal and to me, the night wasn't awful and the employees were very apologetic and no harm was done. I think next time I will just try another dish. I was hoping for a few bucks off the bill since they cooked the wrong meal and I had to wait for them to cook the correct one, but there wasn't. We didn't mind too much, so we paid and left to catch our movie!\n\nThinking about giving this place another shot, just trying something different and next time coming during their Happy Hour!", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2013-10-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'w01wzU-HJqO5-bzA1OvsQA', 'review_id': 'UEhd1711y26gsw_GbW1uDg', 'text': "A pretty solid place, great for a cooldown in summertime or a night out.\n\nThe living room is nice and dark, feels cozy and not in your face. Serving staff is friendly and attentive.\n\nThe appetizers are surprisingly large, I shared the nachos with my GF and it was enough for us both. They also make a really good tuni sashimi, I wasn't so sure about it at first, but it was delicious.\n\nIf you like beer you'll go crazy...the serving sizes are massive and it is like swimming in it, great choices, and good local drafts too.\n\nA good upscale-casual hangout in the scottsdale mall area. Recommended.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2013-10-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'S5l5HqsIHWxY7fOV3vP1Mw', 'review_id': 'x34X5QZDH4fyjvzjLVyvZw', 'text': 'This was my first time at the Yard House and it was a very pleasant experience. First off, I liked that the server said "welcome ladies" instead of the usual...HI GUYS that we usually get everywhere when we are WOMAN! Hello!! We are not guys. It is one of my pet peeves. The waitress was friendly and attentive that not overly bothersome, so I give Tai 5 stars!! \nI ordered a club sandwich and it was huge and stuffed full of turkey, avocado and bacon. They also substituted the fries for a house salad at no extra charge. They also had my favorite 4 peaks peach beer and it was nice and cold.  I will defiantly patronize this place again!!', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2013-10-06', 'type': 'review'}
{'votes': {'funny': 5, 'useful': 6, 'cool': 6}, 'user_id': 'Q2jWOzEmkl6Zys2R1fFZWg', 'review_id': 'B5J3NyzMlvx7upohkGiVtw', 'text': "HDTV IN FRONT OF MY FACE\n\nGreat service and real food at a sports bar and grill.  Plus over a hundred different beers to taste.  Clean restrooms to do your business.  HDTV throughout even outside on the patio.\n\nUnlike most restaurants the tables here don't turn as quickly on account of the length of the NFL games. Our delightfully engaging server Brandon was a real pro and keep Yu-go chauffeur's Dr Pepper tumbler full throughout the game.\n\nOrdered a Chicken Nachos Grande, small Ahi Crunchy while concluding with two scoops of Mint Chocolate.  We finished it all and the meal was enough to keep us full for the rest of the evening.\n\nGot 50 yardline top of the line HD viewing, great seat service and yummy food while watching two most competitive NFL teams duke it out.  What a perfect way to spend a Sunday afternoon.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2013-10-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FHDI8M5sm6lrZXNUBZAOfA', 'review_id': 'RfcvH-KmdnSfjGiAdDiy2w', 'text': "I have to say thar for someone who considers herself a foodie - I'm almost surprised by how high I'm rating a chain like this. Yet there is no denying that my experience has been nothing but positive here. Food, beer and staff have been terrific and consistent. Because we are football fan wannabe's without actually possessing the ability to watch a game at home, we like to roll over here for our sports fix. And there truly isn't a bad view in the house, though I've never strayed from the bar.\n\nThe beer selection is of course...impressive. I love trying new ones and the bartenders are very patient with doling out samples for an indecisive patron such as myself. On that thought - the bartenders are pretty awesome. Always friendly, always attentive and insightful on both beer and food. While we pretty much always order the same thing (deviled eggs and truffle fries anyone?), I've like most things I've tried on the menu. This is a great place to accommodate the meatless crowd (self included) and even those that live sans carne get cravings for buffalo wings - mission accomplished here! Thank goodness for Gardein.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2013-10-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dkmeYJYEGhAV0kijSHpefA', 'review_id': 'Dj2Xb5qvQQnyCHCz_r0BIA', 'text': 'Beer 5 stars. Food 4 stars. \n\nBeer selection is great. Even for beer snob standards it\'s a bit pricey though.  I tried several beers I have never had which is hard to find for me.  \n\nI got the Hawaiian poke for an appetizer which was good and the New York steak sandwich which was very good. It was massive and delicious.  Decor is nice, like an upscale sports bar that takes pride in their food and beer.  The big problem is the crowd.  This place gets packed and becomes a bit disorganized. Also, some of the clientele tends to get unruly. Go here for lunch during the week or another "off" time and you will enjoy yourself.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2013-10-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Mu-SsGqShMhQBh_-jLV0tw', 'review_id': 'M_1-KhhNEzuwmVJkFz474g', 'text': "Nice atmosphere and centrally located at Desert Ridge, which I am there nearly every day having a meeting at Starbucks. Great lettuce wraps during Happy Hour. Tons of big screen TV's with all the sports playing on them.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2013-11-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'K0euQLFAcKhQPZ6JxGAryg', 'review_id': 'OIYrhM9yLRecWbpeS6hPTw', 'text': "They have a great variety of food here and the staff is really nice. Unfortunately the food was not that tasty. It wasn't horrible, just not what i was expecting. The Mac and cheese was pretty bland and milky, so I would not suggest you order that. The manager was great abt removing that from our bill. \n\nI love that they have the Gardein meat substitute here and have so many options for vegetarians. The Gardein Buffalo wings were a great consistency, but too salty and spicy. The truffle fries were good. The dessert sampler is a great idea. Our favorite was definitely the lemon. It was delicious. I will order that alone next time.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2013-11-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'Vs6r_qruKjJ0QfHGm0hJqg', 'review_id': 'Vqorefojb5FmKvFIiCnW7Q', 'text': "What a beer selection! What a food selection! Big portions of both too, our server, his name was Matt but I didn't catch his last name, recommended the nachos and a Papago Orange Blossom. The side salad portions were worth the price as well and we even tried some of their specialty cocktails that Matt sold us on. Both were great and they even brought out a birthday dessert for my friend. The environment was good with football on during a Sunday, would definitely go back, even for lunch and a quick yard of beer. Don't get fooled by the chain restaurant gimmick, this place is the real deal for foodies and beer enthusiasts alike.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2013-11-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Kmixr95qA7MSRiM_m8ZHXQ', 'review_id': 'lDZhqNpsxB01kxd4Gv681Q', 'text': "We noticed this humongous establishment at the front of the Fashion Square mall soon after we arrived in Scottsdale.Being lucky enough to have a wife who is a good sport when it comes to me checking out a new beer place we headed over here for dinner last Tuesday night.We got seated in a cosy booth and I took advantage of Delirium Tremens being on tap.I think they had an unbelievable 150 beers on tap.The restaurant comes across as an upscale sports bar with a number of big screen lcds plastered around the ceiling but with the volume pretty much off.Supposedly the founder's vision included classic rock and good contemporary stuff but we didn't hear too much music that evening.My wife tried the pork carnitas and I'm a sucker for good old nachos.Everything came out in good time and tasted fine.It's a lovely joint but being well under half occupied on this Tuesday evening the lack of any music seemed to magnify the football field size of the place.Chip the manager popped by to check on our state of satisfaction and apologized for the almost indiscernible music volume.There is a Yard House in San Diego but I am not inclined to go there because I can eat as well,drink as well and create a better atmosphere in our own house.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2013-11-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'YVK9az5yUFbpQchy0DYUeA', 'review_id': 'y_3pkMkv8U9Lys_b2O2s8w', 'text': "This, of course, is one of the greatest places to go and hang out.  It is like BEER HEAVEN if you ever want to try a new flavor and sick of the routine choices.  Place is amazing, great service etc.  Had the burger (3 on a five scale) and salad (average in many respects).  You can't go wrong as far as a place to hang out and do business deals etc.  One thing - if you are going to buy a t-shirt (I bought two of their shirts which are really nice and comfortable), make sure you buy it WHILE YOU ARE SITTING AT THE TABLE, we had to wait around 15 minutes after we closed out our bill just to pay for the shirts. Such is life I guess.  At any rate, definitely fan of the Yardhouse and have been to multiple locations!  Go for it!\n\nPS Tried to buy the yardhouse hat but when you take the sticker off the bill, it shows a round circle there (need to fix that, it's like the products you buy that you can never get the sticker price off).\n\nPSS Don't let me forget to mention they have the BEST music rolling there (I am not going to say what it is - you will have to go for yourself and check it out) but let me say BE CAREFUL you could use an application like Soundhound and spend more money on iTutnes songs than you pay for eating!! FUN PROBLEM TO HAVE THOUGH!!!\n\nPSSS The BEST hamburger in town is at Bobby Q's off the 17.  I have a review on that.  Trust me on that one.  Find your sizzle!\n\nGreat job guys!!\n\nHave fun, and find your sizzle!\n\nAttorney Steve, the business and real estate lawyer.\nhttp://www.attorneysteve.net", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2013-11-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'utEHvY9LcXOJSet6aN-EBw', 'review_id': 'wsjRNGdQScjtTTH9crmHpw', 'text': 'Without question, the worst service I have ever had at a restaurant.  We came here for a birthday party with 12 people, after being seated we waited 25 minutes for drinks (never even got water until we complained to a manager).  Food, as is standard for any Yardhouse was good, but it was totally overshadowed by a unbelievably horrible service.  If you have 4 hours to waist, eat here.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 1, 'date': '2013-11-23', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 2, 'cool': 3}, 'user_id': 'iwUN95LIaEr75TZE_JC6bg', 'review_id': 'e8JCKP0adXFMqYKltMoDQA', 'text': "The holiday season will soon be upon us, and that means one thing.\nShopping for the ones you love.\n\nMatching the right gift to that special someone is always a challenge, but it doesn't need to be. Not anymore.\nMay I suggest the Yard House at Fashion Square?\n\nStart your shopping here with some of Yard House's spectacular IPA flights, enough to insure you're buzzing like a high-voltage power line. Now it's time to get started with that shopping.\n\nTake the short stroll to the information booth inside the mall, its just a few short steps away from the Yard House. This is where they sell gift certificates redeemable at any of the Fashion Square shops.\n\nNext, inquire that the clerk run your card through the thingy to see what its limit is. Once you know the available limit, your judgment, sufficiently impaired from pre-shopping activities, will allow you to throw caution to the wind as you go balls on your loved ones. This is how I never fail to match the right gift with that special someone.\nBut here's where it gets tricky.\nDO NOT max out the card. \nI suggest leaving at least a hundred on it for your immediate return to the Yard House, where you''ll find refuge from all your holiday shopping madness.\n\nOnce safely at the Yard House, finish off your holiday spree with another couple rounds and some delicious chicken wings, again, being prudent to not max out the card. \nLeave at least twenty bucks for the cab ride home.\n\nPS. If possible, don't go shopping the same day as your wife. This will allow you to safely sneak out the house with HER Visa card.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2013-11-27', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 3}, 'user_id': 'f4CExFYr3GTMSBD4BccDQw', 'review_id': '8tlUGjRqQm9cYOMlIaCBhA', 'text': "Made another trip out to Yard House last night and had a better experience. It was pretty hoping for a Wednesday night, but we were seated right away. Our waiter was very attentive, our food came out at the same time, our order was correct and everything was good! This time I ordered the Caribbean chicken, it was nice and spicy, full of flavor with lots of different peppers. My friend ordered the Fried Chicken again and that was of course still delicious (recommend this dish). My original review wasn't bad, I just know that sometimes things happen, so it was nice to know that I was correct that things happen every now and then and this is not Yard House's norm! Definitely redeemed themselves! Good food, great staff, nice place!", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2013-12-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'gPgpg7HXHBKu2pkefNFgkw', 'review_id': 'CjyPqrFSn_3_HE9ByuYv5g', 'text': 'My room mate and i eat at yard house a couple times a month.  The food is always consistent and good portions for a good price.  \n\nHowever the one thing that this company really needs to work on is there customer service.  We were in yesterday evening and we were seated at a table near the bar area we sat there for at least 15 mins before our server even came to the table.  He asked if we had been there and we let him know that we had.  He then asked if we wanted any drinks.  Our friend ordered a diet coke, a order a glass of wine, and he ordered a moscow mule.  The diet coke came a couple minutes later the moscow mule came, about 10 minutes later my glass of wine arrived.  Some excuse about how the manager had to go and get more cause they ran out.  Our server then took our order and argued with our friend about what he wanted for dinner.  And was rude to my room mate and I when we ordered.  He then left and it was another 15 or so minutes that we saw him again.  When he came back i had asked for a glass of water and very rudely agreed to bring some water to the table.  And instead of bringing water for the table like every other table received or every other time we came in he brought just the one glass.  \n\nIf i was basing a return to Yard House on this service there is no way that i would come back every.  I work in the hospitality industry and this is no way to treat a guest of your restaurant.  \n\nPlease work on the service that you provide.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 2, 'date': '2013-12-07', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'ep4jDMEp0MMDYS1iL-2AHg', 'review_id': 'QfIG_CMPzHFQNST1D92nbA', 'text': "Terrible terrible waste of time! 2 hours without food or an explanation. Don't seat us if you can't feed us! Plus the one plate that came out with a salad on it after one hour was filthy!", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 1, 'date': '2013-12-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mRjDdjbsG3bJoEYUAHAalQ', 'review_id': 'qDGQhCchgbkSjE9tjXBEyg', 'text': 'Any place! I mean any place that can have over a 100 could beers on tap at gets 5 big stars in my book! The food here is good, but who comes here focused on that! It the biggest selection in the world in choosing beers! Great place!!', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2013-12-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9oiixa22QdZi4Y5JA2HaWg', 'review_id': 'CrXM-LdO1pKsKIdSSdxvGw', 'text': 'Excellent food and excellent service.  This was a great experience. The wait staff and management went above and beyond to make sure we were satisfied.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2013-12-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'l609W_lwszHEFC7ElASIgQ', 'review_id': 'wXYnrxeG6MP-K7VgwfXhbg', 'text': "Saturday Dec 7th 2013, My family & I went out to celebrate my wife's birthday. We were told it would be a 15 to 20 minute wait. I gave my name to the hostess and was given a pager. 25 minutes later, I approached the hostess area and asked how long. I was told we we be next, but it would be 10 to 15 minutes. I go back to the hostess' again and was told they are clearing a table. 15 minutes go by and I again talk to the hostess (she was quite snooty and more concerned with watching the ASU football game) and she checked  with her fellow hostess' on their paper logs to see where we were for check in. I was told my name and the pager were not accounted for and that they would clear a table right away. It took another 10 minutes and we were seated. One of the hostess' must of contacted one of the managers (thank you to her). A very nice manager offered 2 free appetizers for our wait (a nice gesture). I told the manager that we did not even get an apology from any of the hostess' and that they should have better customer service. Next, we waited another 7 to 10 minutes for our server (I believe her name to be Rebekah). She was impatient and quite rude off the top. We ordered our drinks and she was off. During that time, the manager who spoke to us earlier, told her of our extended wait and her attitude suddenly changed, mainly to please her boss more than the customer. We ordered, my wife's meal came out as a kid's order. They made a new order for us to take home. We ate, celebrated my wife's birthday and vowed we would not return. Poor, poor customer service for a place I liked. Yes, a place like this gets packed, especially when local sports are playing, but each customer that walks through those doors should be treated well. I should have stiffed them on the tip, but I did not. A horrible experience.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 1, 'date': '2013-12-30', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 5, 'cool': 2}, 'user_id': 'C5UZ88NJSguhi1DfZNUIAg', 'review_id': '15OBWFHmfCmP4c_HjkOBKA', 'text': "Updated Review:::: I gave this place a second chance! After being over my previous experience I visited them five times. All the other times I attended were great! Management must of done something to fix the issues. They were clean at all times, all the people were friendly, we received our food in time, no hassle. I hope this continues to be the case going forward and I shall continue to return. \n\nAwful customer service! Why is there a\nGratitude included in the bill? I would have left $0.00 as a tip. My friends and I came to enjoy great food and drinks needless to say nothing about the experience was great not even the drinks. We came in 8pm an hour went by and I still hadn't gotten my food so I asked the waiter what was going on? Obviously he had forgotten about it. It wasn't until 9:30 that I received my food and I got to speak with the manager. Thanks for taking care of my appetizer I would have given you two stars, but everyone else got charged extra for food and drinks. Their bathrooms were disgusting and no pens to sign off my tab with????? Seriously never coming back again!!!", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2013-12-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zhY7n4oAQzjFEbE7Q3cFCQ', 'review_id': 'PMVz01e6h9Glh_DxgLHRDA', 'text': "Yay! I'm a fan!\nMy pescatarian sister, husband, and I had dinner here on Friday night. The location was perfect because we needed to hit the Microsoft Store (and who doesn't love to visit the Tesla store, huh?!).\nI did research about food in the mall before I went to see what restaurants. Picked this one based solely on location, menu selection, and a few reviews. While online I could tell it was nearby (but unsure what floor it was located on), it was super hard to figure out on the mall directory. It wasn't on the directory's list of food but it was listed on the map.\nThere were plenty of choices, so many that it was hard to decide. Even my sister had a hard time, and quite often there are so few options for her that she's the first one to make up her mind.\nHost Staff and waitress were super nice. Service was quick. Everyone was super pleased with their meal. We ordered the Truffle Fries with shredded parmesan and herbs = Yum! I had the small portion of Mac & Cheese with chicken and bacon and LOVED IT! (Thank you to restaurants for realizing that there need to be more than one portion size - because that was PLENTY of food for an adult's portion, especially if you order an appetizer)\nThe gal we had as our server was wearing a shirt that labeled her as a Trainer - if the new folks follow her lead they'll be successful in the business.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2014-01-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'z8qCidu5VFHlA9lmewj7JA', 'review_id': 'fk3JsWISTzyzT4ugJqYSXg', 'text': 'I went to Yardhouse at Scottsdale Fashion Square with my boyfriend on a date. We had a bad experience. The server we had gave us attitude and whenever we had a question about the food, she seemed annoyed and irritated that we would take up her time to ask such a thing. The food was not good for the prices they charge. We have been there before and the food was better, but this particular night, it was not good at all. Very hit or miss with the food and the serving staff is not welcoming and friendly.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2014-01-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ckNi88QZoXRfgl9nSdXtbA', 'review_id': 'nNAE6DMHYF19rJnM9xfAQg', 'text': 'Amber, you\'re the consummate server! Thank you!! We had a great time at YH. Merlot really packs a punch ! The steak salad was fantastic but pricey. They don\' t offer a lunch size. Of course I had to order some of their delicious g fries. It\' s dark inside and very cozy. The seating booths are comfortable and very ample. This was a special BY for 2 of us and Amber didn\' let down us down with beautiful desserts that were complementary. Nice display of "birthday" in brown sugar. Awesome! 1 star less because the manager came over and told us someone complained about  our loudness and language. Why were 2 small children and mom seated nearby? It was nearly empty with most people outside. We\'re an exuberant bunch of ladies not intintended for little ears.  It put the kibosh on festivities.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2014-01-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DnBtpNNKQvhlPmDbAISITg', 'review_id': '7e6hhoCBvvA_tXUfniqTYA', 'text': "I'm always a fan of Yard house, great food and great service. Our server Matt was great and very attentive. We started off with beers; me with the Four Peaks Peach (always great) and my boyfriends tried two hefes. Although he did not like that, Matt was able to quickly change the order to exactly with my bf wanted. We got the spicy tuna roll (substituted with the ahi poke, as recommended by Matt) and the chicken nachos (amaaaazing & so much leftover). Great decisions by us! Also, Matt saw that it was our anniversary and brought us a complimentary dessert (the chocolate cake with ice cream) which was a great way to end the night. The food was amazing, but still can't beat the happy hour prices, which will probably lead us to come back on a weekday instead of a Sunday night. Great food, great service! Will be back!", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2014-01-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'b55NYJJavY4rXXx8V3HaFQ', 'review_id': 'x2k6hWx29g8t8PtHb_t_BQ', 'text': "The Yard House, for me anyway, is strictly a happy hour stop.  The beer selection is first rate with too many on tap to count.  The food specials during HH are great.  The entrees are ok but if you're in this neighborhood you have dozens of better options.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2014-02-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'adkV-Rt2NjIZzh2tmryeWQ', 'review_id': 'rqtQk8JqPcX9kAU4Aljb-Q', 'text': "Came here for dinner because I was craving the beer I always get here, RoseGaarden, so my lovely girlfriend was kind enough to bring me. This beer is a blend of hoegaarden and I believe raspberry ambroisia. We both had classic cheeseburgers, mine with pepper jack and BACON ! Both burgers cooked perfect, came with some delicious sauce, and plenty of fries that come in a separate metal cup type thing. This is nice for me since I don't really like my food to touch, and gives me extra plate space for ketchup. Both of us were happy and full. Only thing is kinda pricey. $50 for two burgers, a coke, and a beer.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2014-02-08', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': 'n4SiDQvwfeLOuxoLEV1xZw', 'review_id': 'i9GhV48mi5AT6f6eFZ3tHg', 'text': "This place is bomb!! Been to a few other restaurants around the California area but this Scottsdale location is in the perfect spot. So close to my house and I can go get some good food when I'm finished shopping. Went there a couple weeks ago now and was immediately greeted at the door by the host and was seated right away. Matt was our server and recommenced the chicken nachos and also the fresh fish of the day which was the swordfish. My gf and i actually never had them and were quite impressed!! This place is the real deal.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2014-02-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oEo_9d6XX_8-G44yvo-8eA', 'review_id': 'Wc4VV5HKJd26Uhhjdf_5RA', 'text': "The variety of beer and portion sizes are great, I really liked my salad, however the service is NOT. My order was forgotten twice and then not excluded from the bill. Second time's the charm to get me to not go back to this particular location.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 2, 'date': '2014-02-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'r6ksfQrygaiUYqSJ3IsWhA', 'review_id': 'KR82WHS5m1N3KxYLwWGABQ', 'text': 'Fabulous food! Their Cuban Roast Pork Dip is delicious, as are their steaks, Parmesan crusted chicken and fresh baked brownie.  Their waitstaff is very attentive and the beer selection is amazing.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2014-03-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Qk83VL3_mdQM3iLaW3YIUA', 'review_id': 'Jf-b_0U4v_x7sCcKHVogUA', 'text': "I love this place. There are tv's all around and the food is awesome. I always get the roasted turkey melt. The service is a bit slower than most places, but it is worth it.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2014-03-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'gEysd5btpRh_7TkZN3Ckrg', 'review_id': 'xbA_R_96rAuxtx0aZiT6Cw', 'text': "Great location near the mall in a lovely area of Scotsdale. Loved the large craft brew selection. This would be a great happy hour. \nThe lighting is VERY dark, and based on the music, this place isn't geared toward the 20somethings. So it was funny when my whole table took out their iPhones and used their flashlights to peruse the menu! At one point, the waitress held someone's phone so my companion could hold the menu at a particular angle. Fun stuff.\nHuge menu and selection of food that came out VERY quickly. Loved my Southern fried chicken but loved even more the mashed taters/spinach/corn concoction.  Selected the trio sampler for dessert and was pleased with the yummy and unique selection. The lemon souffle rocks.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2014-03-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'XTBnPvJh3e0BnYsPy4aQAA', 'review_id': 'hcGNecqOQ-7PCQwJ15kqXg', 'text': "Get the Mac and cheese squared. You won't be disappointed. Foods great, ton of beers on tap.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2014-03-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'eCMIO4JFt1weYrWfFG7WWw', 'review_id': 'ZRTBts6jJseT4viG83uqbg', 'text': 'Decided to try this place for the first time while on vacation.   We are now a FAN!   Be sure not to miss the "smore\'s brownie"  they tell you it will be a 15 min wait since they freshly roast the marshmallows on top!  OMG it was so worth it , one of the best desserts we have ever had!!!', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2014-04-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hKNGmozNm5J7ssNyi1pcNQ', 'review_id': 'VJuLFMAk2RAyR-5_ecxkVA', 'text': "I'll start by saying I've been going to the Yard House for nearly a decade now. When I lived in North Scottsdale, we'd trek over to the Desert Ridge location, but now I just make sure I have lunch at the Fashion Square location anytime I'm spending a day at the mall. I love their Gardein meat substitute menu - when I first found out about it, I was *so* excited and it's never let me down!\n\nA few days ago, one of my best girlfriends and I had lunch there and I ordered the Gardein BBQ Chicken Salad, my favorite. The food came out super quick, but I noticed my food was definitely incorrect - there were noodles and the smell of soy sauce and sesame oil. I asked our server if maybe the order had come in wrong, that this looked (and smelled) like the asian pasta salad. He apologized, quickly took it back and came back to let me know that the order had somehow gotten lost in translation. No big deal! He was very apologetic and told me my correct salad would be out shortly. I said ok, no worries! A few moments later, their head chef came out and apologized and let me know that, because of the mess up, they would be taking care of my lunch for me. I was shocked, in a really great way. I hadn't made a scene by any means (I've worked customer service for 9+ years, I know mistakes get made and who cares? I was enjoying a leisurely lunch anyway), but they really had amazing customer service and I was so thankful for their genuine level of caring about the mistake made, even though I wasn't upset at all! My salad came a few minutes after that, while my girlfriend was still only halfway through her meal! No harm, no foul. \n\nBasically what I'm saying is, for amazing customer service, awesome beers, and tons of options, Yard House is tops. I always *have* recommended it, and now, after that amazing and unexpected experience, I will always continue to do so.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2014-04-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0Idu7JzPUjre7B3dz5mLPg', 'review_id': 'JlEFen29mxXWnI63mZOKFg', 'text': "The menu has a great variety of food.  Nice restaurant compared to other sports bars that I've been to.  I make sure to come to Yard House whenever I'm in Scottsdale.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2014-04-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'V4dRqmyUjLcLBqJ8E_1aew', 'review_id': 'CGg3NCU1cEnW50Inoe7jfQ', 'text': "Two words: Happy. Hour. \n\nI know that whatever state I am in, I can count on Yard House for good consistent food. My favorite appetizer is the spicy tuna roll. It's not the traditional sushi roll, it's even better. It's just a giant circle filled with tuna, avocado and cucumber. YUM. The nachos, wings and pizzas are really good too. And it's CHEAP. So much food for so little money!\n\nThey have a great selection of alcohol and they have my favorite framboise! \n\nI've been for lunch and dinner too and it is also delicious.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2014-04-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'MkptBarqPmWgMdugUPPP7A', 'review_id': 'ReJD4rPuvVLsf_6s0HvcUg', 'text': "First time here & loved it! Tai & Sal are some of the best bartenders I've ever encountered in decades of drinking. They are so engaging and super knowledgeable about the beers on tap, different styles, & beer history. Can't wait to return.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2014-04-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'sbvSyNtI7Sgp7k4qzf2reg', 'review_id': 'lQLXa7ur5TLwvV1UPe6U7A', 'text': "I kind of, sort of, eh, love this place. I mean, I could REALLY love this place if they had different kinds of Chimay and maybe the food came out hot. Just saying.\n\nI love the warm vibe of this place, but it is a chain so they don't really have time to chat and get to know you at the bar. I don't believe I've ever had a conversation with any of the bartenders at any YH I've ever been to now that I think about it. Odd. \n\nThe menu is large, but again, doesn't stray far from the standard bar fare you find at most places like this. It lacks authenticity and the flavors are generally all muted. \n\nHad THE best server; Jordan, and she took great care of us last night. They first sat us right next to the kitchen (I cannot believe they have booths right there!), but the clanging of pots and all the noise soon had me begging for anywhere but there. I specifically asked if, when we moved, they could still let Jordan wait on us because she is THE girl. She is personable, complimentary (my fave thing about her - hehe) and quick. If she couldn't get to me she delegated and got me what i needed immediately (we did move far away from her section and she was so nice about it!). \n\nThe beer flowed and it was good, but again, I'm particular to a certain brand that they don't have so I wasn't THAT happy, just moderately so. :)  The food was another story. Ordered the lettuce wraps with chicken and the chicken was barely warm and the sheen from the grease all over it made me a little ill, but that's okay, the calamari was worse. It was practically frozen. I was so disappointed because usually it's really good. We would have changed it, but we were starved. We also order the street tacos (asada and fish) and they were good, but for some reason instead of using corn tortillas to at least offer up some authenticity, they used this weird flatbread-tasting stuff. No bueno. \n\nOh well, it's a great place to socialize and the people are pretty here so it wasn't an all-together horrible experience. The bathrooms are super clean and the lighting is great for selfies so no complaints there. I'll probably always come here, it's just the way it is.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2014-04-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'R9DXkB7va34wUjtLoTXGpQ', 'review_id': 'D5Uix5Lrf5-9hccDDiEl0g', 'text': 'Wife and I were there about a month a go for our anniversary and let me tell you the food was great amazing service our waitress that day was Courtney and she was incredible nice really enjoy our time thanks for the great service we were there on 04 24 2014 thanks again for the great food and service', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2014-05-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PtoxaK2JnWE90zfQAfFBKA', 'review_id': 'Ne1vdv3M4KkSKUnwxGKYmw', 'text': "Never ordering to go again! I tried the Cobb salad and received chunky old lettuce, turkey was gross and avocado was brown. I've eaten here years ago and recalled a pleasant experience. Definitely not ordering again!", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 1, 'date': '2014-05-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vrTs9qvS5bVRXEeKyjwCWQ', 'review_id': 'WK-ymQXOzwa2SsV__-Ba3Q', 'text': 'I arrived just in time for Happy Hour (3-6pm) - finding this place from inside the Scottsdale Fashion Mall is a tad tricky, from the outside it is a little easier.\n\nI ordered the Firecracker Wings (traditional) and they were excellent.\n\nI also had the salted caramel butterscotch pudding which was very tasty.\n\nThe happy hour deals on food are excellent and I would encourage any of you to check them out (at all Yard Houses).\n\nMaybe one day we will have one in ABQ :-(', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2014-06-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'lS1yBzrxGoYY-k2auRMAMA', 'review_id': 'sBb5wFAk_1mLhdoFbX0eAA', 'text': 'Great place for beer drinkers... that, I am not. I stick with what I know...Ketel One and cran. But there are a LOT of beers on tap.  I went here (at the bar) after an exhausting day of shopping at the Fashion Square. ;-) The wait staff was superb! They were all very attentive. I think that I was greeted by at least four workers. And each of them asked if I needed anything. (I felt like royalty) My burger was made to my liking. Great atmosphere! Great spot to unwind and fill up. :-D', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2014-06-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_jJ94pg_cForV94uE0PCcw', 'review_id': 'pxH9Y7SG5y8uJHWxh_oFWQ', 'text': 'Delicious food, great selection of beer and GREAT service from our server, Jacob! I would definitely recommend the Korean beef tacos!!', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2014-06-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7f_1fpPdPjTLkMzDbIOXIw', 'review_id': 'd4pJeoZ_u-yCwZc_gKSLDg', 'text': 'I loveeee this place!! I just cant seem to get enough!! I love the beer selection!!!', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2014-06-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mLUPkvjsKFsafrCG-MtS7w', 'review_id': 'sv3n9StVmKXF7j5ROkCb_Q', 'text': 'Close to Scottsdale fashion square. Great late night hours. Yummy fish n chips! The staff is all very nice.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2014-06-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'o83bBoIE5jWDYHfFlyhLJg', 'review_id': 'FpRicCMmSM_nT_Yee1mNBg', 'text': "Had a house pale, ribs with creamed corn & beans. Ribs were fantastic and I haven't had creamed corn in a long time, but theirs was the best I have ever had. Great meal and service.\n\nTheir fries are shoestring which are ok but burger wasn't very great.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2014-07-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Nz6Qv5ZCkFsSWW0OMNhAMQ', 'review_id': 'uPwqHqtYBo8TJvvD9RQKew', 'text': "The food is not good & everything is overpriced. You're paying higher prices because it's Scottsdale. \n The only good thing is that they have a larger selection of draft beers than most places.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 1, 'date': '2014-08-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TCtWeR0iFW2_6aMw2Z8SyA', 'review_id': '0z1Gfmo20ijHIQ6UyBPqog', 'text': 'Over priced and small portions, but the food is good.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2014-08-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ehYcRj_kam_tnMTuaDmqpQ', 'review_id': 'XGMLHdrZWKaBIyQoGysuhA', 'text': 'This place has every beer you can think of along with a great selection of wine and liquor. It actually can be a little over whelming since it seems over half their menu is alcohol related. Their food is average but if you want a beer while the family is shopping, go here.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2014-08-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6XJfj4qjQlxjT-nPw4MSUQ', 'review_id': '0a57KBQojw9WaddxaoP03w', 'text': u"It's been a while since I've been here until recently. Enjoyed happy hour with Blue crab cakes (2) on a bed of greens and special mango salsa sauce for half price of $6. A friend ordered wings for $5 and we shared the trio dessert for $9 - mini chocolate souffl\xe9, mini lemon souffl\xe9 and mini peach apple cobbler with ice cream. That was the order of best to least-best. I need to come back here for the missed adult mac-n-cheese filled with chicken, bacon, mushrooms and other bits of stuff with a side of truffle oil. Mouthwatering just typing this. You know what means. Yes-time to go back there soon! \n\nGood for watching sports and good for group dinners and for beer lovers. All sorts to choose from.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2014-08-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WmXVPxO8KrCFHJ7zI_d6ig', 'review_id': 'ZPyudbwiRPWg8t1-gaYNSA', 'text': "Probably the fourth time I have gone to this Yard House. Service continues to be excellent.  Our server was Alex and he was great and completely knowledgeable in the menu and more importantly could rattle off about 90% of the beer selection.  I had the beef dip and a cup of chowder.  All good stuff. \n\nThe menu has a great variety I options so it has a broad appeal. \n\nReally though. It's about the service.  Lots of good people.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2014-08-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 6}, 'user_id': 'aaHyqSTcpdkismEP0bj0rQ', 'review_id': 'ij63Gm4Wwakda8brcwfjvw', 'text': "I'm a fan of this location. Super friendly staff. I normally get the turkey club with side salad. So yummy. You really can't go wrong with anything here. And yummy Arnold Palmers!", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2014-08-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KJDymAcoPiW_vuqthGxfpQ', 'review_id': 'dDCqeKRlLFyT0HFhYwU0BQ', 'text': 'This location is a part of the mall, and can be accessed where the valet drop off area is. They are a fairly large location for the space, and have plenty of seats for just about any group size. \n\nWe headed in for a later lunch and even on weekends they have good lunch deals offered up. The truffle burger was very tasty and the fries were good as usual. Our waitress was very friendly and checked back on us often.\n\nSitting outside was fun since there is a TON going on out there and it makes for a dinner and show vibe. The downside is that this is the valet drop off site, so it also means that you get fumes and loud noises pretty regularly while eating. \n\nOverall: A-\nGood lunch deals, especially for the area, and service was friendly and quick! If you sit outside, be aware that it can get loud.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2014-08-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XJGf1STjUz8OGfFU8dXjHg', 'review_id': 'I4fcV-0P68Jfim4_Wihwzg', 'text': "This place is massive!! I mean I haven't seen too many restaurants this large. Not a very mixed crowd.\n\nThe waitress staff are awesome, bartenders not so much. I've been more than once.\n\nWe ate, had some drinks and played corn hole. They have fooseball and table tennis. \n\nNice spot", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2014-08-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GMZvpQgt1G3BOznjHx1LmQ', 'review_id': '6fsAC5G9aVzf8izxGAWFUA', 'text': "Solely based on Adam's performance this place is a great spot love the sugared rims for lemonade this guy always kept them coming. Favorite thing about place him and the lemonade!", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2014-08-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5ZOyWqdF2TJBTrS7ey26Aw', 'review_id': '0O7P0Gnt8QKkjUhs6n07hQ', 'text': 'Dinner was fabulous! We had some different beers and ciders, yummy steaks, and dessert. Our servers Ashley and Mecca were so much fun. Will be back for sure! Made date night memorable.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2014-08-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rsP1dZVfhT9xMvbYm7Ur2g', 'review_id': 'nEFj2NClfMKWCXvbQ1tGFA', 'text': "This place is great for a quick dinner. It's not a really nice restaurant, after all, it is a chain. My boyfriend and I go here frequently to grab dinner, usually when we're eating a little later than normal and want something easy.\nThe menu is huge, so it's often hard to pick something to eat if you're not exactly sure what you're looking for. But it's nice to have a lot of variety, especially when there are people with different food favorites. \nSince I usually go during the week, a little later than dinner time, I've never had to wait for a table and always have quick service.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2014-09-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '71NNAFVvXil4NIZmSap9HQ', 'review_id': 'jTydeRhf9fvGToHBPCnKQw', 'text': "Food was great! Our server Kate was terrible and unfriendly. She doesn't know our liquor laws for the state of Arizona and rushed me into finishing my drink before I could get another one. She didn't smile and when I asked her for her recommendations she was very uninterested in my questions about the menu.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2014-09-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nHq467z5LS8ZgkcssinC5w', 'review_id': 'xgtqC4U8GivMIjblub_qDQ', 'text': "I'm two for two this weekend. Nine people for lunch. Forty minutes after we ordered, our food came. One person ordered a burger medium rare. It came well done. She apologetically sent it back. When the burger returned we were finished eating. And the new one was well done. The beer was good (Boddingtons on tap) but by the time the food came it was nearly time to order the next meal. Nice enough people, but really awful service. What has happened to customer service? There wasn't a crowd, there seemed to be plenty of employees. No offer was made to discount the burger. I swear. So I've decided I'm posting at every restaurant I visit, often 5 or 6 a week. I would encourage you to do the same. If the service is subpar, let 'em know.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 2, 'date': '2014-09-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yEQ96ibrgRxUaJP_wv5cbw', 'review_id': 'YYnQP0UV5u346ttg6vhIEA', 'text': "First. If you can get passed the overwhelming selection of food, this placec is worth it. \nI've only ventured as far ass their Vegetarian Selection, and it is always fantastic. (Go Gardein Fake Meat for the Win!)\n\nSecond. Beer Selection - Amazing... They even have Beer cocktails now. I am very excited to start tasting all of these.\n\nThird. The only reason that I give it 4 stars instead of 5 is that the service is sometimes subpar. But definitely go in.. I may ahve gotten a waiter on one of their bad days. Nothing against the place.\n\nSo definitely go here, bring a big group.. it is an awesome place to eat at, and they have reverse happy hour!", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2014-09-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WoqdRUrFYev5E_UGR91H6g', 'review_id': 'eFO-ckBX9_bAiokSr1YzBA', 'text': "I have been eating at the Yard House for years, since it is so close to my house, and so close to the mall. I've always had decent service, but my last visit really turned out to be a great one. My boyfriend and I went to happy hour to watch the football game (they have TV's EVERYWHERE.) We ordered two apps and two drinks. While our drinks and my food came out quickly, his wings were taking an unusual amount of time. I was so impressed when the manager came out to apologize sincerely, and explain why they were taking so long. He brought them out as soon as they were ready and took them off our bill, again apologizing and making sure we had everything we needed. As a former server, I understand things happen but it really makes a difference when the staff go the extra mile!!! I will, of course, be returning :-)", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2014-09-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tb4bpDnZQuDJI_2OP37iog', 'review_id': 'WhV6VXwU0vVc5hbXGeJS-g', 'text': 'I wrote a negative review a few months ago but thought I would give it a second try.  The restaurant is much better. The service was wonderful. The outside tables were replaced and no longer have slats, that trapped spilled food \nThe server came over and wrote down my order, we were simple today but it was appreciated. I loved my Tuna appetizer ...healthy fresh and tasty. My husband and daughter were equally impressed....I will be back often. I really felt the last yelp that was negative was listened to and today was very professional and a fun time.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2014-10-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'PKwZWyQxR-O14RzZirkndg', 'review_id': 'yHuDLZKJs17BPxMlgCVg3w', 'text': "The Yard house has been a primary meeting location for me around the valley.  I'm not sure why?  As I'm writing and revising I realize why.  All locations have prime real estate at malls - so there is immediate availability for pre and post activities.  This Scottsdale establishment has the best location I think.  \n\nBlackened Swordfish Taco and Baja Fish Tacos I recall being decent.  However, I have sent back a seafood entre plate (Phoenix) - I don't think its on the menu anymore, had a bad shrimp appetizer (Scottsdale) and some of the Tacos weren't that great for me (Glendale).  Burgers are ok.  I have eaten here a lot and really nothing amazing unfortunately?  Hmmm.  Your taste may be completely different than mine.  So this is not a great food review for the Yard...\n\nIts been a good meeting place.  I'm not reviewing the drinks though I've spent many hours at the bar with company.  Bartenders have been decent, food service has been decent.  Some people really seem to like the drink selection.  Ladies have told me this is not a good date place - so just a heads up on that lol.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2014-12-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'X9jzZA2U2vQeiNUkbDXl5g', 'review_id': 'ZZZi4aHOwySpvAc3nGcVEA', 'text': "Pretty good food, and the beer selection can't be beat!  I just think that they should offer Happy Hour on Sunday evenings (the place was dead, so why not?)--also, the beers aren't very reasonably priced....most were at least $6.50 (or more) for a standard pint.  I understand some of the beers are imported, rare, or whatever, but have some beers in the $5 range (besides Bud--yuck!).", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2014-12-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2dMkhje-Rqf0byq2cII5Bg', 'review_id': 'u57u-Ktydy1OvdmbjQr5gg', 'text': "We had a wonderful early dinner. St Louis style fork ribs were fall of the bone tender and delicious. Didn't care for the bbq pinto beans too much.  My husband got the oven roasted turkey melt  from the lunch menu and it was a very large sandwich.  It very tasty. We also ordered tortilla soup, it was excellent. \nI was glad to see all the vegetarian options. Next time,  I'll be able to take my daughters to enjoy a nice vegetarian dinner", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2014-12-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '-8gRkiYaVm3zfoQ4pcg75w', 'review_id': 'TPOj336TGKUcHEqWLWuWWQ', 'text': 'The staff are so professional and friendly. Our waitress Meka was awesome!!  Lots of beers on tap. They have some delicious happy hour options. Today was my first visit to the Yard House And I will be back.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2014-12-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BxLlwLX9iT1A59F9axrjSw', 'review_id': 'ZjcVq4Cd-81isq3BMKdBIw', 'text': 'Love this place.  The toughest thing to do here is pick a beer and food.  Everything is so good!  Thankfully the bartender was knowledgeable and had some great suggestions!', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2014-12-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XjHhEHhiVv51bH0B77wE3w', 'review_id': 'pBeLJBxzJthIDQ_zAy4Psw', 'text': 'You will have plenty of televisions for your sports viewing pleasure.\n\nMy buddy and I ate here three times in two consecutive days.\n\nThe food was decent if not fantastic. \n\nThe first time, I had the BBQ Bacon Cheddar Burger, which was decent, as was the service.\n\nThe second time, I had the Southern Fried Chicken Breast over spinach-corn mashed potatoes.  The breast was a bit meh, but service was decent.\n\nThe third time was the service from hell.  I arrived at the restaurant around 8 PM and were promptly seated.  We were also told that there was a large party, so we may have to wait for our order, which we understood.  The waitress quickly takes our order.  Around forty minutes later, the waitress returns and reminds us that there is a large party and our order may be delayed.  We get a little suspicious.  The waitress had forgotten to put our order in!!!!    But it gets better.   After another fifteen minutes, our order arrives, but it is not what we ordered.  The manager comes by and apologizes and comps our meal.  At least we did not have to pay.  I had the small portion of vegetarian angel hair pasta, which was pretty small.\n\nI could have given them one star, but the first two times was decent.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 2, 'date': '2014-12-12', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'DrWLhrK8WMZf7Jb-Oqc7ww', 'review_id': '6QGuAvNz08LIYhzMz5HmFw', 'text': "Pretty typical fare in this location. I still can't rate too high because they charge 6 bucks plus a pint of beer. The chicken enchilada stack is full of white meat chicken, beans, cheese and comes with two different sauces. The BBQ chicken pizza is plaqued by too sweet BBQ sauce, but the large slabs of chicken help make up for that issue. Still, one of the better and more reliable chains around the nation.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2014-12-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WSj1-fp1I6eVA9dXErlMTQ', 'review_id': '9eSrVBGiozChxf744m9T7w', 'text': "Excellent location and the wait staff was very attentive.\n\nYou just can't beat that beer selection... my weakness.\n\nThe Cuban sandwich was VERY good!!", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2014-12-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'XUd9-XTjvjDj4MoyzMscgA', 'review_id': 'bla_7b4UeWfRC9SP4XXuRg', 'text': 'Great place for simple comfort food and good salads. The unlimited choices of beers are topped by a full bar and great staff. \n\nGreat place to unwind after hauling the mall.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2014-12-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-0QTwX15WKy7_imlqVYVig', 'review_id': '3o3AkmKDJmKoVCeKR57I_w', 'text': 'I am giving 4stars for excellent beer selection, good food and service. The location is good, but parking is a pain since it is in a mall. Offering beers in 3 sizes is a great idea because I can try a few in the 9 oz. size.\n\nThe only negative was when we checked in, with a 9 month old in tow, a guy walked with a pitbull-type of dog and was allowed in. Really, a dog in a restaurant? When I asked about it, the hostess said "well it could be a service dog and it is against the law to ask".  It would funny if it wasn\'t so disgusting.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2015-01-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Fugt87Ao5ptMfRT2-rWDlQ', 'review_id': '8ZQLhrBVorozMq7tpfXG2Q', 'text': "great service great atmosphere terrible French fries.  Hamburger was good (truffle something blah blah blah) but not amazing.  Tasted a fellow diner's pork belly taco and wished I would have ordered that.  A few other diners ordered fish and chips that did not look appetizing which explains why they had plenty left on their plates.  \n\nSkip the mini chocolate souffle.  It's just another premade brownie cupcake warmed up in the oven and tasted so. \n\nAll in all I can't say The Yardhouse is a place I'd be excited returning to.  Me thinks its chain restaurant pedigree is too apparent in the food.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2015-01-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xAM-ZBDcl-kOVHT4-5OLoQ', 'review_id': 'TY5ISJIeggfYaiWWLqJY2A', 'text': "It's about beer, food and service.  All were 5 stars.  Great IPAs,", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2015-01-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FUCVObAQOIv105RrZCwlAw', 'review_id': 'MJAPOOKtV-yMb99PDF49cQ', 'text': "I love the food, drink selection, and atmosphere of the Yard house.  I could rate it 5-stars on those criteria alone, but location and food do not a restaurant make.  There are two issues with the service:\n\nThe first is that the restaurant can get uncomfortably packed at times, especially nights and weekends.  Using the bathroom can occasionally be a nightmare, as you might get stuck 1/2 way.  This feels like partly a layout issue, partly a flow issue, and partly a hosting issue.\n\nThe restaurant needs to open up some space on the bathroom side.  Servers and food runners need to establish guidelines on how to move through it without obstructing it constantly, and hosts need to ensure parties sat there are the appropriate size and not adding chairs to the ends of tables (this happens often, I wouldn't be mentioning it if it just happened 1-2x).  \n\nThe second issue seems to be turnover related.  I'm good at remembering people, even those I barely interact with.  I know the restaurant industry is famous for this, but when I was going there frequently I almost never saw the same staff member twice.  It's possible there's a massive staff, I suppose - but how many bartenders can there be, a dozen?  I used to go for a drink before a movie once a week, and I honestly never saw the same bartender twice.\n\nThis is coupled with their staff occasionally flubbing the menu.  Either calling something by a different name, not clarifying, etc. this has twice resulted in the wrong thing coming to the table, which I promptly send back.  Maybe it's a new-menu-too-often deal, too much turnover, I can't say.  But it happens too often for it to just be a one-off/unlucky customer kind of deal.\n\nEdit - I noticed this establishment has a $$ rating.  In my opinion, this is probably a little under noted.  Some of these dishes, the ones including seafood or other exotic ingredients, can easily run up your bill quickly.  It's worth it, but the $$ can be a little deceiving, it should really be 2.5 $'s (if that's possible).", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2015-01-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rK5VV9vsH-Xc6k2oHKjtLQ', 'review_id': '60UQwAlhsCQe0nxKVHpKhQ', 'text': 'Kim P the bartender here is great! Amazing service, smile, and super nice. If I owned a restaurant Id want her working for me...And she can serve you any of like 100 beers.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2015-01-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-5pAIpIF7AwSZbSu9TqKPw', 'review_id': 'dRppt0i75JGAH3ORJn_ifQ', 'text': 'Originally liked the yard house chain when living in Kansas City, good food and drink selection. Figured that all would have the same great service. Not so. This location had very poor food a year ago when we visited Scottsdale.  This year we realized that the hours were incorrect when we arrived just after midnight thinking they were open until 2pm as it says. Not so. They close much earlier. Check before you take a late night trip to Yard House. Good luck.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 1, 'date': '2015-01-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'EzKRzSxZwLfHTUVWIdjNfQ', 'review_id': '_6_dp4oVoDIA40fUHXKjwQ', 'text': 'Food was ok. Service ok could use improvement. Our server seemed busy. Bar back or who ever dropped off drinks threw the straw in our food. They messed up our reservations as well. We had a party of 13 but only had 10 seats at our table reservations were made 4 days in advance for a bday party. The only 5 star thing was my cherry limeade drink. Who ever made it made it the best I ever had. Would I return probably not due to so many other options in a 5 mile radius.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2015-01-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dtErUkGCDTwJNjy-U4az6A', 'review_id': 'd78TCVTmwzmoEWTCiiALJA', 'text': "It's an okay place for lunch if you've been shopping and want something nicer than the food court. I'm guessing it would be a fun to head there for game day or a late happy hour too.\n\nObviously, the beer menu is huge and most of them are pretty good. There are a lot of food options on the menu - I LOVED that any of the burgers could be ordered as a veggie burger. My boyfriend and I each had really great veggie burgers (I got a classic one, he got a fancier themed one and said it was good) and a ton of French fries. The food is pricey, but it tastes like it is worth the quality. \n\nHere's where they lost stars: 1, the inside of the restaurant smelled like something I can't even describe. Like sewage, but worse. I don't know if they were having a plumbing issue the day we went or what. If there hadn't been an outdoor table available we would not have stayed. 2, we had a waitress who was training another girl, and they were not the most efficient team. We had two servers, you'd think at least one of them would have remembered a side we ordered or brought us our check without us having to ask for it after they cleared the plates and seemed to forget us. I know training can be difficult, but they seemed to be slowing each other down. \n\nI'd go back, but I would sit outside again (just in case) and pray to the restaurant gods for a solo veteran server.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2015-01-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fSsvZJNMgHZT363s27_QWQ', 'review_id': 'PUxJXVg0Rb28X6iMzn9fKw', 'text': 'Holy guacamole... They have hundreds of beers on tap and wonderful ,wounderful food ,also tv after tv.great service too. hey what more can you ask for ;) yes it is very clean. Now what are you waiting for?? Go,go,go;)', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2015-01-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QxKjiAVoyl7qo-VYekHuDw', 'review_id': 'Xsy7bBEB3FEtemB_RnnkKw', 'text': 'I like this place. I love the bartenders. I love their knowledge of beers. While I love love love Mac-n-Cheese, I can say with an authoritative voice that "I will pass on ordering it again." It was pushed on me by the staff when I had a moment most patrons have where you ask "What do I want to eat?" In a valley with Mac-n-cheese competition, I\'ll stick to my number 1 choice for this comfort food. The Yard, so so for food thus far (and I\'ve sampled a good variety). But the beer? The beer!!! Superb!  Definitely worth visiting again and again just for the great beer, but next time I\'ll eat before.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2015-01-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1MKlJDkmyTilK9ZX0IVIKg', 'review_id': '5BZRXOGCdDq6c52REIen3g', 'text': 'Our server Matt was absolutely perfect! He was well knowledge of the beer list and very helpful with suggestions of our food items. I had the six pack sample which was absolutely delicious pairs with the pear & Gorgonzola Flat bread - YUM!', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2015-01-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'eYQRLJ5I9JaCWUbrJUAtzw', 'review_id': 'e_lJzYSM7NvO4cvDhgfV3A', 'text': "Chicken nachos are a must! I normally go over happy hour for a cheaper beer selection; they have TONS to choose from. If you're feeling daring order a yard or half yard. This location is weirdly placed under the carport area, but has a great patio if you're stopping in after shopping. The service can be a little spotty, but the food and beer makes up for it. They have a lot of TVs so if youre going for a sporting event you won't be disappointed.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2015-01-31', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'RlAAn9opjQww-rLW_HSXOw', 'review_id': 'zV4tnYGtVfxrI8Wz-XCIbw', 'text': 'This is my favorite Yard House in the valley. Located at, but not inside, Fashion Square mall, next to Crate & Barrel. It\'s large and spacious. The staff is always pleasant. On my last visit, our waitress was extremely personable and borderline comedic. Loved her!\n\nThere were only 3 in my party, but we ordered a ton of food. It was Happy Hour, so we took advantage of the slashed prices. \n\nMy non-veg*n peeps ordered Chicken Nachos (a huge portion! 2-3 people could easily share), Chicken Strips, Blue Crab Cakes, and a Pineapple Pizza. They loved everything they ordered. \n\nI got my usual: \nGardein Sliders (hold the cheese & sauces). You get 4 sliders and they come with fries.\n\nGardein Firecracker "Wings"\nGardein Buffalo "Wings"\n\nEverything was beautifully presented and delicious! I especially love how they give you the same portions at Happy Hour that you get during any other time. \n\nThe restaurant is always clean, restrooms included. TVs galore, for you sports enthusiasts. And I personally love their music selection. Lots of 80s rock = mucho booty-shaking-in-my-chair-whilst-stuffing-my-face. This will continue to be my go-to Yard House.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2015-02-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uF7L4kBbjjtYCrqDndwT5g', 'review_id': '_eW5GOWMk281MfWN6MTKkA', 'text': 'Great place to go with many many options for beer.  Had a wonderful time and love coming back', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2015-02-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4zRDwF74YyCRFDQfxl6obw', 'review_id': '7MZiUXb6s78aRywxWLQlSQ', 'text': 'We stopped here over the weekend.. Nothing fancy just a quick bite for lunch.\nI ordered a med-well burger and it came out blood red. Not a big deal - send it back and get a new one right?  Mind you - I had cut into my burger before I noticed how rare it was... When the "new" burger came out I noticed it was the same exact burger as before (remember I had cut it) needless to say it was disgusting. And what a classless act on their end. Who takes the same burger, throws it back on the grill and then serves that to the customer?  As a result, I will never go back to this location.   Honestly Burger King has more class..', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 1, 'date': '2015-02-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'iiAcKoBL13XgSE8BiBe-FA', 'review_id': 'GNxLxRCaZSi4ZRbAyxc8aA', 'text': "gave yard house a second try and it was much improved!!!! I love how many options they have. I got the tofu lettuce wraps and the sauces were amazing. I also gave the ahi salad a second try and although I was so full, it was incredible. My favorite ahi salad around!!! I'm really happy I went back. My date also loved his chicken noodle soup. the pineapple mule was good but you have to love pineapple. It wasn't super sweet which was nice. Thanks yard house!!! Will be back", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2015-03-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BZYREq70KD-S0kd2pEf8iw', 'review_id': 'm9d89upjdL2z4Pxuj0DZww', 'text': '3 of the 6 people in our party got sick after \neating here.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 1, 'date': '2015-03-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hmRRMOQlhy5h0HBRTo0HCQ', 'review_id': 'gV5n521vO-xzr8en4rjZJg', 'text': 'We had a party  of about 12.  Someone in our party let the hostess know that we may need one additional table as we have some unexpected guests.  The hostess seemed bothered and annoyed that god forbid we have more people to come in and spend money.  My apologies sweet heart!   Ordered drinks first and after 15 minutes of just sitting there I got up and found a "manager".  I wanted to enlighten him on the wait so far just for drinks.  He looked at me with the most puzzled look on his face and said these exact words " I am sure they will be out soon"  I guess 15 minute wait was acceptable for him. Drinks finally showed up and after the long wait, Paige our waitress informs my girlfriend they do not have the type of beer she ordered.  She then just asked for a Blue Moon.  Wow! just wow!  I got out of my seat and went to bar to buy the blue moon myself.  This is ridiculous! \n\nThe table ordered appetizers which included Calamari, wings, some sort of spinach dip.  It all came out at the same time, Great right? Maybe now we can just let the rough start go.  Apps were dropped off and everyone looks around like "who\'s going to eat calamari with their fingers?" No app plates were brought and everyone just had to scoop the food with there hands since there were no plates to serve our selves.  \n\nI am usually not one to write such bad reviews.(look at my past reviews) but this place was absolutely ridiculous!', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 1, 'date': '2015-03-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IzpuiSZBhZssnBG-zqlyvQ', 'review_id': 'm00GbycStdzuk1PVVok2VQ', 'text': "The BEST grilled cheese with tomato soup (vegetarian) that I have ever had. Across the board. Across the states. Kicks Giada's grilled cheese at her Las Vegas restaurant out of the park. It is very classic, simple, and melt-in-your-mouth yummy. The waiter was new and he was fantastic, I wish I could remember his name! Excellent service, great draft beer selection, wonderful wine selection, and great menu indicators such as vegetarian, under 600 calories, etc.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2015-03-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'K51V3RlC6GFY5ip3f2AJeg', 'review_id': 'alpXAFoSPMEjS4gvjHnewA', 'text': "Went there few weeks ago with family visiting from out of town and had a great time! Service was superior, thank you Dani!. Couldn't have asked for better. Food was top notch. Will be back! Adding this to regular rotation for dining out.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2015-04-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GB3xbyiaQSX_7mPfx6HOoQ', 'review_id': 'bP2SjgfhjI7X1jFBCMI5wQ', 'text': 'Quite an array of beer selections. Being a avid beer drinker I greatly appreciate the variety Yardhouse has. \n\nTheir menu can at first glance be a little overwhelming but having a pretty decent description of their dishes certainly eases the anxiety.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2015-04-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '821pqzrcPSbL3nt6ug-NVg', 'review_id': 'VlaeG_EzfwCk0fKYgycglg', 'text': 'I went with a few coworkers for happy hour (3- 6pm) and will definitely be back.  I got the grapefruit IPA ($5) and the margarita pizza ($6) with marinara dipping sauce.  The sundried tomatoes and roasted garlic on the pizza were phenomenal!  We sat at the bar and the bar tenders were very nice to chat with.  Shout out to Zach!', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2015-04-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'feMMn1wTTe0rV60ydEFqRw', 'review_id': 'WrbS44wzHUom9d8g7HXRNQ', 'text': 'Great selection of beers and the menu is good with many choices to choose from. I would recommend the Fried Chicken breast served over spinach & corn mashed potatoes and bourbon gravy! Moist and tender with a nice crispy batter and flavorful gravy and mash', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2015-04-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LXOhR4ZUULSbBNztxYZ2dQ', 'review_id': 'Bep7-ChU0IN_WEefm7pZ7Q', 'text': 'Went here for lunch today with my best friend and it was a pretty decent experience. Our server was pretty mundane but efficient and the food was very tasty! \n\nI ordered the lunch special with the caesar salad and the BBQ chicken pizza. Chicken was a bit bland and there was too much BBQ sauce dripping off but I still enjoyed the red onions and bits of flavor. \n\nThe caesar salad was pretty good as well and was served with the meal.\n\nWe ended up deciding on the brownie with ice cream as dessert and it was phenomenal! The flavors were absolutely perfect and the ice cream was a delicious pairing. We ate it up pretty quickly! \n\nAll in all it was $40 for 1 beer, 1 soda, 2 lunch specials and dessert. \n\nI would go back again :)', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2015-04-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'X11XW93ZgxsJ9zOsgdg1cA', 'review_id': 'wmkY9AnT6wRb_cTe0Kdivg', 'text': "Dined here Friday Night 4-17 about 8:15 PM.\nService was good & food delicious.\nHad ordered 2 Pastrami Egg Burger - really good!\nBearnaise burger & beer sample super good.\nCuban Dip Sandwich was average-kinda bland tasting.\nKids Meal -teriyaki style chicken- not worth the cost. Get something else from the kids menu or you'll have to share your meal with your child cause it just isn't enough.\nTruffle garlic fries are amazing!", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2015-04-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mDtUaN69WyruNk204GAbiQ', 'review_id': '4RG2vl6VI2Vt7Ucb6eT5Jw', 'text': 'The Yard House has a very large beer selection, which is great!  Their food is also pretty good. What I really love is the environment of this place. It is big and spacious, and the booths are large. I', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2015-04-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZG688N9Gi0O8f0QXCJqj0w', 'review_id': 'ZgPfopbmfDWrIMsMKtcLuw', 'text': 'Brendan behind the bar is awesome!  Slow Sunday or busy Sunday this guy rocks it! He is full of knowledge for the menu as well as the surplus of beers. He is friendly, and all around provides great service. The French dip, sweet potato fries  ( with the maple bacon dipping sauce) and french onion soup is all amazing...Thank you for the enjoyable dinner!', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2015-04-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WGO00NiOVbGiCUj2RUi_dg', 'review_id': 'EdEs-7Zbe3ZXVYPVDXJv0w', 'text': 'Great food and good service. Atmosphere is ok. A bit pricey. Mainly it gets four instead of three stars because of the vegetarian selection.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2015-04-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5Qq3_5tnzuIGWgomVWZxuQ', 'review_id': 'UB2V8Af-MmPND94tZEmkIA', 'text': "Updated review of what used to be one of my favorite places around to get a burger.  The Menu seems different and the portion sizes were noticeably smaller.  The burger was charred around the outside and a couple of the beers seemed flat--Pineapple beer was bomb tho.  The Hawaiian burger was just not the same , I don't know who decided to change things up but it was the wrong move .", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2015-05-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mO8Rliju_qv_CnXiht8hjg', 'review_id': 'Fq7aTEncsBHFMhil9hTdVw', 'text': 'I had a late lunch with my friend here . Ordered clam chowder soup chicken wing and  pepperoni  pizza .everything was delicious and our service was friendly !! I will come back again ...', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2015-05-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'P3Ewdp9b3XifsPLuuWJ5Kw', 'review_id': '6fdTI8pJCqnGc3VMZ1c8cQ', 'text': "Always good, consistent service at Yard House. Whether I'm stopping by for a quick drink during happy hour (try the strawberry fields martini) or having a sit down dinner, I am always taken care of. Good food, good beer, good cocktails, great service. What more could I ask for?", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2015-05-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wgB1omdRgZKj7cjB8LARUA', 'review_id': '51fxIiP5b1HUPieV326gig', 'text': "Service was impeccable! I took my mother here for Mothers Day and had some of the best service around. The cocktails were amazing! The waitress Kelsey was super nice and patient as my mom decided what she wanted from the huge selection of delicious-sounding appetizers and entrees. We weren't confident on how to order the steak wellness and when it came back more raw than we wanted, the waitress was so nice about getting the food cooked to perfection and the the manager Gerry even came over to apologize for the delay in our Mother's Day dinner. I would definitely recommend this restaurant to anyone looking for a nice dinner or special occasion. Both Kelsey and Gerry's attention to making sure everything was perfect on a very busy day made our day. Ask for Kelsey!", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2015-05-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1ROTK8XOMciTdUca-1-xLw', 'review_id': 'bS0uiBACFkysIBSENkvgig', 'text': 'They have good happy hour specials from 3-6. $2 off of domestic pints and a "yard" 32 oz beer for $9. I think there were a couple other specials for wine and well drinks too. Amazing selection of draft beers here. The service was attentive. There are also happy hour specials on food. I tried the tofu lettuce wraps and they were amazing. They even offered to bring out more lettuce cups when I was on my last one but still had more tofu, which I really appreciated.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2015-05-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5o8eZPeIG9xg66LnEiYqfg', 'review_id': 'wtADvCnx2l6x5RXuisNf_A', 'text': "Hostess weren't very organized, nor very welcoming but later on got it together. Food was delicious, had the burger with an egg and my best friend had lobster pasta. Both were exceptionally delicious! Our waitress Amy was so kind, professional and welcoming! Great experience!", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2015-05-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'D_HlLP5e5kyler6fJPqndw', 'review_id': 'tmBq2LrMMB5W_pKHgfZVXg', 'text': 'This restaurant has a great setting and a very interesting menu, the wine list is top notch. The Mac and cheese squared is worth a try, however, I was disappointed with the lobster garlic noodles. This dish has such potential to be savory and to bring out some great flavors in the lobster, crab, and shrimp that comes on it, but the seafood was not quite fresh enough, and was "slapped on," rather than cooked as part of the dish.  The herbs were much the same, just tossed on. The seafood should be cooked with the sauce to infuse that garlic herb flavor.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2015-05-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'aIM9hR-Ugzm4BCsZDne2rA', 'review_id': 'UuUGqfRW9uhFvh9JAttBsQ', 'text': "It had been years since I had been to yard house and once I saw the menu and amount of beers on tap I was excited to try it out. I ordered a cider and my boyfriend ordered a house IPA. After waiting about 10 minutes, They brought out a house white? And we said no that's what he ordered and the food server said well that's what it said. Anyways the waitress came over and sorted it out and brought us the IPA we actually ordered. I ordered the French onion soup and my boyfriend ordered vegetable and rice stir fry. His hardly had any rice, strictly vegetables and was swimming in stir fry sauce. My French onion soup was super salty and lacking flavor other than that. Wasn't impressed at all. Not worth the pricey penny either.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 2, 'date': '2015-05-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JgDARI4_EjxF7sfaDq-KvQ', 'review_id': 'QwpZLVVnT2SGcUpbIVAkaA', 'text': 'If I could have given negative stars I would have. HORRIBLE SERVICE. We had a party of 12 and the restaurant  was not busy. We had 2 servers and neither one was friendly and we continuously had to ask for basic things such as drink refills. Service was ridiculously slow. Had to send 2 orders of Truffle Fries back because  they were overcooked. You know its bad when the manager takes care of the entire tab, especially for a 12 person party. Needless to say, I will stick to the location in Glendale.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 1, 'date': '2015-05-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZuP3JQoyEb_4rnYl2IZVCg', 'review_id': 'QdpF0UlQIzr-v7ov0hCbrg', 'text': "Yardhouse has always been a favorite of mine once I first tried it out in Marina Del Rey, CA.  They have an outstanding variety of options to choose from on their menu and heavily American cuisine oriented.  Their Firecracker wings are out of this world good as well as their Lobster Artichoke Dip.  They also have a chipotle ranch for dipping on the wings and other foods including fries and onion tower that you want to make sure you get.  I have never had a bad experience at any Yardhouse and coming here in Scottsdale was no different.  Secretly Amazing Menu Item You Wouldn't Normally Buy At A Restaurant:  Grilled Cheese and Tomato Bisque.  Do it.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2015-06-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'A318wS3YJoN2n8YbFX1Vww', 'review_id': 'Y0WwyGNN9u0ngvwDrylnGA', 'text': "Love that Yard House offers Gardein (plant based options.) it's the only reason I go to a Yard House. \nThis location was quite large and is good for groups.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2015-06-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'm0FMb8avBMr2E7wdUyhVzA', 'review_id': '0B6KEHOh1X0gvQJJjaIN_Q', 'text': "First of all I'm not a giant fan of corporate beer houses in a mall. BUT, I met a long time friend here for a couple drinks on a Wed night so here I am.\n\nDidn't order food......The amount of taps they had was pretty outstanding. I usually jump from beer to beer, but they had Dogfish Head 90 minute on tap, so I stuck with that.  My friend, a die hard Jager drinker, orders doubles at a time, my girl, martini's.\n\nNow being we are drinkers, and not cheap drinkers either you would think our table would get a bit more attention from our waitress in a empty restaurant on a Wed night.  NO.....we had to flag her down EVERY TIME to get a drink, many times her walking right past our table. We weren't a bunch of obnoxious frat boys.....3 people having expensive cocktails catching up.  We had to FLAG her down to get water as well.......pfffffftttt. \n\nI had my rating at 3 stars but after reading this I knocked it down a star because I'm ticked off again because of our experience.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 2, 'date': '2015-07-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'R4oAf3KUC0KQyLxp4hvo-A', 'review_id': 'e0sED-AYdBw9PAcPADndEw', 'text': "This hip location is a wonderful place to meet for a quick drink, a nice meal or a delectable dessert. The Yard House has always been excellent when I have gone and I can't wait to go back.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2015-07-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'AdxydgO5Esau8RHb3SFIJw', 'review_id': 'xcbDsj_O1X5AkbBLqkOdxg', 'text': 'A good place to watch games and drink good beer. Not the greatest prices in the world but average for an upscale place. Pizzas are good. Burgers are ok because most of the time just well done no matter what you ask for.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2015-07-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5KlQsdxvar0IsrjYdLM2fw', 'review_id': 'VwiVpdPSQdH7FiuqN7Ykzw', 'text': 'Great place to have veggie bar food!!\nLots of beer options.\n\nI am not sure how the none veggie food is but any place serving so many options for vegetarians is my kind of place.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2015-07-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'APugnf1rnGLMARVEG2QQ2g', 'review_id': '1bQGEXfohppqbhg3vfyxzA', 'text': 'Love the beer menu that is divided by style to help you choose something you will like. The ribeye with flavored mashed potatoes and vegetables was excellent. Our server Shanna really brightened my day she was genuinely sweet and good at her job. Visited 7/23/15', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2015-07-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 's79z5q89rMjcRFuE2dMTKw', 'review_id': 'yOtS7TrdhfCOV3mrk0PTjg', 'text': "Great family place 5 meals for under $100 can't beat that!\nFood tastes great and beer and cocktails where pored just right.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2015-08-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'AG2d0M9okSTSAFStVHn3Hw', 'review_id': 'pJ-7ubHxvG90rt7GnvHPcQ', 'text': 'My friends and family of mostly vegetarians used to love to go here for the Gardein burger. Alas, they no longer carry it. Too bad. We loved that place but will no longer go there.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 1, 'date': '2015-08-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zWxgSKK1-7DZnEvG7r23SQ', 'review_id': '0A0Ipia4-x27kQI8oymujQ', 'text': 'Food was great today!  We always come here for happy hour.  Tejah is an awesome server!  She has a positive attitude and really took care of us.  We love this location and will be back soon!', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2015-08-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DriGauETXw1mlup1WE8ZZA', 'review_id': 'V-ckBt7ajMuAaHl0VMA4bQ', 'text': "I'm giving this place a two stars just because I could have received better service somewhere else. I came here with a group of friends for a birthday dinner on a Tuesday night. Our group and two other groups were the only ones there so I have no idea how the waiter missed my order. I ordered artichoke dip and chips, the waiter asked me if I wanted it to be served when everyone else got their food just because it's an appetizer. I said yes and everyone's food came out except mine. I waited for a bit then my bf told me to ask the waiter. I asked the waiter about my order and he said he will check the kitchen. Minutes past and no answer, I asked another waiter to check what happen to my order. He went to the kitchen came back and told me that the order was lost and my food will be done soon even though everyone was almost done with theirs. I didn't want to make a scene because it was my friend's birthday and I didn't want to ruin her dinner even though she was annoyed with the staff. My food finally arrived and it wasn't artichoke dip it was a whole steamed artichoke. I told the waiter I didn't order this and he offered to take it back. I told him no because I was starving. I ate it, it was good but not as filling as the dip would been but they did give it to me for free! I just wished my experience was better.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 2, 'date': '2015-08-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kIXwsUOsVzuVtKRfmtYy7Q', 'review_id': 'UPdq_kAws3KbUntjMTceng', 'text': "Came with the family and everyone loved dinner. The staff is SUPER friendly. The menu is big and diverse. We had a bacon cheeseburger, Southern fried chicken breast, shrimp jambalaya and orange chicken. The food presentation was so pretty, we didn't want to eat it. (But we did and it was delicious!) Great ciders and beers. My only critique? Need more chips with the guacamole.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2015-08-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 's54bsdZ3dpvc-zHqNI2JkA', 'review_id': 'EO55MDoR-LCke3gCWwTC6Q', 'text': 'Great and pleasantly overwhelming beer selection! \nFood is pretty good. The House Mac n Cheese is pretty good.\nAlso, you cannot go wrong with the Street Tacos; they are all good;)', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2015-08-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xBxzxT24g2c9wekn6gI7wA', 'review_id': 'tW-jpbO8O7ro8IwuNJ7WUw', 'text': 'Great place to watch some college football! While service is attentive and game day atmosphere is on point, the food here is great, but not super special. I ordered the lunch combo which gives you the choice of 1/2 sandwich or 1/2 pizza with a soup or salad. I went with the roast beef dip sandwich that comes with au jus and a creamy horseradish. The sandwich was hot and gooey from the Swiss cheese. For the salad, I chose the classic ranch salad. This was fresh, crisp, and really satisfying! Definitely a 5 star side salad. I also ordered a side of fries which were decent (nothing special). \n\nOverall, if you\'re out shopping at Fashion Square, don\'t hesitate to come here, but if you are able to leave the mall and head to the less "chain" restaurants for something different then do so!', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2015-09-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6Wwyfr5coeoaQKpSwFV30Q', 'review_id': 'pyZTH4yJxr0ntsvS-s7neA', 'text': "I was surprised. I didn't think I'd like yard house as much as I did. Their weird menu really threw me off...what restaurant tries to do a little of everything?  In my experience,  you ought to stick to a specialty rather than do everything. I didn't try the sushi but the chicken noodle soup was hearty and good. Their boneless buffalo wings were good. The calamari is simple okay. Their draft beer choice is awesome. They even had my husband's favorite, orange blossom by papago.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2015-09-12', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'OiDuxCxCBkc3_gPDSf_28w', 'review_id': 'VAhDbD5DBGD-H0IDhE6JXg', 'text': "Ever have such a horrible experience somewhere that you think.... Hmmmm... Is this a hidden camera show? Yep, me too. Except I wasn't, it was just a really bad experience at the Yard House. \n\nI wish I could give it zero stars. Our waitress was named Amanda. Not only did she not bring us our drinks, she described the food as Panda Express-like (gross, I don't eat there), and she also never brought us our food. Instead, she rang in our order and had it delivered to the vegan table next to us. When our food finally arrived, BOTH OF OUR DISHES HAD HAIR IN IT. And my boyfriends order was wrong. And Amanda didn't bring us our food either. She actually only took our order. Then she never said a word when she dropped off the check, or when she picked it up. I was mortified at the whole experience. Please, DON'T eat here. We also mentioned to the manager on the way out how terrible the service was, and he just mumbled an apology. Oh, and we told him this while he was outside smoking. This was just a TERRIBLE experience!!!!", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 1, 'date': '2015-10-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FsC9Ycdf26KUTQAFcmR6CA', 'review_id': 'TUA1IaDwjSLVcJ97GDKVYg', 'text': 'They have lots of televisions for sports. Dark atmosphere great for watching a game or catching dinner after shopping. The siracha Bloody Mary was delicious! It came with a piece of meat on top :). Service was super slow and the food was good but not great.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2015-10-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VB-JgkbxjlaL2tHhndoKYQ', 'review_id': '5mQorP3uCWp8z6z9DE8TEQ', 'text': "Yard house is one of my family's favorite restaurants and I would say we frequently visit this location. Generally the service and food are great, but today there was a fluke with my dish. I don't think this reflects on the restaurant really as we come here a lot and I've never had a problem, every business has their off days. I'm picky about customer service and the manager on duty who took care of my check provided me with great customer service and spoke very well and for that a Yelp review is in order. Too bad the dish wasn't the best, but I respect the friendliness and professionalism of the staff.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 4, 'date': '2015-10-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0l14aD6M8yOH0OBxFwwDLA', 'review_id': 'qxWlCzQAYb3vLggZlaUtmg', 'text': "Me and my boyfriend had this for dinner tonight. We just happened to be at the mall and saw the yard house. We are here visiting from California and we have a yard house so we figured easy choice and we are so glad we did. We wanted to celebrate our anniversary with just a nice dinner together. The hostess and manager were at the front entrance and greater us so warmly I had think for a second do I know them ha but of course I don't were from outta town. So we were already off to a great start then our waitress Mackenzie B came to our table. What amazing service she was so sweet and upbeat and just cared. We had some great conversations, she let us know about happy hr and answered any questions we had. I cant believe she has only been their a few months, she is very knowledgeable of the restaurant  and I love that. We got 2 beers and like 4 dishes to share and we were so full, so much food, great prices and so good. Great dinner hands down. Thank you guys.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2015-11-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1jyNMw5sbi9Qkdd-WmI5Nw', 'review_id': 'VdliZyjh9tqm6zW3HMjyow', 'text': "We had a very disappointing experience on our last visit to Yard House. The problems started with the water and continued throughout the entire experience.  Let me explain. We arrived and were seated on the patio, we requested water while we looked over the drink list. The water arrived but one glass had some stuff floating in it. We brought it to the attention of our server and he replaced it, but it took a while to get the fresh glass. Then my husband ordered a beer which took a while to arrive. Since we weren't seeing our server as much as we would've liked, we decided to place the entire order at once, but requested the app come first and then the entrees. Well, all 3 things came at the same time. We weren't pleased and our server said he would send a manager over. The manager never came over. This could be because our server never alerted the manager, or because the manager didn't want to come over. I don't know, but I don't appreciate empty promises. My husband ordered a second beer, but it didn't arrive until AFTER he finished his entree. The server's excuse was that there were 32 tickets backed up at the bar. I'm fairly certain that he forgot to put the beer order in until we asked about it again. The least they could have done was send a manager over and in my opinion the last beer should have been comped or the app should have been taken off the bill. If we go again, I will not place an order all together because they don't understand pacing. I will instead order an app and wait for it to arrive before placing my entree order.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 2, 'date': '2015-11-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CdIbamDiZWrQrcLOjboJjg', 'review_id': 'HdfzalVsJyLczMf1uQ0CtA', 'text': 'Always great here.  Unlimited food selection, everything is always spot on.  The tortilla soup is a must try.  They will sit you near the football game you want to watch also. They ask ahead of time which game you want to see.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2015-11-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Xfe_WvL0rVP3yjD706KsxA', 'review_id': 'UielZQn8opOgt30n0bweMA', 'text': 'Great Service and food. Bartenders/servers are very tentative and there is never a wait. Food is out withing 10-15 minutes of ordering. One of my favorite neighborhood restaurants to grab a bite to eat and a drink.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2015-11-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'UaO0SRuNQaFjv0JEB8vzBA', 'review_id': 'u8QMb0XK-6ZBLo2gVh3Rkw', 'text': 'I love this restaurant. It has a great combination of food variety as well as a relaxing ambiance. The staff here has always been friendly, as well as the management. \n\n\nToday, I came in having one of those bad days, and the manager came up to me in a caring manner asking if I wanted any desserts on the house. I was astonished. He must have overheard me asking the host If we could sit in the corner not near as many guests. I was so touched. That speaks lengths about this company. I already love coming here, but now I will definitely dine here more often. \n\nNick was our server for lunch and was a sweetheart as well. For appetizers I recommended the ahi tuna with wontons and a avocado, or the crab, artichoke, lobster cheese dip.', 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 5, 'date': '2015-11-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9CX0ktYTZA8K6FS1Vhz_5g', 'review_id': 'Y3zAFnttP_dXLd1F3oX8qQ', 'text': "Definitely not a good experience and WILL NOT be back! Went here with Steven for lunch and we were super excited to eat and it sucks because we won't be back. The service and atmosphere along with beer selection was awesome but everything else was below average. Stared with the truffle fries which were good and Steven got the lobster macaroons which  was way to expensive and tasted like Alfredo with canned lobster on top and I got the ribs which tasted like it was heated up in a microwave. The waitress said the plate is hot (normally you can still move the plate not in this case) I went to push it further away and BURNT my fingers the plate was hotter than a fajitas skillet plate & was so hot my ribs sizzled on a normal plate, than my beans and corn sizzled along with it. $70 later not impressed.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 3, 'date': '2015-12-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rvIXicPgOPRxchMbFX9qZQ', 'review_id': 'cpkbzjExLK95ZZB8XWBD-A', 'text': "I came here with my friends and the atmosphere is nice but the service was kinda slow and the food was just ok. I wasn't very impressed with it to be honest. I probably won't come again.", 'business_id': 'UL3OMN_c-NXHlyb97pDifA', 'stars': 2, 'date': '2015-12-16', 'type': 'review'}
