{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6GsY9fBJHcf8UCwPCBuK4g', 'review_id': '_sW1ylFixD-qNuQ0x1p4yw', 'text': "Went to the opening today for lunch. Took a few friends to back me up. Staff was great and the food was Amazing! We didn't have any drinks since we were on a lunch break but I plan to come back this weekend and see what kind of crowd they have. Its a perfect place to kick back without the Scottdale DJ's or the overpriced drinks. Just great food, I hope the bar staff is just as great! I will follow up after my return!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-05-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': 'xFFmQTr0srCsnXiupIXT2A', 'review_id': 'WuGyp2E5yJZQ9rh95ytIpw', 'text': "I went to Bootlegger's on Monday for the soft opening.  Love the vibe!  Staff is very friendly especially Alyssa the bartender.  She knows what she is doing by keeping the conversation with customers and prompt service.  Fuller menu will be on Friday.  It is close to our house which we live at Shea/Tatum.  Glad something better is opening in the area.  Chef James Fox is an outstanding chef coming from the Mission and won grand awards both days at the AZ Taco Festival.  \n\nLooking forward to more late night options in the neighborhood.  You guys got this!  Congratulations and welcome to the neighborhood.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-05-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'eDWfJ5l0zUEEfLKEI9IPdw', 'review_id': 'iFyATASasGpav5Z2Xoruew', 'text': 'I was lucky enough to make it to the soft opening of Bootleggers this last weekend.  Everything I tried was amazing!  The corn on the cob was out of this world!  \n\nThe atmosphere was unique and comfortable, homey but still classy.  The wood for the walls and the grating over the bar made for a warm (yet super cold A/C!) experience.  \n\nI am excited to return and try new, wonderful BBQ dishes that were all over the menu!', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-05-15', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 0}, 'user_id': 'mApVxneKdoR7tnvSmtQZmQ', 'review_id': 'Uxiy_p6FjDjUrGSdhsRPAQ', 'text': 'I have to say Bootleggers offers a very nice atmosphere and nice service, but I stopped by on a Friday after work to find out there were no Happy Hours specials. That\'s a big negative since this place isn\'t sure whether it wants to be a "date night" dinner destination or a neighborhood pub. It resembles a smaller upscale Scottsdale restaurant, but the menu offers up mostly bar food. Ok, so looking at the beverage menu, it seems they have a nice beer selection. Too bad they were out of my first two choices. Oh well, I\'ll have to settle for my old reliable, Miller Lite. Whats\'s that...4 bucks?! Check please! Best of luck to you Bootleggers, I hope you make some wise changes before it\'s too late.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2013-05-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 4}, 'user_id': '1qdj_KsKTguk-vA4cVYMaQ', 'review_id': '85Gy-r77sbosTvm9zfbI9Q', 'text': "I give this a 5 star review in the context of the price point and execution.  Exactly what you'd want in a Bar & Grill.  PBLT is a must-have, cocktail menu is no-joke, wings are exceptional.  I anticipate becoming a regular.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-05-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 9, 'cool': 4}, 'user_id': 'ljR_XxzrJES4i4X5Mn-6Vw', 'review_id': 'V4ns_bE0D1UijwoEOvlm-A', 'text': "So very excited about the addition of this new gem to our neighborhood!  Great atmosphere and very cool decor...but the food...oh my!  Absolutely outstanding!  The nachos are in a class all their own.  The PBLT - that's PB for PORK BELLY, is one sassy sandwich.  Everyone seems to be doing pork belly these days, but not everyone is doing it so well.  This was so, so good!  My favorite, hands down, was the Crispy Rock Shrimp appetizer with cheddar grits, tomatillo sauce, green apple gastrique and tomatillo sauce with the most scrumptious little nuggets of crispy pork belly you could ever hope to taste.  My husband and I both agree that this is one of the best dishes we have ever tasted anywhere.  \n\nThe bar is also very fun and had some amazing looking concoctions that we'll have to try in the future.  The atmosphere is sexy and rustic, with brick and reclaimed wood and feels like a dark, cool oasis that will be a great spot to escape from the summer heat.  Featuring housemade moonshine in mason jars with all kinds of tempting combos like Apple Pie and Blackberry Peach it may be hard to choose, but I think the one with my name on it the next time will be the Tito's Mojito.\n\nOur little neck of the woods is really taking shape with Bootlegger's joining our other favorites 32 Shea and Sala Thai.   Maybe we'll be the next culinary hub!  That said, even if it wasn't in my backyard, I would frequent this new gem!  \nGo here.  You need this.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-05-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'D0ZTDnjsXdKDHd5UM9XZiA', 'review_id': 'WQUXDraDgV4jNPmPdRymKg', 'text': "Great new place to take friends! I have been there for dinner and also, just snacks/drinks. We had the fabulous nachos, ribs, burger, etc. I refused to share the peach cobbler, but our friends shared a sexy, creamy milkshake for dessert. We had so much food that we had snacks for hungry teenagers the next day! I DO recommend  the 'If you see Kay' red wine blend with the burger!!!!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-06-10', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 4, 'cool': 4}, 'user_id': 'KSBFytcdjPKZgXKQnYQdkA', 'review_id': 'dzur30AicdB3zRNPceX2xA', 'text': 'Cudos for bringing more Mojo to 32nd and Shea.. I have street cred when it comes to this area, My mom used to drag me around the AJ Bayless in a cart when it was the only supermarket in North East Phoenix, I remember having my tenth birthday at the Dairy Queen in that shopping center after a great night at Legend City.. I had my first Cheesesteak at Uncle Sams in 1979.. I also remember the shattering of this area when the 51 came in and closed down 60% of the businesses in this area, so the Bootleggers location is the little engine that could.. I love the fact that Uncle sams still thrives, the addition of Shea 32, and Sula are great as well.. But alas.. my thoughts on Bootleggers:) If you get anything.. Get the Nachos... There must have been two whole avacodos on these beautiful mounds of chips! The PBLTA was figgin ridiculous.. I love how Lori expresses how expensive this place is.. Umm Lori HELLO..Stop comparing this to the abortion known as Area 51.. The other restaurants went out of business serving the same ole Budlight, fried wings, and Sliders, ever other Sports bar in the city serves.. This is way more like a Gastro Pub, The food was reasonably priced.. (Although a Happy Hour would be stellar!) Oh yeah.. Ten bucks for a burger is not expensive.. Just sayin.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-06-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 3}, 'user_id': 'm3xEaoe7mltR_c5kwb5AFA', 'review_id': 'gFo0MuNrIen3N4rcfMiTcg', 'text': 'I stopped here for lunch yesterday. Decided to try the wings. WOW-We had a dozen for $8. Great pric- Big drummers and only 1 flipper- The flover we had was the PBJ and the other was the Dijon BBQ- They were really great an we had them grilled. Had a sideof slaw- good and the  4 cheese mac and cheese- very rich. \nIt has been really nice redecorated and we sure will be back. .\nalso killer martinis. \n\nSo glad this place has been revamped to a nice place but not really pricey for the area.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-06-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': '_1M2A8MUoDKfQ5jTHJROzA', 'review_id': 'h7gGpDLSbUlyBIrFb-SzYQ', 'text': 'The ribs are super excellent smokey goodness. The smashed potatoes have smoke gouda on them for the win!  The asparagus was perfectly cooked yum yum yum! The apple pie moonshine tasted way better than expected.  Friendly waitstaff, great ambiance and comfortable decor.  Two people $46 with tip.  Well worth every penny.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-06-13', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 0}, 'user_id': 'PXWap915We8Ppw9R48eY3g', 'review_id': 'ZEaBccwINHuPKj_QsyWJyQ', 'text': "We were very excited about the opening of this restaurant. Unfortunately, we thought the food and service was worth only one star.  \n\nThe restaurant was not super busy but steady when we arrived. The hostess was nice and immediately walked us to our table.\n\nThe staff was rude and very short. Our server never checked on us to see if we needed anything. If we were lucky enough to be able to flag someone down to ask for refills; we never saw them again. We watched several people at different tables get up and leave because the service was so bad. These folks just threw cash on table for there drinks and left. \n\nAs for the food, it was cold and did not look appetizing. For the same money, we would rather go to Houston's...you always get great food and service. \n\nWe do not understand how this place received the amazing reviews.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 1, 'date': '2013-06-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'rXghmXPfM8Bmzqn-v5UGgA', 'review_id': 'KAu6DbQqI3qZbtuQXgWEpA', 'text': "First time visit tonight (A Saturday night). It's a really nice place inside, but still casual. I like that they have some good craft beers, not just the usual domestics. The place will gain more popularity, I'm sure, but they do have some kinks to work out. The waitress told us the St. Louis ribs were pork. Luckily the co-owner(?) clarified that they're beef because I really only like pork ribs. The nachos are killer, with big chunks of beef. The corn appetizer is awesome. Our burger was good. Our bill was $56 for nachos, corn appetizer, 4 craft beers, and bootlegger burger (shared). Service was a  little sketchy. It took a little while to get another beer, and to get our order in. To be honest I think we just got the 3rd string waitress. But we'll definitely be back. Great food and great atmosphere.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2013-06-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 6, 'cool': 1}, 'user_id': 'kmjYN9Hi1Q8nPGcElxXi7A', 'review_id': 'C8Mq3OUDAIHvzNsaPlzASg', 'text': "Have you ever been to a place that you REALLY wanted to like? It's close to home, great atmosphere, great ambiance, ambitious menu, and you hope this could be a new place to frequent but the food turns out to be not that good/borderline bad. That was Bootleggers for me. \n\nFirst, \n\nMy friend and I ordered the nachos, the pork belly sandwich and the wings half in the miso glaze and half in the peanut butter and jelly glaze. Everything was over cooked and I mean everything. the pork belly came out dry, and the wings were almost inedible because the miso was reduced to pure saltiness. The PBJ wings had no flavor at all. The wings did seem fresh and were all drums which was nice. \n\nI will say the Nachos were pretty good. tons of guac, sharp cheddar and pork but the pork didnt really shine in this dish. \n\nto be fair, It seemed like all the food was almost there but not quite. We told the waitress the wings were bad and the owner came out and said he tasted the sauce and we we're completely right, apologized and took the wings off of our tab. I couldn't ask for a better response and because of him I will be willing to try Bootleggers again after the kinks get worked out.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2013-06-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'lG6Q5OvamVHUSk9MPE6Q4A', 'review_id': '2ZsjsX0jvNSr1MIqk_7YLA', 'text': 'Heavens me, that was a great burger!  Service was attentive and helpful.  Music was spot-on.  Beer selection was decent, could offer more distinct/local beers.  Yes, this used to be the dirty drummer.  Dispel all notions of that dive from your head.  Bootleggers has nothing in common with it.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-06-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': '8aBoNgjAi8cn15UsoHWQFw', 'review_id': 'D_YKlCygc0y73OKmaSmv0Q', 'text': u"I'm excited for my next trip here to eat dinner!  My BF and I stopped by here for a nightcap after I read a small write up on AZCENTRAL.com.\n\nThe d\xe9cor is awesome!  Very warm, inviting, and laid back!  We sat at the bar and were happy to see a bartender that we knew from a previous establishment.  Choosing from their selection of hand-crafted cocktails, we ordered a Tito's Mojito & French 77.  Both were DELICIOUS but I had a taste of the Motito and had to have my own for round two.  \n\nEverybody sitting next to us was scarfing down their food and it smelled wonderful.  I can't wait to become a regular here!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-06-19', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': '7jWmd57QoJnq2q4QyvVS2Q', 'review_id': 'hUQkbtjyBwC35xPhHlYpsQ', 'text': "Went here on a Saturday evening after hearing good things. It's located in a old strip mall. From outside doesn't look like much but don't judge a book by its cover. The inside is very inviting with large tvs, and a dark modern decor. \nLuckily we had called ahead and made a reservation because there was a 20min wait when we got there. The total seating is on the small side so I'd recommend calling ahead. \nThey're still working out the kinks and getting up to speed because the service was a little erratic. From wrong drinks and food items being brought out, it took a while to get everything sorted. \nTo start we ordered the nachos flat with avocado and pork. It was awesome, would def recommend. We also tried the Mac and cheese with fusilli pasta. Also recommended! \nFor entree, I had the PBLT, pork belly lettuce tomato sandwich. It came with just house made chips, I would've liked an option of fries instead. The pork belly was well cooked and moist but tasted very salty. I'm not sure if I was being sensitive but I could only finish half the sandwich. \nOverall a good meal for the nachos and macncheese. Wish there was a happy hour to try as well.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2013-06-19', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 0, 'cool': 0}, 'user_id': 'QfMkmIcJVAiKYgItdX5D5A', 'review_id': 'k6ysUvyZ2EaT4ksgJDZkiA', 'text': 'nice remodel.....food not that great.....we had ribs, chicken and pork chops tonight....chicken undercooked...taken off bill.....mac and cheese side good', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 2, 'date': '2013-06-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': 'WrP60_4xzolbZ4J0jteLJA', 'review_id': 'J8fKi1-BSqvMIAbZkoFaxg', 'text': "Tried Bootleggers for the first time last night. Food was very good and fresh. Had the bacon board and nachos for an appetizer. Both were amazing! \n\nAfter those heavy appetizers I had the cobb salad for my entree. It was also very good, very fresh!\n\nMy only complaint were the drink prices. $9 for a low ball jack and coke? We are not talking gentlemen jack or single barrel! Regular jack $9? Last time I paid that price was at the Phoenician Resort. Take note Bootleggers, I won't drink there until you fix it!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2013-06-25', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 0}, 'user_id': '0Pdx57HISV8nEUws1AWLqw', 'review_id': 'KbNeZDp5_x-b6w_BlvmaWw', 'text': "Sat at a bar table and once seated, the table rocked like a boat on a rough sea.  It was so bad, I worried one false move and you would be wearing your drink and/or dinner.  Scott arrived at the table with waters and as he placed the glasses on the rocking table, I asked what is wrong with this table? He said, it's rocking and left.  I thought perhaps he was getting something to stabilize it, but he never returned.  It was at that point I realized how condescending and rude Scott was.  Hoping the waiter could rectify  the situation, when he finally showed up to great us (it was not a busy night).  I expressed my concern with the table and he offered to move us to another table.  At this point, I decided I we would never return.  Between the two of us, we only ordered one drink, paid for it and left.  We had full intentions of having dinner and drinks.  Of course when it was time to pay, the waiter said he was very sorry about the table and he would tell management it needs to be fixed (guessing he knew it was tip time).  A little too little too late.  A packet of sugar under it would have done the trick.  We ended up going to Postino where it's always a good experience there.  For that area, the prices seem to be a bit on the high side as well.  I live near by and was really hoping for a cool place close to me.  Highly disappointed.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 2, 'date': '2013-06-27', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 4, 'cool': 2}, 'user_id': 'ehzo8dvKCQNAmyo0avqEMg', 'review_id': 'aeYCk2XaGV-Q1Eh4hIHQoA', 'text': 'My new favorite place in the Valley... Get here as soon as you can before everyone else finds out about this joint.\n\nLet\'s start with the atmosphere:  I couldn\'t believe my eyes when I walked in... the last time I was at this location it was called the Dirty Drummer and that is exactly how I felt when I was in there, "Dirty"!  Now it is totally western chic\'... Think what the wild west must of looked like 100 years ago, then add some really cool touches as if Christopher Lowell got his hands on the joint.  You know where I am going?  Trust me, the place looks amazing, just don\'t be intimidated by the outside.\n\nNow to the service and food:  Like I said, this is my new favorite place for a couple reasons, the amazing service my wife and I received and...  wait for it...  the Bacon Board.  You heard me right...  the Bacon Board is totally unique and amazing, they really put their back into this effort and everyone should give it a go at least once.  I love how it flies in the face of other "uppity" joints with their $50 charcuterie boards.  Trust me, you are gonna love it, just be sure to double up on your Lipitor before you go.  The rest of the menu items are really well thought out and unique.  My wife had the Salmon over Kale and it was prepared perfectly and she loved it.\n\nFinally, if for no other reason at all... Go for the Moonshine.  Seriously, how many other places have you EVER been that serve good ol" American made White Lightning?  It is gonna blow your socks off, first for the amazing smooth taste and flavor and then for the buzz you are about to have.  Again, just trust me, try the flight of 3 and let the bartender pick out the flavors, you will be hooked just like Betty Ford was.\n\nEnjoy, I know you will!', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-06-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'fJDuIWyG2QO1ul0n_u4rYQ', 'review_id': 'F3_4LDSctgpqJPtVnFY29w', 'text': "Everything was great!  Atmosphere and food are top notch. The bacon board and sweet corn are spectacular.  My only disappointment is that I live in California and can't eat here all the time.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-07-03', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': '3U6yfkk_VulP9kh6VOf3gQ', 'review_id': '6jaVtQWnNDB4XQq49pJuHg', 'text': 'Bacon board and apple pie moonshine. Nuf said.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-07-03', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 11, 'cool': 10}, 'user_id': 'fczQCSmaWF78toLEmb0Zsw', 'review_id': 'x6gxrz8Hh3SwxFLlBgeRbA', 'text': "In the spirit of Independence Day (which was yesterday), I'm writing this review about my new favorite good ol' American restaurant in the Valley...\n\nI've been to this hidden gem twice so far and despite it being a tad bit out of my normal 2 mile radius, I'm sure I'll head back again soon.  I love that Bootleggers offers a very diverse menu.  When I went for lunch, I was wanting to be healthy and I ordered a kale salad with salmon.  The portion was huge, filling, and delicious.  The salmon was cooked to perfection.  In addition, there's a secret crunchy ingredient in it which I love - you'll have to go try it for yourself to see what it is!  \n\nThe next time I went was a few nights ago... it was date night and my husband and I decided to splurge and order from the not so healthy options on the menu: chicken wings (we went spicy on the wings, but there are several flavors to choose from), brisket nachos, and a burger.  We ran into some friends there that joined us and wanted to share, so we added two kale salads and a side of asparagus to get our veggies in!  It was all so good that we ate almost every last morsel between the four of us.  We washed it all down with a few beers.\n\nI like the recently renovated prohibition ambiance.  (Ask about the wood used throughout the restaurant and the windows on the wall, which have quite a bit of history behind them).  Bootleggers also has friendly service from the hostesses and the wait staff. (Alex was my server both visits).  It was a tad bit slower when we were in for dinner, but it was also packed that night.  And finally, while I'm not a moonshine drinker, those that are will be happy to know that there is plenty of it to choose from!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-07-05', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 0}, 'user_id': 'z4tCzlLOg8AeMvo25p8O2A', 'review_id': '2rzo8zEuuzIaoDFoppGxAQ', 'text': 'I was excited a new independent restaurant opened around the corner from my house. \n\nUpon being seated at Bootleggers, my arm stuck to the table. It was difficult to get anyone\'s attention to come wipe the table. https://www.yelp.com/biz/bootleggers-food-and-drink-phoenix\n\nWe ordered the Crispy Rock Shrimp appetizer, which was very tasty, yet a very small portion for $10, for 10 marble sized shrimp. \n\nOur dinner was comprised of Beef Brisket, Turkey Leg and Cottage Fries.\nThe cottage fries were horrible. They tasted like they were a cheap brand, frozen from a bag. In fact, I buy frozen Ore-Ida fries that are far superior. These were below school lunch grade. I suggest the Crispy Ore-Ida Crinkle Cuts. They are fantastic. \n\nThe Beef Brisket was unlike any I\'ve ever eaten before, and I would never eat this one again. It was cut horizontally, against the grain of the top of brisket. It was one 1/2 inch slice. It looked more like an elongated piece of liver. It was very dry and barely tasted like brisket due to the cut and thickness. The turkey leg was very small, maybe 7" long and was also quite dry.  I\'m no chef, but I can make far superior turkey, brisket and Ore-Ida fries at home. \n\nIt seemed that the kitchen was very backed up. All the tables were full and everyone was waiting for their food, as well as the servers were waiting and starring into the kitchen.  It seemed that the kitchen was struggling with preparing food for the bar buffet, and dinner service.  After the bar buffet was replenished, table service began to flow. \n\nOur server was friendly, yet very inattentive. I had to wave my drink several times to get the servers attention for a refill, and then when it came it wasn\'t what I was drinking.  I gave up on trying to have it corrected. The servers passed quickly through the tables without looking or acknowledging their tables. \n\nThe table next to us had issues with their service and getting their full order served as we exchanged exasperated glances. It wasn\'t until after they were ready to leave that the last dish was finally brought to their table. \n\nI couldn\'t wait to get out of there. If only I could get the servers attention to bring my check.  Finally the server had brought out about five checks, picked them all up and rang them all out slowly at the same time. \n\nI wish Bootleggers all the luck in the world and hope they can make it, and then make it better.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 1, 'date': '2013-07-05', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'bp07IueJXHU1PgwAdoVbVQ', 'review_id': 'BKhBTVKdddwc534f2ESwzA', 'text': 'Went for the first time last night.  Love the atmosphere.   Service was excellent.  I only ordered cottage fries and the chips and queso dip.  Fries did not seem fresh.  It was weird, some of the fries were hot and some cold.  It was as if they mixed old fries with new.  The chips were delicious but the dip was bland with no seasoning and I could not taste any sort of cheese.   It was pretty bad.  I came here for a drink and not to eat so whenever I want a drink, this is my go to place because the service and the atmosphere was excellent.  Just wish the food was up to par.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2013-07-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'QmTJzZSoCIPb3JwKAKVM3g', 'review_id': 'vb_SeZYaGy_4IlJ24kzm4Q', 'text': u"Awesome gastropub in the 32nd St/Shea corridor. Went on a Friday night, every dish we ordered was amazing. Great selection of drafts. I had the Kale salad, braised kale side and salmon entr\xe9e. All three were perfect. My friends had the barbeque brisket and pulled pork, and both were awesome. They had a different kind of cole slaw, vinegar based, light and tasty. The cobbler and the cherry shake were great finishers. A great addition to the neighborhood, along with Rusconi's it's a major upgrade. I'll be back.....", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2013-07-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'AYRv5k9H2w7VNI1X-9fM3A', 'review_id': 'epeqdWnz0yE76ioUEvC5Qw', 'text': 'Finally something cool opened up in this location. I vote they bulldoze they entire block and expand an outdoor bar / restaurant. Good beer and good food so far.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2013-07-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'VlpwSHJnXruY2nWJMcvg7A', 'review_id': 'xg-cNAlJtY1uCU0xVdfqNQ', 'text': 'Only going 4 stars \'cuz no self respecting BBQ joint would want a 5 star rating... \n\nStopped in here today based on previous Yelp reviews and let\'s face it... it\'s just too hot to do a proper BBQ brisket and not get paid for it ;) I called my buddy up and we agreed to meet here for lunch. \n\nIt was a good call :)\n\nTHE PARKING LOT SMELLED AWESOME... smokers ablaze and hints of what was to come... my English teacher would have called it foreshadowing...\n\nI arrived first and was happy to see there were some customers already at the bar and in a few of the tables around 1PM on a Saturday afternoon. It\'s always a little daunting when I walk in and am the only guy in the place. As soon as I walked in, I saw a guy sitting at one of the tables jump up as if to greet me but I gave the "I\'m going to the bar" signal and he was all "cool". ;) A plus in my book today as it told me right away that they are a little less formal than your regular restaurant, but still want you to feel immediately welcome... like showing up at a BBQ should be. \n\nI walked down the length of the bar, past a few regulars and overheard conversations of vacations in the islands and a few comments that sounded like "MMMM.. you gotta try this... wait, never-mind, get yer own..." etc. until I found a couple of open stools... I snatched \'em up and was instantly greeted by a bartender singing lines of county songs and twinkling her eyes as if to say "Heya". She got me a beer and I looked over the menu while I waited for my buddy. In the time I waited, she didn\'t pressure me with the "specials" or even really offer much about the place, and normally I would kind of like a little guidance in a new place, but this is BBQ... if you don\'t know BBQ, what the hell are you doing in a BBQ joint?! I was cool with it ;) What I really liked was that while there were some TV\'s and such to occupy my wandering eye, the place was also EXCELLENTLY decorated with light fixtures with actual fillaments... some in mason jars, some in old fan housings. There were overhead beams of solid wood and metal that gave a standard strip mall space some REAL character. I gotta say they put some good thought into the design. And while there are TV\'s, they were not in the way to distract you from the people you came to enjoy a meal with. That said, this is not the place to come watch TV. \n\nBuddy arrived and we were both happy with the choices on the menu... PLENTY to choose from. All the standards and a few unique items to choose from. I got the pulled pork sandwich with coleslaw and chips. The coleslaw was NOT on the side... it was on the SANDWICH as it should be for a proper pulled pork sandwich. And I gotta say the bun was perfect. It was bakery fresh and toasted and held up until the very last bite... never got soggy and never fell apart... even though my face and hands were almost always in need of a napkin. The pork was tender, JUICY, and the sauce was the right mix of sweet, savory, and smoke... though I would usually add some spice living in the southwest... but it was a nice change of pace and reminded me of what BBQ is like in the rest of the country. Didn\'t realize I missed it \'till I had it again. \n\nMy buddy had some really tasy Beef Brisket. Now he and I are known in our circle of friends as being able to produce some excellent smoked brisket, so I am always wary of ordering this from a restaurant as its just a difficult thing to keep moist, smokey, and tender if you don\'t pay attention to the details... A couple bites and I think we agreed these folks are doing it well. Better than most really, in my humble opinion. Certainly better than I\'ve had outside of my or my buddy\'s backyard.  \n\nI also ordered a shot of the house homemade apple pie moonshine. Lemme tell ya fellas, get one. Just shut up and get one. Good stuff. You\'ll think it has no alcohol at all but me and the buddy just spilt it to see what it tasted like and we could both feel its affects in a minute or two. SMOOTH is not the word for it... more like sneaky! \n\nWe also tried the Mac n\' Cheese... which was almost overkill at this point but still... a must try... served in a cast iron skillet, with fusilli pasta instead of the usual elbow macaroni, it was a great side to put things just over the top. Creamy, no usual breadding to get in the way, but a nicely browned cheese topping to again bring a little of the BBQ to the dish. \n\nWe maxed out and leaned back in our barstools... and had a couple more beers. \n\nThanks for lunch, Bootleggers. Bettin\' we\'ll be back again soon.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2013-07-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VcAQSGLgTI0RBjrHlePWow', 'review_id': '3OGpGJ0v48jK1-eiAykGWA', 'text': 'Great food, friendly people and outrageous peach cobbler! I will be back!', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-07-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bWZiW9l1Q87uBOYo7mPA4A', 'review_id': '7V5dmourYRqg3q34uj8bxw', 'text': 'Crazy amazing! This establishment was transformed into a warm, cozy environment. For those who have visited the old stomping grounds, will be blown away with the changes. Our waitress Kayla was outstanding...she paid attention to every detail, had a beautiful smile and the service was spot on...very attentive staff. I loved the cobb salad & peach beer...will definitely be back for more. To end our tasty dinner, we ended with a chocolate ganache topped with bacon and a side of sweet ice cream & berry pieces that had to be the best dessert we ever had. We look forward to our next visit. Wow!', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-07-16', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 1}, 'user_id': 'sHm-7z3G1khyznqSCHhDYw', 'review_id': 'AZ_jYIfghOorfHWgOaJXmw', 'text': "First of all, Robin our server was fantastic! She was friendly, funny, knowledgeable, and didn't steer us wrong on any of her suggestions. My  friend and I just tried this place for the first time because of the bacon board appetizer. It was absolutely delicious. I started with their mojito, which was one of the best I have ever had. my friend tried some if the different moonshine flavors amd the copy cat cocktail. she enjoyed all of her beverage choices. I then had the house smoked turkey open face sandwich and my friend had the crispy chi ken sandwich. We both thoroughly enjoyed our sandwiches. Lastly, we shared the peach and blueberry cobbler with vanilla ice cream. It was delicious and a great summer dessert.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2013-07-21', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': 'ngnrTCBbOqnvaaneg2KXKw', 'review_id': 'onMHW7NcmzV__kdbUpEqtQ', 'text': 'Great BBQ! AMAZING nachos. Fun decor and atmosphere. Better for lunch.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2013-07-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Ue9mYNOxPcicrU_UzhGluQ', 'review_id': '9x5XGkhzFAQqTmUoafgmaw', 'text': u"One of the best burgers I've had in a long time. It was a random night searching yelp in the area for food. Found this place with good reviews and thought to give it a try. Neat country steal d\xe9cor serve beer in mason jars. (nice change)\n I had the Bootleggers Burger \n 1/2 lb seared patty, house sauce, muenster cheese, whiskey onions, crimini mushroom, slab bacon, on a pretzel bun\nYeah it sounds good and tastes great I love the pretzel bun\nwell seasoned and messy a must try", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-07-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'SzyhKws7WauKk-nWnYDLug', 'review_id': 'rMC2CGXk9tV25KpNR3LdFg', 'text': "Driving North on 51 at lunchtime my husband remembered an article he had read in the Scottsdale Republic Magazine about this restaurant at 51 and Shea. We aren't in this area often and took advantage of trying it since we were right there anyway. Being an ex-Kansas City person, he loves BBQ. We looked at the menu and the chicken sandwich (not BBQ) sounded so good (he says it was) he had that instead.  Another reviewer is correct, just the aroma of barbeque in the parking lot is strongly tempting. (Too bad they can't  blanket the area with the smell, it'd be great for business.)  Don't eat meat so I had the grilled fish sandwich and was quite satisfied with it.\n\nOur server, Nathan was new on the job, think  he said 1st day, but he handled 4 or 5 tables handily.\n\nNew restaurant, only open two months, but I would like to see them succeed.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2013-07-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'VpRR1mcbK4FahWifr2mpYQ', 'review_id': 'Lmtn_7sIvoEMqMaPs3RFMQ', 'text': "We live just down the road and first came here the day it opened- my husband happened to remember it was opening.  Their menu was pretty select at first as they were testing a few things out.  In the testing stage, it was good (limited BBQ though) and we were able to offer feedback on the dishes we got.  We came back a couple weeks later and they had added more.  Even better than the first time and more BBQ.  They now have a full menu w/ lots of BBQ and we've eaten off of it a few times now.  It's all really good.  I had the turkey melt last night (with smoked turkey-- no deli meat here) and added avocado.  It was really freaking good.  My husband had the side of mac and cheese and a side of asparagus... don't ask... but he loved them both and was full.  They serve great beer (including Four Peaks, my favorite) on draft amongst a bevy of other things.  We would really like to see this place succeed, especially because they finally poured money into remodeling this place.  Since we have lived in the area (since July 2011), that place has been about 5 different things (and previously was the old dirty drummer long ago) and every owner kept it the same dumpy place inside and just changed the name.  Now it's actually a cool spot to go hang out at, even if it's just to enjoy a beer or two.  Wait staff is friendly and you can smell the BBQ from the parking lot.  You should definitely try this place out.  We've been at least a half a dozen times and will keep going back.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-07-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'M-549dhzF9G6GmOxSGkkjA', 'review_id': 'c3_6OMQrAJV-5f-wdk8hhg', 'text': "Excellent addition to the neighborhood!!  The cocktails were delicious especially at happy hour.  I had the ribs.  I do some smoking of my own and I gotta tell you these were about the best ribs I've ever had.  The smoked chicken wings done traditional style were also fabulous.  My wife had the beef brisket which was a little dry because it looks like they put it on the grill after they slice it.  Overall I'm delighted they are here and will be back.  Nice ambiance and they do take out!!  The service was excellent.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2013-07-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': '68cAcBB9MeZD9G-jWIi6Uw', 'review_id': 'ynzOK7oni667DZMvuwEBow', 'text': "A girlfriend and I visited here for lunch today and it's always amazing to me that in Phoenix, so many neat places to eat are housed in generic strip malls that you would never know are there. I almost missed the turn off just off the 51 but made it since there are two entrances into their parking lot. Ample parking outside and somehow missed the BBQ smell as I walked up. Upon entering though, you realize this place is way cooler than most strip malls restaurants. The atmosphere was really nice with big booths for larger groups and plenty of tables. The lighting was great and reminded me a lot of the decor that's popping up all over Phoenix at places like Central Bistro and even Olive and Ivy a bit with their cool filament light bulbs.\n\nWe were invitied to sit anywhere and we opted for a booth/chairs table along the back wall. The booth was comfy though it was a bit chilly in the place. I need to start remembering to bring a sweater to restaurants during the summer! Everything on the menu sounded really good so we opted for the grilled corn as an appetizer and I ordered the pulled pork with a side of the 50/50 potato salad and my friend ordered the brisket plate and a side of mashed potatoes. Our waitress, while handling what looked like 10 other tables, had perfect timing except for the one time we needed a Diet Coke refill and we had to flag her down. Other than that, she was great, friendly and always had a smile on her face.\n\nOverall I thought the food was pretty good. The corn was a bit disappointing because I'd hoped for more street corn with the creamy sauce drizzled on it but rather got two pieces of corn with some jalepeno spice that made it really hot! I'm a bit of a weeny when it comes to hot so I only ate half but the corn did have good flavor. The pulled pork was really good and I loved their coleslaw. Slightly sweet with not too many ingredients. Also on the plate came with two tortillas. It seemed really strange at a BBQ place and wasn't in the mood but my friend said they tasted like...surprise!...a tortilla. I had expected a slightly more 'deviled egg' potato salad based off the ingredients list so it seemed to lack a little flavor so I probably wouldn't get it again. My friends brisket on the other hand was delicious! Coming from KC, finally there's a place in Phoenix that holds up to some of the BBQ you can get there. The meat was super tender, great sauce and I think she got 4 or 5 slices on her plate.\n\nOverall, love the atmosphere, fantastic service and I'm excited to come back here for more BBQ! I also just realized there was a Local Dines certificate to this place so I'll definitely be coming back more frequently even though its a bit of a drive from downtown.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2013-07-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 5, 'cool': 2}, 'user_id': 'AuQ28IMcqAloDmlFI7CKoA', 'review_id': '4tFpoVCiM_3eehASHoOz2Q', 'text': "Have stopped in here twice now and see plenty more visits in our future. The first time was just a recon. Had a couple of drinks and some wings. The wings are very tasty, but we still long for the old dirty drummer wings...\n\nLooking at the menu that night only convinced us that we had to come back and try a real meal. \n\nWell, we returned with my son and it was actually quite a challenge to figure out what to try. Jeannie went with the pulled pork sandwich, while my son and I went for the PBLT...pork belly, lettuce, and tomato. AMAZING!  Our only complaint is that we couldn't eat more! I had half of Jeannie's sandwich and half of mine.  Both were incredible smoky eats! Tasted both the home fries and the homemade chips. Suggestion: go with the Chips and don't get filled on fries. Save as much room as possible for the exceptional barbecue.\n\nBoth visits were also marked by very attentive staff. This is not a cheap neighborhood eatery. Bootleggers is a place you will feel comfortable bringing friends and family....especially to impress with a great spot to eat. \n\nSaw they are gearing for new happy hour options....can it get any better? :)", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-07-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'VlpwSHJnXruY2nWJMcvg7A', 'review_id': 'z_ufCQ17fy0Y0-nnuL7rVg', 'text': "OK... had to add that 5th star, cuz it's only been a few days and I'm already craving that pulled pork sandwich again. That flashback factor is awesome. :)", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-07-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'h4knhUbSSxwLs7XtEE_pbw', 'review_id': 'ukRSgfYMPV2YAa0E7BS8CA', 'text': 'We recently tried this newer restaurant in NE Phoenix. It primarily serves BBQ, but the atmosphere (and prices) is rather different than most pork and rib "joints."  Our visit may not have been typical: if you like beer, stick with what is on draft; the wine is very expensive for this type of establishment.   The entrees are a la carte and rather expensive for what you get - a slab of meat on a plate.  The only exception is the burger which was very good and came with chips.   No bread was offered.  It took quite a while for our entrees to arrive yet there were few occupied tables. My husband\'s steak was good, but my son\'s brisket was dry.  Our server was friendly and courteous but needs to improve her knowledge of the bar offerings (different types of beer, etc.).   They should lose the 1965 Bob Dylan music.  Although we were so pleased to see a non-chain restaurant open in our neighborhood, we don\'t plan on returning.  The overall experience did not justify the prices.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2013-07-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': 'XqDh0QDMoMAaBvJcakze5A', 'review_id': 'Qx_KiaRZxkCe9ETujSEAWA', 'text': "This restaurant is spectacular. The food is great and the staff is both professional and welcoming. You can relax on your lunch break  or come back at night with that hot date. If you come at night be sure to ask for Lauren because she is awesome! She remembers my order every time! Also if you didn't already know this they are a great destination for large groups. This past weekend I brought in two groups of over 20 people and it was a fantastic experience! Long story short...Bootleggers comes highly recommended!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-07-31', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 0}, 'user_id': 'sYidJ6jraZjE18eMi8ouNA', 'review_id': 'WM4EO9M_VTjxmyKLJdqdNw', 'text': 'Not impressed.  Barbecue sauce was to "ketchupy"  side werent good either.  Maybe I need to go back, my feeling is that it is a good place to drink bc they have "moonshine", but I was not impressed.  If the reviews still hold at 4 stars in another 6 months I may have to go back...always an optimist.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 2, 'date': '2013-08-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'PhWqfjSTannHUGbJSGFWYw', 'review_id': '2T7zOOqwRubYBZGPAQiNHg', 'text': "My husband and I found this jem on the Yelp search for BBQ. We try to eat healthy most days but allow ourselves one meal we've been craving on Sundays. Oh boy did we hit the jackpot with Bootleggers Food & Drinks! From their home made moonshine, to the bacon board appetizer (yes, I said BACON BOARD), to the ribs & pulled pork sandwich entrees - we were both in hog heaven - pun intended. The food & drink were great! The location is in a small strip mall on the SE corner of Shea and the 51. Formerly the location was a Dirty Drummer and I am told - quite a dive. However, the modern-rustic hip decor was super sleek!  And couple all of that with spectacular service...we will definitely be back and next time with friends in tow!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-08-06', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': '7op0fmvXG6XydXF_d7kkKQ', 'review_id': '3y1OGkDmpHkAqe6tuHilHQ', 'text': 'Oh goodness, a dinner that included moonshine and a bacon board. A board that included five different types of really tasty bacon. Service was slow but good. Food came out fast which is a positive and negative if your table is small. Paleo heaven with tons of meat and veggies - excellent asparagus and green beans. Make reservations and try the Apple Pie Moonshine!', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2013-08-10', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 0}, 'user_id': '9zDVfc4wjY2U4XSjb2CPXg', 'review_id': 'fJyle56WRZvzzBpoDB6f2Q', 'text': 'I went here after ChowBella\'s numerous tweets about how good this barbecue was. I\'ve gotta say, I was unimpressed. This is not real barbecue.\n\nFirst, the good:\n-Cocktails were well done and $2 off craft cocktails was a nice special for HH\n-Pickled veggies that came with the wings were very good, and ample (and also unexpected)\n-Once we were actually able to order, the food and drinks came out in a reasonable amount of time.\n-The food was pretty good; the cole slaw that came with the meats was very good, and so were the accompanying tortillas which were good enough that they could have been house made\n-They did comp us some drinks for the poor service\n\nNow, the bad:\n-the service was awful. Showed up at 5:25 and the first two of 8 were there. Got our first order of drinks fast enough, however, we did not see the server again until 6:05 (having 6 more people show up and get ignored for 20 minutes was inexcusable), which was conveniently right after HH pricing ended. We tried to waive her over several times from 5:45-6 (which was answered with "I know, I\'ll be right over").\n-Chicken wings were good enough. Advertised as "cold-smoked" they tasted like regular fried wings. We ordered the PB&J flavor based on the server recommendation; they were fine, but I\'d opt for traditional next time\n-A friend and I split the Brisket, Turkey, Mac&Cheese, and Green Beans. When our food came out, we got the Brisket, Pulled Pork, Mac&Cheese and Smashed Potatoes, so we sent the wrong ones back and (eventually) got the correct food. \n-the brisket was tender and nicely seasoned, but lacked in smoke flavor. It was also glazed with a barbecue sauce after having been sliced \n-The turkey was nice and smokey but had a bit of a cold cut vibe to the thin, uniform slices.\n-Mac&Cheese as overly salty; we had two kids order some at the table, and the kids version did not have the Parmesan topping leading to a nice seasoning level\n-The comped drinks simply made up the difference between what we should have paid (if we had decent service and got an extra 5 or so drinks as well as wings at HH price) and what the "original" bill had us charged at\n-I\'ve never been a huge fan of Southern Pride smokers (although the aroma entering as well as the pit on display by the entrance was a nice touch), preferring barbecue joints that use an Oyler pit or custom models\n\nOverall there was enough promise that I will visit again. With good service and the right order (I would like to try their PBLT as it comes highly recommended) I could see amending this to 3 or even 4 stars for BBQ-inspired New American food, but if you want real, traditional, smoky BBQ, this ain\'t the place.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 2, 'date': '2013-08-12', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 4, 'cool': 0}, 'user_id': 'thdVzCfKx-DV0zYWqId3pw', 'review_id': 'fiiRi-SjmqmRC99s-LwPsg', 'text': "I can't remember the last time I ate at a restaurant that came so close to hitting the mark, but somehow missed it by a mile.  There is a lot to like about Bootleggers, but tons of little problems add up so quickly that I honestly can't say I'm in a rush to give it another try.\n\nThe good:\nA $50 for $25 dollar gift certificate from Local Dines (https://www.localdines.com/phoenix?ref=19485).  Who doesn't like to save money?\n\nThe Odor.  I got out of my car and could smell the barbecue across the parking lot.  There's even a funny sign that says to follow the scent.  Nice touch.\n\nThe ambiance.  The old looking wood and brick and the metal table tops and chairs have a cool appeal.  It feels like the building is around 100 years, and not in a bad way.\n\nMoonshine.  There's a huge selection of moonshine on the menu.  Not only does this work perfectly with the prohibition theme, but Bootleggers offers a flight where you can sample three for just $10.\n\nCheap food.  Prices are surprisingly low.  The portions are big.  My wife and I ordered a lot more food than we were expecting to eat because we wanted to hit the $50 price on the local dine.  If you use the gift certificate, make sure to bring a few friends.\n\nThe bad:\nA ridiculous wait.  When I looked at Bootlegger's website, I didn't notice the 'make a reservation' button.  We showed up and were told that it would take 30 to 45 minutes to be seated.  We decided to run a quick errand and return, but still ended up waiting well over an hour.\n\nAn awkward waiting area.  There's plenty of space to stand, but no where to sit and an uncomfortable view of the entire restaurant.  You can see everything.  It sucks to be the people watching everyone else eat and drink, and strange to be eating and see all the people standing around and watching and waiting on you.\n\nThe kitchen door is in the front of the restaurant.  Who came up with this dumb idea?  All the food runners had to walk around the people waiting for tables.  While seeing the food did get my appetite going, it was really annoying to have to get out of the way when the servers and runners were moving around the crowd like we were part of an obstacle course.\n\nThe food.  Nothing was bad.  It just wasn't worth the wait.  The presentation was also overkill.  Many of the plates were just the right size for the meal, but left no room for maneuvering.  We ordered nachos as an appetizer.  The chips were way to small.  You couldn't scoop of the toppings off the plate without getting it all over your had.  I eventually resorted to using my fork, not a fun way to eat nachos.  We had a side of the grilled cauliflower.  The server and runner made it sound like a bit of this would be life-changing.  It was good.  But it was just skillet of cauliflower with the onion cheddar and pretzel bread on top it.  The dish didn't come together as cohesive bite.  It just felt like I was eating the four ingredients on one plate.\n\nThe service.  Our waiter was very friendly and a little overly excited.  Not a bad thing.  But he also disappeared after the food hit the table.  He also forgot one of the items we ordered.  He totally owned up to it, but by the time we got someone to flag him down, we just asked for it to go.  When a bag and box arrived at our table, whomever prepared it really dropped the ball.  The box was way too big for the bag so they put it in sideways.  That wouldn't be a big deal except there was chicken and coleslaw in the box which totally mixed together creating a big mess.  Why didn't they pack the side separately?\n\nBootleggers is a newer restaurant (only a couple of months old), so some kinks are expected.  The place has a pretty good vibe and is at least worth a try.  I'm just not sure at this time if it's worth a second try.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2013-08-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'ZP7ZkQYTIntGyeeHGkxM4Q', 'review_id': '9gFK0w50waHmL_qm1A7eBQ', 'text': "We went here for my boyfriend's birthday and loved it. They didn't have the bacon board available (which made me so sad), so I need to get back i and try that. I must say the apple pie moonshine is fantastic. I was told the owner makes it at his home. That is some burly ass shit. My boyfriend had the brisket and I had the grilled cheese (because I eat like a 12 year old). Both were good. I'll definitely be back for more of that moonshine and to try the bacon board.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2013-08-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mPP-G7c_mlXea76iHlKTOg', 'review_id': 'NMnl0-qPypRZiIlfoQCSkQ', 'text': "I live fairly close to bootleggers, but seem to be passing it all the time as I'm passing through town....always stop in! Love this place, the food, the drinks, the people, the atmosphere, highly recommend!!!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-08-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'wqQ-50Sjf9ol3SYaPbA1YQ', 'review_id': 'jL0YbpNWPRtS68uy4TC9_A', 'text': "Pricey but what BBQ isn't? Great friendly service from Alex? the guy knows the menu like the back of his hand, was able to do multiple recommendations and the food was KICK A**! Plus any place that has a bacon board is A-OK in our book! Get the Local Dines ($50 for $25) Can't wait to go back!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-08-20', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 4, 'cool': 0}, 'user_id': 'EflgGnTQzv3uDZ9rgQGbtw', 'review_id': '-IqH0NJc8u-yI1YfdVunbg', 'text': "I will preface this review by saying that we really wanted to eat, but were not given the chance........  Also, I worked in the restaurant business for over 17 years, so I know how things should work.\n\nI made an online reservation for 7pm on a Saturday night. We got there 5 or so minutes early. Place was very busy and trendy looking. The hostess said she could not find our reservation and we might have to wait twenty minutes. I asked why there were multiple empty tables if we had to wait twenty minutes and she replied that those tables were for reservations!! She apparently had a change of heart and lead us past many. many empty tables to sit us in a tiny corner. \n\nThe tables on our sides were seated 10 minutes or so after us. One server came and took care of a table (seated 10 minutes after us). I tried to get her attention when she finished with them, but she looked right at me and kept going. Another server walked towards us, turned her back and took the order of the other table (she seemed to know them). Again, I tried to get her attention and she walked right by. us.\n\nBy now, we had been there over 25 minutes and I was done. As we left, we walked by the hostess stand and she looked right at me, but never said a word. Not a good way to run a business.\n\nWith all of these great reviews, I really wanted to try, like this place.It seems like a very trendy, 'Scottsdalish' kind of place. Good luck to them staying open...\n\nThere is a new BBQ place called the Hammered Hog that will b opening soon on Cactus and 32 Street. we went and ate at their place after leaving BL and the food was great. Friendlier and great beer prices. And they acted like they wanted us there. More my style.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 1, 'date': '2013-08-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'qYnXG4az7ITxdyquD0XDeg', 'review_id': 'vawagintYxVN-La7TzsgdA', 'text': u"Maybe I'm still not used to Phoenix after 3 years but a fun and clearly well financed restaurant like Bootleggers still looks weird sandwiched between a strip mall hairstylist and an express pizza hut...am I wrong?   \nI will say that after 4 times eating take-out from this gem, I'm still enjoying the food.  I have yet to dine in but the d\xe9cor in walking through the front door is pretty impressive. and that coupled with the amazing smell of smoky bbq makes it worth it. Someone has taken the time to plan out the space and create a comfy feel in the bar area. I'm noticing from the other feedback that service is the lowpoint of their visit so I can't be of much help there. I've ordered the full rack of ribs a few times and have enjoyed the meatiness and flavor...I did notice they increased the price to 28.00 from 23.00 in the span of a week but still worth it.  The brisket was a bit salty and didn't suit my taste much. For sides, I've enjoyed the braised kale (loved it), grilled asparagus (good but a meager portion), mac&cheese (great when noodles were firm) and the cole slaw was perfection. \nIn calling my order in, it has consistently taken 20-25 minutes and served up hot. \n\nI hope this place succeeds, the convenience and variety in the menu is a terrific option to have in the N. Paradise Valley area.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2013-08-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 1}, 'user_id': 'u1fxUYcCZsiazNmczJh0hQ', 'review_id': 'yxlwytn7NrS8G5nYyw37vw', 'text': 'Tried this for the first time with hubby, new baby and our friend from out of town and it was a unanimously amazing experience. Our server Alex was awesome - case in point - when told it was our first time in, he asked us to put the menus down and began a great presentation of all the menu items and what their best known for. We took his advice and got the briscuit, the bootlegger burger, a Sunday special Bloody Mary and the bacon appetizer plate. \n\nAll items were 5-star good and the burger was actually fought over. The Bloody Mary was a meal in an of itself as a slider burger came as the garnish. Again, ALEX the host, came through and gave us some of their desert moonshine as samples which led us to order their peach cobbler and chocolate bacon raspberry cake. \n\nAfter all of this we had to be rolled out of there but not without smiles on our faces and plans to come back next Sunday and the one after that. \n\nKudos to a new amazing restaurant experience that will certainly be a staple on our dining list.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-08-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'f3OFmSUNrjEcgi_j0CpvDw', 'review_id': 'yctTE-nGCm7KsXrju-0fxA', 'text': 'Hmmm what can I say about this first time experience?! Yummy in my tummy, yup! The Cottage fries with cheese, super tasty. I got the st louis ribs- what a wonderful explosion of flavor in my mouth. My 2 year old son even enjoyed them. To top it off, I got the peach blueberry cobbler, another tasty treat! Definitely going back.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-08-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'k8fdxHRqtPxg93LyfQjA2Q', 'review_id': 'gm_JSAVtvQTGHU8COrh5EQ', 'text': "Had thed magic LocalDines coupon for $50 of what we hoped would be a food delight.\nHad reservations for 5:30pm and were seated quickly.  Place is nice inside, casual yet modern,  My first complaint was the lighting was so dim it was very very hard to read the menu, place needs to turn up the wattage a little.\n\nAfter reading how great the food was we had to start with the bacon board..  Price has already gone up $3 which seems to be a trend on the majority of the menu,  Pulled pork was $8 now $11, brisket now $12 and I think it used to be $10.  The real problem was that the food in our opinion was not up par if compared to the prices,  The bacon board was served in semi darkness.  The waitress explained what each componet was so we would know what we were eating,  Overall I liked the various types of bacon, only one type was overcooked, the dipping sauces were great and well as the toast., but the real question was it worth $16, not to us but it was worth a try just to say we've had it,  Wife ordered chipped brisket sandwich with coleslaw on it and I order the pulled pork with slaw (my favorite way to eat pulled pork).  She enjoyed her sandwich, however mine had no spice, no punch, just grease!  Now I enjoy grease but you have to have bbq sauce with it.  My pulled pork just lacked flavor, what I get at Pork On A Fork is far superior BBQ overall.  Ordered a couple of sides: cole slaw, lacked salt and spice, the roasted asparagus where very thin and nothing special.  Both sandwiches were served with thick warm potatoe chips which I nibbled on while waiting for the check.  Didn't quite spend al $50 but I had enoughj.  My wife wants to return so I may give it the second chance the couple sitting next to us they gave it and were definitely they did,  As for me this weekend I'll take my two coupons to Pork On A Fork and eat some down home BBQ.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2013-08-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'f1-pIw_p0ifzu03TXjPRiw', 'review_id': 'uUjawiGQgGGUyqW5g2EaYA', 'text': "The Hubs and I were looking for a Happy Hour spot to meet my parents at and checked our handy dandy yelp app and decided on Bootleggers because of the reviews and it was near where we were.  Walking up to the joint, we could tell we were in for a treat (not because of the strip mall location), but because of the awesome BBQ smells permeating from the restaurant.  It was a bit dimly lit inside for 5PM, but we all sat down and looked forward to a great meal.  When we arrived we were the only people in there, but by the time we were ready to leave there was a line out the door... that surely says something about the food.\n\nThe table decided on sharing some things including the bacon board, nachos, and wings.  My Mom had the apple pie moonshine... dear lord... that was dessert and alcohol all at the same time, what could be better.  It was really good.  The bacon board was huge and everything on it was salty, sweet goodness.  We highly recommend that board of goodness.  The nachos were awesome, surprisingly awesome in fact, and the wings were crispy and cooked perfectly.  Basically all you could as for in wings.  Needless to say we had an excellent experience.  The waiter was super excited about the food and the restaurant (especially given it was his first day).  Without a doubt we will be back to give the non-happy hour menu a shot.  I am quite pleased with this new hidden gem (although by the looks of it, it's not hidden any more)!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2013-08-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hn_DclKLzdxABRGGAuqKgg', 'review_id': 'oBcQsgT6Pl_9dQYzZR8WbA', 'text': "First BBQ place we've tried in Phoenix, and we were not disappointed!\n\nBootleggers is located in a small shopping strip with lots of parking. The restaurant is really well decorated. We had the nachos as an appetizer - awesome! The meat was tender, and the cheese, avocados, and onions just added to the delicious richness. They were a little greasy, but they're nachos - what else am I expecting?\n\nBBQ brisket sandwich was really good. I liked the strong cheese that they paired with the sweet BBQ sauce. The bun was really nice and buttery. Upgraded the potato chips to the fries, which were a little salty, but good. I might forgo the upgrade in the future and stick with the chips.\n\nThe brisket plate had a nice, large slab of beef covered in BBQ sauce. The sauce is a little sweet for my taste (I prefer a little more tangy), but the beef was tender and yummy. The accompanying tortillas were surprisingly delicious - super soft, warm, with a wonderful texture and flavor. The coleslaw was pretty good, and I did like that it wasn't weighed down with tons of mayo. Added the green beans, which were cooked perfectly and had a great touch of citrus.\n\nService was awesome. Everyone was really friendly and helpful. I will definitely be back to try a burger and some moonshine.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2013-09-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'eJyGP05vnSJo10GdW_Z-sw', 'review_id': 'HBwp63-1hg--YVcqIhJk_w', 'text': "Love it! Great food, great service and great ambiance. What more could you ask for? We went here with our friends who are big foodies; the husband said it was the best burger he's ever had! But, all the food was fantastic so I'm not surprised. We went a little later, around 8 p.m., and did not have to wait for a table. Our server was great and the manager was awesome. I'm so happy its near our house so we can visit on a regular basis.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-09-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_L9bVY6Z6_zO4UwDAwzsaQ', 'review_id': '7fx_Fnlvy6VgdMMCOdMTwQ', 'text': "Moonshine! Oh yeah, they have it and in many delicious flavors. I will admit I tried a few...purely for my Yelp review's sake, of course. See what a good Yelper I am! :)\n\nThe booze was good, the food was even better! They have done an amazing job with the menu and everything I tried was uber yummy!\n\nThe interior is dark and sets the mood for a perfect date night! I found it to be a little loud, but that is to be expected when you mix good food, lots of people and strong liquor! It wasn't rowdy but it was loud. I can over look that though because of all of the other great things Bootleggers has going for it!\n\nTwo thumbs up!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2013-09-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'lnl8wvuOJBsArN70vwBaBQ', 'review_id': '7Jduy8albUqWsnWw99ikpA', 'text': "Wow wow wow! All the food we had here was too notch!! Bootleg burger was fantastic! Can't wait to come back !!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-09-06', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 0}, 'user_id': '0Hmez6GVD2c_mGkhCgP9PQ', 'review_id': 'CJ3LGEu26mqwC7S-PsiuoQ', 'text': 'Went here tonight based on reviews from yelp.  We ordered food to go.  They cook everything except the salads in some spice rub so beware if you do not like spicy food, which we do not.  The grill cheese sandwich with bacon is very spicy due to the rub on the bacon, it is also very expensive @ $13.00 and not at all worth it - 3 different kinds of cheese, 1 piece of bacon on sourdough bread.  Nothing special and way over price along with the mac & cheese a itsy bitsy tiny bowl for $5.00.... The kale salad and the cobb salad nothing special once again just ok.  The cole slaw which came with the brisket, again nothing special just ok....The cobbler is very very sweet, overly sweet and the chocolate cake while okay it is a bit expensive @ $6.00 for what you get or rather do not get.  I had the beef brisket, the rub again was spicy so what I could eat was very good, it was tender and melted in my mouth.  I would not recommend taking food out, but rather eating it to experience the big screen tv, the bar and the high booths... My family was not impressed with the place, but I like dives so I will try again if just for the brisket.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2013-09-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'FGav1F2B6RvIsSmyyNrgTQ', 'review_id': 'G3gUyECJsaLigvMl3Vr2hw', 'text': 'What a great place!  Just tried for the first time on Saturday night....made an online reservation at 6:30 for 7:00...walked in the door and was seated on the spot.  The restaurant has a great vibe.  We ordered nachos, PBLT and my kids had grilled cheese sandwiches....I lived it up and had a flight of moonshine and really liked the caramel and apple pie!  The food had great flavor....such a nice change of pace to have great food in a great little local spot!  Will be back for sure!', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-09-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 0}, 'user_id': 'A9x6WO4DJuHzT2U_fT9Jhw', 'review_id': 'zJMjU4yTlfF92GEBg5H1AA', 'text': "Been here 3 times and very disappointed.  Other than the ambience the food and service have been inconsistent at best....Tried everything popular on the reviews, (Nachos, Brisket, Pork Belly Sandwich, Mac and Cheese) and my experiences have been exactly opposite.  Terribly inconsistent, greasy, and just super disappointed as a live 2 blocks away.  My waiter told me the owner makes their moonshine at his house.  C'mon, really?  Bad luck or an off night....3 times I don't think so.  \n\nMy guess with all the reviews is that people have already made up their mind before coming here.  I have wasted too much money giving this neighborhood spot another chance.  If you want REAL BBQ in North Phoenix go to Pork on a Fork.\n\nOh yeah.......the owner parks his white Range Rover in the handicapped spot in the front......nice touch", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 2, 'date': '2013-09-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'q-rV21IVlQlgzL0ygUvHwA', 'review_id': 'JcjcMJebwpkSfaSUzR5jGQ', 'text': 'The food was good, even better when you see your bill.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2013-09-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 's3ogzzWFW0TOJbXe9blRnA', 'review_id': 'Z_Rk38GtjDRzSaMsh9fnuA', 'text': "First time in last night for my buddy's birthday.  Decor is amazing with old woods and antique lighting.  Very modern western.   The smoke smell hit me immediately when I walked in the door and mixed right in with the American Mule that I got at the bar.  Bartender was really friendly and chatted it up for a few til my friends arrived.  Hostess and waitstaff were really nice, joking around, and created a laid back atmosphere.\n\nFood was delicious.  Had the bacon platter which I recommend.  Had a variety of bacons (cherry smoked, apple smoked, jalepeno) and a few unique sauces to try with them as well (mustard, cherry, and onion jelly).  Very good flavors and with all the options, lots of combos to try. \n\nHad the half rack of ribs.  They were a little dry, but flavor was excellent and the meat was terrific.  Came right off the bone.  Plenty of meat on them compared to other places where i found it is mostly bone.\n\nCobbler for dessert was interesting with a cinnamon toast crunch crust.  Wasn't my favorite combo, I like the traditional cobbler crust, but I appreciated its unique approach. \n\ni want to go back and try the pulled pork next.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-09-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 6, 'cool': 1}, 'user_id': 'ihquMwE0LfLtRILg-7b-NA', 'review_id': 'ihqS2oFz-bwySUtQRsOtHQ', 'text': 'Bootleggers, I WANTED to love you. I did. And you made me sad face. \n\nFirst, the meat is amazing. Flavorful and melt in your mouth amazing. But you cannot get a 5 star review based on the virtue of your meat alone, and your spotty service and incomplete meal prove that you think otherwise. \n\nThe bartender did not know what kind of beer, IPA specifically, that was even on tap. Dogfishhead IPA...great, which one sir? Very disappointing.  The PBLT, which is described as Pork Belly, Lettuce, and Tomato was absent the Tomato. I was going to mention this to the bartender/server but he NEVER reappeared.  Our uncleared dishes sat on our table for 20 minutes or more while the bartender/server flirted with two chicks sitting at the bar.  I had to get up and ask the hostesses (multiple hostesses, why? You only need one Bootleggers) who were dancing, singing, and folding napkins to get me a box for my remaining food. \n\nAll around very disappointing experience, and although your meat is divine, I will not be providing Bootleggers any further business.  Once you get your service straightened out you could be a top notch restaurant.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 2, 'date': '2013-09-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'cNbpfwuMfvLb233G4Zs_5Q', 'review_id': '6GIxAxb-1rZB67nJj6ijdQ', 'text': 'Just back from our 4th visit to this relatively new and very popular BBQ restaurant, which as the potential for 4, or even 5 stars. The ambiance is great, with wood barn paneling on the walls, a nice bar area, a couple of tv\'s on the back wall. The food is the best BBQ my wife and I have had since leaving our native Virginia and North Carolina. Service is good. So why only three stars? In the 4 times I\'ve been there, they have been out of one of the beers (Lagunitas) on the menu. At the first visit, this was easy to dismiss. By the third visit, it veered in to irritation. And tonight, we had a new menu. No Lagunitas listed, but Dogfish Head instead, a very yummy IPA from Delaware, recently appearing on the draft menus of a few restaurants in the area. I was excited to order it. And guess what? They were out! But they had Lagunitas, we were told, after we had already ordered a Sierra Nevada, bottle. Pretty annoying. Then, when time to order that second beer, which would be a Lagunitas, what happens? They "popped the keg," which means it wasn\'t available. It would have been good if that was all that was not right. But no, that wasn\'t all. My wife ordered the ribs, one of the dishes listed under the menu that was to receive a side of cole slaw. The waitress told us that the new menu, just printed, btw, was wrong, and the cole slaw was a side and was extra. As it was listed in the menu, albeit incorrectly, they provided the said side dish, which is delicious. The restaurant manager came over to "handle" the situation, proferring the usual PR stuff. I suggested menus are inexpensive to print and that they needed to get them right. We were offered a variety of excuses.\nWhich makes me wonder. How often is this other\'s experience? \nBottom line, the food is outstanding and the best BBQ we\'ve had in AZ. Downside it lack of attention to detail when it comes to the menu. Just don\'t expect them to have what they say they do on the beer menu, and be sure of the sides listed to come with your entree. I do hope they can correct this niggling problem and live up to their potential.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2013-09-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Y9xQfzQriL6IBbq-QQcmkg', 'review_id': 'kkTf1wQ__IXaePvuhPuaNA', 'text': 'Maybe the best pulled pork I have ever had. And a great selection of beer too. And not too hard on the wallet for how quality the experience is.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-09-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fY5ZyH00Vq3NAGiogppBYQ', 'review_id': 'Ogq0yXvKRzqrcyhVLDwpng', 'text': 'My boyfriend and I went here a couple months ago.  I understand the place is fairly new, but the server was not 100% knowledgeable about some of the items like the drinks for example.  This could be because she was not of age, but my boyfriend ended up getting two recommended drinks that tasted nothing like she described.  She was a very attentive and nice server, however.  I ordered some sort of open turkey bacon sandwich with home-made potato chips.  It was very delicious.  The bacon was incredibly smoky.  It was almost too smoky, but the portion was huge so I can see how that flavor would just be too overpowering for an entire meal.  The ambiance was a little strange; it was very dim-litted (to the point it was hard to see, and I am only 22), and there were a bunch of TVs that were playing sports games.  It would have been more romantic except for the TVs.  The TVs really should have only been at the bar.  It was pretty pricey, but it was worth it for the experience of different drinks and food.  Bootleggers does not belong in the strange strip mall-ish area it is in.  I hope the location does not hurt business because it seems it would not be a nice restaurant from the outside.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2013-09-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 6, 'cool': 3}, 'user_id': '45V7-1r79DEG0HbuaKYIlg', 'review_id': 'NS8syIYKMqN6kPlLl1kxZw', 'text': "Restaurant week meal #1 for my stepfather and I.\nI appreciate how they decided to do it - instead of selecting from a limited menu of appetizer, entree and dessert, each person is served smaller portions of 3 apps, 2 entrees and 1 dessert. What a great way to sample what the kitchen can do!\n\nApps: \n- Baked potato soup - fantastic! would definitely order it again!\n- Short rib with grilled pear, brussel sprouts and goat gouda salad with grilled lemon vinaigrette. The dressing was a bit too acidic - but a little tweak on that and this could be one of my favorite dishes in town! The flavor, texture, color and shape composition is spot on. One of the most well conceived apps I have seen in a long time.\n- Smoked turkey grilled cheese - meh. It wasn't bad...just bland and boring and nothing special at all.\n\nEntrees:\n- Chicken and pumpkin pie waffles with egg and maple red eye gravy. I have been singing the praises of chicken and waffles for years. Now my stepfather is a convert, based on this dish. We did specifically ask to speak with the manager to beg this be added to the menu. Perfectly executed!\n- Smoked pork belly steak. (with bing cherry bbq sauce, swiss chard, guerro chile, leeks and white bean puree) It's pork belly. That's all you need to know. YUM.\n\nDessert:\nCornbread pudding, chipotle huckleberry jam, bourbon caramel corn.\nNever would have considered this for a dessert if there were any other options. Luckily, there weren't. It was an out of left field amazing hit!\n\nWe were both pleased and impressed with the food quality, presentation and combinations.\n\nThere are a few service snags that need to be worked on, though.\nFlatware is wrapped in napkins, already on the table when seated. Fork and knife only. If it's decided most diners won't need a spoon, when you serve an appetizer that includes soup, please deliver a spoon WITH the food.  Once the soup was delivered and we realized we were spoonless, we were unable to catch the attention of any staff member, my stepfather had to approach the hostess for spoons.\nOur forks and knives were bussed away with our entree plates - our desserts were delivered with no forks. (I snagged two more napkin rolls from the empty table next to us so we could start dessert. About halfway though, the hostess came by with long forgotten forks for our dessert course.)\n\nNothing that would stop me from coming back. No dealbreakers at all - and I do look forward to coming back. Just time to work on some front of the house snags...\n\nStill definitely a fan!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2013-09-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '09rm-cYytHT4A4dqLfudVg', 'review_id': 'kjvfgbD3SuNSTwD71SUZUA', 'text': 'If I could give 3.5 stars I would. The food was really good, the menu was up to par for a regular BBQ joint. I guess I felt like it would be a little more unique. The decor is decent, but they could have done more with the inside. It has a little bit of a stale feeling inside. However, the food made up for it and I hope they make it. I will be back.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2013-09-28', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'bWZiW9l1Q87uBOYo7mPA4A', 'review_id': 'azYNlX1H__PH4wtDofNnKg', 'text': 'Great apple pie moonshine', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-10-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'r-t7IiTSD0QZdt8lOUCqeQ', 'review_id': 'BGasqJNz1qRCkA9MnYpPUQ', 'text': "Nice neighborhood feel and friendly staff.  STick with the 'que...", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2013-10-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 5, 'cool': 1}, 'user_id': '7brf9WC0Gr_7bUBXEHs9FA', 'review_id': 'nE_kzcPS0D1eEaAoHBVnag', 'text': 'Last Saturday night I was itching for some barbeque.  I have not made it over to Bootleggers which is only about one mile from my house.  The menu is extensive with ribs, turkey, brisket, etc.  I am always hesitant to try a new barbeque place in town since I moved here from North Carolina and have had a hard time finding reliable BBQ in town........but it is out there\n\nI had ordered the smoked turkey leg with fries and coleslaw.  It was surprising tasty.   The turkey was slow cooked to perfection and was actually juicy, not dry.  It was spectacular.  I was quite surprised that I was able to have only a turkey leg and sides and be satisfied for dinner, but I was...........\n\nThe atmosphere in the restaurant is inviting: rustic, dark and a good place for conversation and privacy.\n\nThe staff in attentive and detailed.  A fine addition to the neighborhood!', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-10-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'TxOR39w0Mlbd4h1siXyb_w', 'review_id': 'KhwSKEIksgqSH2TzgZxvlQ', 'text': 'I can\'t believe this place is so close to my house and I have been driving by it for months and not realizing what it was.  The location used to be a Dirty Drummer Sports  bar.  Then it was another generic sports bar and I believe it was called Outlaws or something similar.  So when I saw it changed to Bootleggers I naturally assumed it was another bad sports bar.  Then I read in the New Times Best of Phoenix that they won something. I believe it was for Brisket Sandwich or something. I could not believe it.  So I stopped in tonight.  Unfortunately I had already eaten so I just had a few drinks looked at the menu, listened to the other dinners and watched. And watched alot.  \nI really am looking forward to going back and trying the food.  Everything looked really good. Everyone was talking about the Brisket Nachos so that will be something I look forward to. They had a nice beer selection and a nice little unique thing where they are serving Boutique Moonshine. So that is a thing now.  I remember drinking rock gut homemade whiskey when I visited my brothers in the hills of Arkansas.  Now they are charging $10 for that.  I need to tell the hillbillies to pack up and move to Arizona.  But it was good and something different. \n\nHere is my only complaint about the place and normally this is not a big deal to me.  But they don\'t have Wifi.  Actually they do but they don\'t give out the password.  Which is certainly their prerogative but the staff was kind of nasty about it.  LIke "We have Wifi" But you can\'t have it.  It sort of left me a bit put off.  It\'s 2013 who doesn\'t have Wifi anymore? If management decides that they only want to use it for management business purposes then I would recommend changing the name of the router to something else.  When I see a router for the business I am in there is a built in expectation that it is available for customer use.  Don\'t want to offer Wifi as an amenity? No problem, then have your Wifi signal be anonymous. \n\nLooking forward to eating some food there.  But will remember to carry my own Mifi if I feel the need.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2013-10-10', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 1, 'cool': 0}, 'user_id': 'mYqYG5yxc8VI56JCkoNj8w', 'review_id': 'OP2Zs_u5wbj_OA8WNQ50IA', 'text': 'Thumbs up!', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2013-10-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'kmjYN9Hi1Q8nPGcElxXi7A', 'review_id': 'Xlf7xm3L3ZvO1BtD32C6bw', 'text': "So long story short I wrote that bootleggers had potential but missed the mark. The restaurant had just open and I wanted to wait and give it a second chance. \n\nWell I'm pleased to say that I came back and came away very impressed. The apple moonshine is one of the best drinks in town. Notes of apple and cinnamon come together for a fantastic cocktail. We ordered the bacon board, nachos, chicken wings, and Mac and cheese and all were really good. Wings were grilled and had a smokey flavor and were hot but not over bearing. The nachos had some great guacamole and the brisket was cooked well. The bacon board was amazing. There wasn't only 3 very distinguishable bacons, but delicous pork belly and pork confit all served with home made jams, mustard, and cheese bread. Everything was cooked well and very appetizing. \n\nI'm glad I gave bootleggers a second chance and love that we have a new good restaurant in the north Scottsdale area.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2013-10-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': 'rRMj923rxgl_yCyQ41ZPZA', 'review_id': 'SXfuz6TfDmt5uigUHZVseQ', 'text': 'Great wine list and over cooked dry meat! The place lacked any character to back up the nicely remodeled place. In short...dont waste your time.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 2, 'date': '2013-10-14', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 4, 'cool': 4}, 'user_id': '7e1XAK4j95x-ibEy4qFKYg', 'review_id': 'lvviINbG_DvciDD3dZ2xsA', 'text': u'Bootleggers gives a nod to the prohibition era with some cool cocktail and "moonshine" options. I quote moonshine because unless I get my white lightning in an unlabeled mason jar from a shady guy in Kentucky, I\'m reluctant to give just any liquor such a notorious distinction. That term is being thrown around pretty loosely in recent years. \n\nI tried one cocktail and it was good, but I have no recollection as to what it was called. I looked for it on their online menu without any luck. Milady tried the Blue Moon drink which was a bit heavy on the basil for me. \n\nWe started with the Bacon Board. An ensemble of delicious bacony meat delights. It\'s also served with some toasted bread pieces and a sweet onion jam that paired nicely with everything. It also comes with a house made mustard that actually consists of mustard seed, not yellow sludge, it was good and interesting. I\'d never had actual mustard seed before. \n\nI got the PBLT - Pork Belly Lettuce & Tomato with a side a mac and cheese for dinner. It was good, but by the time I got half way through the sandwich I had to call it quits. My stomach had begun revolting against the fatty pork products consumed on the Bacon Board, but it was worth it.\n\nThe mac and cheese was very good. It\'s served in the same cast iron skillet-thing in which it\'s cooked. I always like that look. It had lots of creamy cheese flavor unlike more subtle M&C I\'ve tried recently. \n\nOn a non-food note, I really liked BL\'s modern rustic d\xe9cor. Older looking wood siding and exposed brick. It had a slightly sophisticated yet natural feel and I\'m not usually into much in the way of sophistication. There was a nice balance.\n\nBootleggers was a good find. I look forward to coming back to try more of their offerings after I recover from my current pork coma.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2013-10-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ghDL-MQt6BVyWDXReXxCWA', 'review_id': 'rV5s7u_mDHnTa_IeogBNPQ', 'text': "I was disappointed. The menu advertises 1/2 pound brisket?  Really it was two slices.  My daughter in law ordered the grilled cheese. Waiter asked did you want tomato? They charged a extra dollar for a single slice of tomato.  The bacon board was tasty had a few slices with a couple of dabs of dip.   For 16.00 that was a rip off.  My son ordered the pulled  pork which came with Coe slaw on the sandwich.  He doesn't like coleslaw and they replaced the sandwich and brought out fries then charged  additional 2.00 again another charge not disclosed. The cauliflower for 4.00 was cold and hard.  The hostess never stopped playing with he hair.  The severs run continual an gov a uneasy feeling.  I was very disappointed.  \nSave your money!!!!!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 1, 'date': '2013-10-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wDaHD-7PHiuPYl7dLExAdQ', 'review_id': 'pTHg987ftZFqFUwZcwqVOg', 'text': "Would've given a 4-star rating had it not been for our last time in.  One of our absolute favorite neighborhood spots for sure with a Cobb Salad you have GOT to try complete with pork belly, of all things.  The demotion from 5 to 4 stars is a direct result of witnessing who would seem to be either the owner or GM standing behind the bar during service drinking with other patrons and/or off-duty staff.  His refills were promptly supplied by their on-duty hostess.  Also somewhat perturbing was the fact we could hear his entire conversation from the opposite side of the bar.  We get it, you're important, but a little humility goes a long way.  Having been in the restaurant business ourselves for well over a decade in some of the more well known establishments in Scottsdale, my wife and I perceived this to be a completely unprofessional way of representing both himself and his brand.  If he would've simply been seated at one of the several open seats at the bar or community hightops, he would've gone completely unnoticed.  And I sure hope that wasn't his white Range sans a handicap plate in the handicap space within steps of the front door.  Either way, a friendly bunch, for sure, as they all made it a point to say goodbye to us on the way out, but perhaps management should re-evaluate some of their policies to mirror those of the more tenured and respected establishments in the Valley.  A long and prosperous future would await them...", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2013-10-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jRtdO03kWbReasB_vBlTsQ', 'review_id': 'sx4fLN_LvK73KtSsgI-k0g', 'text': "Went here last night with a HUGE group of about 75 ppl. I'm sure we maxed out the capacity of this place but they handled it very well. They did their best to get the drink and food orders. They did forget about the nachos I ordered during happy hour and it was 20 min. until the waiter got around to me again, however, after he leaned of the issue he upgraded me to the full plate of nachos to apologize. I was happy they gave the extra effort. I'll have to go back again when it's not so packed to give a better every-day review.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2013-10-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': '8yLExbiAW_6TQx54YVWt8w', 'review_id': 'ane37TJ52KzoBC8CuoWIzg', 'text': "Mediocre at best. Wings were dry and tasteless, brisket was full of fat, pulled pork was ok but with a strange after taste and the ribs were nothing more than ok. The coleslaw was good. \nService was un attentive when we were the only ones in the restaurant. \nWe won't be back :( \n(Unfortunate because we really like BBQ)", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 2, 'date': '2013-11-05', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'U80eHjvLQ44Y3tpSW0f4MQ', 'review_id': 'jV85uxysqyUCdR3ZN89Afw', 'text': "First, I didn't order the right things. I ordered the shrimp and grits appetizer with a side of grilled asparagus for lunch. My lunchmates ordered salads. I should have ordered a salad.\n\nSecond, I ordered a dessert -- the berry cobbler with ice cream. Nothing else appealed to me. \n\nIf I have an opportunity to return, I will because I don't think I ordered the right things. It's a BBQ joint and I ordered shrimp? But I didn't want to go too heavy mid-day and get sleepy. After 6 p.m., a moonshine cocktail and a brisket sandwich might sit better. \n\nThe ambiance was great, very artsy and hipster cool. But again, midday was not the great time to go. It was empty, but our server was amazingly attentive because of the dearth of people. Let me try this place again later.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 2, 'date': '2013-11-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uqsVGaxoE4nCceXQ0G6fzg', 'review_id': 'Df0ziCvcOjRbRhSvjGX90w', 'text': u"I stopped by Bootleggers to grab a beer and appetizers. Since I love bacon I went with the Bacon Board and also ordered Nacho Flat. They both were delicious. The bacon board had variety of different types of bacon, from house smoked pork belly to dry cured apple bacon. The nachos had chopped bacon and a chipotle cheddar sauce. Some of the best nacho's I've ever had. I washed everything down with a nice cold beer and a shot of moonshine. I will definitely be back to try an entr\xe9e.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-11-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2HzGKs6DVSVgLUsrLAm98g', 'review_id': 'qoH35ycmP3jJP6LgwTLa2Q', 'text': "WOW WOW WOW GO! You must go! This place is so good. Doesn't look like much from outside but the second you walk in you know you're in for some BANGIN food and service. Love it here. The chef is so damn good! I think he's famous? Not sure but he should be!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-11-15', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': '0Pdx57HISV8nEUws1AWLqw', 'review_id': 'MNLEkKiAgxntz0sHgcDMEg', 'text': 'Stopped to get a kale salad to go, sat at bar to order.  Bartender did not offer me a drink let alone a glass of water.  I ordered chicken with my salad for an extra 4 bucks.  Salad done, I paid and still tipped the un attentive bartender knowing I would be writing a review on him.  Opened up salad when I got home and the 4 dollar chicken breast was a joke.  It was half of a full breast.  So for $12.00 (15 with tip) this salad was a joke.  How does this place stay in business?', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 1, 'date': '2013-11-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Jd3s0wRJE_bEVYed8UqmLg', 'review_id': 'ZF_lNacIWIT2-F5Vxc_fpA', 'text': "Phenomenal. Bacon Board -- delicious and plenty for 2 (or 3). Pulled pork with slaw on the sandwich was great and plentiful. I hate that I hadn't heard about this place sooner! Great food, great service.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2013-11-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'gswzsdXFFxNM-OiIdHMZYg', 'review_id': 'SH5MICQndYvlCNg22W0W_Q', 'text': u"We finally got the chance to visit this restaurant, after putting it off too long. We sat at a high-top table in bar section, where there are several TV's turned to sports. Our waiter asked if this was our first visit, and, when he learned, he highlighted their menu and cocktails. We ordered the Brisket dinner, with flour tortillas and excellent cole slaw. The brisket was done perfectly. Nice and lean with just the right amount of smokey flavor. Smoked meats can sometimes be over powering, but, theirs is done just right. It could have used additional BBQ sauce, perhaps, on the side would have been nice. We also ordered the smoked turkey melt, open face sandwich. Again, the turkey was smoked perfectly. Bacon, melted cheese, tomatoes made it excellent. We ordered the Yukon gold fried potatoes for an additional $2.00, which were again excellent. We added the side green beans, which we had heard were good. They are saut\xe9ed, and extremely flavorful. Just a side note that they use cloth napkins, which is a really nice surprise. They offer a full bar, with an extensive beer selection. The staff is very friendly and inviting and, well trained. We would certainly return, especially to try other specials on their large menu. Chef Fox has a good thing going here...", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2013-11-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IiaY5qNaIw2OHgvrls1OPg', 'review_id': 'RceQTl7YRcbvUqpqt-k24w', 'text': "Cool vibe and decor, the BBQ smell as you walk in is a bit overwhelming, but the food lives up to it! Nice variety of beers...and the Bootlegger Burger is just crazy good. Seriously one of the best burgers I've had here in Phx .\nThe bacon sprinkled chocolate cake is a must try as well.\n32nd and Shea has been a desert wasteland for good food, but thanks to this place and a few other new additions, you can skip McDs and Subway and have something worth eating and returning for.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2013-11-19', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 1}, 'user_id': '0dgQa81w5it1PMpGpC_L0A', 'review_id': 'bS_snTRHX7g4mEhZPUWx-Q', 'text': 'I think that Bootleggers has a lot of potential, and probably rates better than this more often than not.  Unfortunately, we had a few issues on our visit that kept me from giving a higher rating. \n\nWhen we arrived, the restaurant was moderately busy, but there were a number of open tables.  Of course, we were led to the tiniest table that was placed so close between two others that I felt like we should offer to share food with our neighbors.  We asked to sit at an open booth, and were told no; they "thought it might be reserved".  We ended up deciding to sit at the bar, and no one used the booth the entire time.  \n\nI was very excited about trying the bacon board, and it was darn tasty.  I absolutely loved the onion and tomato jams, and the lightly-cheesed toast was the perfect addition to the meats.  It was curious that the board was given to us without any explanation though.  I would have expected to have been told about the 5 different types of bacon and accompaniments.  We asked for some guidance so we knew what we were eating, but the server wasn\'t even sure the difference between a couple of them.  Still, it was tasty.  We also shared the BBQ Turkey breast.  I love that it came with homemade tortillas; it made delicious little tacos with the coleslaw on top.  We finished our meal by sharing the peach/blueberry cobbler.  Yum! \n\nOther than the seating issues, my main complaint was the chatter among the wait/host staff.  Since we were sitting at the bar, close to the kitchen entrance and hostess station, we were privy to a number of personal conversations that shouldn\'t have been taking place, including complaints about a customer across the room.  Yikes!\n\nI will return for the food and to try their many amazing looking drinks... but next time I\'ll insist on that booth and stay far from the chatter of the hostess station!', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2013-11-20', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 6, 'cool': 4}, 'user_id': 'q9XgOylNsSbqZqF_SO3-OQ', 'review_id': 'MJAMlEKsSK05BNjMfoc3Hw', 'text': "We went to Bootleggers after being teased by the picture of the bloody mary with the mini slider on top. We drove up on a Saturday and were disappointed to learn they only serve those on Sunday's. \n\nWe opted for the regular bloody mary and the mixture was so spicy I could barely finish it. That was disappointing because it will probably sway me away from ordering it on a Sunday. \n\nI saw bacon board on the menu and could not talk myself out of ordering it. It was delicious! It was a carefully curated collection of the finest all-natural swine slabs served with w/griddled toast, sweet onion jam, house yellow mustard and house brined pickles. The sweet cherry and the jalapeno were my favorite. I balanced that out with the kale salad and it was equally good. \n\nI will definitely return as it is a local spot with friendly staff, I just may not get the bloody mary.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2013-11-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Tp4_arBmQ5GkRSE-a-Wn6Q', 'review_id': 'jCEx_kgs318EzZ7yAUHxFw', 'text': 'The Decor was modern, just as their name suggest, with the orange chairs and stainless steel tables. \n\nThe food was delicious, mac and cheese was to die for. The beef brisket was also very tender and juicy with fat lining it. The homemade potato chips were good too! All so good.\n\nThe service was great. The waiter ,Torrance, recommended the grilled traditional (buffalo wings). Was pleased with the recommendation, and they tasted good too. Overall very wonderful staff!', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-11-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'E9CNzin1dYCMjp4Tng2ydw', 'review_id': 'OJg0zIqp0-8osudl8C93eA', 'text': 'Decided to come hear today, with my family, right after visiting the desert botanical garden. Arrived around late afternoon. Got seated right away. Our server Torrence immediately brought us water. He gave us a good amount of time before asking us for what we wanted to eat. Recommended traditional wings and bbq items which turned out great. Mac and cheese was also amazing. Overall experience was great very happy with the food and service.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-11-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'IDnIYkLxdDJ6G_QGpcqaog', 'review_id': 'eShTSsQyQT3FZ2hNFRbxRQ', 'text': "Wanted to try somewhere new and this was a good choice! Everywhere I eat I try to order the pulled pork sandwich so finding somewhere like this was amazing!\n\nThe atmosphere was awesome. The drinks were good. The service was a little bit slow but it was made up for in their delightful attitude. I'll definitely be back!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-11-29', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 1}, 'user_id': 'AJpAR7ny8rl31pbHyXFA8A', 'review_id': 'ZA1-qUhyNPjhhaSzc3NpEw', 'text': 'Great food and drink.  Try the bacon board.  Service is a little off.....slow and slightly aloof.\n\nDefinitely worth trying though.  Amazing pulled pork.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2013-12-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'POCXOrFNHMZoicscgKoz6Q', 'review_id': 'I5Vxb5dN8eAJJMTbcGsrVQ', 'text': "Good service! \nWhile the fare is tangy tasty down home bbq, it definitely raise the dining experience on regular 'ol bbq.\nThe atmosphere is a little  casual chic, but the food is down home good.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2013-12-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'LHDOSzJYOqTBIoOif8mj2Q', 'review_id': 'yHVqq63XJfSu4_VvfXXInQ', 'text': 'Great staff,  great design,  great food.  Try the specialty cocktails too.  Had the pork sammy,  burger, chips and pb bourbon wings. Pork was delish on a crispy fresh sourdougb, bootleggers burger is amazing and so juicy and delish, chips and dip with bacon was to die for and the wings were just eh- a little overdone and on the asian side of the flavor spectrum.  Probably just personal taste.  Check this place out for sure,  jason at the bar is the bomb.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-12-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'bwmXfjwrogAaGqV33kSVpQ', 'review_id': 'kuc5Karq8Mx6PIsAFD8s4g', 'text': "Nice atmosphere but service and food were a little disappointing. The bacon board is a nice starter to try different cuts of pork, but some of the bacon was just too soggy. I thought service was slow and inattentive. Our entree orders were taken after we had already finished eating the appetizers. I liked the chips and potato fries (upcharge). but meat dishes I tried (brisket, ribs) were too dry and salty. I also found drink portions a little small. Wouldn't go out of my way to come back here. Not much else to do in the area anyways. Split check for for 5 people:  2 apps, 4 mains, 4 drinks was about $30/pp.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2013-12-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'EDMVQiBJ8h841d8Em_0ijw', 'review_id': '1UKvWJfLKVUXmkQKmDxOQQ', 'text': "everyone there is very nice.  bill the bartender is great! had the bbq sampler and i liked the pork the best ......so i always get the bbq pork. comes with a few tortillas and it's awesome!  mac and cheese is great and the smashed potato's are good too! wish they had some awesome baked beans but it is still great!   stiff drinks aren't bad either.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-12-22', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': 'MHTZuj8I_obO_5Y9C9Zv8g', 'review_id': 'syc31wNukjwHPxU04B2Myw', 'text': "I still have yet to eat here, I'll do that soon. But know this...this moonshine is something you need to give full attention and respect to. It's delicious...delicious", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2013-12-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jga116TEkHXu5hSUckN_EQ', 'review_id': 'Luw2XLg98uD1AStVLiu3FA', 'text': 'Food lacked seasoning.     Ribs were ok nothing special.   Sauce tasted out of bottle average.    Pulled pork was average.   Needs seasoning.    Burger came with chips that completely lacked salt.    Server did not offer side dish options.    Nobody finished their plate.    Burger was pre made patty.   Lacked flavor.   Service not horrible but certainly not great.   Overall everything just average.    Tried twice to be fair.    Nothing to bring me back.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 2, 'date': '2013-12-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nY3KOVVvwDbSTCjzLu05aA', 'review_id': 'TrO5HPLAM-K1uSHwa78y-Q', 'text': 'Pulled pork, pork belly sandwich both excellent. Gonna be a tough neighborhood for them to do the kind of business they are hoping for but I wish them well. I will certainly go back', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2014-01-02', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': 'R6KioM-MQKoOb6O8rUKujw', 'review_id': '543KphMfmLhg2WvTklCdzw', 'text': "Came here twice. Once for drinks and once for food. The drinks are very tasty! Try their house made apple pie moonshine! DELISH. The smoked chicken wings are mouthwatering!! Perfect smoky flavor and perfect crunch on the outside and tender on the inside. I've never had smoked wings before and I think I don't want them any other ways. These were my favorite! I also had the pulled pork sandwich with potato salad which was good but nothing special. The potato salad looked like mayonnaise soup which I really didn't like. Since I loved the wings so much I will for sure come back. They bacon board looks amazing! I mean who doesn't like bacon?? On Sundays they also serve a Bloody Mary served with a slider on top! How cool is that?! The decor is awesome! Definitely looks like an old saloon and also has their smoker visible for everyone to see. I hope to be back here soon!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2014-01-04', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'nc3cqVN0UuB3m50-CcMftw', 'review_id': 'gyETnG3YsBWlJtyf2mG_sw', 'text': "The bacon board alone could convince me that love can happen again. And I can't wait to return and get my love on.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2014-01-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qoeSpwTjflaFQOdzsd7gWA', 'review_id': 'PbGSp5YT1DtS0-eCnmkD9w', 'text': 'Have been probably a half dozen times, tried several entrees and moonshines. You MUST order the apple pie moonshine when you sit. Everything here has been good, albeit heavy. Bootlegger burger is a fav, smoked turkey has been least fav, but nothing objectionable. I\'ve ordered the cauliflower steak as an app a few times. A flight of moonshine is a must for passing around. Ambience is sort of "mod/barnwood."', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2014-01-05', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 3, 'cool': 2}, 'user_id': 'ZrUZtLgLOn15v2NIZl-oKQ', 'review_id': 'rpAbNCcNMiwTmhjFKB1u9g', 'text': 'I owe a debt to a friend for recommending Bootleggers to me. The first time I came here was for AZ Restaurant Week. I was absolutely bowled over. When I came in and said I wanted to see the Restaurant Week menu, the waitress took the menu out of my hands. I said "Wait, I wanted to choose something." Then she said "No, you get EVERYTHING." What?? Can this be?! Everything was delicious but the cuteness of the tasting proportions was deceptive. I was almost stuffed after the first course! The first plate had a mini grilled cheese and turkey sandwich, a baked potato soup and a very tender short rib with brussel sprouts and grilled pear. You could tell real thought went into the menu. The second course included a quarter section of a pumpkin waffle with chicken. I had to save that for the take-out box. But I miraculously found room for the smoked pork belly steak. So fat but so good. \n\nThe second time I went there was for the Bacon Board. What a great offer. Unfortunately it\'s the reason I can\'t go back there too often, hehe. I truly heart the Bacon Board. \n\nI also love the decor. This is another instance of a restaurant that is too good for its strip-mall location. It\'s a kind of rustic feel with a lot of wood and metal but they use empty bottles for the light fixture that add a cozy ambiance. This place is conveniently located right by the Shea exit on the 51. I would take visitors here for sure, that is if their cholesterol levels aren\'t already on the edge. ;)', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2014-01-06', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'rotKO3R8h23YbiLFaZ-BLg', 'review_id': 'gz2I-6_pD4T6kNGe2_-K2A', 'text': "My fiance and I loved the Downtown Scottsdale Bootleggers, so we had to try this location.\n\nThe service here was fantastic.  At both locations everyone was incredibly kind and helpful.\n\nThe food was excellent.  We tried the Shrimp and Grits, which was delicious, as was the PBLT and Bootlegger Burger.  The drinks are great, too.\n\nThis is now my go-to restaurant for BBQ.  \nIf you haven't been yet, give your diet a day off and get in here!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-01-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'Fw5LYu9i4kWQ07bCLigr1w', 'review_id': '74R_YcGakC7EQChBMu0zfg', 'text': "So I went out for a quick drink with some friends last night and pulled into Bootleggers. I honestly thought it was going to be some little drive bar judging from the small plaza it is located in. In fact, it even looked closed! But once inside I was very impressed. Mason jar chandelier and drink glasses. Perfect atmosphere for a smoke house. There's a window that allows you to see some of the kitchen and the wood piles used for smoking. The place smelt great but my friends and I were only there for a quick drink. That's when the bartender informed us about their signature apple pie moonshine made in house. It was pretty tasty, I gotta tell ya. But I can't wait to try a meal. Service was great. The bartender, I think his name is Mike, was great! Definitely a good experience. I'll be back to write a review about the BBQ here soon!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-01-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 2}, 'user_id': 'DGTip0-KD3Rr39Oafz3ncg', 'review_id': '-mQ_7PU5pq5OXqoTbRAjbA', 'text': "This is a cool local restaurant - love the overall look and feel of it.  They're open 'til 1 or 2 am so I would definitely come back here in the future for drinks and hanging out.\n\nThe food was good.  We ordered the Bacon Board, St Louis Ribs, and Mac n Cheese.  The mac n cheese was reallllyyyy good.  Came out piping hot and had a nice crust on top.  The bacon board was very interesting, had about 5 or 6 different types of bacon with 2 different jams, bread and pickle.  There's no correct way to eat it,  you just kind of eat it how you want.  The ribs were good... great flavor but it couldve been a bit more tender and it wasn't hot, it was lukewarm.  \n\nThe service was friendly - they weren't negligent or too bothersome.  \n\nI'd definitely come back to try other things on the menu", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2014-01-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'JtwWEFC6sDAyihuIM970yg', 'review_id': 'f1h0ZkzBP-kOvIWkxfqY1Q', 'text': "The Best BBQ in Arizona!  Start with the bacon board then tackle the brisket and ribs.  Finish with cobbler.  Chef James Fox is a master at smoking meat, as well as pairing it booze; it is named Bootleggers after all.  Ranging from an apple pie moonshine cocktail to local craft beers, their bar is as well tended to as the smoker.  Bootleggers is a must for any Zoni!  So here's to James, you have thoroughly wet then quenched my hearty thirst for exemplary barbecue!  Cheers!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-01-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hQJPPTEy_iamIVF7nfoFGQ', 'review_id': 'IOdTRN8fD95JkupxpwJiAQ', 'text': 'I really enjoyed everything about this place. Cool theme, great food, unique atmosphere. I had the short ribs and was more than impressed. The other people with me had the chopped kale salad with salmon added. She is a pretty big kale salad fanatic and said this one was one of the best that she has ever had. My dad had the burger and it looked and tasted great. It was very rare which is the way I love it but, my old man probably would have preferred it a little more well done. The only other compliant would have been that they were out of a couple of the beers that they had listed on the menu they were out of one of the appetizers that we had ordered as well. It was a Sunday evening so they probably had a busy weekend.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-01-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IjafRfMSAQpInLlw-Vi0Cg', 'review_id': 'iN3fVxkhIVEe9eyNxdqAyg', 'text': 'I got the pork belly sandwich. It was cooked well. it was tender, but had no flavor. Really bland. That was only one sandwich, maybe they can do better, but for now they are sitting at a 2. What also kept them down was the server had no clue about anything on the menu. More education for the servers about the food would be better.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 2, 'date': '2014-02-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'tqjY8__KQI5kE8pA41nUEw', 'review_id': 'bQwoPXiTGt08SoLkX9wFRQ', 'text': "My boyfriend stumbled across this place while searching for a local evening spot. As consistent Yelp users I'm not sure why we didn't we find this place earlier, but we definitely lucked out that evening!\n\nThe ambiance is inviting - not too light, not too dim, the TV must have been at a decent volume because I didn't notice it, and the music didn't compete for attention - just enough subtle background noise to fill any lull in conversation.\n\nWhile the ambiance is important, the food and drink is definitely the highlight! I've had the pleasure of their Bootlegger burger, along with a variety of moonshines. I have to say this burger is by far THE best burger I've ever had. You know the Carl's Jr commercial with the person eating a super messy burger with juice dripping down their face and hands? It was pretty much that experience, but with one exception, this burger is a million times better! Did I mention the pretzel bun? No joke, it makes me sad when I realize there's only one bite left.\n\nIf you're wondering about the other menu items, I've heard they're just as good, but I can't tear myself away from my Bootlegger burger.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-02-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '96-WVJBbvbVzrcf4B2TuPg', 'review_id': '7t4KxwPvchzvV6n5HlGAgg', 'text': u"Been dying to try this place and so glad we did!!! The sweet corn app was wonderful but be careful it's spicy! My fianc\xe9 did the pblt which was fantastic, very simple but great! I had the bootlegger burger, OMG probably one of the best burgers I have had in a long time. It came out cooked perfect super juicy, I recommend using a plate to eat it rather then the board it's served on (presentation is great but juices go everywhere). The pretzel bun was perfect! We shared the Mac n cheese and the cauliflower both delicious! Also the house made chips that come with the sandwiches are yummy!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-02-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'z3xOgubkCYr2qNi7IuG9Rg', 'review_id': 'BAyxJRLZuTmdXMmFGxClNw', 'text': "First off let me say I'm always looking for new restaurants. This place is by far the best restaurant I've been to in a long time. The chicken wings are a must try for starters and the corn is right up there. I ordered the St. Louis ribs were very good I tried the brisket and I was amazed at just how good it was. Our waiter Alex made our family experience complete. If you read this please go eat here you won't be disappointed!!!!!!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-02-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zz2TzgH7WtEcNTUu1NGbYg', 'review_id': 'SyZeRv1mAdiuPd5hKDq_hw', 'text': "OMG!  I have been here a few times now.  Usually, I just go and have the pork belly tacos which  are only $5 during happy hour.  Amazing.  However, I went there for lunch and they didn't have those tacos so I opted for the brisket and could not believe it.  It was probably the most flavorful piece of meat I have ever eaten in my life and that is huge as I love meat.  It also comes with HOMEMADE flour tortillas.  I'm such a tortilla girl, but I barely ate them as the brisket was soooo amazingly good.   It was so good, I ate two orders!!!!    It's not cheap, but it is well worth it.  Can't wait to go back.  \n   BTW, they also sell moonshine!!!!  Too cool!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-02-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'fu7yLZyIzD6WdBBjhb_YZw', 'review_id': 'a6mzYq3gMjhWFqzlCplRVg', 'text': 'Drove by This "hole-in-the-wall" for nearly a year before a friend recommended we check it out.  Who KNEW??  Took the kids on a Saturday evening,  the intoxicating smell of REAL BBQ drifting into the parking lot lured us happily inside!  The house was busy but under control.  Once seated, orders were taken immediately.  The waitress & manager sincerely apologized they only had TWO infant highchairs & both were in use.  This made my dinner experience a bit rough, and eventually, I had to tote our 7 month old outside as a courtesy to other patrons.  \nThe ambiance was casual but romantic, the food was delicious, the service was great.  \nLets get a few more high chairs in the dining room and you\'ll get 5 stars from this mama!', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2014-02-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'sswYaxw2SCb7bVIif2ao4g', 'review_id': 'X5OFg_6ixMrIbObILMyDww', 'text': "This was our second time at this establishment. The first time we were here I tried their pulled pork sandwich, it was good but not excellent. \n\nThis time however I tried their salmon entree and wow, it was absolutely incredible! The presentation was amazing and the salmon was cooked perfectly. The fregola sarda and apple cider gastrique was absolutely delicious. I would definitely recommend this entree.\n\nAnd for dessert I had their peach cobbler which was very good. I'm glad this restaurant is within walking distance to our house. which made for a lovely evening with my wife.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-02-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'rJfJ_o2EsadZIyfvOTjiiA', 'review_id': 'wZQ6jVyQfKoqapKXjWS3HA', 'text': "It comes with a heavy heart that I have to rate only 2 stars.  I've tried this place twice now and both times the service was horrendous!  I don't really understand why either.  The place isn't that busy and there are quite a few servers walking around.  Both times we waited over 10 minutes and had to flag someone down just to get started with water or even have someone say hello to us. (I want to add that we came after the dinner rush on both occasions.  There were open tables around us.) I feel that is a little excessive of a wait time for a greeting.  Anyway, even after being greeted and drink orders placed, both times we found ourselves lurking around the restaurant in search of help once we were ready to move through the steps of the meal process.  (i.e. order food, refill of water, order another drink, etc.)  The food here is really good and I really was hoping that last time we were here that the bad service was a fluke.  Unfortunately no.  With there being so many restaurants to choose from nowadays.  I don't foresee myself trying this place a third time.  The lack of attentive service has steered me to trying out other places instead.  Not to mention that the food was better on our first visit.  Hope this isn't a trend as well.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 2, 'date': '2014-03-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'W_R-gVF8OHNrIhtmyhDnyg', 'review_id': 'sHp2rNHaPCG0Ni0Amz0iUA', 'text': "Went there on a Saturday morning for lunch and there were only a few tables occupied. \n\nNot the easiest place to find, kind of tucked away in a small strip mall in the corner. Good size parking lot. The inside of the restaurant is like a bar.\n\nCame here for one reason and that was for the pork belly sandwich - PBLT. The cut of the each bacon / pork belly is pretty thick in size. Nothing special about the bread lettuce or tomatoes but the pork belly was nice and thick and of course greasy.\n\nHad to try thus once and it was a pretty good sandwich. Reminded me of another place in Chicago that had thick bacon like this. \n\nCan't say I whether I would come back but maybe ti try the bbq", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2014-03-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4OoN5RSqVYAkT1msWa5vAA', 'review_id': 'Pn4lknxAT0kOE99S3Reg9w', 'text': "We ate before we came since I expected a dive...boy was I wrong.  What a great atmosphere. Rustic and laid back. Menu looked great. Can't wait to come back for dinner.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2014-03-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'z6Q8uKccZ2iu2G_rgC0tog', 'review_id': 'ttzJQ6r6wBUkZ435vAc6bQ', 'text': 'We decided to try this place out after doing some shopping and were a bit worried after reading some of the reviews about having long wait times, cause we were going a bit late and were Super Hungry. BUT, it was great! We got seated quickly, waiter came over right away, and food came out fast. So no problem with speed. And food was awesome we both loved our dishes. Turkey Melt & PBLT. We will be returning!', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-03-15', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': '7XozMqHn_xs9HifPeWPxbw', 'review_id': 'y2IiNx_xs3AIJavN3SGG1Q', 'text': "Yea, I know. I'm the guy that ordered a burger at a BBQ place. Glad I did. It was fantastic. Perfectly cooked with a great blend of toppings.  I'm definitely a burger junkie and this is in my top 3. \n\nMy friend had the bacon plate. Like nothing I've seen. Delicious. \n\nThe ambience also helps. I hate places that are too bright or so dim you can't see your meal.  This place is just right. \n\nOur service might have been a bit slow for some people. But I prefer not to rush my dining experience.  If you are in a hurry, don't go out to eat. \n\nThe menu has lots to choose from. I'm excited to try the rest of the items on the menu.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-03-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'clDZzfxkpoN6VRuQYnGorA', 'review_id': 'R1DjZMbfxZuzlzjNVQvJUQ', 'text': "There brisket is absolutely amazing! I can't resist getting it every time I go there!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-03-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BCBQ2XPWJb2ZWoA5NZ_Jkw', 'review_id': '0BqFhDuoz8xNhroTY10UtQ', 'text': "This place is awesome. Every cocktail I have had has been amazing...just the right amount of ingredients to be flavorful and strong but not overpowering. The bartender is friendly and attentive when you need something but never hovers when you don't. Her service is professional and stylish and she knows how to make a good drink. The manager is super friendly and makes a point to stop and say hi and welcome new patrons. The music and vibe is right on point. I love the dim lighting and wood cabinet back bar. And the food is delicious in that its probably not that healthy but tastes sooo good way. \nIt's so nice to have a hip spot on this side of Shea and not have to always go to Scottsdale for a great place!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-03-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'gWaM-fZf1mSgNCyLW2Jo1Q', 'review_id': '4LVQBLYPxXHWdqkrw4Ufqw', 'text': "Went there on a whim with some friends and we were pleasantly surprised. My suggestion - order the bacon board and cheese fries as an appetizer. You won't be disappointed. The wait staff was friendly, the food was amazing, and the prices were decent. Definitely plan on returning.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-03-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '6qo04lq-8q9P1w9n8spmGA', 'review_id': 'BBF5gWEFLPCldIB0__IQEA', 'text': "they have a bacon board. read that three times and tell me it's not the best thing you've read all day. other than that stellar menu option, they have great southern bbq. it's not tex-mexicanized which is much appreciated for my north carolinian husband. \n\nsunday brunch is a large mason jar bloody mary with a skewered slider, french fry, pickle, olive, lemon and lime with a beer back. they do not joke about brunch. that's what you get. that's all you need... maybe two... maybe three. you'll thank me later.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-04-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JbEUL3sYEFHF3EyFf3Mntw', 'review_id': 'MuLHQYV2rrhYcwMgThf4SQ', 'text': "The only reason I am giving four stars is because I am a vegetarian and this place doesn't work for me. However the salads are great and the choose of drinks are really good. We love the atmosphere inside as well.  It felt very comfortable and had a modern rustic look. Keep up the good work and hope you stick around.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2014-04-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '4OOmSWs18WidFfHyF-IGaQ', 'review_id': 'HUgj7K6LtyK10UYwJkA4NA', 'text': "One of the BEST places I've eaten at since moving to AZ !! Smells good walking in , so many good choices on the menu .. We got the bacon board , turkey leg , brisket sandwich and salmon entree , omg they were all so mouth watering good ! Excellent flavors , paired with garnishes that I would have never tried and so glad I did ! Bacon that melts in your mouth ! Anyone who goes must start with a bacon board ! Oh and our drinks were stiff and good size :) .. Good service and ambiance . Will be back for sure !", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-04-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'GELnq-W4_6tiYoBcLJkmWg', 'review_id': 'tWywnSFC6bDJqQw5rq_x1g', 'text': "Really cool place, moonshine is an awesome concept for a bar.  Our bartender was awesome, knew a lot of about the history of the place, the area, the moonshine, pretty much everything and was very friendly.  We didn't eat the food, although he did say it was good, I would definitely go back and try some other flavors of moonshine.  Was only in there for a few minutes, but had the apple pie moonshine, the blackberry and white lightning and thought all three were good.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2014-04-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XMdR1aO9X5HnU2ntqBJCqg', 'review_id': 'UHjR1c9y-yMLPEjkt0KZGQ', 'text': "This place is awesome! The service was great and quick; we literally could've gotten out of there in 30 minutes, but the vibe was so fresh that we decided to stay for a couple more drinks! Love it!!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-04-11', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 2}, 'user_id': 'Ep3anRsVSShs7O4DlEmoWA', 'review_id': 'tFlzMGXmgOCNFTaP_mZ1dg', 'text': 'Had a pulled pork sandwich which (for them) I, unfortunately, make the best ones, so I know how my pork should taste.  Theirs is just adequate.  I say this because I found lumps of meat in my sandwich which was not chopped up or pulled as it should be.  Also, they are kinda scrimpy with the meat there.  Taste was okay but nothing exceptional at all.  It rates a "meh" from me sadly.\nServed with some home made chips which were ok, but nothing spectacular.\nThe staff and service was great, the place is cute with it\'s little fresh sunflower at each table...but the food, to me, was just average.\nI\'d give it another try, but I\'m not holding my breath that this will rate a 5 star next time or ever.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2014-04-12', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'Nwk6UxpImt_o9QB6ArMYtQ', 'review_id': 'g1mnxi3Sx8nkmowbysFx6g', 'text': 'Wow!  So good! I wish it was in mesa instead of n. Phx.  Everything was great!  Really great. PBLT is a great sandwich, Mac n cheese is awesome!  My gent had pulled pork and potato salad and it was nothing less than perfect.  I highly recommend this place!', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-04-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Jrx1fLr5JdqgHdIfMT7wag', 'review_id': '-0bfljlLsxtACDcx-W_3Wg', 'text': 'Came here to check out the BBQ. It was just okay. Service was good. But just not special enough to come back to. I think this place is more for their drinks.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2014-04-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'i6O2vi3PiSNt1GRixjXojw', 'review_id': '017WD41BeXNOjaAmj2FJYw', 'text': 'Just stopped in for a drink, but the service was excellent and the smell was amazing!  Will surely be back to eat!', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-04-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 1}, 'user_id': 'YVK9az5yUFbpQchy0DYUeA', 'review_id': 'I8h1EdnwKk8sNikBdPbiuA', 'text': "Okay, another SLAM DUNK to report in Phoenix area.  Bootleggers is a great place off Shea and the 51.  Get to Shea and you are there.  Environment was cozy, cool music, great prices and friendly staff.  Need I say more?  Probably not, but you know I will anyway.  The BBQ here is phenomenal.  I saw the BBQ smoker in the back and if that doesn't make you hungry there is something wrong with you.  We ordered the hot wings (good), the hamburger (great, right up there with my all time valley favorite Bobby Q's - of the 17) and the pulled pork with coleslaw on top (AMAZEBALLS)!!  \n\nThe general manger Jacob came over.  Guy is as cool as it gets.  We enjoyed a cold beer (Oak Brown Nut Ale of course), oh yeah, and THEY SELL MOONSHINE!!  Oh yeah.......try the one with applce cider flavoring - DELISH.\n\nAt any rate, place is like one year old, great vibe, so get out there and give them some business.  Aside from Bobby Q's (which also gets a 5) this is a repeat visit waiting to happen and the best on this side of dodge.  Parking is a breeze and this place will not disapoint.\n\nThanks for making this fun guys.\n\nHave fun, and Find your Sizzle.\n\nAttorney Steve, the Business & Real Estate lawyer\nhttp://www.attorneysteve.net", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-04-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'DVqigFeLodiysUezvQRkGA', 'review_id': 'rSDd1RaXurFk4aRKH9GKOA', 'text': "this restaurant is definitely a must try! the interior of the place was super cute, dim, rustic? the staff were very nice and attentive to our needs. we came for their moonshine and bacon board and let me just say that bacon board was AMAZING! it's 5 different kinda of bacon with cheesy bread and two types of jam to complement the bacon. the bacon were all distinctively different and so tender and flavorful. a must try! their house made apple pie moonshine was delicious! I didn't realize the other moonshine a were commercially bought and those were really strong and not too tasty. we also ordered the Mac and cheese and BBQ sampler for 2. the Mac and cheese was pretty delicious, very creamy and had a nice crust on top. the BBQ sampler was pretty good too but we were kinda full from the bacon board. the brisket seemed a bit dry and all the BBQ sauce tasted the same so it got hard to finish, but it does come with tortillas and a delicious coleslaw. the people inside were very chill, not rowdy or overly loud place, I'd definitely come back!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2014-04-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xSetRvBmtH7mu_jtuGGh9Q', 'review_id': 'ktPwAYgySc--N4ZKGkoxEw', 'text': "Despite the location (in an older strip mall at Shea and the 51)  once you step inside there is a rustic modern decor with cool lights, wood and metal accents, and clean lines.  I like that while televisions are available, they are not over the bar. \nThere are about a dozen tap handles ranging from pilsners to IPAs and more bottled beer on ice. The wine selection appeared decent, but the star as far as beverages go is the cocktail menu.  The mixologists are friendly, knowledgeable, and enthusiastic.  I hope to someday try one of everything then move on to whatever the staff wishes to create.\nWe could smell the BBQ from the parking lot.  I judge all BBQ by the brisket. Theirs was nicely smoked and moist, but it was served pre-sauced with a thin sweet coating.  I prefer a great dry rub myself, but it didn't slow me down any. The happy hour tacos (3) were small but tasty and made a complete meal when accompanied by a shared side order. I will go back for the ribs.\nThere were more regulars than not at least during happy hour (7 days a week). It seems like a great place to meet friends, stop in for a beverage after work, or spend a quiet date night if you, like me, also find BBQ romantic.\nMy waistline and my liver are happy they are 20 miles away.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-04-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'YuP0nieAHhieo8DbBC84zg', 'review_id': 'olo0EOI3dPKTXGCbJZlksQ', 'text': "My husband and I couldn't be happier to have finally found a great restaurant in our area! A convenient location off the 51 on Shea Blvd, makes this place easy and fast to access from anywhere. \nWe initially went in for an after dinner cocktail, but soon realized we wanted to try everything we saw coming out of the kitchen. We ordered the Bacon Board, and couldn't have been happier with the results! \nBoth the food and cocktail menu is fun with a twist on the regular american cuisines and beverages. \nIf you're looking for a casual, fun, and cozy dining experience this is the place to check out.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-04-27', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 0}, 'user_id': 'BjwXX-sChcjx2E55B_7rXg', 'review_id': 'U9y_hv4pUonP6b7Dw84y2A', 'text': 'My pulled pork sandwich at Bootleggers wasn\'t fatty. "Fatty" implies some sort of holy union between tender shreds of protein and slow-cooked, melty lipid. Fat was on one side of the arena. Protein was on the other. I was picking wads of cholesterol-flavored chewing gum out from between the kaiser roll, which was very soft and brioche-y (you know, to enhance the mushy fat aspect of the experience.)\n\nNow look, I ain\'t a bitch. I like fat. I also like chips, so you know there\'s a problem when the greasiness from the chips is actually about to saturate and capsize the sandwich. Few things deter me from putting chips on a sandwich.\n\nMoving on from the first-world problems and onto the first world solutions, the coleslaw on the sandwich was excellent in all the ways. The pork itself, as well as the flavor, was good. I actually found the huge, unshredded chunks to be the best part, since I didn\'t have to worry about trimming them first. \n\nSPOILER ALERT: Happy ending! Basically, my persnicketry saved me from expelling food in public or having to go get a coronary artery bypass graft. (Day ruiner, am I right?) So naturally I got a blueberry & peach cobbler with ice cream afterwards. Super sweet, very comforting, and the topping was made of mutilated cinnamon toast crunch. Novel.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 2, 'date': '2014-04-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'gzRsfkwkxS1OAcMvh6muDQ', 'review_id': 'HYSw9wsGGOvzEjPTBZMY7w', 'text': "After a run on the trail on 40th St trail, me and a buddy decided to stop by Bootleggers tonight to recharge with some food and beer.  This was our first time at the restaurant.  It has a pretty cool atmosphere and the staff was friendly,and initially attentive.   Everything seemed promising until 10 minutes passed before anybody took our drink order.  We waited an additional 10 to 15 minutes to order food and then a excessive amount of time for the food to arrive.  I'm not an impatient person when it comes of food service and can also understand long waits if the restaurant is slammed.  Bootleggers was not overly busy and we spotted our waitress talking casually with other staff or doing nothing at all.   She made no attempt to ask for drink refills or provide an apology for the long wait.  Fortunately the wings and nachos we ordered we outstanding, and the beer selection is good.  I wish I could give 4 or 5 stars, but the poor service makes that impossible.  I will give it another chance though.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 2, 'date': '2014-05-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cMlAIBZlj4G-bSs5Z27-mw', 'review_id': 'JOPqNRoGkrFCmaE8UQX8TA', 'text': 'Great place to have a beer or have anything from their great menu. The bar and sitting area is as hip and rustic as it gets. Very friendly staff and all around a good place to be a usual hang-out place.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2014-05-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'sDyaN_3DEZyhnJPUFIwoEg', 'review_id': 'hqvg7JhJl_HvX1gxTAgIiA', 'text': 'I am a fan- I think the prices are a bit high for what you get but that is just me... also- tortillas but no corn bread with barbecue?! It is odd. I do like their drinks alot here though.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2014-05-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 2}, 'user_id': 'rxyZ2tWhKWIx2CEMs5H1Ow', 'review_id': 'XHq1n7owyzibSlOTi9rvTQ', 'text': "I really can't say enough about our experience here...start to finish, it was 10/10 on all fronts!\n\nI wanted to have a birthday dinner with a bunch of friends, but I made the mistake of waiting until Saturday  morning to make a reservation for Saturday night. woops. Fortunately, Bootleggers was able to accommodate my original request for a group of 10 on the patio--which is gorgeous. I called a few hours later and upped the res to 12...no problemo. As is common with big groups, not everyone RSVP'ed to me and we ended up being a group of 16. Still, they made it work without a hitch or sigh.\n\nHaving worked in the industry myself, I know how it can be to serve a big group that grows even bigger, and everyone was talking over each other and going nuts half the time. Our server handled it like a champ!\n\nThe food was awesome -- everyone had good things to say about their chosen dishes, including my vegetarian friends who ordered a bunch of the veggie side dishes and really loved them. I personally ordered the wedge with chicken added and it was great. from other plates I tried the pulled pork mac and cheese, burger, cauliflower side, potatoes and probably some other stuff. \n\nAll of that being said, the best part of the night was the guy who made my birthday dinner extra special by bringing out a round of apple cinnamon moonshine and a banana bread pudding for me. As we were leaving, we found out he was the owner of the place! Super cool guy. He came out to take a group photo for us and even thought to bring up the lighting on the patio beforehand to make sure we got a good photo. It was really thoughtful of him on both accounts. \n\nWe will definitely be back!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-05-07', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '4wFlqAzzAScCaY9R1pHkWA', 'review_id': 'jvxM3aag-616JkxkUWsCiQ', 'text': "Bacon board! Bacon board! It was AWESOME! Not only the bacon but the condiments (mustard/jellys) that come along with the bacon. Also had the BBQ sampler with an order of mac & cheese...it was super good. I've only been once but I've literally dreamed about that bacon board several times. Going back soon and I highly suggest trying Bootleggers out.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-05-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'GQyHwLW_JP55WhkKvk340g', 'review_id': 'If6brsrnWbwQONd8iPCQ0g', 'text': "Bacon Board!!! Bacon sampler appetizer... nuff said. So good! I had the brisket which was just phenomenal. My side of mashed potatoes came in it's own little cast iron with cheese melted on top. Definitely try the moonshine cocktails! Love this place. We'll definitely return.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-05-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'qvVUH58N9WrsA1pSMi7Zig', 'review_id': '56o__hXgH_Dn92CFfjc5eg', 'text': "Bootleggers is walking distance from my house, so I was super excited to have a revamped bar  nearby. I've 'been here half dozen times and I hate to say I am not very impressed.\n\nService is incredibly slow, every single time.  There is clearly no sense of urgency to greet tables. It has taken 15 minutes to get a beer. Even when the server made an error on our tab (overcharging us hundreds of dollars), she didn't seem apologetic at all. \n\nI've had some amazing food (the nachos!) and I've had very average food. The Bootlegger burger is delicious. On the flip size, $32 for three meats and a side of coleslaw is serious overkill.  The pulled pork sandwich and grilled cheese are average. The asparagus and cauliflower sides were awful. They have a great draft beer selection (although they got rid of all 4 I once ordered) and moonshine served from mason jars. \n\nYou will easily drop $50 here for dinner for two and one round of drinks. I have brought friends and family here and they often leave disappointed. It may be worth a try, but I doubt I will back for anything but the nachos and burger.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2014-05-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'FKg5GKz7_hG_c6QdKIcjwA', 'review_id': 'KY1kNAQLQw2nhNsFC8P7yw', 'text': "We went to Bootleggers for the first time on Saturday night.  Overall pretty good, I had some mixed reviews.\n\nPros:\n- Super friendly staff.  I had to change my reservation a couple of times because my husband was running late.  They were very friendly and accommodating.  They said as long as we arrived by 10pm we shouldn't have any problem. \n- Cocktails were awesome! $11 each so they better have been! \n- Bacon board was incredible! \n\nCons:\n- I got the ahi tuna sliders.  Pretty good, kind of lacking in flavor. \n- Husband got the short rib.  It said on the menu that it came with sweet potato fritters, but seemed to both of us more like mashed sweet potatoes. \n- They started clearing our table before 10pm.  We were finishing our very pricey cocktails and they took our candle and our flower away.  Totally rude in my opinion.  You can't just wait until we stand up and leave to grab the flower and candle!?  Biggest pet peeve is trying to enjoy dinner and you're not-so-subtly getting kicked out.  We weren't even the last ones in there.  Ruined the remainder of our experience.  Good thing we didn't order dessert, I have a feeling they would have just boxed it up for us.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2014-05-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'F_r2NtzpV10pDxkqoB6Fdg', 'review_id': 'HqelATdyILKyUMMghKwpyg', 'text': "Well if you're looking for an overpriced bbq restaurant with small portions you've come to the right place. I came here with my friend and we ordered the bbq sampler for 2 at $32. It would have been a hearty meal for one with a decent amount of leftovers but for two people it left much to be desired. The brisket and pulled pork were delicious, as were the tortillas it was served with but I'm pretty sure fries aren't supposed to be spicy, I'm also not sure why it cost me $2 extra to substitute the side order of coleslaw with fries when they cost the same on the menu.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 2, 'date': '2014-05-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'g4luSu3EFv3tmEAj1XrNog', 'review_id': 'CGq5ZZTuVOIvxThX-eoZRQ', 'text': "Party of four went for Wednesday night dinner. Items not available to order: beef brisket, fried chicken, pork chop. Service was excellent which somewhat offset the fact we couldn't try their signature brisket. Pulled pork was greasy and the bacon on the Bootlegger burger was undercooked. Side dishes were pretty flavorful. Overall a mediocre dining experience. Hopefully will be able to go back and try other dishes as the neighborhood location and atmosphere were desirable.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2014-05-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2QTrMf28FeX7Q2meTyXKIQ', 'review_id': '6xgyPIu7Mplm1Au9y80n-Q', 'text': 'Great food! Hit and miss service...', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2014-05-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'GoDjpEPTyUQoQVRwPljIgw', 'review_id': 'ckkMh2ZYd-7OGPgrP3XYNA', 'text': "When we pulled into the parking lot, the  smell in the air was so strong and fragrant of BBQ, that we immediately had high expectations for the meal we were about to eat.  We sat ourselves in the back, but it was so loud, that we moved to the bar closer to the front of the restaurant.  It was much quieter there.  The walls are covered in wood and metal to compliment the industrial theme, so the noise just sort of bounces around with nothing to absorb it.  \n\nIt was happy hour, so we ordered a plate of nachos.  There were huge flavorful chunks of avocado, but only very teeny tiny pieces of brisket on them.  We ordered the PBLT which is a BLT sandwich, but the bacon is replaced with juicy pork belly.  The pork belly was juicy and tender, but the bread on the sandwich was so over buttered that all I could focus on was the greasiness of the butter.  We also ordered the brisket with a side of potato salad.  I absolutely loved the potato salad.  It was chunky and super flavorful.  It was a mustard based potato salad.  The brisket came as a huge portion, but my hubby was sad to discover that at least half of each piece was all fat.  Of the meat that was there, the tenderness and flavor of the meat was good.  It's just hard to love any brisket after you've eaten the stuff from Little Miss BBQ!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2014-05-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KQnq1p-PlWUo-qPEtWtmMw', 'review_id': 'AH4YW5H1HU6eyx9N67sS8w', 'text': "Im with the rest of the folks on here, in the fact that I really can't say enough good things about this place. \n\nIt has a modern but rustic atmosphere, that just flows. I guess if I had to complain about anything it would be that the hostess dress was so short I thought it would just roll up at any second and give the restaurant a show. Very unclassy and not appropriate attire. \n\nBut, now to the good stuff! \n\nGet the bacon board. Its literally a wooden block with different flavors of bacon. Don't even think about it.Just order it.\n\nThe moonshine will also give your body an unpleasant kick in the face, but its good! The martinis were also fantastic. Great happy hour pricing and a really neat place overall. \n\nWould definitely stop by again next time we're in Phoenix.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-06-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IxqDzUzOMI4Te0Af239ZDw', 'review_id': 'ch8ov2wOMFxhTQGOOXJV2Q', 'text': 'Poor service! My grilled chicken was over cooked and the beef brisket was so so! Definitely disappointed in this place after all I had heard about it, but I did notice we werent the only ones receiving poor & slow service.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 1, 'date': '2014-06-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tnGcCddb1VwhCMi-H64dMQ', 'review_id': 'tezqBh9ppecWnh1Uge7S6Q', 'text': "This place should have way more customers but doesn't due to an unfortunate location. The PBLT and Bootlegger burger are mighty tasty. Try the Dr. Pepper BBQ sauce if you be of the dippin' persuasion.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-06-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'X9YqBE7uJUPQ5m9GdFF6fQ', 'review_id': 'QPW27BGSkNgzRgYMPanqxw', 'text': "This place is in a strip mall so the initial feel is more like a bar but after walking in the decor and ambiance is nice. I wasn't overly impressed with the experience though. We got the sampler platter and everything was prepared in a sweet BBQ sauce which made it all taste the same. The Mac n Cheese was great as was the apple pie moonshine. The server was nice but very slow, and we ended up having to ask multiple people for the same thing. Everything took a while and plates sat on the table well after we were finished, even after we had paid. Overall the experience was mediocre.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2014-06-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'w6tMOpAhpu4JU5NyIfFhsA', 'review_id': 'l2SjuoaiqlVr_Tu7GEPZJw', 'text': 'Bloody Mary, Moonshine, and Bacon Board!! What more can you ask for? This place is great. Great service, great drinks, and yummy food.  The ambiance is great too. If you are a meat lover this place is for you. The BBQ is great too.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-06-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'WTbKjTqavtyMhcCjkr5AXw', 'review_id': 'Zw7J8xKesreig5Me-JC0Uw', 'text': "2nd time coming here and it was just as good as the first. The service is great and the food is wonderful. It's tucked in the corner off of Shea and the 51 and I would have never found it if it wasn't for Yelp. If you like bar BBQ you have to try this place out. Killer drinks too!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-06-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lRMshM3iDQw7Pqv_7PWoaA', 'review_id': 'tI7rD2t-gQ-hsAgEDfBBpQ', 'text': 'We\'ve been to this Bootleggers many times before yesterday and we loved everything about it.  I toook my family there for Father\'s Day dinner around 4:30pm and this time we were very disappointed.\n\nTheir menu is totally different from 2 weeks ago & it no longer has any of the excellent food they are famous for!!!  \n\nThey didn\'t have any lemonade, we ordered an appetizer what never came,  they didn\'t have their Sunday Special "Prime Rib", my daughter ordered the ribs & while the meat fell off the bone, there were small shards of bone throughout the meat - she couldn\'t eat them!!  Their famous tacos are only available during Happy Hour and their prices have gone up ALOT!!!   The service was very slow and we overheard many people complaining about the service!!!\n\nWe used to be big fans of this restaurant, but now we\'ll have to look for another neighborhood smokehouse.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 2, 'date': '2014-06-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HpHIRyT6jL2eY46FGDfxvg', 'review_id': 'fjDEd06UU9dIm1oaNJ1MDg', 'text': 'Terrible experience for us!\n\nFour of us went out to Bootleggers in Phoenix because we were in the area and the one in Scottsdale was good so -- why not?\n\nWe were seated pretty quickly - we asked for the booth but it was under a reservation that was already late. They said they would move us but never did (and the reservation never showed). After looking over the menu for 10 minutes we realized no one has stopped by our table to ask us if we wanted drinks or not. So we asked the hostess to send over our waiter if possible. \n\nOur waitress Tami (not our actual waitress but the girl who was going to take care of us) came over and said "I was told no one has stopped by your table! So I am going to help you out." Awesome, by this time (15+ minutes sitting there without drinks - other than the water the bus boy left) we were ready to order. So we ordered it all and waited. Someone at our table ordered coffee and I ordered iced tea - everyone else had water. \n\nI asked for a straw when my tea came out that I never got and I was never offered sugar or anything for the tea. When the coffee came out she was holding it and telling us that it made her hands warm. Awesome, but can you NOT hold the cup in the place where I drink it? I hate it when someone hands me my drink and your fingers are touching where my mouth goes. NOT OK. Also - no "do you want cream or sugar?" nothing. \n\nSo, we went to find the hostess and ask for some cream and sugar for the coffee after waiting another 5 or so minutes with nothing coming out. She said "yeah it\'s in the fridge" and eventually brought it out to our table (mind you I still have no straw and no sugar). \n\nThen we receive our food. It was dry and overcooked. My pulled pork was flavorful but dry and overcooked. Once we received our food, she never came back to us. Until it was time to pay. It isn\'t like it was super busy. I am glad we apparently didn\'t need anything else. This was SUCH a ridiculous disappointment after having such a good experience in Scottsdale. \n\nOverall - it was not worth the money we spent or the time and frustration. \n\nGo to the one in Scottsdale instead.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 1, 'date': '2014-06-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9SmUBwtiLdI_4LcQoBdZkg', 'review_id': '9Pq8gqwgYP0zhdJ4FwkNCA', 'text': "Overall we had a very disappointing experience here. We had the bad luck to come in after a very big party which clearly they were not ready for or could handle well. We waited nearly an hour before getting our food- now mind you we have a toddler so keeping her calm and entertained for all that time is no small feat. When we finally were served my food was stone cold which tells me it was sitting in the window and no one bothered to run it. I grabbed our waiter and explained the situation and he did offer to remake it but I did not care to wait another hour to get my meal. He explained they got slammed because of the large party which I could almost forgive if the 2 tables on either side of us hadn't  been served and had finished their meals before we got our meal delivered. \n\n**that said the quality of the food was good but clearly it would have been much better hot and if we hadn't had to wait****\n\nThe manager did come over and apologize and offered to comp my meal and give us some desserts. I told him that would be great and much appreciated yet 20 mins later we had no check or desserts. We had now hit the 2 hour mark and I should add that I found the metal chairs to be very uncomfortable as I have back issues so I was beyond cranky now. We finally saw the waiter and asked for the desserts to be wrapped up because it was past my daughters bedtime and she was at her limit. \n\nMy husband brought us here with high hopes after eating there before but I have to say after the cluster of events we feel victim to it would be hard to give them another try,\n\nPS- The desserts did not stand up to being brought home. The brownie was dry and hard as a rock the next day.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 2, 'date': '2014-06-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'D0ZTDnjsXdKDHd5UM9XZiA', 'review_id': 'TgkYgRWPYeQvfW8rDuZlng', 'text': "Delicious lunch this week! I had my favorite, the panko chicken sandwich with yummy ham, cheese, arugula, etc.. It's the best sandwich! Buddies ordered the house salad with half a sandwich, and they loved it. Portions are generous and the house made chips are so good. We'll be back!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-06-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lBGQOJ8IPSVniWJhh3OU_Q', 'review_id': '6fWq16aPcmV0AMTkyIntJA', 'text': 'Awesome BBQ place! My waiters name was Alex and he was excellent! He told us about the place! The food: Very excellent Alex told us how they get there early and start smoking the meat. You can taste the smokiness! Overall one of the best BBQ places in the valley.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2014-06-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'efEPhKj2LNjsxkugpXI0Iw', 'review_id': 'K2dJMIkedPN6cmZ5HLtkEg', 'text': 'Really wanted to like this place. Brisket was tough and rubbery. Cobbler was average. Hostess lacked warmth and scruples.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 1, 'date': '2014-07-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7KP-dNolpO_wHMaPLpxg1g', 'review_id': 'e5_pbDwHq-6ZKb0CON5yLw', 'text': "Best apple pie moonshine ever! Some of the best BBQ I've ever had. The sampler platter is totally worth it!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-07-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8EPLUbwU4LTXN_qk17yIsg', 'review_id': '8Vmfzof6HXEvUKLOD8hXLQ', 'text': 'Went for dinner on Thursday night. First, our waitresses kept switching. The smokinghouse margarita was horrible, had to return. My husband ordered the special,  Boot Bacon Bomb, it was dry and salty, not worth the price. I got the brisket, it was dry and not worth the price. Our friends did not enjoy their dinner either. We would not go back.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 1, 'date': '2014-07-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'cosbiB3IZGD6-sRVbD7Thw', 'review_id': 'BcpAWeETq6y3pp9iS00XOw', 'text': 'I love this restaurant. I was craving a burger...googled "best burger in Phoenix" and Bootleggers came up. It\'s less than a mile from our house. How did I not know about this place?!?\n\nThe decor is awesome...rustic and comfortable. They have tables, booths, hard seats, soft seats, tall stools, etc. Something for everyone. \n\nWe\'ve only been for lunch or early afternoon and there is always plenty of places to sit. \n\nFood is awesome! Burger is the best I\'ve had. My husband got a bloody mary with a "slider"...it\'s a burger...seriously. So good...those are only available on Sundays. We\'ve been back and gotten the PBLT sandwich, the brisket, ahi tuna sandwich...all awesome! They make their own chips on site. \n\nAnd they usually let us sample their moonshine. I am not a fan of moonshine but I did try the peach cobbler moonshine this last time and it was soooooo good! \n\nI give Bootleggers 5 stars for their ambiance and food. The service is slow. It takes a while to get your food. Thankfully we\'ve never been in a hurry...so we don\'t feel pushed out of the restaurant, either. \n\nI can\'t wait to go again!', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2014-07-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CL-PExCJDA-mHXaJqz-mYA', 'review_id': 'sygVAON-s8eBGN3VZ2eniA', 'text': "Wow!  So glad we have such a great place in our neighborhood!!!  We started with drinks (love the moonshine, especially the Apple Pie Moonshine!) and then onto the Bacon Board!  5 types of bacon, we liked the Pork Belly Confit best but all were yummy.  The beef brisket was sooooo tender and pulled pork was great as well.  They make their own tortillas which is nicer than a bun and the cole slaw wash really fresh and not loaded up with sugary mayonnaise.  Cauliflower grilled with sweet onions and melted cheese was a nice change of pace as was the grilled corn on the cob.  We had tons of food to take home since the servings are generous.  Finished the meal off with a great brownie with Jack Daniels and ice cream.  The service was excellent!!  We'll be back soon!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-07-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': 'thdVzCfKx-DV0zYWqId3pw', 'review_id': 'cP4aSOHc3bMhJdBdxPxSZQ', 'text': "I'm glad I gave Bootleggers another try.  It looks like this restaurant has made it past its learning curve and finally figured things out.  The service has greatly improved and the menu has been properly chiseled down. Also, the popularity of trying the new place has worn off, so Bootleggers isn't even close to being as packed as it was nearly a year ago.\n\nThe smaller menu may mean less choices, but it finally focuses on what Bootleggers appears to be all about. The smoked meats. The meats all come with a tortilla or bun, coleslaw, and a side. With a price ranging between $16 and $32, you still get plenty of food for a good price. Besides, it's not like any of the smaller cheaper items that disappeared in the last year are sorely missed. If I hadn't looked at my previous review, I'd never have even remembered what I had.\n\nAnd don't forget to get a Local Dine (http://www.localdines.com/phoenix?ref=19485) before heading to Bootleggers. The website has a $50 for $25 gift certificate for Bootleggers. Unlike most web deals, it covers alcohol. So enjoy a moonshine flight while you're at it.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2014-07-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'd_wua5aAKmOFROoHuizYQw', 'review_id': 'VuSyMjWQslVR_A4JI3N98w', 'text': "Don't try anything else but the smoked hummus.. It's the best hummus I have ever had... Brisket was a bit dry, the brownie was awful however the hummus made up for it.\n\nSorry brisket the hummus won this round!!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2014-07-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 5, 'cool': 2}, 'user_id': 'F5KUqedvX7dJf3RbHfKo-g', 'review_id': '5aUKg1yqA9kh6LPtnP4Rug', 'text': "Not what we expected and not worth the money.  There is better BBQ for less money in Phoenix.  We tried Bootlegger's because we like to try new restaurants and this is near our home.  We sat at a high top and the tables and chairs were cool, but the table very wobbly.  This would not have been a big deal but you have to CUT their 16 hour brisket and 14 hour pulled pork.  Why do you have to cut pulled pork?  the whole table shook and drinks were spilled while cutting meat that should not need to be cut.\n\nIn their favor the draft beer and wine selection is good and the decor hipster cool.  If eating at a hip place is more important to you than the food, you might make this a three star, but we eat out for the food, not to be seen in a hip place.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 2, 'date': '2014-07-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'baVvyJ9EvmjXpdX10gLJoA', 'review_id': 'Q6CL4yvdusv8EuU7-sFZBA', 'text': "The place is beautiful.  Very well done in terms of decor and ambiance.  The meal was good but not outstanding.  The meat was the best part which should come as no surprise since it is what they are known for.  The server seemed a little distracted and it wasn't even very busy when we went.  I ordered the pork with the homemade tortillas and asked what salad options they had to go with the meal and when I asked it seemed like an outlandish question based on his tone in responding.  I felt the menu was a little overpriced for what you got.  BBQ in the Phoenix/Scottsdale area is a competitive market to jump into and I just feel there are other great options out there.  But if you are looking for a good place to go for the atmosphere this is your BBQ option.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2014-07-28', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'ol7Ubb3i2OXPoG_PE8QeLA', 'review_id': '_o9t_mNa5wHnKjQjO_noAg', 'text': "I wish I could say I like this place but I really don't. Last night was the 2nd time I went there and from what I had remembered from the first time it was terrible service and mediocre food. Last night was no different... We were there on a Monday night at 5pm and there were only about 6 other people there. I know that doesn't matter too much but you think the service would be spot on. We were served by an older guy that stopped buy our table every 15-20 minutes and had so many cheesy jokes it was hard to humor him. I got the beef brisket and it wasn't terrible but there were pieces off meat that were about 90% fat. The potato salad was some crap I could buy in the deli at Frys. Entrees came out at different times so we were all waiting for everyone to have their food. Avoid this rathole.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 2, 'date': '2014-07-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'L__XTqxyTHgMK2dFi64hng', 'review_id': '_zes9Dr_aIeV2mGtS0H7ig', 'text': 'Kale salad was delicious.  Great selection of craft draft beer, whiskey, and other liquor.  Great bartender, great late night spot.  Kitchen is open until 10 for the full menu.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2014-07-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ff3NqoaitypL0N7dL-ZITw', 'review_id': 'T048xa3K6y6YLHPk5Hueaw', 'text': "I've been here twice and both visits were very positive. The food was very tasty (I highly recommend the bacon board) and the drinks  (the 'Apple Pie Moonshine' was KILLER) were really, really good. Best of all, their service was great. I highly recommend Bootleggers.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2014-07-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '_KwyAbbwiK4pipPvtzAMAA', 'review_id': 'JfTv8yHSi7OTt2i_F6bnEg', 'text': "Bootleggers was the perfect place to go after a long, dragging Monday. My beau picked me up from work and we got there just in time for happy hour.\n\nI highly recommend getting their pulled pork sandwich as a happy hour treat. They were delicious. The brioche bun was delicious and pork was succulent.\n\nFor my happy hour cocktail, I got the blueberry brumble and the beau got their Catdaddy Old Fashion. The brumble was delicious and very refreshing. The Old Fashion was a tad on the sweet side.\n\nWe also ordered dinner there. I went for their Monday night special, Fried Chicken & Waffles while the beau had their ribs. The Chicken & Waffles were good, it was just a bit too sweet for me. My beau had the ribs which were very very good. I snuck a couple of pieces myself. \n\nKudos to the waiter who gave us a military discount too, I'm not sure if they do that often.\n\nOverall, Bootleggers is a great place to stop by after work for a good drink and some good ol ribs.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2014-08-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'InedXiRCPleOwY7YaPWlBg', 'review_id': 'kItda2IzwESD5o_1E__a1Q', 'text': "I had very high hopes for this place and I was a little bit disappointed. We were sat right away, but it took forever for someone to come over and greet us. After that it took about 40 minutes for us to get our meals. The meat was pretty good, but I don't believe it was worth the high prices. There is a lot better BBQ in the Arizona area at cheaper prices I would rather go to.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2014-08-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XHtSR6hghthup6jlXruhsQ', 'review_id': 'ZAqK3nl3MjoJa8rdZWOVdg', 'text': "One of Old Town's best kept secrets!\n\nIs there anything better than smoked proteins and APPLE PIE MOONSHINE!?\n\nBacon board, brisket, brisket nachos and the moonshine are all highly recommended!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-08-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lrX5TGRVHUzfnZDYf0WXtQ', 'review_id': '4TtkmffQwU6A2o2NZOYUqA', 'text': 'First all Service was amazing!! Drinks were great. The BBQ not much flavor. Dull for a BBQ. MAY TRY AGAIN!!', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2014-08-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '_L9fgrTst8Ubxc7Mcaljaw', 'review_id': 'pbkilY6QJYQIRqfZLhkqjw', 'text': "Great atmosphere great bbq, best I ever had in Arizona our waiter was very attentive the Old Fashion Moonshine cocktail was Excellent , we had the pulled pork nachos Delicious!!!!! We finished off with BBQ sampler for two all I can say is WOW !!! It's full of different flavors yummy all the food was very fresh ,can't wait to go back again ...", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-08-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GGquh62Wbh81RNyKMtDzFg', 'review_id': 'Fflmn-cs6MlZEQtpFUzlYw', 'text': "Just had a delicious meal here with another couple and we all had a great time. I enjoyed the 75 cocktail and my husband had old chub (on nitro, not typical for a restaurant) and they were both great. \n\nWhile the bacon appetizer looked tempting, I don't think I could have stomached five types of bacon plus more meat as an entree so we opted out of it, but it looked amazing at the table next to us. I had the St. Louis style ribs and my husband had the brisket. The smoke ring on the ribs was perfectly pink and smothered in a sticky sweet and spicy barbecue sauce. It was really delicious, my only wish was that it was warmer. It came with a tortilla and I had forgotten to ask for the biscuit instead but the tortilla was super good. It came with a side of cole slaw that I enjoyed - not too creamy, a little bit more vinegary, and really let the flavors melt together. I also got a side of the smashed potatoes and they were insane. My friend got them as well and as we both took a bite, we knew shit just got real. The icing on the cake? About half way through our meal our waiter came up to our table with an extra drink the bar had made (the blueberry one) and gave it to us. Woohoo! \n\nThe atmosphere of the restaurant is really great, a cool rustic meets 50s style with just the right pops of color in the right place. If you're looking for a cool place to grab dinner in old town and you like smoky meats and western style with a little hipster flair, bootleggers is a great place to eat!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2014-08-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 0}, 'user_id': 'sFewQLOn1-QC0HbYu1Fa5Q', 'review_id': 'bWed2kkqtsqhmDOpATsvig', 'text': 'Glad that Bootleggers has become a staple in the neighborhood, great options and great people.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2014-08-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 5, 'cool': 0}, 'user_id': '1tNoyBrHWuJlXEaMOtEGqQ', 'review_id': 'wjSXyIv-DI0Q3aJ2wZWPOg', 'text': 'Hate it when a place gets greedy... This was one of my favorite spots, however they changed the menu, again, which I understand is necessary in the first years, but literally doubling the price of your meals is outrageous. The food is great, and was previously reasonably priced (still enough to open a second location!), but I guess they wanted more. Bring back the BBQ program and get over yourselves...', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 2, 'date': '2014-08-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'wFweIWhv2fREZV_dYkz_1g', 'review_id': 'nE5GTxv4J5E2KQKFvUcMHg', 'text': "The BBQ here is delicious!  The dishes are a little on the spicy side so check with the server if you prefer something mild.  You can't go wrong with any of the cocktails on the menu either.  Great ambience, I'm sure you'll have an excellent time if you pick this place for your next meal out.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-09-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'a59UEZCcCy822KUeYtaWOw', 'review_id': '-Bu5GrnvxBTZTJ4VG14hOw', 'text': "Barbecue can evoke different emotions from everyone. For me, it's home style, southern deliciousness with plenty of ribs, sticky with a side of sweet potato mash. \nWith one type of rib offering, I didn't get my sticky ribs I had wanted and settled for home style Mac and cheese & fried green tomatoes. \nThe barbecue was ok, but the  mac and cheese & fried tomatoes mostly had me feeling like I had gorged myself without any of the deliciousness. Next time I'll have to pass, unless someone is willing to share the bacon board.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2014-09-10', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'OkwAoG2bcyi1QyqtwOF0CQ', 'review_id': 'A6eDhDKkZd5sxNqt9FRptQ', 'text': u"After reading all the positive reviews here on Yelp and after seeing the Best of Phoenix award, I really thought this place was going to be top-notch. I ordered the pulled pork that comes with slaw plus a side of green beans. I'm not saying this to be hyperbolic, but nothing on my plate was appetizing. Anyone who has eaten enough BBQ will tell you that pulled pork that comes out of the kitchen pre-sauced is a bad sign. When the bartender sat the plate in front of me, not only was it pre-sauced, it was swimming in grease. There was absolutely nothing aesthetically pleasing about what was sitting in front of me. \n\nThe first bite confirmed my suspicion: the pulled pork was horrible. The sauce was way too sweet -- no vinegar whatsoever. Sauce should be used to compliment the meat, but all I could taste is sugar. The texture of the pulled pork may have been the worst part of the plate. It was so mushy that it stuck to the roof of my mouth. I imagine that they pull a whole shoulder, sauce it, and hold it in a warming pan until someone orders it. Either that or they smoke the shoulder at too low of a temperature, which could also cause pulled pork to be overly greasy.\n\nThe sides were equally disappointing. They advertise the slaw on the menu as not too creamy and not to vinegary. Well, then why was the slaw half liquid with absolutely no vinegar? The green beans were bland, and they were about to drown in the oil the cook saut\xe9ed them in.\n\nMaybe I just came in on a bad night, but I won't be spending any money here again. In fact, I'm not sure if I would eat their food again if it was free.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 1, 'date': '2014-09-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ma-7afsMYNnQkIGxRwPxdg', 'review_id': '04CM1ScVN3tFtxOD_nq68A', 'text': u"My husband and I decided to come here for a Saturday date night. When considering our options, we were sold when we saw the bacon board on the menu. It did not disappoint! It was an excellent and delicious start to our nice (giant) dinner.\n\nFor our main course we had the BBQ sampler for two, as well as the shrimp and grits appetizer because I just couldn't help myself! The shrimp and grits were simply glorious. I may have preferred grilled or saut\xe9ed shrimp, rather than fried, but the other ingredients did a great job of balancing the richness of the fried shrimp and bacon. Marvelous. \n\nThe sampler was very good, but not amazing. I had been particularly looking forward to the turkey, but they had run out (something we weren't told until after the food was delivered and I inquired about it). The hot links were our least favorite - just not our thing, I guess. The pulled pork was pretty good, but the ribs and brisket were definitely the stars, and our favorites by a mile.\n\nSince we brought up the missing turkey,  we were given a cobbler desert for free. That's about as much as I would pay for that dessert - $0 - as it tasted like hot, vaguely-fruity mush with a layer of raw flour on top. Whatever... they don't claim to be dessert experts, so what did I expect? I just know better for next time. ;)\n\nAtmosphere is great - cozy, clean and modern. Just hipster enough to feel cool, but not so much to make you feel uncomfortable if you didn't show up with facial hair or a vintage t-shirt. Service is not as attentive as I would prefer, but most likely due to having too much to do, as opposed to a lack of effort. Everyone was very nice.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2014-10-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Sg52QRFKm5c_0cQG5tIf9w', 'review_id': 'ilod1GrYO50TM34QneFMKA', 'text': 'This place is awesome! Great BBQ! However, They have disappointing portions on their sides and the meat on their sliders.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2014-10-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'oXnp_Gn9sdL3dJ_nauxfig', 'review_id': 'OENeJVI3dI361iKQgA91Lw', 'text': "Really had a great meal here! \nWe started the night with a couple of their in-house moonshines. Apple Pie and Blueberry! Both were delicious. \nFor food, they have tons of Smokey deliciousness going on. \nIt was Happy Hour so I went for one of each of their Tacos. Smoked Salmon, Steak, Pork Belly, Brisket. They were all very good, with focus on the Salmon and Pork Belly. My wife went for something we'd never seen before, Smoked Tofu. Texture was still nice and firm, and had a great smokey flavor. \nThe service was great, waiter really explained everything they had in detail. Definitely a place I'd go back to! Need to try more of their Smokey Goodness!!!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2014-10-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'jWvzAN1czxypi-GM1KY62g', 'review_id': 'PeliSu1Ci5YSUUA_PNufzw', 'text': "I decided to try this establishment out on a recommendation from the ChowBella blog for one of the top places to go on a date.    My husband and I tried the sampler platter, moonshine (how could you not), and the potato brisket as an appetizer.  Everything was ok.  But honestly, we've had better BBQ.   It seems to me that Bootleggers is trying hard to make BBQ hip (kind of like Country Music).   \n\nThe interior was very modern and as was the music playlist.   But overall...I was left unimpressed with the food and the atmosphere.  The service was excellent though :)", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 2, 'date': '2014-10-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DC3Nw9lH2AzzSV9uwmTLBA', 'review_id': 'o5sFgESREC4rRIm6IlUJJw', 'text': 'One of my favorite places to eat. The food is great. In my opinion best burger in Phoenix. My only complaint is that the service is always slow. Pleasant but slow. I always enjoy my meal but leave a little annoyed at how long it took to get the bill and cash out.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2014-10-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'S_S06oA6xGAPr-HC1kLVlQ', 'review_id': 'faFpjIyw_2gso0OIXkrSUQ', 'text': "As we all know, 'Q is in the eye of the beholder. Peg and I stopped in tonight interested to see what would happen after hearing that Stephen Jones had made the move to this place from the Hound. What a wonderful introduction!   Tami was our server and was a welcoming guide. Alex was the ultimate in making sure that the experience was better than average, and the BBQ sampler definitely filled the bill. The meat was succulent, sweettangymoist wonderfulness. The links snapped and the meat on the ribs did NOT fall off the bones....a great thing!  The mac tasted home made and the slaw was not the sometimes commercial onion mess. Served with tortillas that held up to the sauce, the meal was terrific.  I thought they had me with a fried chicken on a jalapeno waffle special....but that shall happen in due time.  This is a wonderful addition and just off the 51 and Shea....a very easy in and out with parking to spare.  Thank you Chef Jones, Alex, and Tami....we shall return!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-10-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'g7B9pKNfMZu8p8V-hIM7tg', 'review_id': 'ZtyzPh_KWIEFfsvJgTvVbQ', 'text': 'This is a cool place. And i use cool like an old beatnik, cool dadio, you dig? The atmosphere is dark and moody with smooth sweet jazz over the speakers. The smell of BBQ wafts into you nose as you enter. The beer selection is small but varied. I had a vanilla porter with a glass of apple pie moonshine which is the most amazibg thing ive ever tasted. It is apple pie in a jar. The service is relaxed and friendly. I had the beef brisket with smashed potatoes. It falls apart in your mouth and has a deep smokey flavor. The bbq sauce is thick but not overpowering. Adds a nice sweet compliment to the smokieness. There are two things that keep this review from 5 stars. One is the temperature inside the restaurant. Its a little warm. The other issue is the chairs. So much money is spent on the decor and all the chaira are metal and they feel cheap. Go with wood! Great place for a date though. Id highly recommend.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2014-10-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'R7w97GdCIsr8XLBzih0bag', 'review_id': 'HhLgYN00OXY4Y4rJAi5hrg', 'text': 'Best place for BBQ around!  Satisfaction guaranteed!!!!!  Amazing food and service.  Get the nachos and pulled pork or brisket!!!!', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-10-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'K708g-P3UIxc7rTos1R4zQ', 'review_id': 'sZ2xivw-FvB-fGCV9lWzYw', 'text': "Loved this place when it first opened. What happened?  Changed the menu so they don't offer sandwiches at dinner. Bootlegger burger now has a thick slice of uncooked bacon on it. Kale salad left in big chunks where it used to be julienned. Disappointing. Drink prices have always been too high but I could overlook that for a great place to hangout in the neighborhood. Now I am wondering whether it is worth it to go here when there are better places down the freeway.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 2, 'date': '2014-10-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'jl67C8OhNXD5oMZ0v7RbUw', 'review_id': 'GJDClVT4qZENIw9dQL2VbA', 'text': "I've been here four times, and each time, I get pretty much the same thing: bacon board; Sneaky Petes (no longer on menu, but ask for this tequila cocktail... yum!); and the wedge with chicken. All are dependable, yummy and MINE ALL MINE. Seriously, jalapeno bacon? Who read my mind and made this worthy creation, for which I'll always be grateful? \n\nMy friends always try different things, and being the mooch I am, when it comes to good food, I've determined that everything is worthy of trying. \n\nOnly area which could use *some* improvement - the service. A couple of times, during less-busy times, we have had to ask what happened to our server. Did we scare him/her away? :/ \n\nGo enjoy the smoky scents and tasty foods!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2014-11-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qzYrDbZ2ElSKgG91eV4ftw', 'review_id': 'acYltyQuVkoC7x4_Tb8v_g', 'text': "This place has a good drink selection (although it is rarely accurate on the menu). Food is decent and I haven't been disappointed the 4 times I have been. Some sides are better than others but overall it's alright.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2014-11-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': '5ddMnLFqukwdHMHL1s5qcA', 'review_id': 'c7fsTc6QZdtOrK-naUJvPg', 'text': "After hearing some reviews on this place I thought I would give it a try. The dinner here as a whole was a failure. The food came out at all different times, Drinks took forever to arrive, as did other items and I won't be back. Seemed like the restaurant was way understaffed. The food was good but not worth the horrible service.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 2, 'date': '2014-11-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DC3Nw9lH2AzzSV9uwmTLBA', 'review_id': 'X5nNkgHuYFYDqt4th-kbmg', 'text': "Again service is the issue. The food here in my opinion is great. I love the burger and bacon board. They have changed the menu and the desserts aren't as good now but as long as the burger is the same I'll probably return. But it just really bothers me how inattentive the service staff is and everything is so slow. When the server finally made his way around to us, he seemed unhappy. He was rude or unpleasant but he seemed as if he could care less if we were there. It just always seems as if they are understaffed even at slow times. There are too many good burger places to choose from to keep coming back to a restaurant that doesn't care if I'm there or not.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2014-11-21', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 1}, 'user_id': 'p7dvahRPZIWL7T6pFA_0dg', 'review_id': 'px_8tSYtIbFwKqlWLww8xw', 'text': "This is a small dark woodsy old fashioned looking bar that serves Chef Crafted Smokehouse Foods and Hand Crafted Cocktails. I had he Kale Salad topped with added smokehouse chicken. The kale was prepared well and easy to eat. I liked the fresh corn on it and the sweet apricots added a unique touch. I thought the creamy fresh avocados tied it together. I admit I'm sensitive to smoked foods and just don't enjoy half the ones I try. I'm certain that the majority of people would enjoy the chicken as it was fresh and warm but had a certain kind of smoking that isn't for me. But I thought the salad was good.\n\nMy husband had the signature PBLT Sandwich (Pork Belly Lettuce & Tomato) that came with house made crispy potato chips. His sandwich differed slightly from the description on the on-line-menu but he thought it was very good as he got it so much so he would love to have it again.\n\nDepending on where you seat yourself you might need a light source to read the menu. \n\nSlight update 12-4-14 \nI originally rated Bootleggers with 2 stars only because of the ladies bathroom. The bathroom stalls are made with repurposed wood. There are many holes in the wood and a few are large. Maybe I was just paranoid that day but felt very insecure in the ladies restroom and I thought others might feel the same. The owner contacted me and told me the story about the reclaimed wood. It's very old and from his family's barn that he moved all the way here from Montana.\n\nThe food and service was good.\n\nNot sure about how I feel about the bathroom.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2014-11-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': '-2r-OO0dtcCQQ3BLYdHXlg', 'review_id': 'cgxnF254yAw5srQ3XhRFXw', 'text': "I reviewed this place on yelp along with reviewing the menu online.\nI will tell you the first time I picked up Togo from this place in a Sunday and I was completely blown away!!! And would have rated five stars!\nI ordered the beef brisket with macaroni and cheese, substituted cole slaw for green beans w/an up charge (which is fine and understandable). The brisket was perfectly seasoned and cooked perfectly! I enjoyed the macaroni cheese it was very cheesy and it had a nice crust of extra cheese and seasoning on top of it. I was also asked if I wanted tortilla or a bun and favored a bun which was also butter and toasted amazing!\nThe overall ordering was very similar to how it look like online.The flavors were amazing and I was completely sold on the place. \n\nI went back two weeks later on a Saturday and had a completely different experience. When I ordered they didn't seem to understand the menu the same as the Sunday person did which was fine but I still order a very similar meal the only change was corn vs green beans. I was not asked on my bread vs tortilla option but honestly forgot about it since I was distracted about switching corn for Cole slaw. \nWhen I received my meat I was upset because this time it was very fatty, I didn't receive tortillas or a bun, the macaroni and cheese had none of that amazing flavorful crust or additional seasoning overall it was not the same meal I was completely discouraged and have not eaten here again. I didn't talk to the management about it because I felt uncomfortable with the whole situation. I would not like to be tattling on anyone but was honestly bummed about it.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 2, 'date': '2014-11-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ocRhJ7pyP3v7N2ENcHQofA', 'review_id': '5Wd_gS9DIouxPQzUo0Mj8Q', 'text': 'This is an example of overpriced and poorly executed BBQ.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 1, 'date': '2014-12-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-dBX48HxXZ2iZU1xrImGZw', 'review_id': '8-s_h98oc0Ueg68M9BvgUg', 'text': 'We came here for my birthday and had a fantastic time. The service was top notch and the food was delicious. We had a bacon board which was amazing.  There were five of us and we were able to try several menu items. We had pulled pork, turkey, and prime rib along with our appetizer. The food was really delicious and tasty. We will definitely be back.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-12-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'exIrgC5Y1Dwq1fBv76fd5w', 'review_id': 'AVk12yqD0d7VnAZjFjmArQ', 'text': "Service was awesome ... brisket is damn good and fish n chips were really good.  Wife's Colorado Bulldog was perfect.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-12-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SNaMk4rFWW4VeKvZ0_dWcg', 'review_id': 'xVEd1aEvPM3JO-oybDE0jw', 'text': 'Really enjoyed the ambience, our server, my whiskey sour and the BBQ! Had the sampler platter and it was perfect to share with my husband. The ribs were awesome!', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2014-12-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 's10b9Ozb5RPKrou6T0v57A', 'review_id': 'MhNb6gIg8-lhRCkZg4SqGA', 'text': "If I could give them more stars I would. This place is amazing. We walked in and didn't have anyone come up to us for about five minutes. Finally a waitress came over and was very apologetic and took our orders right away. She came back and said that they would be giving us a complimentary dessert and rushing our food. The food came out after about seven minutes. It was delicious! I had the Sunday prime rib which was cooked perfectly and was not too smoky. My boyfriend had the short ribs which were fantastic! The bbq sauce was perfect and the portion was huge! The Mac and cheese was also just right. Probably the best short ribs I've ever had. The waitress came back and took our plates and brought out the peach and blueberry cobbler which was very good. When she brought us our check she said they were taking 50% off our bill! We will definitely be back again and again. Our new favorite restaurant in Phoenix.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-12-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fCz5Wq2MWBxs3bBskf4bjg', 'review_id': 'ZfMVIbT100s2fg4ThmRLgA', 'text': 'Best cheeseburger I have ever had(the bootlegger)! Add the fried egg and it is pure bliss!!', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2014-12-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GDeAlgzT3WEhSPmci40qgQ', 'review_id': 'dAeJsnrRHtPAxGot5Qg-bg', 'text': 'This place has the best pulled pork sandwiches. The first time I had one I was in love. I actually dreamed about that sandwich later that night. The only real downside to thus place for me, is that it is a bit pricey.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2015-01-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'y_5DfxEpBVQp50FblQZa7w', 'review_id': '69aNnT8C5Bg2RR71DYu6Pg', 'text': 'The bacon board is insane! Do yourselves a favor and get one! The moonshine cocktails are incredible. Beef brisket was divine. The happy hour is great but to truly enjoy the place I would plan on spending about 30 per person.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2015-01-05', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'WiBnYAfG2-tJkXAryVOLbQ', 'review_id': '5_mU2z7gNb_mNUgEQgYhzg', 'text': 'I see all theses reviews about great service, our service was HORRIBLE! We ordered a $1 apple pie shot, which was great, but we ordered it before anything else and it arrived half way into our meal. We ordered a side with our food, and it came out before our actual food. We then ordered a second drink during dinner, and it came out after dinner, wtf! The food was meh, the lack of service really made the experience poor. We got the sampler, and the best part was the dr pepper bbq sauce.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 2, 'date': '2015-01-05', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': 'MRIPbO8Vqx36eLdKmTg8aw', 'review_id': 'delW7cdqIPYWZ7XIxZTm_A', 'text': 'I planned a group dinner here for my boyfriend\'s birthday dinner and our experience was ridiculously bad from start to finish. It was one of those situations where everything that could go wrong did go wrong. \n\nThere were issues making the reservation and I had to call multiple times to be sure everything was confirmed. I knew they had another group that night but was assured it wouldn\'t affect the service. When we arrived, the hostess said they were about to give our table away because they had it in their system incorrectly. \n\nWe had some of the most laughably bad service I have ever experienced. I would hope that any restaurant would put one of their more competent servers on a table of almost 20 people. It wasn\'t a busy night - the restaurant was half empty.\n\nIt took forever for food/drinks to come out. When orders eventually came out, the server would wander aimlessly around the table asking "did someone order the ___." If an order was dropped off at the table, it was not in front of the person who ordered it. It was like musical chairs trying to pass drinks/meals to the right person. Also - they were out of clean water glasses. \n\nOur server kept assuming items she was carrying out were extra, giving it to someone else at the table saying "Must be extra, I guess you can have it for free." This happened with my drink, which ended up being passed down to me from the other end of the table after she \'gave it away\' to someone else. My meal was also given to the wrong person. This happened to the majority of us. \n\nAlthough we all ordered at the same time, meals came out sporadically... some 30+ minutes after the majority of the table had their food. One person in our group didn\'t get his meal until 40 minutes after everyone else. Our server needed constant reminding that people that were still missing meals, even 15-20 minutes after the first meals started coming out. \n\nAfter 20 minutes of people having their food sit out and get cold, we started eating - sharing food with the people whose meals hadn\'t shown up. Items that weren\'t being delivered weren\'t complicated meals - they were basic salads and sandwiches. \n\nEven though the service was a total nightmare, the restaurant staff was completely unapologetic. We expected an explanation for why the service was so bad, but never got one. They also didn\'t offer to discount any of the food/drinks. \n\nI wanted to complain at the time, but didn\'t want to make a scene (and my boyfriend asked me not to). I was mortified to have planned the event and have the dinner be such a mess. \n\nAdded bonus? The bathrooms were disgusting - there was blood on the toilet in one stall and tons of TP with blood on it overflowing out of the trash can. No TP in the stalls. Unreal.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 1, 'date': '2015-01-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4nTnoOs2Dw9dYKLQZFp3Hg', 'review_id': 'hNnXOpaOlNklh9OGk8VhfA', 'text': "To be blunt, the food was TERRIBLE. The cornbread was dry and bland. Main dish: $32 full slab of ribs and cole slaw....The ribs are frozen out of a box and heated up. The cole slaw...don't even get me started. First of all, if you are a BBQ joint, you should be able to at the very least, serve acceptable cole slaw.. The slaw was so bland. I mean bland doesn't even cut it. Tasted like paper? I have eaten at several BBQ joints around phoenix and this one is bad, sorry to say. We told the staff the food was awful and we can't eat it. I don't like to complain and refuse to pay for food at a restaurant, but there was no way I was paying over $50.00 for arguably some of the worst food I have ever had. But hey, the waiter was really nice about it and apologized so, that was a plus...Go to BOBBY Q's. You won't regret it. Top 3 best rack of ribs I have ever had and for less money.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 1, 'date': '2015-01-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UwzkhcbR0ZbSYEq1-OYgzA', 'review_id': 'oYJdFuwY4p2g6u4kzFINGg', 'text': 'Really not traditional bbq, but high quality and tasty!  Their ribs are especially delicious. The only caveat is the brisket is not up to par with the rest of the food on the menu.  Highly recommend ending your meal with their apple pie moonshine!', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2015-01-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4ntA5lCZ8GZY3E8Q-RkmqQ', 'review_id': 'wV2uy589Wf0pjBI1high1A', 'text': "Bacon board charcuterie was on point! Nothing makes me happier than 1/2 off a bottle of wine, copious amounts of bacon, moonshine flights, BBQ ribs, burgers, Mac n cheez, and of course more moonshine. The staff was great and the bartender was an angel! Definitely be back for moonshine Monday's and hopefully a bit of Sunday brunch.. Thank you guys!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2015-01-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DC3Nw9lH2AzzSV9uwmTLBA', 'review_id': 'uuiiDS2mraZnL9rGGVORgg', 'text': 'Because the food is so great I continue to come back and I must say the service is getting much better. The staff had always been friendly but at my last visit, the service was fast too.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2015-02-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SSFNIcWmDFXD5sQY9zGe_w', 'review_id': 'ItIc0p05DuXmvVLXczjyZg', 'text': u"So the fianc\xe9 really loves BBQ, and I am a pretty big fan myself. Walking into Bootleggers I was immediately digging the decor and cool vibe they have going on. However, I thought for the price that the drinks were on the small side and the food was so-so. I ordered the beet salad, which was good but a bit sparse. I was happy that they let me put bbq'd meat on top. He ordered the brisket and was not impressed. More bbq sauce with the bbq entrees would have been good. \nSo, three stars it is for so-so food with an awesome atmosphere.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2015-02-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'deZ56J6ZAjiQo7PJczqMNg', 'review_id': 'MMjdC7DAuEa8kknjykJxSA', 'text': "Have been here twice and disappointed both times. Staff have been nice, but the food was bland and disappointing. After the first visit we thought we would give it another shot, we got the special meat platter. Ugh. Nothing was good. We won't be back.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 1, 'date': '2015-02-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7eVPoTYPhRptb9_JrbBOoQ', 'review_id': 'NhQ-jwjP9HsBaq-UquPnpw', 'text': "I like the atmosphere a lot but the food needed a lot of work. I realize it's difficult to serve fresh bbq sometimes, but the brisket was dry and so tough you needed a knife to cut it. The pork was a out the same. For the price and quality of food its a tough sell.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 2, 'date': '2015-02-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Uv5LD9IxaP-q9YBFlNtU_Q', 'review_id': 'gU_CpE2_YuvYmDe1odh5MQ', 'text': "We got the BBQ sampler. The smoked turkey was a little dry, but had a good flavor. The brisket and ribs were delicious! The pulled pork was average, but made better with the bbq sauce! Coleslaw was overly oniony though. The Brussels sprouts with Lardon was a much better side. The best part of the whole meal was the Apple Pie Moonshine! It was absolutely delicious and only $1 on Monday's! There wasn't much of a crowd tonight and the food came out fairly quick.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2015-02-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': 'ZkSO6mp7rqMJXnTI6R1mzw', 'review_id': 'iU0JaBcsOaBY4XL3sr9tXw', 'text': "Wish I could this place zero stars. This place came highly recommended, but the evening started on the wrong foot with it taking 10 minutes to be acknowledged. \n\nThe food was below average with the beef ribs being terrible - no meat. The brisket was underwhelming and the pulled pork was substandard. How this place can stay popular with the small portions, below average service and bland food is beyond me. My guess is it won't if these conditions continue!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 1, 'date': '2015-03-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'CTmUGOcXoUBv3atNaKIBCw', 'review_id': 'z0ELK-b-B9IhV0NFG_50Xw', 'text': "Go there once a week ! Awesome atmosphere , great staff , food rocks ! Can't beat it ! Modern BBQ w amazing salads !", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2015-03-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'mGpgNKint0CqAII_L2ZeaQ', 'review_id': 'vVXFU_W83d4Z4FLTV-gNZA', 'text': "Where is the ZERO when I need one!  This was my first and last time I will eat there.  We went since my brother n law said it was a good place to eat and he wanted to go there.  Service was bad!  Never came back and refilled drinks nor did she separate the checks like my brother n law asked her to.  We had no silverware or napkins set for us until after the food came and WE had to ask for it!  When I received my food, I had no roll as stated on the menu but the roll was one of my less worries.  It was a hamburger bun cut in half!  lol!!  The quality of the food was not there for the money we paid, yes over priced!  My Prime Rib was smoked around the edges but had no flavor in the center.  The cole slaw had no flavor.  They were going to charge me $3 extra to order the Sweet Corn instead of Mashed Potatoes.  What a joke!!  I stayed with the Mashed Potatoes. My husband ordered the Brisket and he received a few pieces very thinly sliced and the BBQ sauce was terrible!  He agreed the Cole Slaw had no taste at all.  The only food item we ordered that we liked were  the Sliders for an appetizer.  Needless to say, with the amount of money we paid out last night, we will not be going back!  I've tasted much better Prime Rib up at Harold's in Cave Creek!  The only place I have ever gotten good flavored Prime Rib in the area!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 1, 'date': '2015-03-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '81hpuEdYu2C4hp6oL7EPZw', 'review_id': 'oMHCwnwnPQls7jxJoa4ZBw', 'text': "I like moonshine so when I heard they had flights of shine I was there.\nWell the flights are really 3 different kinds with a bunch of flavors.  They have a house apple pie.  So much for the exciting flight of shine.  \n\nThe bbq isn't exactly award winning either.  It's okay and the portions are big enough but there are much better places than this.  St Louis style ribs if you are interested.\n\nThey do have some interesting sides which come in fancy little skillets.  I almost thought they served them by themselves as they showed up way before the rest of the meal.  Which brings me to the service - awful.  Had to ask for cutlery. had to ask for our missing mac & cheese - 3 times.  It finally showed.  if the mac & cheese wasn't the best thing in the place I would have said forget it.\n\nMac & cheese is pretty good.  You can get tortillas instead of rolls with the meal which makes it a bit lighter.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 2, 'date': '2015-03-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'bFS6lhiomcOBw9j7B6QWzg', 'review_id': 'jsJ3UB0e9LxABjPLUkqAHw', 'text': 'Unfortunately this place has gone down hill fast.  So disappointed because it used to be great.   I knew something was wrong because it was empty on a Friday night.  Bacon board was fantastic,  but the price has increased,  moonshine was also great.   Terrible food......and it used to be good.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 1, 'date': '2015-03-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'HXCFgubyi7VtxTZdup2M8w', 'review_id': 'dHYvSO9rPU29uQ93jFXIKw', 'text': 'Service was excellent, our waitress was very efficient. Food was great but if your looking for that country midwest BBQ flavor this is a little bit different, hence the "modern american smokehouse". Nice little hidden atmosphere and okay for kids. I was a little bit hesitant when we pulled up, it looked like a bar, but the inside was a complete different feel. Also, nice selection of classic oldies music.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2015-03-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '5yYB5_BOqB5YNj8oJZJ2HQ', 'review_id': 'BrwY3PF83qQUzd6lkTX-DA', 'text': "One of my new favorites!\n\nService: 5/5 The staff was super friendly and very knowledgeable about the menu.\n\nEnviorment: 5/5 The place is named Bootleggers so it's no surprise that you walk in and get that late 20s early 30s feel. The lighting is pretty dim and to add that extra bit of romance, there is a candle on every table; if this is a first date and you don't look exactly like your profile picture or the other person was a little tipsy when they gave you their phone number...this is the place for you! Besides the lighting, I LOVE the decor.\n\nFood: 5/5 Most important part!!! I came here for the bacon board...Yummmy! I'm talking 5 different kinds of bacon with two spicy jams, home made mustard, pickles and cheesy bread. Yes it was $24 but my bf and I agreed that it was worth it! I would just go for bacon and wine if the opportunity ever presented itself. For entrees I got the turkey leg, coleslaw and mac n cheese and my bf got the brisket, coleslaw and black beans. We both loved our food but I wanted to give special attention to the mac n cheese...first off I'm super picky when it comes to mac n cheese because it is one of my favorite foods, and I usually never like mac n cheese outside of mine or my mom's...but let me tell you, AMAZING MACARONI AND CHEESE!!!\n\nAltogether including a beer cost us $71.95 before tip (includes 1 beer, 1 appetizer, 2 entrees).", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2015-03-21', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 3}, 'user_id': 'XUd9-XTjvjDj4MoyzMscgA', 'review_id': 'ixrLaE4sS2Cwbzyhrgie-g', 'text': 'There are two locations. This one and one in old town Scottsdale. I have only been here. I love the decor...distressed wood walls, copper topped high top bar tables, mason jar light fixtures, etc....  The food is amazing, but you need to like bbq/smoked foods. I am a fan and I have never had better. I just had the ribs which were perfect sided with smashed potatoes. My wife had the wood plank salmon over mashed cauliflower. We both demolished or dinners. They serve a full bar including housemate moonshine in an array of flavors. They do have vegetarian choices, so they cater to all.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2015-03-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'IkC2BKzADqgPlvaac5gRHg', 'review_id': 'halCim7LRakUCUVXtr2ykw', 'text': 'I attended a work event at Bootleggers and think the restaurant did a great job setting up our group in the back room and setting up a buffet of good food. I really liked the mac & cheese which was al dente pasta with a cheesy sauce, with an extra layer of melted cheese on top. The fried pickles, battered with a seasoned coating like curly fries, were good too. They have many beers on draft, including local beers. The atmosphere is upscale country.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2015-04-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-URcDWnbD-ph94c6TAyZYg', 'review_id': 'OEOxNQL2XUeWJIDyNBBpDA', 'text': "My wife and I were visiting friends.  (Yes I just got married), and my stomach was growling something awful. So we all decided to hit this place up for our first visit dinner. What a pleasant surprise it was when we walked in. The reclaimed wood was a nice accent along with the brick walls and the lights remade from old fans. Real comfy inside.\nLets get to the food shall we. We all shared a plate full of nachos which were presented on a rectangular cookie sheet. We basically devoured them in plain sight of everyone, and wasn't ashamed of it either. For our entrees I chose the beet salad and my wife got the Brussels sprouts salad. I know, I know, who orders salad at a barbecue place? Sorry, but someone has to eat a little healthy now and then. My salad was good but a little small. It could have been bigger but the dressing was nice and the veggies were fresh. The Brussels sprouts salad was a nightmare. We were shocked they were raw. You have to cook them first so you don't break your teeth on them. I had a few bites as well as my wife and tossed the rest. They really should put them in the oven or fry them up first. Won't be getting that again. All n all a nice experience for our first time. I'm not going to let the Brussels salad damper the night. Will try  again on a cheat night and splurge on something juicy.  Later", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2015-04-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': '4OOmSWs18WidFfHyF-IGaQ', 'review_id': '2uHNHtxQStbTF-VBQS2TzA', 'text': "1 year later and still one of my favorites !! Every bite or drink of everything I've ordered is mouth watering good !!! \nDefinitely give the shrimp grits appetizer  a try ! You will never have grits like this anywhere !", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2015-04-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DTT8M5bQ0xbApy6KDKjUnw', 'review_id': '4gwqTq0eXBfIA1tZx8LaKQ', 'text': "Oh my gosh. Delicious! Best bbq food I've had in a long time. The service (Amy and Robin) was amazing and very attentive. Recommend to everyone!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2015-04-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nBFyVu9NZ9zhY49LRoULKA', 'review_id': 'XoUmaWa7PwO8O9v_-VrkqQ', 'text': "Definitely one of our new favorite places to go eat.\n\nAtmosphere- the place is dimly lit and decorated pretty cool. The bar emphasizes the alcohol and isn't taken over with tvs (there are a few in the back part of the dining room). The dining room looked pretty small so we chose to sit at a community style table in the bar.\n\nService/Food- We were served by the bartender (I think his name was Paul) and he was just excellent. We had never been there before and he graciously guided us through the menu. I started with a gin and cucumber cocktail which was refreshingly delicious and my boyfriend had a blueberry cocktail of some sort which was a little sweet for me, but he enjoyed it. We were torn between nachos and pork belly sliders so Paul directed us towards the nachos and said they are a popular dish (he was right)- so we started off with the Nachos- I could've eaten these all night long. They had fresh jalapenos and a smoky nacho cheese sauce and plenty of super tender pork all on fresh cut and fried tortilla chips. After that, we shared the sampler platter which had 4oz of pulled pork, brisket, turkey, sausage and something else I forgot. It is served with tortillas or rolls and their house coleslaw. I usually dont like coleslaw but this one was very light and citrusy and I thoroughly enjoyed it. In the middle of our meal. Paul brought us 2 small samples of the house made applie pie moonshine. I can honestly say that I have never tasted anything that delicious. I wanted to order a huge jug of it to go. I cant wait to go back just for a few of those. Seriously though, get one of those for sure, you wont regret it. I had 2 and that wasnt nearly enough. We also ordered the smashed potatoes (heavenly) and the black beans with smoked peppers- those were my fav. We barely finished the meal because we had decided to get dessert because I can never pass up a cobbler. \nEverything was just excellent, and I cant wait to go back!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2015-04-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'MNfOCJZsbtMbnDlvJ1LKeQ', 'review_id': 'DXQSS77ycFI6x61On_HplQ', 'text': "My husband and I have been here for lunch and dinner and it's pretty good. The only thing we weren't happy with was the cornbread, it was dry and not sweet at all, other than that everything is great and we will continue to come back for more!!!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2015-04-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Sd8h4YbI95p04L5hg_Jdfg', 'review_id': '2CloSNy2XpURgDUXZq9w1w', 'text': 'Everything I ever order is great!  Never had a bad meal, service is good and nice atmosphere.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2015-04-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'Jvg0Iv2a67hjZqVdyF4aAQ', 'review_id': 'srtjH3qQJ2gYlCBj5dVLoQ', 'text': 'Thanks to Yelp I have found a great new place to eat! The apple pie moonshine blew my mind! so yummy (had 4 of them). Food was great! short rib tacos were just amazing, so were the wings and everything else we had. Def coming back.....soon!', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2015-04-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DmEnTWL8OXxUlgCAHxgwnw', 'review_id': 'm-_Un38glBMQEAUpJ_XOZg', 'text': "Food is of great BBQ quality. I had the PBLT with a fried egg. It came with a thick piece of pork belly and the yolk of the egg made it brunch overload deliciousness. Also tried the brisket sandwich best brisket I've had since being in Texas. The cottage fries were amazing!!!! Drinks were great--must try the Bloody Mary on Sunday which is a real treat.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2015-04-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'f5DSsK2w-b0xQVyz8lZACw', 'review_id': 'VNU-zswQUNNAPYovCTR-TA', 'text': 'Went in for a quick happy hour meeting with a co-worker at his suggestion. I was surprised to see the taps.... some of my favorite styles of beer, if not brewers that I recognize. Paul the bartender led me to a saison to start the session. My friend ordered food, I swore I did not have time but ended up getting some anyway.\n\nI smoke meats and fish at home and think I am pretty damn good at it but this place was out of this world. I will be back again and again. Excellent vibe, great bartender and fantastic food.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2015-04-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '3ftoEYNRKiVub4NaNut5hg', 'review_id': 'nXpKOkLDVujLNuWldXzkhg', 'text': "I stopped in after reading the raving reviews. One of those places you would never know was there if someone didn't tell you about it or find it on Yelp.\n\nFirst of ambiance. Wow. Really cool place, gives off a great vibe, very fitting for a BBQ place. Very surprised it was so cool for it being hidden in a little strip mall. Awesome ambiance. Service, super attentive. It is tough to keep my drink full and they did and did it very well. I was impressed.\n\nOk, let's get down to the food.\n\nStarted with the bacon board. Great selection of different bacons. Presentation, wow. Jalapeno bacon which was prepared PERFECTLY, thick, crispy, full of flavor and was my favorite of the bunch. However, I found the exact same flavor I believe from Hormel's Black Label Jalapeno bacon. The rest, I never need to have again. Nothing else stood out. Price for the bacon board is absolutely stupid at $24. It was an experience I would not do again. Was it fun and unique though? Yes, absolutely.\n\nNext was the BBQ sampler for two. And it's enough for two. Portions are quite accurate for two people and two people ONLY. Includes beef brisket, pulled pork, hot link, turkey breast, ribs, cole slaw and I opted for rolls and tortillas. \n\nRolls and tortillas, I preferred the rolls. Soft, chewy, loved the rolls. Tortillas were on the mark. No butter was provided for the rolls though and there was nothing to dip the rolls into.\n\nBrisket, eh, was ok. I'm not typically a brisket fan. This one did nothing for me.\n\nHot link, very unique, border line strange. A little heat. Flavorful.\n\nTurkey Breast, was moist, juicy, sadly, for a BBQ sampler, it had no BBQ sauce on it, and it was the best thing in the sampler to me.\n\nRibs, beef. Not fall off the bone. Bite off the bone.\n\nFinally, the pulled pork. Dry. Way dry. Surprisingly dry even upon arrival and seemed to continue to dry out even more. \n\nThe BBQ sampler came with one small plastic container of BBQ sauce. The best thing I can say about the flavor is that it is unique. It was unlike any BBQ sauce I have ever had.\n\nAfter sampling the provided BBQ sauce I asked if they had any others. And sure enough, they did. They had a Dr. Pepper BBQ sauce and third I forget how they described it. The Dr. Pepper sauce was SWEET. Wow, was it sweet. Then I tried the third sauce. Weird is how I would describe it. It wasn't ketchup, it wasn't BBQ sauce, it wasn't cocktail sauce, it was just WEIRD.\n\nSo for $56 + two drinks from the bar pushing the tab over $70, I would say we had less than $20 in actual meats. Disappointed for sure when it came to flavors and portions for the price. I have had much better for a lot less.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 2, 'date': '2015-05-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'p_CScNk-cdR5jsZQWEqDSg', 'review_id': 'D2oFOlYUdUfq3LqJ5WC3Zw', 'text': 'Sorry folks, I was very under whelmed with a burger costing, $14.00 the bootlegger burger, the bacon was not even done on it come on.  Went for lunch on a Tuesday at 11:30, hardy anyone there, so no reason to not do great on food.  I have better high end burgers costing $10-11 range! Oh burger came with chips, how about some fries for that price!!!', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 1, 'date': '2015-05-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'g2oAVC6PMs64oLPdKWqPIQ', 'review_id': 'u5Huv3Sj_iKx9ReMlkzfBQ', 'text': "Bootlegging is illegal but there should be an exception for bootlegging good food. Bootleggers Modern American Smokehouse in Phoenix, AZ is taking food to illegally good levels. Who doesn't want good food?\n\nI got to try their food for lunch on a rainy Sunday. I was immediately greeted by the scent of barbeque as soon as I got out of the car. The aroma of burnt wood and meat started to excite my taste buds. It was truly a modern day smokehouse feel when I walked in to the restaurant. Nice tables with orange chairs (GO SUNS!) to my left, a bar and long tables to my right, big booths for large groups in front of me and flat screens TVs all the way at the back. Everything felt very modern but still felt every bit a smokehouse.\n\nService was nice. We were greeted at the door with a smile and offered drinks a soon as we got to our table. I asked the bartender (which was our server on that day) to switch the TV to a different game and she was kind enough to advice me that she will have the channel changed soon as she finishes the drinks that she was preparing for everyone at the bar. It took a while and another similar request from another table but we finally got our channel changed. During our meal, our server constantly checked on us to make sure we had everything we needed. Again, the service was just nice.\n\nThe food was a little above average. I see the reason why they were given awards for Best Sandwich (Phoenix New Times), People's Choice for Tacos and Best Craft Cocktail (Arizona Taco Festival) in 2013. I ordered their Apple Brandy Shandy ($9), Cottage Fries ($5), Mac & Cheese ($9) and the BBQ Express Lunch ($15). All of them satisfied my taste buds. Everything was tasty and balanced. The only down side, the food is pricey and the serving size was too small. For a barbeque joint, you would expect a hearty meal that would satisfy your cowboy gut. I was informed that they heav a different menu for dinner. Since I was there for lunch, their menu did not shout out bbq except for their BBQ Express Lunch.\n\nThe Apple Brandy Shandy Moonshine Cocktail was very refreshing. The tangy apple flavor cuts through the strong moonshine bitterness. Since it was served on a mason jar, it was able to keep the moonshine character while still staying true to the modern theme. It was a great starter for a good meal.\n\nThe Cottage Fries was a delight. Maybe the best of what I ordered during my visit. The thinly sliced potato were fried to crispy perfection. The cajun flavors complimented the crispy potato fries. It felt like eating potato chips. It had a good spicy kick on each bite. It wasn't overly seasoned. In fact, the seasoning was right on.\n\nI love their Mac & Cheese! The flavor wasn't flat. You get a little bit of saltyness and lots of the creaminess which I always love from a mac and cheese. They combine four types of cheese which complimented each other. Served on a skillet, the mac and cheese is kept warm to a perfect cheesy bite. Love it but the serving is a little too small for $9.\n\nThe BBQ express lunch I had was composed of 2 slices of beef brisket, 1/2 cup of pulled pork, cole slaw and tortillas. Very good smoky flavor on the brisket. I love the burned parts that added character and flavor to the meat. The pulled pork had a sweet and tangy finish. Both brisket and pulled pork were tender and very easy to chew. The coleslaw was a little flat. I would have wanted a little bit of seasoning. Maybe a little more salt. The tortilla, hmmm... it tasted like a tortilla. The star of the plate were the brisket and pulled pork which was served on a small skillet. Again, it is really good but I think its way too pricey. For $15, I would have wanted 2 more slices of the brisket and maybe another spoon of the pulled pork.\n\nI would come back for the food. But maybe next time I'll try the dinner menu. Maybe i'll leave my cowboy appetite at home on my next visit. I am always willing to pay well for good food. As long as the serving size is comparable to the price. At this point, Bootleggers Modern American Smokehouse is only a serving size (and maybe a few more BBQ menu options) away to becoming the next best BBQ joint in town.\n\nRead my other reviews at http://themealexperience.blogspot.com", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2015-05-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'AV8ZpKdcf3vw8KqJXKqAsQ', 'review_id': 'apGiSnDnH8dzZs526IDALw', 'text': 'Hostess was put out seating us after we interrupted her conversation asking if we seat ourselves. Then there was no waitstaff, we ended up just leaving after ten minutes in a mostly empty place.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 1, 'date': '2015-05-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'xmzxKReOF-rttJ_bDVDlCg', 'review_id': '3YAOcKU9X-BQm4OCgsSw8w', 'text': "I was on a work trip and randomly found this place. I am so glad that we ate here because it was delicious! We started with the blackberry moonshine cocktail which was awesome. It was served with basil which tasted great. I would have loved to been able to try more of the drinks since they all sounded amazing. We got the short rib, Mac and cheese, and sweet potato fries. The short rib and mac and cheese were so good! I am really picky about Mac and cheese, but this one did not disappoint. The short rib came with a bbq sauce that was on the sweeter side. I have had better sweet potato fries from other places, but they weren't bad. If I lived in the area I would come here all the time! The decor and atmosphere is awesome as well.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2015-05-10', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'vM_VJVpUGzTsRGnxiCwfMA', 'review_id': 'Ru_JdgNTmwyG6FAsLCTcIw', 'text': 'Came here with friends who wanted moonshine. There are several options of specialty moonshine drinks as well as moonshine flights. I ordered a specialty drink, and it was really delicious. Unfortunately I do not remember the name of it. I was with a party of 5, and everyone ordered at least one moonshine drink and/or flight. Everyone enjoyed their drinks, although they were a bit expensive (as expected with mixed drinks).\n\nOur server was really nice, friendly without trying too hard, and attentive without being overbearing. I liked the atmosphere in there as well. I also ordered the brownie dessert to share, but it was not very good. It was pretty dry, and neither of us even wanted to finish it. I would definitely come back, either for more delicious drinks and to try the food!', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2015-05-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'fP7vBZsPsfBLqCMak85vvg', 'review_id': 'Znm2dH-UXzlpintjfUhtJQ', 'text': 'Ok, so I wanted to take wife out for great meal near where we live.....not possible. (Sorry W. Bell rd.) So, we traveled to the other side of town (NE Phx) to a little place called "Bootleggers Smokehouse" nestled in the corner of some other shops. Simply put, Food: Amazing (I ordered almost everything)\nDrinks: Well made (thx Robin) good beer sel. \nService: five stars. \nGreat job Bootleggers, you made a germ-a-phobic food snobs day!', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2015-05-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'RhP5-X6ni8xmC0y5e0ifaw', 'review_id': 'EkEn0RprDqvX3N0KU1KC6A', 'text': 'Fries to die for and sliced brisket that melts in your mouth.  Yum.  Friendly service and laid back atmosphere.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2015-05-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'aoNbXJUs9gJPdchTNfsMog', 'review_id': 'mbIdjaBetY2_p99Fh__p8w', 'text': 'Delishous!! Great aptmosphere and fun local brews. So happy we stumbled upon Bootleggers! It will be a place we visit again when in Phoenix..', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2015-05-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0VfJi9Au0rVFVnPKcJpt3Q', 'review_id': 'DBldVPIpgiyr6lxwieGTUA', 'text': "Bacon. I enjoyed my first time here. Menu was not as cleaver as I expected, but I did appreciate the bacon board selection. Second experience was boring. It's great for one visit.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2015-05-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': '1lwR1L0XerFlEtwhPpmH2Q', 'review_id': 'KoKiENQB1Xae_Qkj1l2e_g', 'text': 'Ambiance is my jam. Think Farm chic; low lit mason jar chandeliers, rustic wood back splash pieces, neat silver bucket bar stools, cozy and warm energy. \n\nMy most favorite thing about this place? Their Apple Pie moon shine. BEST moonshine I have ever had. Okay, that might not sound that compelling considering most moonshine tastes like heartburn and tears, but their Apple Pie moonshine is some sort of magic concoction. If I had to drink only one alcoholic beverage for the rest of my life, hands down this would be my #1 choice. Every time I have it, it is the highlight of my week. Shamelessly, I have tried multiple times to get the recipe out of the bartender since it is a "house secret". He has dropped hints of a few ingredients they use but didn\'t divulge enough for me to master theirs. Note to the owners: you hired on a loyal bartender. To be blatantly honest, I have literally tried bribing him with a decent amount of money to give me the exact recipe and he declined because he was trained to keep it a house secret. If genies existed and I had 3 wishes, one of them would be to know this exact recipe. \n\n\nMenu Items to get:\n-Bacon board. Whoever thought of this and put it together, you\'re a genius. It never disappoints.\n-Mac and cheese. Such a good creamy and consistent cheese base that packs amazing flavor. And they obviously know that their cheese sauce is amazeballs because their noodle of choice is rotini. I know "Mac and cheese" is traditionally with macaroni noodles, but any pasta connoisseur  acknowledges that the best noodle to scoop in every delicious bite of cheese sauce with is the rotini noodle.\n\nThe only recommendation I have for them is their burger. It has the taste components to be an excellent burger but execution falls short. A burger should be solid in every bite and this one falls apart after the first bite, so you are left with a crumbled mess of trying to put together broken pieces to get combined ingredients into a bite.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2015-05-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uCiHGSV78naDsX9eZfCiTQ', 'review_id': 'w746GoNp3-YYC19pFAitAQ', 'text': "Tasty but overpriced. I have done my share of BBQ and I can assure you that a Hot Link should not cost $17\nThey did a nice job of converting an old neighborhood bar into something a little classier and original and their BBQ stands up but I can't get over paying $20.00 for 5 strips of brisket and some cheesy mashed potatoes in a strip mall.\n\nServer was kind but too busy to be attentive.\nA neighboring table had a bacon board with snacks and cheesy bread which people seemed to be enjoying. Might be their signature dish.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2015-05-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'LxCdK-4cwTZdqbjBD7LyPg', 'review_id': 'F0NgvTpqR64Cxu8FFPYsHQ', 'text': 'I have been wanting to try this place since I drove by...then recently for my splurge meal during Arizona Restaurant Week, we decided to try Bootleggers. I made a reservation and was seated promptly in the private dining room. It was actually a surprise to me that I was able to be seated so quickly, I went in with the expectation I would be waiting approximately 10 minutes or so just because it was AZRW. The service was decent, I could tell the server was just overwhelmed. He did as best as he could. When our food came out, there was a minor issue, with the fries but we addressed it with the food runner and he came back with the correct fries within 5 minutes. We ordered a sampler for 2 and it came with tortilla. I am not a huge fan of ribs and I demolished the ribs on the platter. By the end of the meal, our waiter was apologetic about not being able to spend more time with us because he has been running around nonstop since he started his shift. He did make some recommendations on what we need to order for next time. Yes we will be coming back next time.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2015-06-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'qqmOGbK_8iGfE0J06cbS5A', 'review_id': 'PRDDpwzCvsk0sjyal8aOhg', 'text': 'I highly recommend the following: bacon board, moonshine flights, macaroni and cheese, and their brisket is unreal!!', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2015-06-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'ot_8rE2OMIUoewFSbiXT0g', 'review_id': '1R_yeWnnin3NHl5nZmCjaQ', 'text': "Located in a semi-empty shopping center, but it doesn't disappoint once you get inside. The staff was great, very personable and ready to help with recommendations. Between the four of us we had a burger, pulled pork and sliced brisket. All were well prepared and tasty! Our only criticism was that the slaw was pretty bland, not doing its job of offsetting the tanginess of the barbecue.\n\nI recommend this as a place worth seeking out and trying!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2015-06-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'MNd2kbG7OYxElc6xe1xexQ', 'review_id': 'ZrEtOdOll6MVgKg5vzF1CA', 'text': u"Ok, I have to admit that I was skeptical. My 12 yo told me that he'd been to this place with his dad and that he liked the barbecue. Not being a huge barbecue eater, I hesitated but gave in as it was on our way home. It's in a strip mall with not much else going on. But, walking in, I was surprised. It's small but with nice ambience. Lights, candles, and friendly staff greeted us. We were asked about our preference in seating and service was immediate.\n\nOur waiter recommended a $24 bacon platter. Are you kidding me? But again, I caved and the platter on a wooden chopping block was served. It was absolutely beautiful. 5 different varieties of bacon, cornichon, mustard, grilled bread, onion and pepper jam. My kid was in heaven and pounded 80% of it. I had a taste of 4 of the varieties - smoked in house. The jalape\xf1o bacon was my favorite with real kick. After two slices of bacon, I trimmed my order back to a kale salad. It is interesting with a lot of different texture and flavor. My son had a burger and half of it landed in a to-go box. \n\nThroughout our evening our service was spectacular. The waiters were attentive, answered questions, made recommendations and validated us as customers. If I were a big meat eater, no doubt I'd give this place five stars. The dinner for the two of us was also over $50 with no drinks so difficult on a budget.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2015-06-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DXCWbLXFKWAv-Txq3cLhqQ', 'review_id': 'VFxxevCH5zAHL0TP5tSxAA', 'text': 'Ahhh, this will probably move to 4 stars....they\'re really on the knife edge between 3 and 4.\n\nLOVE:  Bacon Board taste and presentation.  Its truly worthy of being a signature item.  Cauliflower steak and cottage fries are lovely bits of comfort.  The intimate lighting and design of this place is pretty special, too.   Most plates are served with a good bit of panache in terms of presentation.\n\nLIKE:  The PBLT sandwich, which has ranged on different visits from awesome to above-average.  The service on most nights is pretty good, although I have been left parched a few times for quite a while when sitting at the bar waiting....and waiting....and waiting... for the tender to make her way back to me.\n\nI\'m OK with:  the subtle smoke flavoring on the meats...although I tend to prefer a stronger smoke.  I\'m also OK with the prices of most items, and I don\'t feel like I have overpaid when I go here, although nothing screams "great value".  Not that there is anything wrong with restaurants charging what the market is willing to pay...but hey, this is YELP, and one of my stars is typically reserved for good or great value.  There are a few rather pedestrian offerings that don\'t seem to live up to expectations, such as the Nachos.\n  \nDISLIKE:  The price of the bacon board...no bueno!  Also, when bootleggers opened, it had the promise of being amazing in the beer/bar context, but I feel like they rotate their taps way too infrequently, so there is rarely something new for me to try.  \n\nI see alot of 4 and 5 star reviews for this place...and I can truly respect that, as I can see why many people would really, really like this place.  But for me, meh.  To become a mainstay in my rotation, I personally would need a wider beer selection, more smoke in the meats, and a permanent 25% off coupon lol.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2015-06-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hazeGAy8Ewc3wuAr3KMmnA', 'review_id': 'iU9FwvvfKzIzo037nBBZJQ', 'text': 'Great service! Our waiter was fun, informative, and attentive. The nachos and moonshine were delicious. Cutely decorated.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2015-06-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3olqWZaGoIT_Svpq3CjetQ', 'review_id': 'SwpfhSWJBprhYQ4jyrfvxg', 'text': "Here for Father's Day and they are way under staffed. Been here almost 2 hours and no food. Staff so rude and refused to make things better. Owners should wake up.  This could be the worst restaurant experience ever. We were over charged for all of our beers. The bar tender slammed our tab in the table and was rude like it was our fault because we waited two hours and had no food. They did nothing to make up for this terrible 1st experience and being a restaurant owner I know what should be done. I hope everyone takes this post seriously and there were 6 of us so expect more negative reviews. We have given them plenty of chances. Is there a -5 stars?  That would be too high. Terrible place and service. We even saw the bar tender drop ice cubes and put them back into a drink. Gross!!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 1, 'date': '2015-06-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'TJRBA15ziLkf5chQrCrzHA', 'review_id': 'TWnGTVs8NV_NcYauhz30Qg', 'text': "This place ROCK'S. being a retire firefighter I do enjoy the smell of smoke especially when I know it being used to cook some delicious meats.  I've been here several times now and have tried most everything on the menu.  The burgers, chips and hot wings are some of the best I've eaten.  My wife loves the coleslaw.  The staff members have always been friendly and offered great suggestions.  So while the food is hot, the beer cold and the staff wonderful, the only thing I can't brag enough on is the are the prices.  I know I'll be back and I'll enjoy being here, sadly I can't afford to eat here as often as I'd like.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2015-06-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ui_aRlrLjr5hGDzvCeDrnQ', 'review_id': 'pvHoANamYpyRNY49nIO-dA', 'text': 'While their food was very good we experienced a serious problem with them. We used our credit card at the restaurant and when the statement came in an additional $30+ had been added in. So far we have made four calls to the restaurant to get it resolved and no one ever calls us back after promising to do so. If you go, USE CASH!', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 2, 'date': '2015-07-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'lYel2Yv5RdAAU5L4pCiiRQ', 'review_id': 'RzlL9JLxXTBUK8v6ODz6oA', 'text': "Great hamburgers! I like the atmosphere and the smokehouse BBQ,  I can't wait to go back and try more menu items :)", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2015-07-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'ZbGDghNc2nMDRHwvEGNrKA', 'review_id': 'wZ_kVXUKh_spBwHnnkCKZA', 'text': "My brother took me here for the first and last time.!Sat down, received drinks in a timely fashion, ordered apps when drinks were dropped off, apps arrived 40min later as the server explained 'the kitchen didn't know the apps were on the menu.' \n\nWe didn't stay the extra hour on our lunch to find out how the entrees were. I will say the pork belly tasted ok, and deviled eggs were crap. I will also add the price point of this place is way off, so spend your money for quality deliciousness elsewhere.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 1, 'date': '2015-07-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'CjsQq1SPPQkOcA8JULT9Pg', 'review_id': 'gHw6Euea-SP6zvwZyptYXQ', 'text': "I must say, wow!   These guys have stepped up their game and the new menu is outstanding.  If you find yourself in AZ, I strongly recommend you drive directly to either of their two locations.   Start with a bacon board and go directly to the Boot Burger.   I believe it's one of the best burgers in America.  I know, that's a big statement, but they are delivering on the goods.  Sorry no pic on this post.  My hands and mouth were too busy...next time I check in I will post a few pics.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2015-07-18', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 14, 'cool': 13}, 'user_id': 'kR32ZZ3wTBe7fp5vnS6Avw', 'review_id': 'aM-HZ0mbHPKeOmTNyR4CtQ', 'text': 'Bootleggers has GREAT food!  My boyfriend likes the Boot Burger, while I prefer something healthier like the kale salmon salad.  Whether you want standard pub fare or healthier options, Bootleggers is a wonderful place to grab a beer and CHOW down some yummy stuff!  YAY!', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2015-07-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5xuMJpY23YC6zKA2oI186g', 'review_id': 'WCaxujIDAIKGONjflJt_Zw', 'text': 'The food here is absolutely delicious and the wait staff is awesome! The menu prices seem steep at first, but the serving sizes are very large and most meals are platter types for the whole family. I highly recommend this place. Make sure you go with plenty of time, this is not a short order or quick serving place.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2015-08-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'wttePGxhTumTTUinL5tlTg', 'review_id': 'amP5pQCMNQe3RoLKyt4Wlg', 'text': "So good, and so very unlike anything else in the area. \n\nYou won't believe what Bootleggers looks like inside when you pull into the parking lot of the typical Phoenix strip mall it inhabits just east of the 51. The atmosphere is unisexually appealing and so is the menu of food and drink.\n\nIf you are with the guys and you want large portions of meats, go for the ribs or a steak. Get one of the rotating local craft brews to go along with it. If you are out with your girls, get small plates or the bacon board to share and drink some apple pie moonshine or a glass of wine.\n\nYou will be seduced by the smoky smells coming from the smoker- which is behind glass near the bar so you can check it out.\n\nIf you sit at the bar, say hi to Robin and if you want a sip of something to drink before committing, just ask her.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2015-08-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'F6Zektk_fZTniUKT8mX3jw', 'review_id': 'sM8hnDibmYBo2567cEg0qg', 'text': "Wow. I'm from Chino Hills California visiting friends and we were deciding on dinner. They mentioned Bootleggers but I first had to check Yelp rating; it was a 4 star. That was perfect because I will not entertain an establishment less than 4 star. Well, Bootleggers is a 5 star in my opinion\n The Bacon Board was incredible. I then ordered the Pan Seared Salmon; incredible from start to finish\n The side dish of broccoli was delicious! Our entire group loved their dishes as well. The servers were friendly,  timely and friendly. I am now waiting for the peach/blueberry cobbler.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2015-08-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'K5owfRSgd1e7ds7-Oj3GVg', 'review_id': 'iKcRFPHcWwHCd8abyAk7_w', 'text': 'Tried this place recently because my son and my wife have been asking for barbecue. We were pleasantly surprised. Ribs wee very good. Brisket was excellent. Sides were pretty good. Service was pretty good, too. Nice people. But it is a small, loud place, with a large bar area. I see some people have complained about the prices, and I can see their point. But the food is worth it, and I will be back. I just need to figure out how to time my visit to miss the noisiest times.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2015-09-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IBHIB59epUFRXPOhwN_LqA', 'review_id': 'K_n4oEmVvUxXuAvglYuXFQ', 'text': 'We had been wanting to try this place for a while and finally made it there this weekend. We were a party of 5 and seated immediately with a reservation. We ordered drinks and appetizers. The bruschetta with the peaches and goat cheese was tasty. The honey Siracha wings were fantastic and we just might go back and only order those. Everyone tried something different from turkey, to pulled pork, ribs, brisket, and the hamburger and everyone thoroughly enjoyed their meal. The only negatives we had were was one person had a sprite that was a bit on the flat side, the Long Island iced tea had way too strong of a lemon flavor and the cole slaw that came with many of our meals was nothing special but I never expect much cole slaw. Drinks are also a bit pricey.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2015-09-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'lS1yBzrxGoYY-k2auRMAMA', 'review_id': '_snFC2dqwnqRKxQx_nPFFg', 'text': "OMG! Where do I start??? Phenomal establishment! Previous reviewers has chatted it up about the bacon board, so I won't harp on it. But, listen to me people...GET IT! You'll be mad at yourself if you don't. The barbeque board was great too! The servings are plentiful for two or more people. I ate so much I looked like a potbelly pig when I walked out. Wash everything down with a jar of moonshine! I tried several favors! :-) I was a happy camper ya'll! The staff were on point with recommendations, order taking, or just for small talk. Great date night place, epecially if you like sharing!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2015-09-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fPnHphZvSRo8j3zP6nWbkg', 'review_id': 'W2hGQc7F2IijHxLgczzs1w', 'text': "If I had to grade, it would be an incomplete.  We stopped in for lunch, waited 10 minutes and not one employee came into view.  Not a bartender, waitress or hostess. \nSo we left and went to another restaurant. Which I will review when we're done with lunch!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2015-09-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bAaNeIZq4qmlIo9NdqeUhQ', 'review_id': 'hHxk4IUibuspvS9nnsvcCA', 'text': "Sunday brunch is back! The homemade Bloody Mary mix they use has got to be the freshest bloody I have ever had. Nothing artificial or 'canned' about this one. Try the chicken waffle bites or the green chile pork burrito. I took my 4 year old there on Sunday and it has a warm family atmosphere, but still a wonderful Sunday football scene. Great place to watch the game!  Our family will be back next Sunday!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2015-10-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '4FJ5foe5Mp2If2k0pxV_Ag', 'review_id': 'FTrS7zk32mJNupitd9kgxA', 'text': "Bootlegger burger is maybe the greatest burger I've ever had.\n\nThe Jack Daniels brownie had an excellent amount of cocoa in the brownie, topped with amazing ice cream.\n\nThe waiter (owner?) was extremely jovial and pleasant.\n\nWould send anyone here.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2015-10-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'F3UojyaAto_lqeVAcUIl6A', 'review_id': '4F6iv6HD2E5RJgxyt4k6LQ', 'text': "Great tacos! Great moonshine! Great time! If you're looking for a date night place or just somewhere new to try I'd give this place a shot. I went during happy hour (3-6pm) and it was a great time with good pricing! I will be going back!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2015-10-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'O6P_oTsHDrqjfH9Nwr9siQ', 'review_id': '2i9OdHPy9GLwH5fJ8Z770Q', 'text': 'I am a smoked meat aficionado. I was very happy with my brisket so my wife and I went again. The 2nd time my meat was very fatty, much to my surprise.  HOWEVER, our waitress took back my plate and brought me a whole new meal.  I was VERY happy with the service and the food.  ONE SUGGESTION, make peach cobbler without blueberries.... please.  If you have a chance try the apple pie moonshine too.  You will not be disappointed.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2015-10-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oTvIhOgqgU70RZ8kTdNMYg', 'review_id': 'NSKeCqUByHyg2yVt6KNhfA', 'text': "I finally got to try this place last night for dinner and I can't say that it held up to all the hype. The decor and atmosphere are great, completely unique for the area since there are very few dining options. \n\nThey had run out of pulled pork by 7pm, which was disappointing because it is one of my favorite bbq items. My family and I ordered the meat sampler (minus pulled pork since they had run out) and a a couple of sides. My favorite part of the meal was the Mac and cheese- It was delicious. Probably won't go back unless my family has dinner there again.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2015-10-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7-PuhvUhhqcbHpoC5Msshg', 'review_id': 'mh15oEKmt7CQW4h7uvmlcA', 'text': 'great service, but fatty ribs and brisket.  The apple pie moonshine helped to forget how many Weight Watcher points we were eating.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2015-10-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '89nX7asv2op1r3E5hHjAcw', 'review_id': '9kivbI7TH6POQFp1GXrzsA', 'text': "Food and atmosphere are top notch. Like a diamond in the rough you would never know how great this place is based on the strip mall it sits in. Do yourself a favor and check out the pulled pork sandwich. Amazing!  Can't wait to come back for happy hour.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2015-10-19', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '7r4Yim0ihL4wBsD-VCd_iQ', 'review_id': '8K82mR8nJ2erRcJZq46aTw', 'text': 'Kiki and Robin rock. Best bartenders. They make amazing drinks from scratch. Personality they reach everyone. They make you feel welcome! Lauren is also awesome! She chats with everyone sitting at the bar! She had fun energy!! Bootleggers is a great place! Wings are crazy good!!!', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2015-10-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'zXtf9QMHbElOPW-3PAKcKw', 'review_id': 'vbd_Vs_QuIaeDZVt_iEkQw', 'text': "Omg .... SO good! Have gone by a million times,  that means a million prior mistakes.  The bloody mary has set a bar for all others to beat (a nearly impossible task). The burger had such flavor!!!! Can't wait to come again!", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2015-10-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qYnXG4az7ITxdyquD0XDeg', 'review_id': 'ERteA9i1FuzVQ8GdunZA3A', 'text': 'Oh, no!!!...we\'re now experiencing the evolution of a restaurant that was well financed but now the money wants MORE money back.  Over the last couple of years, I\'ve seen the prices rise on all plates and I\'m fine with inflation of beef, chicken and pork of 25% as long as portions and quality remain strong while being represented correctly. Unfortunately, they\'re cutting down on portions to the point that it\'s downright wrong. First, I began by trying to call in and order a half chicken with two sides as it\'s advertised in the pick-up menu for 24 bucks....I gave up however after 5 calls going immediately to an answering machine.  I then drove to the restaurant and found out quickly that they no longer offer a half chicken of any type without 24 hours notice.  Wanting some good chicken, I settled on the "Large Plate" section of Brick Chicken with potatoes and broccoli.  I was told that it wasn\'t necessarily going to fill up two people but my wife wanted a bite as she had already grabbed a meal with friends after work.  This "large plate" for 20 bucks was ridiculously petite to say the least. I\'m so disappointed and hungry!!!  Why Bootleggers...why have you given up so quickly?  Chicken is plentiful...I promise!', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 1, 'date': '2015-10-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'tfOnGAZdnmQlSVX_o9yT2Q', 'review_id': 'fc1oPfhHNDiCtmumPmEoFQ', 'text': "Very nice service. \nThe food was lacking big time! I came here because of the bbq ribs pulled work all that yummy stuff and it was not what i expected. Everything was very dry and chewy. Maybe I came  on the wrong night because it was very slow in there. \nI don't think I'm coming back.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 1, 'date': '2015-11-01', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': 'D0rT-cQzz9AIz-dOy0rLew', 'review_id': 'KTcHRl7yvdpQWR0_48liXw', 'text': "Had an awesome dinner at the bar with the fabulous Jameson ( he's their fabulous bartender). I ordered the brisket nachos- delicious. The guacamole is on point. Came on a Monday night - relaxing, watched the game.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2015-11-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'AzClf2GmcVCSqpsUyl8D5A', 'review_id': 'HSxIB9tPaSnmfuJVkmneEA', 'text': 'My son and I came here for the first time tonight and we both really enjoyed it. The burger, sweet potato fries and the smoked brisket basket were excellent. Employees are all very friendly and attentive, relaxing atmosphere tucked back in the corner of a small plaza.  Another great find from Yelp, thank you!!', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2015-12-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cQEhHWFwQ_1pPM2wkkMUIQ', 'review_id': 'DOgpZwR9gJr2NL8MbhdWGQ', 'text': "I gotta say the place has a nice feel to it, the food fell short from expectation though, it's pricey for the portion you get, we first got the brisket and it came in at room temperature and a bit fatty,  the service was friendly and courteous and the manager went out her way to make us happy so she suggested the chicken instead although the wait was lengthy it was good but for the money we paid for it was way overpriced.. French meal portion.. :/ not ur typical BBQ spot if that's what ur craving..", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 3, 'date': '2015-12-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uLboLQZCGC-67eGrRi-lAw', 'review_id': 'NiE7ENQgf0Koy-LY23xEBA', 'text': 'Great food. I have had the Bootlegger hamburger and their pulled pork sandwich and they are both excellent.\n\nI will be going back to try some of their other menu items.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2015-12-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TgmxmtK3Le4wl9BikV5MVQ', 'review_id': '4q6JRyztj4dH8PAlvqk7Cg', 'text': '5 stars for the food but I should never have to wait for the bartender to finish her personal and very angry yelling phone call to get service.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2015-12-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mbZU4ZwP7SkC_WfpABWtXQ', 'review_id': 'vrwAII2uqe1a1ZRQN38BPA', 'text': 'Great ribs turkey is a bit dry but that happens when you smoke it.', 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 4, 'date': '2015-12-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0-_mxr39QBmFuPsOLiOU3Q', 'review_id': 'yo72ScQUPhh7-1g3LeIFzA', 'text': "I love this place. Great ambiance, the barbecue is delicious, happy hour is great (brisket tacos are awesome), and it's a great place to get a drink. Highly recommended.", 'business_id': 'uMxfxbqT27XDeU9UTXeErg', 'stars': 5, 'date': '2015-12-24', 'type': 'review'}
