{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'WmAyExqSWoiYZ5XEqpk_Uw', 'review_id': 'g9JQPf4KFYUujyruPO-50Q', 'text': "I can't believe this place has been here for so long and I am the 1st to review it.  Weird.  Anyways...this place is just ok to me.  I like that its open til 6am, I like that they make strong drinks and the mini TV's at each booth for sports is cool too.  If I was with a group, this isn't a bad place to bs and do shots etc.  But the food just isn't great here.  Its just average Mexican imo.  3.5 stars is what I would give this place if I could.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2007-11-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'dEMgNgcRFD8d4lre8_N1rA', 'review_id': 'vHRP_Dj0sJbv8AU-3iGNQw', 'text': 'Great Mexican food at a great price.  The restarunt has won many awards and is a local favorite.  Well worth the trip.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2008-01-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'vPFXjpKzJJu5wLCxo7iE5w', 'review_id': 'dNbQ5w0mljJiDNJE3cA3mQ', 'text': 'Really fast service for a Friday night. They brought out our drinks quickly, with chips and 3 kinds of salsa [mild, hot, and omgwtfhot]. The guacamole was pretty onion-y. Lay back guys.\n\nTwo of us ordered cheese enchiladas. It was one of the cheaper meals, at 10.95. It came with rice and beans. The other ordered a burrito verde. Pretty huge, and a bit more [$13.95, I think] but very good.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2009-01-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qAqMZlpP4QVuspYYiaWXZg', 'review_id': 'TOUfmlZd2v6jaJ7lmUWjlw', 'text': 'A few years ago, I attended a blow out pre- Jimmy Buffet party at Ricardo\'s in the MGM.\nI mentioned that to a friend and he said - "it moved to Flamingo road and Decatur." He said Ricardo\'s had been in and out of the MGM on a few occasions.\nRemembering the good time I had previously, I could not wait to try it again.\n\nRicardo\'s looks like a hacienda sitting on the corner of a strip mall.\nThe entrance is tiled and the decor is very traditional - other than the many awards they have posted for "vegas best restaurant. "\n\nThe service was good - they thought I would want to eat in the cantina, rather han the dining room since I was alone.....\nbut I got seated in the dining room eventually\n\nThe margaritas are made with Cuervo, and were very good.\n\nThe menu had an amazing number of choices ... and in addition the restaurant had a dinner buffet featuring a wide variety of dishes.\nWanting to try a little of everything I went for the buffet and was glad I did.\n\nEven tried a little fried ice cream to finish the meal.\n\nA very enjoyable dinner.\nNothing spectacular, but an enjoyable dinner.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2009-07-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'eK0tzr8Oh0LhpG22v_Fj_g', 'review_id': '8mcpvfCH3qZnfqBdYNFulg', 'text': "Another late dinner, this time we were craving Mexican food, so we came to Ricardo's on a recommendation.  I ordered the Enchiladas de Verduras, when my food arrived, I was surprised to see my enchiladas smothered in Cheez Whiz...Yuck.\n\nI asked the waitress if she could get me a new plate with regular enchilada sauce and melted cheese, she was happy to oblige.  Overall, the food was not bad, but nothing to write home about.\n\nThe waitress was wearing this odd country style flouncy mini dress complete with petticoat and her hair styled in 2 side buns...Only in Vegas...?", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2009-11-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hU9b1gVEG8jHMgYspd-Nug', 'review_id': '3D_MvH4bLcY-655FFAExwg', 'text': "one of my favorites of all time. excellent food, great service, can't miss.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2009-11-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'L15U2cUBBs5wb7qtp3qW5g', 'review_id': 'RPjSMCZOIMs7d5WVhdSuHQ', 'text': 'Well, my search for good Mexican food in Las Vegas continues.  I really wanted to like this place because the service was so friendly.  Unfortunately, my San Diego taste buds will not be returning.  \n\nThe Good:\n+Great Service\n+Fresh chips\n+Complimentary bean dip\n+Carne Asada flavor\n+Large side of sour cream for only $1\n\nThe not-so-good:\n-Iced tea\n-Salsa\n-Mushy rice\n-Dried out tortillas\n-Prices\n-Refried beans flavor and texture', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 2, 'date': '2010-01-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'bMpF5OPrf916Y0Gu13VIMg', 'review_id': 'SHBzWt71g3xv5i_26ByDVw', 'text': "Good atmoshpere.  Prices were a little high considering it's mexican.  But the enchiladas were too salty and the guacamole was flavorless.  You guys ever heard of LIME?  Its not just for tequila shots!", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2010-03-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'vMjXKEcrt6S5q37zBmydGw', 'review_id': 'nAvD81-1KkSS8WBm3QQHag', 'text': 'Yesterday I went straight from work to the LV Wranglers game, to see them get smoked by ontario. Needless to say, after a 10 hour shift at the pool, an awful hockey game, and 2 double jack and diets, I was craving some good mexican food. I used to live in San Diego, so I\'ll admit I can be a little snobbish when it comes to authenticity. So, I\'ll just start with that: this is not authentic, but still tastes good.\nFrom the start I was unsure what they were trying to be. From Flamingo I could see drink-promo banners and a neon "open all night sign".....standard for Vegas. The hostess wearing a flowy, brightly-colored salsa-dance dress led us past the gaming bar, to our booth which had a miniature television tuned to ESPN.  See why I was confused as to their overall goal? But, then they immediately served bean dip and 2 kinds of salsas with slightly stale tortilla chips....but don\'t worry I still ate them all. \nI ordered steak fajitas and the steak, peppers, onions, and sauteed mushrooms (?surprise!) were all very good. The condiments, tortillas, rice and beans, were only so-so. \nOverall, if you are tipsy, hungry, in the area, and its late night.... then its worth a stop-in. But, I wouldn\'t drive out of my way for it. \nHowever, I did grab a handful of Vegas mags on the way out: LV Weekly, Dine Out, Where, and CityLife..... all of which satisfied my Sunday morning coffee-reading ritual. So...thanks for that, and for my boyfriends bean-breath.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2010-04-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3sWSeGT-5fQ2Z6uAW78VMA', 'review_id': 'VYSSoW7GSb58i6vOgCDQcQ', 'text': "The wife and I were out running errands and it was getting late so we decided to stop by Ricardo's because it had been a while since our last visit. It was after 9pm, so we were seated in the bar area, which was fine because it was pretty chill for a Friday night. We both hadn't eaten since lunch, so we were excited for the chips and salsa. The chips are pretty fantastic, fresh and not too salty. The mild salsa was like cold tomato soup, but the medium had nice full flavor, though could have been chunkier. The bean dip tasted like bacon fat, and that is kind of a turn off for me. \nMy wife had the veggie fajitas (minus the mushrooms) which tasted very good. I had a Chile relleno and cheese enchilada combo plate. The Relleno was decent, but the chile was super mild and not a lot of flavor. The enchilada was very good, and the sauce was just right, not too overpowering. I also got a Pacifico for $4.25 which wasn't too horrible. \nThe portions are a bit smaller than other Mexican places (the plate filled me up, but I had no leftovers which isn't typical for me), and the prices are a bit high, but if you have a  hankering for some late night eats that won't give you a big of a gut bomb as say Roberto's (which I love, so no trash talk here), this is the place for you. It is also not a bad place for an everyday dinner either!", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2010-05-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Kx4v-rKmNLZB0xdwfoAsSw', 'review_id': 'tdSbpTWr89cjaUk_W1ThCw', 'text': "Excellent food and the best service one can ask for. Local favorite that's been established in Vegas for quite a while. Try the Burrito De Carne Asada.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2010-06-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'XjfKBr96h6GgrfkR_q6gIA', 'review_id': '_SsGLqmzD0qDqj2L5BEIJg', 'text': "Atmosphere is great. Good food. Service could be better. \n\nA good friend was visiting from out of town, so we got together for dinner, with a few other friends. There was a large party- maybe Graduation or a wedding, we weren't sure- but it was buffet style. There was entertainment in two forms- (1) a singer who looked like he was from the wild west or was it mariachi-like? It was black- had adornments all throughout- what do you think? (2) a balloon twister animal shaper maker- ok, I don't know what the exact term is, sorry- but anyway, he made some pretty neat shapes for the kids. \n\nSalsa and chips were very good- we needed more. Refills on water took forever. Our food took a while too, come to think of it. I had the fish tacos, which was good, not great, but good. I don't know if the poor service was because of the large party, but it could've been better. The tables were all occupied, where we were seated. So, it was busy all around. The bill was pretty good for our group of five, so the prices were not bad.\n\nI would be willing to try it again. Maybe it was an off night. The first time I ate here, was in college, and the restaurant was located either on Tropicana/Eastern corner or the Flamingo/Eastern corner. I did remember that the rice chicken dish that I had was really good.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2010-08-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fIv9Coa0MM1E4WfliAnUtA', 'review_id': '929yw1Pf-xRZWZmp6tVaEA', 'text': "Great service always.  Excellent place to grub and for you night owls it's open till 6am every night.  Most people are happy with the burrito Colorado, but I prefer the seafood enchiladas.  But they have a large variety.  The prices are from $9 to $20 ish.  As usual this venue does not fit the yelp $$ scale. :)", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2010-09-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'YTpCi_J9txyN-sl52sgS4g', 'review_id': 'pGWvw6PMh0m0IMHFQ0kkZw', 'text': 'The best chimichanga around.....great service, nice atmosphere.  Always a great las Vegas meal.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2010-09-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'eZAMRyCffUQdjTjlwdD6Kw', 'review_id': 'T2tgHBMZUK_vuJM6pQhOEA', 'text': "I have been to Ricardo's quite a few times.  Although not in the best part of town, the restaurant inside makes you forget the surroundings.\n\nI have been there for Happy Hour and dinner.  Happy Hour is great!  You can have the drinks and any of the appetizers for HALF PRICE!  You can really eat a lot for very little.  Most of the appetizers are a lot of food.  One appetizer can be a meal.  \n\nThere are flat screen TV's with closed caption at every booth.  Really cool.  It is a great place to hang alone or with friends.    \n\nYou definitely have to try it! \n\nP.S. The dinners are great and priced just right.  Service is good too.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2010-10-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'DBjPbmmHD4HG0xLwjtn53w', 'review_id': 'mUYsjyojffmxcFomqwM_aA', 'text': "My husband and I go to Ricardo's about once a month.  We used to go more often but not so much anymore.  The food and service is alright, its excellent when the owner is present.  Its actually kinda funny since my husband I go there so much we know exactly when the BIG BOSS MAN is there just from the way the staff act...Suddenly we get the best customer service from the waitresses and waiters, & our food comes out super fresh & pronto!  BUT only when BIG BOSS MAN is in the restaurant otherwise you get lazy hostesses & so so service.  We ate last night, we were greeted by the staff which was amazing because normally the hostess has her head down as if she is too busy.   (Busy with god knows what when the restaurant is empty???) Tonight must be different  ahhh, I figured BIG BOSS MAN must be in.  The waitress took our order, food came out, super fast & fresh!  Wonderful.  We ate then waitress was no where in sight.  Ahhhh, BIG BOSS MAN left for the night.  BOO HOO.  Our waitress didn't come back to check on us to give us our check for another 15 minutes after we were already finished eating.  From what we have noticed, BIG BOSS MAN aka the owner is usually in late evenings after 9:00pm.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2010-11-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': '4p-qAdc_ZLXfieNwaZGNGA', 'review_id': 'gK0g7mHvQJkSlLEkTL4SDw', 'text': "Ricardo's is just up the street from my work, and since my boss loves Mexican food it's another spot we end up going to a lot for our Friday office lunches. \n\nI always get the $9.99 lunch buffet. When there is a buffet that offers a full taco bar (chicken, carne asada and ground beef), enchiladas, tamales, rice, beans and more... why limit yourself by choosing off the menu?? \n\nWe usually sit in the bar area, the service there is always on point. And the booths in the bar areas have their own televisions, great for my sport-obsessed coworkers.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2010-11-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'eEZYeB3-dRbN1ur3j5rAvQ', 'review_id': 'pipTVDSqwRIp48zEdXFrmg', 'text': 'Ricardo\'s is a great Mexican restaurant for Las Vegas but being from So Cal - the Mexican food there is at a whole new level of amazing.  \n\nThe owner really cares about this restaurant and his employees and it shows.  When he is there when we have visited he walks from table to table and asks how we are doing.  And most of the waiters and waitresses are very kind and your food will come out quickly after ordering.\n\nTheir complimentary chips with two different salsas and bean dip are delicious and are a perfect compliment to their amazing margaritas.\n\nPrices are very reasonable and the food is plentiful.  Standard Mexican "comfort" food.  I normally get their steak and shrimp fajitas.\n\nA nice side note... I love that this restaurant has credit card machines that go directly to your table to pay for your food - no sending the card to Siberia sometimes waiting for your slip to sign - the waiter doesn\'t even see your card.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2010-11-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'RpHfsKfIfDqnjZrBbQE6dA', 'review_id': 'nSRFvP7aNFK70C4O9w1fBQ', 'text': "I recently revisited Ricardo's last week (I hadn't been since 10 years prior). Service and service were good and efficient. Its open 24 hours and for us coming in so late all of the staff were in a pretty good mood. Margaritas were yummy! They also provided complimentary chips, salsa, and bean dip! \nGrowing up in a hispanic household it is sometimes difficult to find good authentic mexican restaurants, Ricardos did it for me.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2010-11-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '2bJhcM8AHslcjSCu5J5gpA', 'review_id': 'LXhBlSL50gTRr0EjQ01WXg', 'text': "The food is tasty. It's nothing that's incredibly unique compared to other americanized mexican restaurants, but they serve a pretty scrumptious bean dip with the salsa and they have a billion flavors of margarita. The atmosphere is ok, Oh, and they're open late! Its a great place to keep in mind when you're super hungry, and its after most restaurants have closed. A good back pocket restaurant for sure!", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2010-11-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 4, 'cool': 2}, 'user_id': 'ia1nTRAQEaFWv0cwADeK7g', 'review_id': 'L7Lm2o16N-ijI5YLiFHErg', 'text': "Ok, Vegas is a city with many things... Great Mexican food is not one of them. \n\nThat being said, Ricardo's is ok. Just ok. The service is usually great and the restaurant is large and great for big parties. I always judge a Mexican restaurant by the chips and salsa...and well, their chips are red and green, enough said. lol\n\nMany of the meals are tasty, but you can tell they've been prepared before hand and then warmed up again when you order. That is my biggest pet peeve in a restaurant, when they tell you not to touch the plate becuause it's hot. I want my food made to order, is that too much to ask?\n\nI'd recommend coming in for their taco buffet. The food is pretty good and the buffet is rather inexpensive. \n\nIn a pinch, this place will do, but I prefer Bonito Michoacan or Lindo Michoacan overall.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2010-12-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': '3sWSeGT-5fQ2Z6uAW78VMA', 'review_id': 'EzOJPkzBXf8rEGN5EdCXyg', 'text': "So it helps when you visit this place and  get seated in the main section. The last  time we were here we sat in the bar, and everything was fine. This time we came in with some friends, and sat in the main area. \nWe were greeted promptly by the friendly staff. I have to give some credit to our waitress as our group had two english only speakers, one spanish only speaker, someone who was bilingual and a child. Our waitress was able to easily switch back and forth between english and spanish to assist us. \nThe salsa has definitely improved since our last visit. The medium was really chunky and the mild had much more flavor. The chips really are incredible here...probably the best I've had it town. Very crunchy, a bit oily but they are also very large. \nI had the taco salad. Its more of a hard shelled burrito than a salad. There is lettuce, but there are more beans and cheese than lettuce. The salad also has guacamole, salsa, sour cream and olives. I had without the meat, but you can get the meat on it. The portion was huge. After indulging in chips and salsa, I maybe conquered half of it. \nThis place does have a roving magician/balloon animal artist. He was a little less aggressive than others I've seen, which was nice. \n\nWe definitely had a better experience, and will probably be back.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2011-01-07', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'kjO094YH2gVycUDk5_6VUg', 'review_id': 'RGBXLyS6qH4FL7YsLXCljQ', 'text': 'First the service.  We asked for a kids menu for our 12 year old daughter, and the server thought we were kidding, ok.  \nI asked our server a second time and then the manager came by and informed us that the kids menu was for 10 and younger, making a joke that  fell flat about how my daughter needed to grow up and be a big girl and order from the regular menu.\nWhy would a restaurant not allow her to order from the kids menu?  \nThe food is priced acording to portion size any way, so whats in it for them to say no?\nThe service was adequate but the experience was soured by the kids menu thing.  As for food its ok, i feel the food from robertos is far superior and less expensive.  Ricardos is a nice atmosphere for a meal, just dont bring your kids.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 2, 'date': '2011-02-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5pn0Rb0RSvt7IkPLWsGeZg', 'review_id': 'wKQZRQ04mUcyoYSXqkFrwg', 'text': 'The food is just OK. I remember when Ricardos used to be a great place for Mexican food.  Today, not so much.  The main reason for the single star is how tue staff treated a 12 year old girl.  When asking for a kids menu for her the waiter actually asked "are you serious". He then leaves the table and comes back a few minutes later and ask if we\'re ready to order. Mind you he did not bring a kids menu. He was reminded that we had asked for one and he actually said " I thought you were joking". A couple minutes later this old biddy comes by with what looked to be a kids menu and says with a real snarky attitude "children\'s menus are for 10 and under". She the proceeds to snidely comment at the child "you\'re a big girl now".  Some people you just want to smack. But seriously, what\'s the big deal, she\'s a picky eater that doesn\'t eat much. So instead she was forced to order a full meal which she maybe ate 30% of. What a waste of food not to mention money. I\'m not saying I won\'t go back to Ricardo\'s, but I guarantee it will be at least 1 year from now. With that and maybe this review dissuading at least one person will cost them more than if they would have just let a kid eat a kids meal.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 1, 'date': '2011-02-10', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': '-K3ZjROK0ml2P-Rk7ttHzA', 'review_id': 'dVdQHry1ylZhtdnoMtIIuA', 'text': "I've come here twice already. The first night I came it was for a late night eat. This place is open from 11am - 6am, so it was perfect after a night of partying. \n\nWe were seated and given chips, 3 different types of salsa, and water right away. The chips were very warm and fresh, which was surprising considering it was 2am.\n\nI opted for the Tostada Fiesta without sour cream (9.95) and my boyfriend got sirloin steak fajitas (14.95). It came within 10 minutes and boy did it look yummy! We both took a bite and it tasted just as good. The portions were very big, so we weren't able to finish, but we had some awesome leftovers. \n\nI highly recommend this place for late night dining. It's very mellow since there aren't many people dining and the lights are dimmed a bit to give it a romantic/relaxing mood. \n\nThe second time we came here, it was for the $10 taco buffet. We found out about the it the first time we were here because the waitress suggested it. \n\nThe place was a little more poppin' this time since it was around lunchtime and I'm sure there's a lot of regulars that enjoy the buffet. We were seated and given chips and salsa right away. Pretty awesome considering we were paying for the buffet and we still got complimentary chips n salsa. I also ordered a cherry coke and the waitress brought it with a couple maraschino cherries in the cup, which was a tasty little treat. \n\nWe headed down the steps and to the buffet. It was rather small, but it had all the necessities to get your tummy to grow twice its size. There were tacos, chile relleno, enchiladas, rice, beans, fresh guacamole, salsas, carnitas, carne asada, shredded pollo, and even tostada bowls to make your own crazy concoctions, \n\nWe both put as much food on our plates as we could possibly fit. We just wanted to make sure we tried everything and we sure did. Needless to say, by the end of our meals we were extremely full and very satisfied. The quality of the food was great, especially for the low price that you pay. \n\nI'd definitely come back again. You get the most bang for you buck with the buffet, but if you want a nice low key dining experience then come here for a late night dine.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2011-02-13', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 5, 'cool': 4}, 'user_id': '47Axeg0deIegNhwatMhC9A', 'review_id': 'ALlWs0-8E5FdImcYuMk3aQ', 'text': "Ricardo's failed at almost everything for me this weekend. The two stars are for the guacamole that was fresh and creamy and was portioned perfectly for sharing. Second star for the tasty cocktails that hit the spot for all of us. \n\nDirty laundry list: \nHorrible service. Not only did our waitress seem to never be around when we did see her she avoided eye contact with our table like we were Medusa or something...strange. On two of her visits to our table she made rude remarks to us! The group of people I was with was not rowdy or obnoxious so I was really surprised to have such a hormonal waitress treat us so poorly. \n\nThe food. Let's start with the basics. Chips and salsa. Chips, no complaints. Salsa, wait, there was salsa on my table? I thought that was red water with tomato chunks floating in it? Wow. It was awful, kids. They serve chips with two salsas and beans and neither salsa worked. It needed more salt, cilantro and onion. It was like baby food level of heat. Bullshit. Next I had cheese enchiladas with rice and beans and it was just alright. Boring at best. \n\nRicardo's is a beautiful, clean restaurant but their delivery is all off. They've gotten lazy over the years and really need to work on their recipes and service so I'm not the last local native to be disappointed. No bueno Ricardo's.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 2, 'date': '2011-02-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1aImarfAXq4wZmGJTRMb4w', 'review_id': 'EWunJQno44-dhET08bbvWA', 'text': 'Open 24 hours. Good food and very nice late night service.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2011-02-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9LwyHtKt5iRqlcFH-897aQ', 'review_id': 'Yr539phKmNLMnIFVYTl69w', 'text': 'Hmm. This place was pretty lame. The food is not yummy, and I cant believe the prices! 6.95 for a kids meal!? NUTS! The food is blah and the staff is nice. \n\nI woulda rather went to Viva Michoacan.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 2, 'date': '2011-03-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 1}, 'user_id': 'M-BRhSXuIbjWRgztRnHjww', 'review_id': 'A6H5P3_qqJWCmAWUaOobnA', 'text': "My friend suggested this place for dinner last. When I walked in, I thought it looked nice, clean, spacious & empty. I noticed they had a huge lunch buffet table when we were getting seated. \n\nService was on point. Great staff. The chips were good, but I've had better salsa. The food was bland. I noticed that among our party of 6, none of us finsished our entire meal. The only reason I ate half of mine was because I didn't eat since 9am so I was famished. The food was no bueno. No wonder the restaurant was so empty. \n\nI thought for same price, I would rather go to Lindo Michoacan. At least they give you that really good soup w/ your meal. Sorry, maybe I'm just spoiled by the many options of other restaurants. When they were asking if we wanted to go boxes, I was thinking to myself. Hell no!  I thought their portable credit card machine was cool. It even has a button for you to have the choice of leaving a 15% or 18% tip.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 2, 'date': '2011-04-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5hBsVMJOc8sXMPt8S3NjmA', 'review_id': 'oKzdX9kxgTfhqxSdtPH3xQ', 'text': 'I will totally be back!!\n\nThe service was great! They were pretty busy for lunch and our server was very attentive. \n \n\nThe food was great and so were the prices. I wasnt sure if it was family owned, but I totally got that feel.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2011-05-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'vMqTGP9DpuLiuOR-1VeD9Q', 'review_id': 'AD2tNI-va6UTyIH3T5OW2A', 'text': "My best friends and I had dinner here on my last evening in Las Vegas. I was thinking, hmmm, Mexican. Not my favorite cuisine but I was willing  and it's all we could think of last minute. None of us were in the mood for anything else. No sushi, no Mediterranean, no Korean, no Greek... so we settled on Mexican.\n\nThe servers name, and I'm not kidding, was Pancho Villa. He knew that was good for a laugh. Since my friend Joe speaks Spanish we got extra good treatment. Joe had a Margarita and Deb, a beer. There I sat with my water, casually mentioning to Joe that I prefer the frozen style Margarita. He rattled something off to the server and the next thing I knew, I had a frozen Margarita in front of me. Though I don't drink much anymore, I really appreciated that one and it was very well made.\n\nThe chips were really good. Not sure if they make them on the premises but they tasted like they sure could have. I love the chips and salsa thing, even though it tends to destroy your appetite and then you have to fight to get your dinner down.\n\nGreat atmosphere, service and the food was good. It was pretty typical Americanized Mexican fare but overall, it was pretty good. It didn't feel like a chain and I'm not even sure if it is. No matter, it was good and in the end, that's all that really matters.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2011-06-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-6rJxEMOWMPuWC7zRHOz6Q', 'review_id': 'YB98-x1WVyFWXYSKE7kjMw', 'text': 'Easy to find, nice atmosphere, really good food, I would return.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2011-06-03', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 6, 'cool': 4}, 'user_id': 'ia1nTRAQEaFWv0cwADeK7g', 'review_id': 'qb9FPGyHKRXSPJIm6gJDGg', 'text': "More of the same from this place, I'm afraid. The food has gotten more and more bland over the years. There really isn't anything I love on the menu and the only thing I kind of like here is the Ricardo's chicken, which is definitely a little overpriced. There are plenty of items that are ok, but just ok. Nothing amazing.\n\nThe service is great and there is no shortage of people to refill your glass or take your order. That's a plus. I really want to love this place. The atmosphere is nice and it's still a great location for large parties with the expansive space they have and plenty of private areas, but the food just gets in the way of me loving this place. If you do come, I highly recommend their lunch buffet. Great deal, for what you get.\n\nIf the food was better, this place would be heaven.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2011-06-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HAWHM5VNld0Nu1BjXm8UuQ', 'review_id': 'yI82AzMOUhbujzFpBCnitA', 'text': "***Late Night***\n\nI had no idea this place was open until 6AM! I thought it was a restaurant-lunch-dinner type place- but no, not only do they serve food all night- but they have a bar and gaming open as well. And can I just say that the set up is pretty sweet, comfortable, chairs and booths plenty of room. This was my second time grabbin a bite at Ricardo's. The first time I fell in love with their mini rolled taquitos (chicken) which were meant to be an appetizer but the plate was so big it was the only plate I had- it was the only plate I NEEDED. YUMMY. The second time I had PORK ENCHILADAS- on the menu it states the flavor is AMAZING.. I dont know about amazing but it was very good! Once again the proportions were huge and I barely got through half the plate. \n\nChips, salsa, and bean dip were delicious as well! I was impressed :D This place is a little pricey($11-15$ per plate) but I believe well worth the price.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2011-06-09', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'FbdB9KXyuvT8rC_zmqRSuQ', 'review_id': 'mjJPrUkFsroyKqgpJ2IV7Q', 'text': "I met a customer here for lunch on Friday. Ricardo's Mexican Restaurant is a large restaurant with plenty of parking and offers a lunch buffet in addition to their regular menu.\n\nWe sat in the bar where each booth contains a flat screen TV.\nI ordered the killer guacamole and chips which were awesome and so addicting!  For my lunch entree I ordered  the combo - choices were a chili relleno and a beef enchilada which also came with beans and rice. The beef enchilada contained shredded beef and was tasty and the chili relleno was yummy too. \n\nThe portion was large and I ate so many chips and guacamole that I couldn't finish everything.  Thank goodness I didn't go for the buffet.\n\nI'll return here again since this is my clients favorite place to dine.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2011-06-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HkOZSO6pN7u5NG7yjEyvww', 'review_id': 'zdg5XqpyWq15uVzta4vKrQ', 'text': "It was easy to get a seat, considering it was on a weekday night and the place was virtually empty. The atmosphere is inviting and cultural, with a comfortable vibe and color everywhere. The booth we were at even had its own little television to watch! I really like the decoration of the place, it definitely invites you into the experience.\n\nUnfortunately, the food was bland at best. The bean dip with chips was okay, but the two other sides of what I thought was salsa and spicy salsa were too watered down and bland. Even the chips themselves didn't have any real kick or substance to them. I ordered the plan bean burrito, in which the rice was very bland and a little mushy. The burrito itself was nothing exciting, and I only ended up finishing half of my meal (and not taking the rest of it home with me).\n\nMy boyfriend ended up finding a long, thick black hair in his food. We immediately told the bus boy, and while it took the manager a good minute to head over to our table, she was nice enough on removing the item from the bill. Our server also gave us a free margarita in place of it. While having a taste of the margarita (and minding they made that margarita kick!), their server either forgot to card him or felt obligated to get him his drink for free. Either way, there is absolutely no reason why he shouldn't have asked for ID in a town like this. That automatically wanted me to drop this review down to a one star.\n\nMy conclusion is this place draws you in with the decor and beauty of the atmosphere, but it doesn't make up for the food. Ricardo's has a lot of potential if they offered new menu items if they decided to revamp what they already have with more flavor. Otherwise, I'd pass on this place.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 2, 'date': '2011-06-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'biifI-JRFI-2IfAA9TdZ-w', 'review_id': '8S0twmttKK5cldYBzZanlw', 'text': "Authentic and fantastic, that's all I am going to say.  Well make sure you try the chicken taquitos.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2011-07-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'OI-VGo5ij4TMHVw8xWrKNA', 'review_id': '_4xdxyiC3MvgZPE9Ap5rHQ', 'text': "I recently had a work luncheon at Ricardo's, I had been before years ago and it was extremely unmemorable. This visit would be more memorable but for the wrong reasons. \n\nWhen given the choice, I prefer to order off the menu than choose a buffet. But the whole group went to the buffet and I didn't want to be the oddball. I had two carne asada tacos, cheese enchilada and chips & salsa. The enchilada was bland the only hint of flavor was the acidity from the tomatoes. The salsa, too, was bland and watery. The chips were pretty generic. The first taco was ok, a bit bland, but tender. The second was filled with grizzly meat. It really turned my stomach. Fortunately, the service was friendly and they were able to accomodate our large group.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 2, 'date': '2011-07-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'S2t3tCdrqRnH7H-35CGncg', 'review_id': 'vUGqnYZ0wNBhIw7ZqGeYZw', 'text': "I love Mexican Food, it is probably my third favorite food group ;) \n\nI was craving some Margaritas and Fajitas. Luckily we live in Vegas and there are restaurants that are open very late- so I found this little spot in the Southwest area. \n\nWe sat in the bar area, where they offered gambling as well. \n\nI ordered a Medium size Mango Margarita- Delicious and was definitely very big! \n\nMy boyfriend and I shared the Fajitas for two, and we ordered half chicken and half steak. The fajitas came on a sizilling hot plate, with guacamole, pico, sour cream, rice, beans, roasted onions tomato's mushrooms and peppers topped with cilantro ..... YUM\n\nThey also give you free table side chips with salsa and bean dip. \nI am not a huge fan of bean dip, but their bean dip was amazing. \n\nThe service was okay nothing over the top, and our server Kim was very nice, even when our order was messed up. \n\nI had a great time and we had enough for leftovers. Definitely a great place for a midnight snack :)", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2011-08-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '0XRFyY8-dxmrDheFPpe8Sg', 'review_id': 'RKsKPGH8UxR2e74lZ4-1WQ', 'text': "I really like the atmosphere in the dining room at Ricardo's, but every time I visit, there seem to be problems.\n\nIt was a bit late when four of us went for dinner.  We were ushered to a table in the lounge, but asked to be seated in the dining room.  We didn't know it was already closed, but nevertheless, the hostess seated us there.  Definite props for that.\n\nWe started with an appetizer combo plate, which was very good.  For the main course, I ordered Carne Asada, medium rare.  At other Mexican restaurants, this steak has an inimitable flavor. It came out of the kitchen fully well-done, and the only flavor I tasted was salt.  By this time, I was full enough from the appetizers that I just sipped my margarita and didn't have them replace it.  I knew that without that special flavor that I know and love, a less-cooked replacement wouldn't be much better.  And that's the big disappointment at Ricardo's.  The food just isn't worth the trip.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 2, 'date': '2011-08-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'nId2LpOpbZazPA9wocSKsw', 'review_id': 'W5JvMUdqFdq4HJeDfUdEyg', 'text': "I love this Ricardo's. It has been around since I was a little kid! They have great chips, salsa and they serve bean dip for free. And the Margaritas are the bomb! \n\nThey have a lunch buffet, but I also go with the enchiladas or the combo plate. I love love the pork tamales. The corn isnt too dry and the meat is nice and tender. The shredded chicken tacos are also very yummy. Good solid Mexican food any day of the week.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2011-09-04', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'jp3074N1q61xlmdma2UbAQ', 'review_id': 'trcU-fUn9ykgUd5qmU76xA', 'text': "Far from being good Mexican food. The rice has no flavor, tastes like plastic. The only thing that has good taste are the chips because both the salsa and the homemade beans are bland. We had a really nice server but he only stopped to see if we needed anything else hmmm...0 times! I did like how they bring you a mini pitcher for your beverage refills. Overall I thought I was way too expensive for the bland food that doesn't even deserve to be called a Mexican Restaurant.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 2, 'date': '2011-09-04', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': 'SMH7Wo9hdpEZU4M8Q-ztiw', 'review_id': 'SpG_APzSHx2Ps4cEH19Kqw', 'text': 'Came here after a long day spending at casino waiting for friend finishing playing.\nThen came to Ricardos for a nice greeting crew, and margaritas.\nThen have Vero our waitress which outstand the service.\nThe food was cook properly and then the end was amazing.\n\nPrice is ok, and definitely recommended.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2011-09-11', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 2}, 'user_id': '3X9b9mimQlWLz_wjIzLuhg', 'review_id': 'vcVH4qERNo-Tk1h0Uo5WUQ', 'text': 'Since moving cloeer to this area, I needed to find a new closer Place to get my burrito and Margarita fix without driving so far.\n\nI am VERY dissapointed usually with the margaritas and most places, they are from the machines and are disgusting... \nBUT i asked for a Blended Fruity Margarita and got the MOST delicious smooth fruitiest Margarit ever! OMG delicious!\n\nThe food was amazing, we had the special. A Lobster Shrimp Enchilada. There was a lot of Shrimp in there, not so much Lobster. But anyways, it was like an orgasm on a plate. I swear!\n\nThe chips and salsa was nice as well, the hot and mild salsa is awesome and they give you a great bean dip. \nSince I LOVE beans but yet had to go to work... i didnt have to much of it. But the little amount I had, was SO good!!\n\nThe staff is SO friendly, and SO fast. Awesome for a close to the strip restaurant.\nThe prices are ... a little higher.. but yet we are closer to the strip.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2011-09-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'OGeWkre907sxAHTigLsCbg', 'review_id': 'YC6IM1juNXL6jNmbqrZkQQ', 'text': "Mexican only has about 5 ingredients, but Ricardo's does them in about a million combinations! As well as having the traditional meats they also offer a lot of fish (pescado) & even lobster (tho we had the lob tacos & I was a little creeped out...) On weekends there is a buffet which is only $10, less than most entrees, & it looked pretty decent.\nOverall, I would say its good but not great. The margaritas are worth a trip though.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2011-10-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oLz9AlTgtBgXXW0BqDmWDg', 'review_id': 'I6SpRq7p37iRCkTcAZ0Xqw', 'text': "I've visited Ricardo's so many times and it's always been very good. However, today the experience was less than what I expected and unfortunately I brought a guest who was visibly not impressed. Food was mediocre with very dry chicken in both entrees and salsa was bland. Iced tea was weak. Service has always been very good and this trip was no exception which is why I give this site 2 stars instead of 1.  I'll give it another chance but not right away.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 2, 'date': '2011-11-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'w_eIMV_LfOc6BdK2EHrEBQ', 'review_id': 'difVlx-ZhexJ1IHkzZ2VsQ', 'text': "Fantastic,\nI have been going to Ricardo's for years for their excellent food, so we decided to have them cater our company party.\nThe food was excellent, everyone loved it, plenty to go around and the cost was very reasonable.\nThank you!", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2011-12-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5FfYOd4D8z0JSlUiTdOvgQ', 'review_id': 'uJBPcuHlUq1t2wAjU4yZhw', 'text': 'Great, good service staff, good food, good lunch buffet, price is fair and very nice looking place.  I have eaten there about 50 times in the last 4 years and it never misses the mark.  Traditional mexican food and a family run place good for lunch or the family.  Also they have a quiet bar if you like to go for a quite date.  Always plenty of parking and rarely a wait to get seated.  My kid likes it too and the kid menu is affordable.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2011-12-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mJ_JIUD9Cd4DymyTJwLewA', 'review_id': 'T0h0EehQZ3AGtHiRnZUyJA', 'text': 'disgusting. crap.\n\nthe chips- tasteless\nthe sauces for them- watery/bland and the bean one looked like it had been sitting out since new years.\ntaco- vile, stringy, old\nbeans- prison slop "goop/sledge"\nrice- microwave 4 day old soggy and hard in others\nsteak- grilled unseasoned \neven the tortilla were hard....\nabsolutely vile- avoid at all costs....\n\n(and fyi the service sucked.)', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 1, 'date': '2012-01-19', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 2}, 'user_id': 'IF1oemfjhwzXXWSaWDC15w', 'review_id': 'p0u4KpRxR91MJWvmP99KOA', 'text': 'My wife and I were pleasantly surprised at Ricardo\'s a few days ago for its half-off "Happy Hour" and discounted "Early Dinners".\n- We had Large Margaritas on the rocks with salt (~$6.50@ happy hour);Quesadillas and Pollo de Ricardo\'s off their "Early Dinner Menu". Our Margaritas were wonderful in taste and GIGANTIC in size; dinner dishes were absolutely delicious and sufficient in quantity. We also loved its warm and crispy tortilla chips, as well as the two different salsas and bean paste! The HOT version of salsa could have been a touch spicier, though.\n\n- The hostess and waiting staff (waitress and the one who brought out chips and water) were friendly and efficient. Our waitress was also quite helpful in offering her recommendations and explanations of house specialties.\n\n- The restaurant is huge and its Mexican decor tasteful and inviting. Some quarters can be very nice for private groups. Yes, it has a nice, intimate bar area, but one can have HH anywhere in the dining room, too, besides its bar. We will definitely go back to Ricardo\'s again!\n\nPeterskis, Mar 2012\n----', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2012-03-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '1oLE_YZo8aHxgX09YFKJkg', 'review_id': 'sSBxsbIPvCTWRdMR7ydSTQ', 'text': 'I used to love this place-authentic Mexican food. No more. Bad service and poor quality ingredients.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 2, 'date': '2012-03-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'BaG7AXwOyGEjoHiUtj6IJA', 'review_id': 'OJuBAd3ljkkCAyO-9S9qpw', 'text': "My first date with my husband was at a Ricardo's location that no longer exists so I have a certain fondness for this restaurant.  A good feature is they are open late so swing shift employees can get a bite to eat after work.  However, I find the food to be middle of the road Mexican.  Not disgusting but certainly not great.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2012-04-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZuiBUV6l_hc8NOCi8O5MLA', 'review_id': 'SNDSQfECsTluVODLwO9_lQ', 'text': 'Love, LoVe, LOVE Ricardo\'s Mexican Restaurant. My family has been going there for  more than a decade and has followed the restaurant through it\'s various locations over the years. It\'s worth it. Hands down best mexican restaurant in Las Vegas. Not only is their food top-notch, but the service is always friendly. \n\nWhen we moved here from Phoenix we missed a certain appetizer our old Mexican restaurant offered (melted cheese and mushrooms inside a warm tortilla). While Ricardo\'s doesn\'t offer this dish, they\'re still willing to make it when we ask every time we come in, providing a little taste of home in the big city.\n\nMy #1 recommendation - The margaritas are superb. Order the largest one they have (we affectionately call it "the trough" in my family). Also, paying the extra for top shelf tequila is definitely worth it. You won\'t regret it.  \n\nHope you find this review helpful.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2012-05-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Ytd2LT005ochbJygQ4eHNw', 'review_id': 'gsGGJfI5XhtW8SRgvQ_ajA', 'text': 'My friends and I just returned from Ricardo\'s after one of the  most horrific restaurant experiences ever! The food was less than mediocre, our server was extremely rude and there was no one in management to complain about our experience.\n\nThe events are:\n\n1.  No tableware for all of us.\n2.  Server did not know the order numbers per dish although, they are listed in that format on the menu and proudly said, "I don\'t use the numbers. You are going to have to give it to me by the item." After, one gave the order number again, she said, "you are giving me the order number again. I just need the items."\n3.  Server returned and informed they were out of certain foods and asked if we wanted substitutions which we did.  However, she did not ask the person if she wanted a replacement for the soup that was out of stock and walked away.  \nFortunately, the person who ordered soup did not want a replacement.\n4.  Our drinks were not refilled until we asked our bus person (good service) and continued to supply the refills, not the server.\n5.  When food was ready she asked, "who got the one with two enchiladas? Who got the one with the tacos?" Very unprofessional.\n6.  On one order, the cheese on the beans was burnt.\n7.  On another order, there was sour cream although I asked for it not be included. The server questioned and doubted that I made that request. Then she said that they were too busy and the kitchen was making mistakes because of this (many, many empty tables).\n6.  Finally, when presented the bill, we noticed we were overcharged (the substitutions).\n\nThere was an attempt to make a complaint to  management but there was no manager on duty.  The server wanted to speak to the person making the complaint but he was done with her horrible attitude.  She then returned to our table and said, "I am sorry that my service sucked but you could have talk to me about it" as she aggressively picking up our plates.  She explained why the bill was broken down but didn\'t bother to do this when presenting it.  I explained to the above complaints and she "well, I am sorry I sucked!"\n\nFinally, we left the restaurant in a horrible mood and our server\'s attitude was outrageous and extremely unprofessional.  Her excuses and lack of service were apparently due to their heavy business but it was not very busy at all.\nWe do not recommend this restaurant, but highly  recommend for Chef\' Robert Irvine\'s show- Restaurant Impossible!', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 1, 'date': '2012-05-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '6_SbJKPPgCmUP5EIS2nGiQ', 'review_id': 'rTqxqzZjCJlfdB7JdwlTBg', 'text': 'This was my second visit to this place and we all were in agreement the bean dip and chips were the bomb! Actually most of our meal was good! The only bad or down side is how can you only get two small meatballs in a albondigas soup? Come on man!! Really!?!?? Otherwise the lunch was fine!\n\nNow, this does not mean I will not be going back..for lunch. :-)', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2012-05-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'm3sW-4R5TovDLl_38j7YQg', 'review_id': 'ioKYHYFkTI9UJSRIaFKanw', 'text': "Bar none, they have the best Fajitas in town...and I've been to literally every other mexican restaurant of note.  Always a nice atmosphere and service, too.  We literally drive about 20 minutes out of our way just to go here when we get a hankering for fajitas.\n\nI've had friends order other dishes and it looked pretty run-of-the-mill and they were not particularly impressed.\n\nI would give it 5 stars on Fajitas and 3 on the other stuff, so 4 averaged.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2012-05-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'k3iEfCw6XhdT0mi6sH_4RQ', 'review_id': 'sqH2_pZHv_dnRSDWAndA4Q', 'text': "They have an awesome been dip...! Margarita's are pretty desent.  \n\nMy friend had her wedding reception here and it was lovely. They had a gorgeous Mexican theme table setting. \n\nThe food was delicious, the variety was huge... my favorite was the Green Salsa with meat & guacamole was great, very fresh...!", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2012-05-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ytd2LT005ochbJygQ4eHNw', 'review_id': '6mXNoRpW-Od6ngEPUFCtqw', 'text': 'The owner contacted my husband a few days later and was shocked to hear of our experience and offered a free lunch. However, I find it hard to believe he was shocked of this experience considering all the negative posts on  Yelp!\n\nThere are many other Mexican food restaurants in this town to with better food, excellent service and at a great value!', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 1, 'date': '2012-06-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'eZF6wsYdw-d6oiTo6MfhjA', 'review_id': '-BTz4l4gvSaqvzR7QHqxVQ', 'text': u'This family-owned and operated fine Mexican restaurant was first established in 1979, with more than one location, but now has only this one place, on the NW corner of Flamingo at Decatur.\n\nThe food is terrific, the service is superb, and the live entertainment (when they have it) reminds you of an old-style Mexican cantina.\n\nI dine there as often as I can, and it\'s a 10-mile trip in one direction, but well worth it.\n\nThey have been voted the #1 Mexican restaurant (in the Las Vegas Review-Journal poll) for 22 years, since first making that prestigious list in 1983, 29 years ago.\n\nOn October 19, 2010, Ricardo\'s Mexican Restaurant and ROSANGEL™ Tequila broke the Guinness World Record for "World\'s Biggest Pink Margarita."  In honor of Breast Cancer Awareness month, ROSANGEL™, the world\'s premier hibiscus-infused tequila, gave the Margarita a pink hue.  A portion of the event\'s proceeds benefitted Susan G. Komen for the Cure\xae of Southern Nevada.\n\nRicardo\'s and ROSANGEL\'s new Guinness World Record for the "World\'s Largest Pink Margarita" was certified at 7,627 gallons, surpassing the previous record of 7,039 gallons.  To break this record Ricardo\'s used a 14 ft. tall 10 ft. wide tank, 4,600 liters of ROSANGEL Tequila (1,215 gallons), 5,000 gallons of spring water, 750 quarts of Kelly Y Gonzalez lime juice, 750 gallons of La Paz Sweet and Sour, 1,500 liters of triple sec (396 gallons), and 20 pounds of salt.  This record-breaking libation will make a total of 81,355 -12 oz. pink infused margaritas.\n\n"There is nothing more rewarding than being able to involve one\'s profession with charity.  We are truly grateful to have the ability to give back and have people really enjoy themselves.  It\'s a mega-feat for a mega-cause," said Scott Schiller, brand manager for ROSANGEL™.\n\n"We are beyond excited to break the Guinness World Record for the \'World\'s Largest Pink Margarita\'," said Ricardo\'s owner, Bob Ansara. "After over a year of planning this event it is exhilarating to make history and complete this project.  We are so grateful to celebrate 30 years of business and could not think of a better way to celebrate with our community."\n\n"Susan G. Komen Southern Nevada is so grateful for the generosity of Bob Ansara.  Eighteen months ago, he had this grand vision and never once lost sight of the tremendous charitable aspect of this event.  We are honored to have been chosen as the recipient of such benevolence and are truly touched by the friendships we\'ve made," said Stephanie Kirby, executive director of Susan G. Komen for the Cure of Southern Nevada.\n\nThat\'s yet another reason why you should visit them; to claim that you\'ve actually been to a place where a Guinness World Record was set.\n\nTo read the original article and see the photos, click here:\n\nhttp://funbaath.blogspot.com/2010/10/worlds-largest-pink-margarita-guinness.html#more\n\nYou\'ll enjoy the food and the fun!', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2012-06-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LgaUnpbX4KNXV1ASKRLzFg', 'review_id': 'mSk7pYPzPgWRF4nSG6cYaQ', 'text': 'Effen awesome! Even at 11:30pm but happy hour starts at 12:00am. Chips, entree', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2012-06-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'C4WMKcNSxiqy95hDzsQAhg', 'review_id': 'jFpFNSwvLB-VBaN39gZ7zw', 'text': "Ricardo's is a nostalgic place for me. I began eating at the old Trop/Eastern location when I was a young child. I remember a school friend's dad being a waiter... YEARS later, to my surprise, he still works at the remaining location. loved it then, I love it now. I can't say the service or food is mind-blowing but I like the ambiance & appreciate the consistency & the tradition of dining there. The chips & salsa are always yummy in my tummy & devoured in the blink of an eye. I almost always have the fajitas. They are perfect, except the tragically disproportionate onion/bell pepper/mushroom ratio: 96 onions, 2 green peppers, 1 red pepper & 1 mushroom. I've since started ordering the veggie ones. Don't be alarmed to see broccoli, carrots & cauliflower added in lieu of the meat. The texture & flavor is out of this world. There is a lunch buffet patrons favorite, as well. Their chile relleno isn't the best. The chile Colorado is flavorful. The enchiladas aren't too shabby. Their strawberry margarita tastes mildly of tomato. But, overall, I highly recommend this Vegas oldie but goodie for your Mexican food fix.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2012-07-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'gFAWLhAKMnVIG11rTeJZ1A', 'review_id': 'Jg-yURn-AA4ok39bI7NtEQ', 'text': "Was invited to a surprise party at this location over the weekend.... didn't know what to expect, but as soon as you walked in, u felt welcome. It has a warm, friendly atmosphere.  Perfect place to hold such gatherings, as they had a few different private areas.  We also had our own buffet, which worked out great for such an event.  The workers were all attentive and the food was good! Would be back another time for some dinner and drinks! Great place for large parties too!!!", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2012-07-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 2}, 'user_id': 'kZ11FAE4NGbddxOOPeRL5g', 'review_id': 'N7D0ehd3yhP-WExz5NOAjw', 'text': 'This is a pretty standard Mexican fare in Las Vegas... the food was good and the service extremely friendly. I had the carnitas meal and a friend had the carne asada tacos. Both of the meals were served with refried beans, rice, and choice of corn or flour tortilla. The meat was actually not dry and was very flavorful. The chips they serve are fresh and go amazing with the bean dip. The prices are reasonable and the service was attentive and friendly. I would say they are on par with Bonito/Lindos.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2012-08-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-n4o5O80TB8zdIfNvbSCAA', 'review_id': 'wH-lulmQhRH3Rq8u3WMcNw', 'text': 'This was my first time here.  Had a nice time. The food was good, the staff pleasant and menu selections gives a wide variety to choose from.\n\nI really liked the pitcher of margarita options.  Mango was the BOMB!!!  Next time I will have them mix the pineapple & strawberry together--sounds good to me.\n\nEveryone enjoyed their meals so that was a plus++++\n\nWhen time to pay up--it was great to see how they handle credit cards.  Instead of taking your card away to process, they do it at the table on a hand held charge machine.  GREAT!!!!', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2012-08-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GwZPNDruj7JtMTHuYmfhbg', 'review_id': 'PylaXDxEYE_kRrJAe_w9sQ', 'text': 'The food was good, would have given 5 stars,but our server Manny was a little rude and inpatient. Manny did seem to pull it together when he took our order for dinner. Overall I recommend for good tasting Mexican food,but management needs to teach Manny some manners.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2012-08-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ehSyEkVq1lnMf1dM6umF9w', 'review_id': 'VhdiQdKghGBsM_u6Jl9h-g', 'text': "Ricardo's still hits the spot for me.  I hadn't been in a couple of years so I was worried based on some reviews. My Chile Colorado was exactly what i remember; tender and flavorful.  Don't forget about this institution just because it left the strip. Want another reason to go,  its now open 24 hours.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2012-09-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'L-x3l7VzM_uxacXx9zw5Sw', 'review_id': 'PWl6YE_sGWmKnVGcI-yzYQ', 'text': 'I thought this place was awful. The service was super slow. The portions were small, prices were mid range but given the portion size disappointing. The food was generic. I could have made a better meal at home. I will not return.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 1, 'date': '2012-10-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '7vnY7ovodTFM-nKlbHw9_Q', 'review_id': 'kTy-uzketKhRq38WZIS3rA', 'text': 'This is actually a 2.5 star review. \n\nWonderful service but the food is very "white" as far as Mexican food goes and a bit pricey as well. I prefer more authentic grub and items that look a bit more fresh. I did not like my Carnitas Verde Burrito at ALL but thankfully my husband agreed to trade and his Colorado Burrito was good. My favorite thing about my lunch was the bean dip that came with our chips!\n\nWe will NOT be returning to Ricardo\'s.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 2, 'date': '2012-10-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3Ak0T_UToT5ViQGCppiQHw', 'review_id': '-JHEwqDUqAJNpVvCMzxHcg', 'text': 'My friend and I stopped in here for margaritas on Thu/15 Nov around midnight.\n\n5-stars because:\n- Both the bar & kitchen are now open 24/7 (awesome for late night munchies).\n- Margaritas come in three sizes and we each had a "small" for $7.50/ea.  The smalls were a pretty good size, margarita tasted great.  \n- Waiter also provided a free basket of chips (with regular and those black nacho chips) with 3 dips (salsa, bean, guacamole).  Even though we weren\'t ordering any food when my friend asked for a chips & dip refill the waiter happily obliged with bringing us a new batch of chips (both types) and dips (all 3 types).\n- So, awesome service.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2012-11-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': '6xrk6A61OWwOtmQAErZTvA', 'review_id': 'xQ_Gr04pBDDqxKya5J0fSA', 'text': "Last Friday night when my flight got in late around midnight I was ready for some hot grub, but not fast food.  So, after some quick research, yelp reminded me that Ricardo's is 24 hours.  It's been a long while since we've ate there because we're quite fond on Bonito Michoacan, but at midnight their doors were already long closed.   The first thing we noticed was that their prices are quite high when compared to similar restaurants in the area.  Being quite hungry, I ordered one of the steaks that was described like adabada style seasoning.  I was really disappointed; it tasted so bad I didn't finish it and I didn't desire a doggy bag to save it.  I just had them toss it out.  Bf ordered the Huevos Rancheros and said it was just OK.  I had remembered this place being much better in my recollections.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 2, 'date': '2013-01-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3vs4PFjqk7mVDUCQjNuypw', 'review_id': '9eFNHzCbiFWQh4Tox1Ks-Q', 'text': "Just went to Ricardo's restaurant for the first time tonight.Food was very good and great service.Had Steak Fajita,wife and son had steak and shrimp.Only problem we had was they brought out 3 steak and shrimp but they let us keep the shrimp and brought out extra order of steak,so NO PROBLEM!!!!!!!!! Our waiter was Pancho and he was great.Excellent service.I highly recommend this restaurant to anyone that's looking for a good Mexican restaurant in town.Reasonably priced,very good food,excellent service.I left there stuffed and had food to take home.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2013-01-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SR1RNxtHSS2MQ4uOiAK_3g', 'review_id': 'vNYf_LrhtjmGRYimnNqQZw', 'text': 'I love this place I have ate here many many times. The nachos are great but everything is amazing. The service is great and the new bartender is super cool! 5 starts is and easy rating.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2013-01-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'fuj-g_8kr_PU3H5N67axHA', 'review_id': '30RzSqpPMvav7_51tQT-yQ', 'text': "My husband and I have been coming here for  a few years now  and the meals and service never disappoint. We always get the nicest servers. My oldest son loves coming here as well because the servers are very friendly towards children. It's very relaxing, the food is always great. They are constantly checking up on you. I love them!", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2013-01-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'AjSH5L1fcTjnLGmm7-URBg', 'review_id': 'Odu9JwRMcQGLCz-RKgDurA', 'text': "This restaurant was great had a party of 55 people and we were left full and a wonderful experience. The staff couldn't have been more attentive & meet all our needs .. Thank you to the staff & the chef .. Can't wait to return next year!---", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2013-01-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'zbUpiea2aiJSKXjj2zQ5yw', 'review_id': 'cyFI0_cBWHDDaAGLlV62CA', 'text': "I've been here a few times. The first couple of times was for work functions. We had a good sized group of people and the restaurant was very accomodating giving us a the baquet room in the back. The first year we all got the lunch buffet. I don't personally recommend that. Its fine but as it is a buffet it is not always the most fresh. I prefer ordering off the menu.  The food is generally good. The taco filling is great whether it be shredded beef or chicken. The shell, however, is premade and fresh out of a box. The tamales are good. A nice balance of meat and mazza. The rice is on par with most other places. The beans are loaded with cheese. Tonight I saw the biggest bowl of menudo I've ever seen. I was amazed at how much of it a 10 year old was able to eat though he could not even come close to finishing it. I would not have finished one bite. I smelled it and and lost my appetite. It smells like poo. I mean no offense to all of the people who do like menudo. I just don't want my food smelling like the farm I grew up on. I'll pass. Everything else though is all right by me.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2013-02-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'its2D1yA7x7IoXKFhc89nA', 'review_id': '0PtrIgFd0tzlPvEyyYPBKA', 'text': 'Nice lunch buffet and service is average. Open 24/7 which is a plus', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2013-04-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TveF1k_JsAtUCr6nC8enOw', 'review_id': 'ar_9HQNUiBoX7_sRtI_RXQ', 'text': "The last two times we've been in Vegas we have eaten here. A little off the strip, but worth it for the food and service! The margaritas are great too!!", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2013-04-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'y59oJueKAspvdtdCgwy-vQ', 'review_id': 'RWXux8HgLXzWTfllB7-lUA', 'text': 'This location is quite a way from our home so we usually meet for date night right after work.  I know there are a lot of Mexican restaurants in town but this is one of the best to me.  We had family in last time there.  All of our food was great and the server was funny (I believe his name was Poncho), personable and helped us celebrate the occasion.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2013-04-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '-Ozt8BSamVO4Ky5HY506JA', 'review_id': 'b09jLn4IaIW5F_rdS3KFHQ', 'text': "This was the consensus of the group of 4 of us that visited Ricardo's for lunch.  We did not partake in the lunch buffet for $11.99, but instead ordered off the menu.  Guess that was a mistake!\n\nTwo of us ordered carnitas tacos - it was dry, hard strips of meat (not shredded or cubed), more like leftover from the fajitas, with a teaspoon of diced onion, but NO cheese, no salsa, no tomato, no lettuce, that's it.  Tasteless, hard meat.  Two of them.  The beans were fine, but it's hard to screw those up, as was the rice. \n\nOne person had enchiladas, very average enchiladas with very little filling and a whole lot of sauce on top!  Nothing to make your belly smile, that's for sure. \n\nAnother person had the tortilla soup -- and there was NO CHICKEN, but loads of celery!!  Must've been cheap that day . . . it was more of a veggie loaded soup with chicken broth.  \n\nAnother person had the meatball soup (not sure what the proper Mexica name is), but there were TWO tiny meat balls.  That's it.  And a whole lot of dark broth.   \n\nI LOVE chips n salsa -- they also had a bean dip and green salsa, all were pretty good, not the best ever, but enough to have me optimistic about my meal.  The chips were the kind I like, crispy, corny with just enough salt.  It is because of the chips n salsa that this is a 2-star (and not a 1-star) visit.  \n\nThe place was pretty busy for lunch, but most dined at the buffet.  Perhaps that's your best bet.  They do make some nice sized margaritas, but we didn't have any this trip.  \n\nIt wasn't good, it's highly unlikely I'll revisit, but I'm glad I tried it as I drive by it enough and have always wondered.  Now I know ! :)", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 2, 'date': '2013-05-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'KfTV2XHIi3icuGQ9VNls_g', 'review_id': 'Qt44WYS47Av0U-Wcz53huA', 'text': "I LOVE HAPPY HOUR HERE! cheap drinks and appetizers Monday-Friday 3-6pm and the super late night happy hour Midnight-4am.\nTry the Pineapple/mango margarita on the rocks with Patron. My favorite!!  The chips and salsa are pretty darn good. \nAlthough I came for happy hour we also had a birthday dinner here after happy hour. our party was seated immediately and our orders were taken pretty quickly, they divided our checks for us, I thought that was nice of them allot of places don't like to divide checks. The food came quickly and our waiter was pleasant. The food was not bad but it was not the BEST Mexican food I've had either. The restaurant seemed a little stuffy and warm. I asked our waiter if he could adjust the temp. and that was taken care of as well.\nI recommend this place for large parties and for Happy hour!", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2013-05-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9GVCWxkosvF102rzrWzYVg', 'review_id': 'yfRodbGyYRoCLFlWqfWRtA', 'text': 'Locally owned an operated and I love that about it!  The owner is there all the time to greet you and take care of you.  The food is really good.  BEWARE: Chips are yummy and addictive!!', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2013-05-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bGM2cp6eeTgJLEE8r6iEMg', 'review_id': 'GjXt_xKeSAoQuQOxWESDYA', 'text': "My family got there just in time for happy hour but they don't serve happy hour at the table, you have to literally goto the bar.  We also don't know what was available for happy hour because you only get to see that menu/special in the bar area.  So we were VERY disappointed.  At the very least they should advertise it in the regular dining room so people will know for next time and will come back and goto the bar area.  Dinner was good, but not great.  We were going to order some margaritas and they sounded really yummy on the menu and even saw another table with some, but there were no prices on the menu which means EXPENSIVE!!  So we didn't order any drinks.  No real complaints.  We of course waited for our check and that took awhile (not uncommon for most places)  \n\nWe came back about 2 weeks later for the fajita lunch buffet and we were the only ones enjoying the buffet and it was yummy but they weren't setup for it and some of the items were cold.  We were disappointed and won't be back for it.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 2, 'date': '2013-05-31', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'OCb_5QTemUq-ei6sN1JGLg', 'review_id': 'uvDoiFWLsCZIdqzf7HwaSg', 'text': "I was given a gift card to this place from work, so we thought we'd give it a try and MAN im glad we did!\nThe fresh chips and salsa (2 salsas actually, and warm beans too) kept coming and were always fresh. Then I had a large margarita...it is LARGE!!! Very good, and very big (the wife drove home!). \nTaco and enchilada were great, my wife had a chimi which she said was moist and great. Our daughter loved her chicken fingers (i also liked her french fries).\nOur waiter, Sacramento, was 100% AMAZING. Funny, nice, treated our daughter like she was a grown adult (shes 3) and was very nice and punctual.\n\nBetween the great food and Sacramento's service, we will be back!!!", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2013-06-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5TnP7_EMMiW9nSkt935dHQ', 'review_id': 'tksydz719_u9pdXpdCw74w', 'text': "Yelpers are always right; why didn't I listen. Best salsa and chips and best margarita I ever had. My son has food poisoning. Was the nacho cheese sauce on his burrito. If you only want chips and a drink, then give it a shot otherwise steer clear!", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 1, 'date': '2013-06-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7iim_N5sI-bLoGUyECPS9Q', 'review_id': 'xsZpGKeWiu9J_qQalGPkmQ', 'text': 'Was looking for a decent Mexican restaurant off the strip and came across this little gem. I\'ll break down this review based off of the items I had to eat & drink.\n\nChips: Were super crisp fresh and delicious.  I found these chips much better than the average fair you find at a Mexican restaurant.\n\nSalsa: They give you three different dips to try.  The bean dip is out of this world delicious, like others have mentioned it is really good.  The green salsa was more of a light Avocado salsa and had a nice flavor and just enough heat. The tomato red salsa was bland and watery with no flavor at all.  Was really disappointed with the red salsa compared to how good the others were.  \n\nCheese Enchilada: Probably one of the BEST I\'ve had in quite awhile. The sauce had a rich deep flavor and the spices were balanced well. The tortilla was not soggy and filled with delicious gooey cheeses. \n\nChicken Taco: The chicken was very flavorful although the tortilla was a little on the stale side.  The toppings were good but very minimal.  \n\nBeans & Rice: One word OUTSTANDING! Really creamy beans that had a nice texture and the rice had some great flavor with the traditional peas in the rice.\n\nMargarita: Had a Mango Margarita and it was average to good.  Nothing to special but nothing bad either.  \n\nOverall a great experience with a very friendly staff.  "Freddie" was a great waiter who was super attentive and funny.  Well be back!', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2013-07-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'if05V4q8EzJ-3-4Wid3KJA', 'review_id': 'il4297Rrp9BSQ1xLbe8wxQ', 'text': 'In town for the weekend and a friend wanted Mexican food. We went to this place right after the lunch hour. Great chips and various dips, GREAT margaritas, and Great food! We were so happy with the food and drank....yes drank! I need a nap from one margarita.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2013-07-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'Uqkha8hDld5Y6f0VK3aWWA', 'review_id': 'nOTygtTqNwi4iSin1QlXVw', 'text': "Went based on a nbrs high rave review.  \nWorst.food.ever.  \nEveryone had leftovers, no one thought it was good enough to take back home.\nI generally don't take leftovers home anyways because no one really eats it...but my husband ALWAYS wants to take left overs home...even if no one eats it later.  \nHe had to leave in the middle of our meal and DID NOT ask to take the leftovers home.  \nWOW.\n\nBest part:  the free chips and trio dipping selection (beans, salsa, and green dip)\nThey brought this out first, we thought wow!  We're in for a treat!  if this is THIS GOOD, that neighbor must have been right when he said we're in for a treat at this place.  \nwe were so wrong.  It goes to show everyone had different taste buds, and his and ours are incompatible.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 1, 'date': '2013-07-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'AJOrnDVb_WWppU_wwoQIdg', 'review_id': 'P2SxfW_i7Pw0G_n6yAs5Mg', 'text': 'Ill nvr eat this bullshit again, rip off, defiantly not wor the money or the time,,,hostess ok 10 minutes to seat us o a table', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 1, 'date': '2013-07-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7gqgHcX5iSM_OyVuGH6goQ', 'review_id': 'wwtf7fVRvBuQKD_gC57Hfg', 'text': 'Best carne asada steak. Very tender and juicy.  Free fresh chips with 3 dips was a nice plus.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2013-08-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mbhQ5Xt0aUmH3RBtQWGahw', 'review_id': 'UxpWIkwcLhtciN-AWMjLpQ', 'text': 'The lobster tacos were really good.  My wife had the lobster and shrimp enchiladas that she could not stop talking about.   \n\nGreat salsa and dips and it is open 24 hours  a day.  They have a buffet at lunch.\n\nJesse', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2013-08-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'U_tGUnsqpN66i0sfafm2IA', 'review_id': 'ZxeQ7VbtHuSHyBT1X4dZlA', 'text': 'Yes! So wonderful. Staff was excellent was food was yummy, a little pricey for above average Mexican food but still a wonderful experience.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2013-09-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'E1I_7NXln-i4eE6-IBpwwA', 'review_id': 'wXND9g0WVGZ8sJZRDyXPCw', 'text': "Lobster tacos are perfect!  It's only been an hour since I've had them and I already want more.  Great location, food, drinks and service. I'm a pretty hard person to please and this place more than met me expectations. Must try.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2013-09-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GZSjv120K2haCry3FC0y5g', 'review_id': '-wvXd8Ar6UjEeOGhx-Vajw', 'text': u"Came here for happy hour after work. I got a beef fajita quesadilla and a couple of beers to was it down. \nThe quesadilla was really good. I asked for roasted jalape\xf1os inside and extra crispy and they hit the mark. I couldn't have been happier. And pints for $2.50 isn't bad either. \nWhen I got in it was dead and 30 mins later the bar was packed. I felt bad for the only one bartender on duty.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2013-10-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kJqSnakTIxJ4-oxuUZethw', 'review_id': 'TAR-pocsuOpeeCAOLuRfgg', 'text': 'I classify Mexican food into two categories: "Tex-Mex" and "Authentic Mexican". I usually don\'t eat Authentic Mexican food unless I\'m in Mexico, New Mexico, East Los Angeles, or Texas. \nI\'ve been to this place a few times in the past usually between 11AM and 3PM, but I woke up at 7AM this morning with a craving for Tex-Mex, so I went there at 8AM because they\'re open 24hr/day. \nI really didn\'t know what to expect at that hour (maybe they only served Mexican omelets or huevos rancheros, etc.), but it turned out that they offered the regular full menu.\nI got the combination plate, which is usually what I get if I go to Cabo\'s or Garduno\'s, but I\'d have to say that Ricardo\'s was better than the two aforementioned restaurants.\nI can\'t explain how it was better, but there was something in the seasoning that reminded me of the food in Mexico. The rice was very soft and the refried beans had no lumps of beans, both of which I liked very much and is not the case with other restaurants.\nThere was only one man there, who acted as host and server, and he treated me like family. He even said, "Would you like chips and salsa, or is it too early?", which I thought was very efficient, and it would be the same thing that I would say at 8AM (of course I answered, "Absolutely").\nI drink a lot of iced tea, and after I downed the first glass in 60 seconds, he put a carafe of it on my table, which is what I would do as well (I ended up drinking two carafes). \nI wish that I brought my i-phone so I could\'ve taken a picture of the combination plate, because the taco shell was not a regular taco shell, but more like a tortilla that was deep-fried. They also took the stem off of the chili relleno, which again, I thought was great, and I can\'t remember any other restaurant doing that.\nI told the waiter exactly what I just wrote, and he was very gracious and said that he would relay my sentiment to the chef. He also mentioned that they get all their ingredients from California, which made sense.\nI don\'t know what more I can say. It was very, very good.\nNow, I have to add a third category for Mexican food: "Authentic Tex-Mex".', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2013-10-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 2}, 'user_id': 'KzNEZ3o0MBvq3fjjbB-Ntg', 'review_id': 'UcYQU7FxBdkMKA4uk6A8cQ', 'text': "I went to Ricardo's mid-week with a large group from work. We were not offered menus, but it may have been pre-arranged that we were all getting the buffet. Our party was seated in the buffet area with some literally having those lining up for the buffet rubbing up against them. \n\nThe carne asada tacos at the buffet were outstanding. The remaining items were all middle-of-the-road, standard buffet grub you can get at any casino buffet.\n\nThe staff was very friendly and did a good job keeping up with drink refills and clearing empty plates. I have yelped before that I am not a big fan of mandatory gratuities, especially eighteen percent at a buffet. I still think it is ridiculous, but after our waitress Debra told us she had been with Ricardo's for thirty-four years, it was a little more tolerable. Hats off to Debra for her years of service. Ricardo's must be a great place to work, as all of the employees I encountered seemed to be happy and eager to please.\n\nThe buffet was $12.50 including a beverage and was average at best, except for the CA tacos. Great atmosphere. Friendly staff. Average food.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2013-10-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'EKJVvRrFZiBjbkp6OcF4AQ', 'review_id': 'S9pqC1G2ke6A7VZiOZI8qQ', 'text': "Great drinks, friendly staff, creative food (I am talkin' Lobster Floutas for God's Sake These people are not fooling around here)what the devil else do you people want? Good prices you say? Well here you go, you have found your place!And lets talk happy Hour for a second shall we. I had more than a Touch Of The Creature and my bill was so low, I was sure either they had made a mistake, or my vision was so blurry I was reading my tab wrong. I asked (hey I am an honest kind of Cat) they assured me it was correct. In short get out to this place and enjoy the great food, drink and staff! Live it up, you are in Las Vegas for cryin' out loud!", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2013-10-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CPWv2fXZ-ViH2qeW-HHIcg', 'review_id': '34u8PoLVPuLoohJKwGjJbw', 'text': "I'm a semi-frequent visitor to Vegas.  Mexican food is my favorite, so I went online to check out reviews and decided to try Ricardo's.  There was a crowd out front, so I almost didn't go in, since I was traveling for business and was dining by myself.  I thought the host of people outisde indicated a queue inside for a table, but it turns out that the 'queue'  was just smokers.  Having to walk through a cloud of smoke was a bit of a turn-off, but tt is what it is and I went inside.  I was seated immediately.  They have an extensive menu.  I was waited on immediately for my beverage order.  I order a marquarita and ice water.  Margarita was very good.  They offer a small, medium and large.  Other reviews commented that their chips, beans and salsa were good.  Their chips come with a guac dip, tomato salsa and beans.  The guac dip and beans were great, but the tomato salsa was very bland; there was no flavor.  The chicken enchilada was very good in flavor.  The chicken could have been cut up a bit more; it was in big chunks.  The carnitas taco was very good.  The rice was full of vegetables - corn, which is typical for Mexican food, but it also had peas, carrots, green beans and lima beans.  I've never had Mexican rice with these vegetables in themn before and did not care for it at all.  The service was good up to the point of getting my check.  It seemed to take forever and I ended up having to ask for it.  I put a credit card in the check holder and after waiting a lengthy time, was presented with a handheld credit card machine where I had to run my own card and punch in my own tip amount and print out my own receipts.  I've utlized self-service tablets at restaurants before, but this felt like I was doing the waiter's job as this was not a true self-service tablet.  The decor and ambience of the restaurant was good.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2013-11-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VtUeRw3fNqgY3EMPMIA5yQ', 'review_id': 'rdreJ-dEbGiK3kX4URs-IA', 'text': "Would give less then a star if I knew how. my girlfriend had a meeting in the area so we decided to grab a quick dinner. chips and Salas were decent.  my girlfriends Margarita tasted like mountain dew and salt.  she got a cold Mexican pizza  and I got the chicken taco combination plate. My girlfriend didn't eat lunch, so she forced down a quarter of her frost bit meal. I took one bite of my taco, attempted to eat my rice and cheese soaked beans, but they tasted dirty.  I quickly ask for my check and 15 minutes later got to pay and leave.  Terrible Mexican food, terrible service, bar area or customers in bar area which I was force to sit in, although I stated I did not want to repeatedly, wreaked of smoke. Will never consider going back, would rather get a rat burrito from the taco bell across the street.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 1, 'date': '2013-11-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'r_CZizY-qn7zcE81S_DMow', 'review_id': '3WcSRKN3totahzrjNGIWBA', 'text': 'Man havent been here in ages. Ricardos is #oldschool', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2013-11-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 3}, 'user_id': 'uJZDBTFk40t9-KXjbYGY2Q', 'review_id': 'Vo9ui95X__JV4w60LEeQNw', 'text': 'Wow my family came once and so we came here for my bday today.\nThey got us in as a party of 10 right away and were very accommodating! \nThe server was AMAZING and interacted well with everyone including children... Honestly it was very impressive. \nThey gave me an awesome flan for my bday dessert and sang for me:)\nThe manager came over and everyone was very pleasant.\nNow, the food was off the chain with the lobster tacos, the halibut, and the peach margaritas!!! Simply just a great place for a friendly atmosphere:)', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2013-11-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Cq2eBus25DEYDNXHOSNfyw', 'review_id': 'IkiWZYZO_qf1cbjtxDVyCg', 'text': "Ricardo's did not disappoint! The chips & salsa were amazing....the servers were extremely helpful & attentive. But more importantly, the food was excellent! I would highly recommend this restaurant if you want great food away from the craziness of being on the strip!", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2014-01-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wr5VQSrcIb0ArNG_K4WttQ', 'review_id': 'mMyTaF1rVmaWxeRWAz6B8w', 'text': "Right off the bat, we liked the decor and atmosphere. Not too loud, casual, and not overly decorated as many Mexican restaurants can be. Our waiter, Freddie, had a great personality and made jokes keeping it interesting. They give an extra small soda pitcher so you're never out. Kept checking on us, food was great. Boyfriend had the diablo steak which has a spicy sauce he raved about. Mom had the chile colorado and said meat was perfectly tender, sauce was fairly good but not the absolute best. I had the chicken burrito and I couldn't complain- simple and good. My margarita was good, didn't specify a size and was given a medium which was pretty big.. Only $10! We will definitely be back. :)", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2014-01-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dKY7PFkcUw2a9o1hk3aQYQ', 'review_id': 'hx4myGbV5io3eo4QAHWVbg', 'text': 'I just had an amazing dinner-- service was excellent they were on top of everything especially during Super Bowl --- and the food was delicious - thank you Juan and  Tovar for great service and to the friendly hostess', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2014-02-02', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 3, 'cool': 1}, 'user_id': '6l_ATA06SBvvPDMvMiKQgw', 'review_id': 'ylrL1D0U_4An46LNp-bwPA', 'text': "I was invited to this place for lunch and they were serving a lunch buffet. The food buffet didn't look so good or fresh. At the same time, it wasn't really a buffet either because there was a lady serving it. Anyway, I tried the chili relleno, enchilada, rice, bean and a carne asada taco. All of it tasted like frozen food being microwaved, not to mention the cheese on top of the enchilada was burnt and had a weird taste to it. \n\nMy tummy hurt as soon as I finished tasting these items. So gross. I should have eaten just the chips and salsa only. Don't know how much the lunch costs but really, who'd pay for this?", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 2, 'date': '2014-02-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tptcrGRSfu5f2B0GZ77UUA', 'review_id': 'DQpS7eqxvBu249wYcZJDQA', 'text': 'I have been a loyal customer of Ricardo\'s for years.  However, I will no longer be patronizing Ricardo\'s.  They offer a happy hour of half price appetizers and drinks between 3:00 pm and 6:00 pm.  Last night my husband and I ordered four appetizers to share.  The waiter commented that we seem to be ordering "a lot" of food, which, actually should none of his business.  I made the comment that I liked to have leftovers for my lunch the next day.  At that point he told me that no "to go" boxes were available because they don\'t make money on Happy Hour and they don\'t want people coming and eating one item off each plate then taking the rest home.  So I guess they would prefer for the leftover appetizers to be thrown away, rather than allow their customers to take the appetizers home that they already paid for??  Doesn\'t make sense to me so I won\'t be going back.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 1, 'date': '2014-02-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'M7gu56kwPFjci6OqNly8Kg', 'review_id': 'wG77IrS7_ga3CmIlJFq5gw', 'text': u"Something that has always baffled me after 15 years as a Las Vegas local is that this is the worst town to find good Mexican food.  I'm from a small town in Southeast Texas and even the franchise Mexican food in that area is amazing.  Still, I had made a plan with my father and sister to check out Bonito Michoac\xe1n, but when we got there, they had NO parking, in the front or back of the building.  So, we drove down Flamingo and found this restaurant and decided to give it a try instead.\n\nTheir food is pretty good.  Not amazing, but not horrible.  The jalapeno popper appetizer was my favorite item and it's served with a very sweet sauce that complimented it very well.  My chicken quesadilla was good, but my sister and dad both ordered the cheese enchilada meal and while they didn't hate it, they weren't impressed.  At one point, the manager came by our table to check on us and when we mentioned how we'd come by Ricardo's, she screwed up her face and told us that we didn't want to eat at Bonito Michoac\xe1n.  We asked her why and she couldn't give us a straight answer, just kept shaking her head and scrunching up her nose...that kinda irritated me.\n\nMy main complaint came when we received the check and I handed over my debit card to pay.  The waitress walked away and came back with a handheld device to swipe my card.  She then handed it to me to choose my tip of 10%, 15% or other and stood at our table while I chose.  I'm sorry, but I like to take my time on calculating a tip and I definitely didn't appreciate having to rush through it while she watched me.  Especially since the service might not have been horrible, but it also wasn't that great.  I'm still unsure if I'll ever go back or just keep trying to find a stellar Mexican food restaurant in town.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2014-02-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tSUSdP-C-2GXh1ta7vwhRQ', 'review_id': 'VXQFAbPU5GCl7Sf0HMVq1Q', 'text': "We love this place. What is there not to like? Open 24/7, great atmosphere, salsa dip trays the best, huge Margaritas, good food. Price is right. Only negative is running your credit card at your table and asking how much tip to put on it. Com'on, have a little more class, your place is too nice for this kind of behavior.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2014-02-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'NjOYSgr2LNMoSPi4e140Ig', 'review_id': 'esLJig9jFoztIXaPt4ahzA', 'text': "This was my first visit to Ricardo's as this was where my Mom decided to take me for my birthday dinner.\n\nI had heard both good and bad reviews so I kept an open mind to decide for myself.\n\nIt kind of reminds me of the American style Mexican food of El Torito's from back in the day.\n\nI decided to get the steak fajitas and my Mom decided on a combination plate that included an enchilada, taco and chile relleno. The taco was horrible, she took two bites and was done with it, the enchilada was sad however she liked the chile relleno.\n\nI enjoyed the chips and dips they bring out to enjoy prior to your meal being served.\n\nMy iced tea was good and I like that they give you a carafe so that you can refill yourself, maybe because the food is a bit dry?\n\nMy steak fajitas was not that great, dry and almost too much of that charred burnt taste as I think they really let them sizzle for way to long prior to serving them. The rice and beans were bland and cold. \n\nI really wanted to like Ricardo's more than I did and it was actually disappointing to say the least.\n\nWell I can scratch this restaurant off my list for places to try and revisit. \n\nIt was my birthday, not sure how they found out but they did bring me a tasty piece of complimentary flan with a candle and sung to me. However as sweet as that was, it was not enough to salvage the poor quality of fake Mexican/Spanish food they serve.\n\nWhen the complimentary chips and dip is better than the meal, that is not a good sign!", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 2, 'date': '2014-02-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wyEdFi3oZ8mb1DmPHBmtJA', 'review_id': 'doSdY3PvV93QyUpgkwH6hw', 'text': "Came Friday night about 9pm & was immediately seated.Waiter soon after took our drink order.\nChips, Bean Dip & 2 side salsas arrived shortly thereafter. Chips were warm, crispy & fresh. I know some have complained  about the chips but ours was very fresh & warm. Bean dip was awesome as others have raved. Especially when dipped into the guacamole like salsa, which was very good. The other salsa (red) was somewhat watery & too mild. \nI love breakfast regardless of time of day, so ordered Chorizo con Huevos & wife ordered the special Lobster seafood Enchiladas. Both orders came with rice & beans and Chorizo came with tortillas.\nChorizo was cooked the way I like & tasted ok but lacked that reddish residue oil which would have greatly improved taste & moisture? Wife's Lobster enchiladas was great. She would order same again. \nBeans were ok but better after adding some salsa. Rice was tasteless, bland & watery, like it was re-steamed? but better than dry undercooked rice like some restaurants serve. Again better when sprinkled with salsa. Flour Tortillas were wax paper like & thin similar to those low fat tortillas?\n\nService was great! Waiter continuously returned to check on us.\n\nWould be 4 stars if not for the negatives listed above.\n\nWe would definitely return again. Especially since they are open 24/7 & food is good.\n\nUnderstood, is that, everyone has their own taste! And everyone's comments, including mine, are therefore subjective.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2014-03-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0lB0JCGxmjgLlbwjuXoCcw', 'review_id': 'cY8Dwa4YnNejITDswdusBA', 'text': "We asked Ricardos to cater my daughter's wedding.  Their catering rocks! Tanya took care of everything.  The food was fantastic.  Working with Tanya was very easy.  Everything she said she would do, she did.  From table cloths to appetizers to bringing a bar tender to an amazing meal, everything was absolutely perfect. Tanya communicated with us and was punctual.  They don't just cater Mexican Food, they will do other menus as well.  We had Mexican food, of course!  Our Thanks to Tanya and her crew for making the wedding very special.\n\nOnly one negative, she used Rebel Rentals and they did not pick up their equipment as requested.  I used RSVP for my portion of equipment rentals and they were easier to work with.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2014-03-03', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'OUEaF3TZaCnxA19-bmh18w', 'review_id': 'ytg45sLHk7cS83BMSIeojA', 'text': "I love the BBQ pork sandwich. The portions of mine and my company were big for the  price. The bean dip IS amazing. The service was prompt and on top of it from beginning to the end. The place is well-decorated and spacious. Lunch hour wasn't too busy or noisy. And there's a bar area which is a plus for a gamer like me ;)", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2014-03-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7n0h0HrdWpL1Tevi6e_yRA', 'review_id': 'kZ7usu4DkImcAOsTeQphZg', 'text': 'Happy hour discounts only in the bar!!  Bean dip is nice to have but not anything special.. Chips are great.. Red salsa is horrible..  The green is ok chicken enchilada gets a 3/5 pork tamale 2/5 rice 4/5 quesadilla 3/5 iced tea 5/5', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2014-03-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_Hy4t3v_AgD4QVkhOwIqkQ', 'review_id': 'Z0DfFY0a2n_tTHiD1ilPcA', 'text': "We were planning a sushi trip after martial arts training but one person in our party didnt like sushi so we decided to have Mexican. I do not normally eat much mexican food and I had no heard of Ricardo's before as i've only been in Vegas a few years. \n\nThe service was great, we had a really cool waiter who was on the ball the whole time. The chips were good and came with 3 dips (salsa, bean, green dip) to snack on before the meal.  I have not been eating alot of red meat in general lately but Carne Asada is a go to that usually is great no matter where you go.  I think it was probably my fault, I wanted just some carne asada tacos but instead got a whole carne asada steak huge meal that was hard to finish.  It wasnt bad but not what i was expecting so i was a bit disappointed.  Everyone else loved their dishes. It is a pretty high quality Mexican restaurant. I think it might be a bit expensive but I did not get to see the tab as it was picked up by another member of our group. \n\nI would go back but I would be more careful ordering next time to make sure I actually got what i wanted.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2014-03-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rNGT6lePmm803H8w0rw4Fg', 'review_id': 'lp2hCNfb9OgQAwRcniiEKg', 'text': "How things have changed...\n\nI can remember eating at Ricardo's back in the 80's & 90's, when the inside felt as authentic as the mariachi singers sounded; now, it's reverted somewhere between a Denny's and Chucky Cheeze.    \n\n-No mariachi singers and the place doesn't even remotely feel authentically Mexican; it was almost like we stepped into a restaurant at a theme park...you know; those cheaply themed places where the quality of the food is determined by how loud the screaming child is next to you. \n\nPrice:  I would never pay this much for crap American-Mexican food!\n\nOverall Experience:  Yuck...\n \nConclusion:  Another original and locally established restaurant gone to crap over time.  A victim of poor planning and lack of investment.  You would think that a place like this should only be getting better with time, instead they've stripped it of it's authenticity.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 2, 'date': '2014-04-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Vy8QHdDM80fo8pPQI6A4fg', 'review_id': '9nkZZ-Qf_tYevWbEhHW1yA', 'text': 'From the chips and salsa to the end of the meal it was delicious and satisfying. Freddie our waiter was tip notch and very friendly and helpful. It was just by pure chance we stopped to eat there but definitely will be a frequent spot from now on. I recommend it highly. Plus they swipe your card right at the table when your ready to pay. It was awesome', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2014-04-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bV07xAIvjDSF6G4H71jb7Q', 'review_id': 'P89jyA9WRK4ydf0bU8Q0hw', 'text': 'The food was excellent including the bean dip. Great margaritas too. We were there for lunch and the service was quick and efficient. However we were not rushed', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2014-04-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Fu0KMrxVBR-4udX2gnqZxw', 'review_id': 'FCqbzpYlv-OHAueSTs_95A', 'text': 'What more can I say about this place.  Yes, they have been a long time merchant here in Las Vegas, but his menu, the flavors, the presentations are always spot on and every dish delivers the best flavors.  \n\nI was amazed at the steaks and halibut dishes, 5 star quality all the way :)', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2014-04-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yByiNgMZHLqBLqvj00rBaw', 'review_id': 'eWbPhVFdpWW506LA-_n9yQ', 'text': 'Not really my choice for lunch today, just went along with coworkers. \n\nFirst time trying this place. I\'ve passed by the restaurant many times but never followed through with trying it. \n\nOverall, I\'m not a fan of Mexican food. I\'ll take Chipotle any day and after today\'s meal I\'m reminded why.\n\nNot that it was bad. But definitely not worth the price. I got the shrimp and lobster enchilada and it came with beans, rice, and pico. Prior to our main meal we got chips with 3 dips (beans, green sauce salsa, and regular).\n\nWhen I think lunch special, I think the meal should be below $10.00. I think my meal was the day\'s "special" but I did peruse the lunch special menu and most of the items were over $10.00. Mine came out to be $17.00 with tax and tip, ugh.\n\nI like the setup and decor of the restaurant. It\'s also a cute touch that the female servers are in their outfits (sorry I don\'t know what their called). \n\nI just don\'t know if I want to pay this much for Mexican food.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2014-04-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6RGI9ayLexiPzcxjt4F8Rg', 'review_id': 'HiWwlBaWFoAOBo619HeEvw', 'text': 'The bartenders and waitresses are very attentive and the food is excellent with good sized portions.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2014-04-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Nnywz2sghyQWTruW1amu9Q', 'review_id': 'LJWldq-ZkbNBJzlzMrRp5w', 'text': 'I had just eaten at Javier\'s in the Aria the evening before - I know Mexican food two nights in a row is not my usual strategy... Any way I took the opportunity to really compare the two ordering almost the exact same meal at both locations.\n\nThe food here at Ricardo\'s was good solid food - nothing special that made me think "Wow, this is the best Mexican food I have ever had!" It did however help me better understand that there can be differences in Mexican restaurant food - it was not really in the same league Javier\'s was as far as the food - Javier\'s really is a high end Mexican restaurant which I never would have guessed existed (the high end restaurant part...)\n\nRicardo\'s was fine, the service was excellent and the atmosphere what you would expect.  I would visit again as overall the experience was good and the cost reasonable.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2014-04-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'P1Y9L_jssdz_oP6KwSavgQ', 'review_id': 'Wpbc4udVxqfnQG-v3PmzBQ', 'text': 'We went on Cinco De Mayo. I get that it was busy but the main hostess working was extremely rude.  We put in our name and waited. As we were waiting she was screaming at other patrons. We observed this for a bit.  The most shocking incident was when an older lady who was waiting for a table was called. The older patron, confused with all the people, began to walk the other way. The hostess grabbed this lady and yelled, "We are over here!!" Pointing to the section. After this we left. There is no excuse for service like this.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 1, 'date': '2014-05-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4Mtl5zRIQhV0TnhD1RB1eA', 'review_id': '5HCRbdUC39Grz69uXbXrvQ', 'text': "Wonderful experience for Cinco de Mayo! We made a reservation for 6:30 a half hour before we arrived (at 6:30) and we were seated within 3 minutes of arrival. The place was definitely in full Fiesta mode, complete with a live strolling band playing familiar tunes, and they took requests! The waiter we had was in the mood to be open to our general jovial ways, and he added to the fun. We observed waiters who often made their clients enjoy healthy belly laughs at their jokes, and everyone was being served from the bar as well as the kitchen in very reasonable time. Food and margaritas were delicious and we had a blast - and we are in the great grandparent stage of our lives. Ole' !", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2014-05-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'vW592QGvpQaFA7ZoIWKmSQ', 'review_id': '99eyNbIZyhYkVT0L26PWAQ', 'text': "I went here two weeks ago while in vegas with my boyfriend.  I LOVE that this place is open 24hrs. Who doesn't love 24hr Mexican food. The chips and salsa are amazing.  They even give you refried beans with your sauces.  Margaritas are strong and a reasonable price.  Food was pretty good as well. Only con was the service. They weren't very attentive at times.  Over all great place.  With good food and don't forget it's open 24hrs!!", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2014-05-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tph4oUyQqY6bALy_-OOrHA', 'review_id': 'eiXKxxZI5IWGDix-mzKlpQ', 'text': "Average Mexican food here. Prices run  between $15 - 20  for most plates.  Don't bother with the Margaritas.  They are made in a freezer( machine and have very little tequila in them.  No hurry to go back.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2014-05-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '4XMI8fGzWlML_K-LxQzUJg', 'review_id': 'rtlusOB6kOtZpx4JZAEfWQ', 'text': "I got the chimichanga burrito to go and it was overall good other than a few pieces of chicken that were overly cooked and unfortunately when I was almost done I found some sort blue food wrapping small piece in my chicken just a tiny piece but still it shouldn't have been there, I put a picture up of it next to green chive so you could see the difference in color and that it is actually a blue piece of something. Before I end I'd just like to add I would never write something that wasn't true if the food was great with no issues I would totally write a review that was overall great I've got other food from here that was good with no issues such as the nachos but was very disappointed this time with the chimichanga, I'll probably try again and hope this was just a one time mistake because they are overall a great restaurant with good service.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 2, 'date': '2014-05-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '7QoEkBr-3AMGLHyjscIvQg', 'review_id': 'H76po6bL9ihVcOjgbWePkw', 'text': 'I hear people all the time say "aww..its not real Mexican"...   I say... "if it isn\'t.. I don\'t care".  This is great food folks.  Awesome flavors and a great atmosphere.  Bring the kids or go to watch the game.  Excellent buffet lunch too.   I think they\'ve got the best chips in the western hemisphere.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2014-05-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dDh9OKS_7tljTuoFXdlAmw', 'review_id': '_9_fAwWBSLeNcc2eXA-beA', 'text': "Came in and really liked the decor. Decorated very festive. Chips were better than the salsa which was pretty runny. The guacamole was bland. My husband and I both ordered burritos. They were just ok. Nothing too spectacular and mine wasn't that hot. I did like their rice which was probably the best thing I had there. Server was friendly but seemed kinda lost and forgetful which was weird since we were like only the third table there. Probably won't be back to try again for you don't really get your moneys worth.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 2, 'date': '2014-05-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'II9mhW-oPY51T33zTXAuVA', 'review_id': 'j19BQ_S4FtSW_gv3dt9IPQ', 'text': 'Terrible service! Terrible food! If I could have done 0 stars I would have! Never coming back here again.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 1, 'date': '2014-06-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vLtt5wtP3ty-KUrfkEl34A', 'review_id': 'KNJyFUqkCa5uo1LImSOObQ', 'text': "iI recently ate at Ricardo's there were very few patrons. My fajitas were served with sour beef full of fat. My friends food was cold.\nThe service was less than standard. When finished the waiter never removed any of the plates.\nHe was sure to tell us when paying with a credit card about leaving at least a 15% tip!", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 1, 'date': '2014-06-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 6, 'cool': 0}, 'user_id': 'pSHzPF5Z6ssmvx53wqh5rw', 'review_id': 'KLXFoMR1brvJPoEbiyViqw', 'text': 'Wish I could give negative stars...\n\nWent out with a group of 4 people. \nThe server came over after 10 min of us sitting there to tell us he is busy and he may take a while to come back for drink orders. \n\nFinally he comes by again clearly hassled. \n\nAnd angrily takes our order for drinks. We also order our food since we had sat there for so long. \n\nOur food came out completely uncooked. The steak had frost on it. Nobody came by to ask how the food was so we walked the steak back to the kitchen. The guy yelled at my friend for coming back to the kitchen. \n\nThe waiter stepped on both me and my friends feet. And did not apologize and not to mention he was sweating into the food he was serving us. \nWhen we complained he ignored the complaint and just rang us up. \n\nOverall the worst service ever!!! \nWill never come back.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 1, 'date': '2014-06-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '41s-kN3xsgWSGHkkR4R_Kw', 'review_id': 'C9VBPglsRaQhyNV_eNd_Kg', 'text': "Remember when Ricardo's was a place to be reckoned with? Now it's becoming a place to be worth wrecking. But to be honest I arrived after 1:30 so the buffet items seemed really dry. It's been awhile since I've been here, I'm afraid to say it will be another while....", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 2, 'date': '2014-07-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'w2hXYWhM3tNgnY_o7vKnTw', 'review_id': 'hUI3kHDDTX5RYuXr6u45QA', 'text': 'I am from Texas and did not know what to expect from a Mexican restaurant in Las Vegas.  I opted for the buffet for $13.99 ($14.99 with beverage).  The cheese enchiladas were sooooo gooooood!!!  Also, on the buffet was beef and chicken breast fajitas (not thigh meat), build your own tacos and taco salad, and flour and corn tortillas.  Chips with three different kinds of dipping sauces were delivered to our table.  Our waiter was extremely friendly, encouraging us to "stat as long as you like...it\'s hot out there."  Two thumbs way up!!', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2014-07-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'drqxDaKNo7LetXh6CzCi8A', 'review_id': 'Rj0_aElm5N_OQpGThNah8w', 'text': 'This place has some amazing tacos! I love the vibe of the place and how everything clicks! They truly know how to spoil me and my family every time we come wether we dine in or take out!', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2014-07-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DHkbIKsrNJaMj_sy531RBA', 'review_id': 'x1brYyQO3c_dwgDIZsZnBg', 'text': 'the food here is great ! i really enjoyed the bean dip delicious !!! not to metion its open 24 hrs !!!!', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2014-07-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'V7OgCZu-cMnnU9nUH4yeXg', 'review_id': 'ZlouAatKkxdR3KnawxCZzw', 'text': 'Open 24 hour we decided to check the place out last night around midnight. They have half off happy hour drinks, and appetizers. Great service and food.  I recommend the Camarones Chipotles con Ajo.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2014-07-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'gefKUQJ6RYMFuw2wEROjcA', 'review_id': '-TFxxh_zVe_H3Rtm-E6nYA', 'text': "ABSOLUTELY AMAZING FOOD AND SERVICE!!!!!!!\nWe were at Ricardos on July12,2014 for a dinner after a wedding and I was truly impressed with both the food and the service. Our Waiter, Freddie was beyond EXCELLENT. This guy has a huge personality and was really engaged with our entire group. You really don't find servers like him in most places. \nThe food was excellent. I had the fajitas and being from Texas I can say I was very impressed, they were delicious.\n\nIf you get to Vegas, this place is a short trip from the strip and \nWELL WORTH IT\n\nEXCELLENT JOB", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2014-07-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZjZapleMCPOgpoaLLAf_Kw', 'review_id': 'rbkuk4FiDhU47CMlSZkkcw', 'text': "I love the lunch buffet here. It's always fresh. You can make your own tacos or tostadas with diced chicken or beef, or ground beef. There are tangy fajitas, chicken and beef, and rice and beans. The enchiladas are my favorite though they can sometimes be a bit salty. There are a variety of toppings--sour cream, lettuce, black olives, onions, salsa, and a tasty guacomole. And they give you chips with three dips.The weekday buffet is a bit less expensive at $12.99(beverage included) than the weekend buffet at $14.99(with beverage).", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2014-07-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oMJiG4jYNPMM-RX1ZntSKw', 'review_id': 'M5E0g_MCumZFkINXg_HBig', 'text': "The food was great they're open 24/7 you even could order online. I had order chile relleno plate comes with beans and rice, another plate was fajitas and carne asada plate and enchiladas swissas means swiss cheese it was delicious. Also before you eat they give two type of sauce hot and mild and aside bean dip very good and their aguas frescas Jamaica y horchata very good", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2014-07-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rb7Jd4TB_Hyw8irpQFciMg', 'review_id': 'VlC57wIr3aP8w6RNBtw3Zg', 'text': 'Best of the best. Always delicious. Good atmosphere. Easy parking. Try the lobster tacos  to die for.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2014-08-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Va9y9URaYQvcPl_6kQz6qQ', 'review_id': 'T0w1HLgVpxG4CleGiuqJVw', 'text': "Service was okay. They were good until after we ordered then pretty much forgot about us. I ordered a large menudo and two Carne Asada Tacos. With my first sip of the soup I was smacked in the mouth with salt. I tried adding lots of lime but couldn't cut through the saltiness. I tried some of the meat and had to spit it out. I swear it was old. I moved on to the tacos. They were okay,  though the meat was very bland and the tortillas were stiff. Never coming here again", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 1, 'date': '2014-08-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FnZHiw9dbzC2hmgD86puhA', 'review_id': 'OrtLqYIU5ZUvPIDm5PSoeg', 'text': 'Overall a great experience. It took a little bit yo get seated, they overlooked us ( each thought the other already took care of us). Once seated it was about 5 min til they took our drink order. After that, our service was great. Food was very good, nice to see bean dip with the chips. I had carnitas enchiladas, would highly recommend.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2014-08-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tp5pIZ8WOzwBGoUXyLRpjA', 'review_id': '28YF7fo_VP4fffEtqro-KA', 'text': "We have been in search of a great, local Mexican restaurant in Las Vegas for quite some time.  My husband has lived here for 20 years, but I've recently moved from California, which is where we would usually indulge.  After driving by this place for the last several years, we finally decided to give it a try, having friends with us from out of town who were craving some tacos and margaritas.  \nThe ambience is great, the service is really good, and the food was better than we expected.  My husband and I shared the chicken & shrimp fajitas, with were extremely generous.  Our kids and friends were happy with their entrees, as well.  The adults each had margaritas, which they offer in different sizes, and kids had Shirley Temples & Rob Roy's... very fancy!  \nWith their chips, they serve a few different types of salsa and warm pinto beans.  Their entrees are appropriately priced for the large portion you get.  We managed to save room for dessert, and ordered deep fried ice cream and flan.  SOOOO GOOD!  \nOn the evening we dined there, they had a magician roaming around to entertain the diners.  Initially, we were a bit put off, but he was so entertaining that we asked for his business card before he left.  \nThey are usually pretty busy around dinner time, so keep that in mind if you are hungry and don't want to wait.  So far, we haven't had any problem getting seated right away, but you never know.  It's not too far off the strip, so you can easily take a cab without having to pay for a drive clear across town.  \nOverall, we have been very satisfied with our dining experiences here, and would recommend it to anyone wanting to try a good, local Mexican restaurant.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2014-08-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UQUjeUGQwopg5mxc-yVnMw', 'review_id': 'BF4Vz2NNVI5d6Wg1T4WfNQ', 'text': 'Service was great. Food was moderate. The waiter checked back on us several times- great customer service.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2014-08-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': 'sKwJyEXUeOfJqjAgONtdTg', 'review_id': 'nP47BX2OjOEiDsjfyC1sSA', 'text': 'This is Mexican food for white people. Not horrible, but rather bland and boring.\n\nCarne Asada = over cooked and way too under spiced\n\nGround Taco Meat = way too much chipotle and not enough cumin\n\nChimichanga = tasty, but super greasy \n\nFajita Chicken = not enough Adobo seasoning\n\nRefried Beans = pretty darned good for retried beans \n\nSalads = both are surprisingly flavorful\n\nStore bought flour and corn tortillas (lame)', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 2, 'date': '2014-08-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'o5BtGc8Znv-oDYiUjlfMWQ', 'review_id': 'POjc8QVBnaLYHKxzHpIZEA', 'text': 'i went here almost 6 months ago. Solid fajitas, decent margaritas, good service. I really remember their guacamole standing out', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2014-09-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'Z2VQxuQ_hhJi_zfAnUJcZw', 'review_id': 'CkqR_2fb0SguNx_WuNt1Gg', 'text': "Best authentic mexican food I've had in Vegas! I definitely recommend the Camarones in Chipotle sauce over rice! Poncho gave us great service! Love the fact that they are open 24/7.. we will be back for sure :)", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2014-09-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'g1a4OLgGSWMLOGEwcsb3fQ', 'review_id': 'I_F0VKK3cEXKjRBALmUHag', 'text': "GREAT food! I love supporting local family owned businesses in Las Vegas. They've been here for 35 years, which says a lot in this town. They were even in the Guinness book of world records for the largest margarita! \nBeing centrally located on Flamingo and Decatur is awesome, and you can't beat being open 24 hours! \nI've got nothing bad to say about this place. It's a must try, that is, if you haven't already.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2014-09-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xcWNxoUGAgL7xgNqNbKwaQ', 'review_id': 'piJDeDMLXC9AN2hEKzHs5A', 'text': "Love Ricardo's , great food and margaritas.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2014-10-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'gyDXyRhSeb124ojxH2512Q', 'review_id': 'c3WPn8ss8wd4ZIQNtbnb7w', 'text': "My boyfriend and I have been to several mexican restaurants in this area of Vegas and so far have been disappointed until yesterday when we went to Ricardo's. Chips come with salsa, beans and a super yummy verde salsa. The chips are to die for, they didn't even need any dip. As for our meal, I'm vegetarian & they made me an off menu veggie chimichanga & our waitress was really nice about it. My boyfriend had the nachos which he ate until he couldn't move. Service was good as well, our waitress was Chelsea & she did a good job up selling alcohol without being too pushy. Will definitely be back again soon!", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2014-10-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'FD0cjGE20hKdbCytlSTjFA', 'review_id': 'pp_zv4dz0vCNCu9F36T8VQ', 'text': "The lunch buffet is a great value. For ~$13 a person, you'll get unlimited tacos, chimichangas, enchiladas, tostadas, salads, and soft drinks. The horchata is recommended and is included in the lunch buffet. Try it! It's sweet with a touch of cinnamon. I prefer it to horchata from some Mexican eateries in Los Angeles, even. When you're seated at a table, you're given tortilla chips and 3 different salsas. The salsas given with the chips are great. One is refried beans; another is avocado-based; the other is tomato-based. My favorite is the avocado-based salsa since it has great flavor and a little spice kick. The chicken tacos at the buffet were awesome. The lady assisting customers at the buffet was so friendly. There were only corn tortillas for tacos, but you can order flour tortillas at your table. I also really enjoyed the rice. It was flavorful without being too salty. The chicken chimichanga is nothing to rave about but still pretty good. For dessert, my party of 4 had split a banana foster. It was a bit too runny for my taste. I'm used to a more syrup-like consistency. Overall, I liked this place and would recommend to others. When I return, I'd like to try a margarita since they're known for having made the largest margarita in the world!", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2014-10-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'r7TKez-SGaHk3AZQn1v8bQ', 'review_id': 'xgMj4UI0UVvg-vyjXlO0uA', 'text': "I live 3 minutes away from Ricardo's and I went on my birthday a couple weeks ago. The food was pretty alright but the what really sold me was their cocktails. They have a great variety and I got some coconut margaritas . Those were surprisingly good! My server was great and helpful when it came down to choosing drinks. I'll be back ! :))", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2014-10-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mTRbk81-4pwNR9fS-RoxSQ', 'review_id': 'UPGTMkT8xKFGEfF5-CB_wg', 'text': 'Best Mexican food in Las Vegas.  There is a reason this place has been around for 30+ years.  Open 24 hours.  Lunch buffet is a great deal.  Love the chips and dips that come with every meal.  I recently tried the lobster taco special and it was excellent.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2014-11-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TNUISSVLumB68-orCidIvA', 'review_id': 'MnNv2lOS8GVKgeghfLyQ0w', 'text': "we had a great server but we came with a whole soccer team and apparently the other server helping them can't do her job and the manager didn't seem too concerned with the poor service.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 1, 'date': '2014-11-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HkIcA8-SpK2e7hhjxQapKQ', 'review_id': 'NgzgOvlnMyJuLj3sjW7I5g', 'text': 'Decent Mexican. Good food. Try the enchiladas. They are excellent. If you want something filling try the tamales.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2014-11-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7EaNptaowHIgKhg1VZBOZA', 'review_id': 'rSfxOC_z0TIToCa-lb8Czg', 'text': 'Had dinner here last week.  It was wonderful.  Service was very efficient.  Food was quite good.  Atmosphere was A-ok.  Prices were reasonable.  Definitely plan on returning.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2014-11-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MTREYPK9-xQhADM1NHHsDw', 'review_id': 'UNS_ct5VoNGNtH-MuFHWug', 'text': "We were in town for a birthday celebration. The food was okay. The margaritas were a little weak, but since I'm not a drinker that was okay. The service was great. My autistic daughter had a melt down in the middle of the restaurant and the manager was gracious and the servers were kind. For that they get 5 stars.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2014-12-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xKZY1SSCqRGL3WMqeY9S8g', 'review_id': 'rYFIrGDq7MO0ZlAO4fePwg', 'text': "We love Ricardo's. I have lived in Las Vegas for 10 years and I try to get in there once a month. My favorite dish is the chicken enchilada. I love their salsa and the large margarita, perfect dinner combination. We were there a few years back when they did the worlds largest margarita for the Guinness record. If my memory serves me correctly, they were pink margaritas in honor of breast cancer awareness month. The booths in the bar have tv's in them if you wanna catch a game while having dinner. The lunch buffet is fantastic too!", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2014-12-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '7IapkuaquKtSdhtProFHIA', 'review_id': 'A7cWiZNH0LJnxKeiX0XLmw', 'text': "I just had the best tasting pork burrito with green sauce ever. Fabulous. Fresh ingredients and excellent service, too.  I'll be back.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2014-12-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'zYk4yoZP_kjIU0Y9ucaQKA', 'review_id': 'DcKWgfLLF1tmGbHM5Jb94Q', 'text': "My group of 4 went to Ricardo's on New Year's Eve for dinner.  Sadly, we were very disappointed.  The food was very mediocre.  It doesnt compare with the better Mexican restaurants in town. The service was pretty good, though.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 2, 'date': '2015-01-02', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 5, 'cool': 4}, 'user_id': 'fuj-g_8kr_PU3H5N67axHA', 'review_id': 'EuA6Sa3q3MWAOESfAU7hcg', 'text': "Time to update my review since it had almost been two years since I last visited. \n\nWalked in on a Saturday night and it was very quiet and empty, we were greeted by a friendly hostess and we were seated promptly. There were only 4 other tables occupied. I had been craving a shrimp salad from Lindo's for the past few weeks so I was a bit upset at my husband for not wanting to take me, we were going to catch a movie at the Palms so we needed to eat at a restaurant in close proximity, boo! From what we remembered, the food and service here was good so we drove right over.\n\nWe were seated promptly but we waited a few minutes for our server to appear. My husband and I both ordered waters with lemon and a waiter brought out chips along with bean dip, red salsa, and an avocado salsa. The avocado salsa was the best, they only times I've ever seen it made are at catered parties so that was quite a treat, loved it! \n\nFor my entree I ordered a chicken caesar salad ($10.99), they don't have a shrimp salad which was a let down for me. I asked our server if I could substitute the chicken for shrimp, he said he'd ask the chef and that he'd be right back. I knew that if he agreed I would pay a few more dollars which was fine with me. When the server came back out he said that I would have to be charged $20 for the salad if I wanted it with shrimp, I was expecting to be charged a few more dollars but not almost double, so I stuck with the chicken. My husband ordered a steak chimichanga for his entree. We didn't have to wait long for our food to come out, maybe 15 minutes tops. My salad was topped with cotija cheese which gave it a different flavor, not bad, just different. The chicken was a bit on the dry side but seasoned well, it was your average salad, decent. My husband did not like his entree very much, he said the steak was too fatty which is something he detests. Overall, we were not very pleased with our meals. It was subpar. \n\nNow on to the service. The server didn't even check on us once when he dropped off the food, he only came back to ask if we wanted dessert or the bill. I wanted a flan so I ordered, he came back out with the flan and bill. The flan was bland to me and it had a different texture than what I'm used to, it was not very sweet and if it had caramel, I couldn't taste it, the best part of it was the whipped cream and cherry on top. Overall we spent $28 on our meal which isn't bad but the food isn't that good anymore, I might be back, I might not, for now, I have much better options for mexican food elsewhere.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2015-01-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5L5-aeVd_gS312kVgjJPcg', 'review_id': 'Jv45e7z91kgs3pcmKs9oFQ', 'text': 'The good:  This is a nice space, with traditional Mexican restaurant decor (of the American-touristy variety), high ceilings, and a huge frosted glass skylight.  The service (at lunch on a Friday) was quick, friendly, and attentive.  The margaritas were well-made and reasonably priced.  The chips were fresh and hot, and came with three kinds of salsa - all good.\n\nThe bad:  Most of the food was over-spiced, dry, or both.  I\'ll give them a pass on my food, because I had the lunch buffet.  The buffet was pretty much indistinguishable from the Mexican station at any hotel buffet.  But my wife\'s combination meal off the menu was pretty much the same.  She also ordered some cheese-only nachos, which had obviously spent too much time under the broiler and tasted burnt. \n\nWe will give Ricardo\'s another chance, but for now I can\'t say that this is the "treasure" of a Mexican restaurant that we always hope to find when we try a new one.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2015-01-10', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'FFfeFVf1bICg4FEubiF-Dw', 'review_id': 'fFpz9hHeCWt6VBj-BFA6qQ', 'text': "On more than a few occasions, I refrained from writing a review because I didn't want to hurt a struggling new restaurant, even though I didn't have a good meal there.  You get to know the owners a bit, see how hard they're working, and you just don't have the heart to write a bad Yelp review.  Luckily for all parties involved, Ricardo's has been around for decades, which means that my little Yelp review won't make the slightest dent in their future.  But hopefully it will make a few foodies out there think twice about going.\n\nWant good Mexican?  Don't go to Ricardo's.  First came out a giant bowl of free chips & salsas - ranchero, tomato, and some green sauce.  Red salsa was OK, green salsa was yucky, ranchero (what's in it?) was the best of the three, but that's not saying much.  Also, I have a really low salt taste, and the chips were actually under-salted to me.  I got the guacamole appetizer, which was pretty good, I guess (I haven't had guacamole in a really great Mex restaurant).  I got the Chile Colorado, short ribs cooked in red chilies, onions & spices - OK, but too salty for my low-salt-taste palate.  Unfortunately, I was burping this dish back up all the next day (sorry if that was TMI).  For dessert, crazy bananas - hot bananas cooked in caramel syrup with vanilla ice cream and chocolate (although I nixed the chocolate).  Too sweet, not great, like something you would get from TGIFriday's Mexican menu.\n\nI have to commend Ricardo's on their service, which was absolutely first-rate.  In fact, it was so good that I held off writing this downer of a review for a few days.  I got to Ricardo's after 1 a.m., and pleasant, friendly, attentive service during graveyard shift is about as hard to find in Las Vegas as an un-augmented dancer at the Rhino.  Ricardo's clearly believes in taking care of their customers, and gotta say, the portions were very large.  Huge portions plus a great staff have kept Ricardo's going through thick & thin (and there's been plenty of thin) for over three decades.  I wish them all the best.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 2, 'date': '2015-01-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '63rYNbooGPq1L2ce2GC3QA', 'review_id': 'cqdtcFer1G0nywEGgKtXVQ', 'text': 'First time here, great service and the green salsa was fantastic, definitely recommend for a great meal.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2015-02-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'NreM0_PYWOAYiUx8chccuw', 'review_id': 'uSJFLJczOaZniDeZTz0Ncg', 'text': "Staff is very friendly, they have a great selection, with numerous lunch-portion options.  Our meals were great, portion sizes were good.  \n\nMy biggest disappointment was dessert - the fried ice cream, which ended up being ice cream covered with corn flakes (something I have seen before, and am always disappointed with, as that's not fried ice cream), and the flan, which was more cake than custard.  Easy enough to skip dessert all together.  Everything else was good tho!", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2015-02-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QOwTV_ABc5kV784bVFSwmw', 'review_id': 'ooH8keR46AXG6tPVprctIw', 'text': 'This place was great! We had just gotten into town and wanted some good food in a no hustle and bustle environment! The staff was extremely friendly and the food was delicious. We both had the week say lunch buffet!', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2015-03-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'sMwypXIpX-UGGlPxi7YZSA', 'review_id': '0o2lEV24mlNbO1lJp11D2A', 'text': "Our food was just ok, but Miguel the bartender/server made our night awesome with his ol'school music mix.  We were eating and jamming.  I ONLY want to come back when he's working.\n\nI gave only 4 stars because I didn't think the tortillas were homemade and in a place that nice I hoped for that.  I also prefer my carne asada in larger pieces so that the meat is more tender. My tiny meat pieces were too well done.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2015-04-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8JG6oROoVSlq15lB52sxYQ', 'review_id': 'MK1vpm_sTtbGOQgFa2tppg', 'text': 'First time here. I came here with my parents who have been here many times. I gotta say it was great. The food was good. The service was good. I had the 2 fish taco meal. I would definitely come here again.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2015-04-10', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'DYAokrdayGPci19e1ArJMQ', 'review_id': 'PUzEdg8FAXn9ikKChpGUpg', 'text': "Food was not great, but they definitely put alcohol in those margaritas. Probably won't return for food, but possibly for happy hour drinks.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 2, 'date': '2015-05-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oZt9UM1fFvKY7PcFKFOBKg', 'review_id': 'pxBPJiRlQpwwTrEioYV_pw', 'text': "Just went to the bar for a drink. Juan, the bartender apparently doesn't know he can get tips for even adequate service. Instead, patrons seem to be an annoyance to him. I thought it might just be me, until I heard the same from others at the bar. He was aloof, unattentive and surprisingly disrespectful if you actually cashed out from any of the poker machines with a profit. Maybe they have him on profit-sharing. Well 100% of nothing is nothing. That's what you'll get from me in the future! Adios, Ricardo!", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 1, 'date': '2015-05-18', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 4, 'cool': 0}, 'user_id': 'l2lJt11bWDvTztVKaPnEOA', 'review_id': 'N2fgJX--ltbu8CnRGio1CQ', 'text': 'Pretty irritated with some of these down right RIDICULOUS reviews such as Rudy\'s.  Get it together people, complaining about SALT on chips!  I mean seriously?  Ricardo\'s is making chips for a mass of people, NOT YOU SPECIFICALLY RUDY!  I assure you, there is salt on the table.  Here is an idea, pick it up and use it!  "Here\'s your sign."\n\nNow for my positive review.  Ricardo\'s did a downright amazing job catering my husband and I\'s wedding.  Every single one of out 120+ guests loved the food and I am sure many will be revisiting the restaurant.  I didn\'t hear one complaint and everyone left fat and sassy.  The drinks and service were unsurpassed and management was involved in every single step of the way...free of charge.  \n\nI have been going to Ricardo\'s since I was a kid....20+ years.  The owner and his wife work Friday and Saturday and they know you by name and always have a smile on their face.  This is a touch of special for me, they are a great pair.\n\nThey have delicious food that I cannot seem to get out of my head.  The chicken Ricardo\'s is my favorite and melts in your mouth.\n\nAs for those chips and salsa you some ding-dongs seem to be complaining about.  Why are you complaining when you have a selection of three sauces?  You don\'t like one, here\'s an idea, try the other.  Most restaurants offer one selection and that\'s it.  What\'s the mean?  You don\'t like it and you are stuck.  \n\nDon\'t rely on the YELP reviews of morons, try it for yourself!', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2015-05-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'exdAB8-hdvkrM6LJ8X-T-Q', 'review_id': 'tx3y45uirZMAmxyxS3_v6A', 'text': 'Great food and great drinks. Love that all you can eat buffet and clean and friendly atmosphere will come back to eat here when I am back in Las Vegas.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2015-05-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UbwyFNuiZftAdop80H-Flg', 'review_id': 'oa8NgnbPkIF-bvmT0U3-dA', 'text': "I liked the staff. Very friendly waiters. I also liked that it's open 24 hrs a day. My friend and I went in because it was 1am and it was open so we figured, why not? \n\nThe chips and salsa were good. Very tasty salsa. The actual entrees... that's another story. I ordered the chile relleno meal. It came with rice and beans. It is really DISGUSTING. The batter on the chile is super thick and greasy. I seriously couldn't get past two bites. I felt like throwing up immediately. The rice tasted old. Like it was starting to get a metallic flavor from sitting in the pan too long... that's the best I could describe it. \n\nI was going to give it just one star, but my friend said her chicken flautas were ok. I definitely  wouldn't go back though.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 2, 'date': '2015-05-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GXkB5krUqcc2EQYbpBkAGw', 'review_id': 'ucnrkLq9B-0COvxu5889_A', 'text': "Chips n bean dip and salsa was good... My tostada salad with shredded beef was good! My husbands enchiladas seemed to be heated in a microwave. So I'll say 3 stars but open 24/7 was awesome!", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2015-06-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nneZc0YpkJRMyRP7z-_nYg', 'review_id': 'wY5ctgfxmI5TiFZQIBUSwA', 'text': 'We used to be regulars but the quality has gone downhill. The staff has always been friendly,the food is just not what it used to be.  Juans flaming fajitas is so much better.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 1, 'date': '2015-06-17', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 4, 'cool': 4}, 'user_id': 'gBoMkFuGtVBUpJqtRL3qAw', 'review_id': 'P7MhlnSoWsIGOJWN6PIU_A', 'text': 'Meh....\n\nYesterday, my fella and I had planned to go to a reopening of a popular restaurant, but they\'ve pushed their opening back, so we had to find something else for dinner.\n\nWe finally decided on Ricardo\'s, which I\'d never had.  \n\nWalking in, the inside is a little run down, and shabby.  Its a little on the dark side, and each booth in the bar area we were seated in had a TV IN the booth.  I don\'t like this...If I wanted to watch TV, I\'d sit at the bar.  \n\nWe got there in time for happy hour, and so I had a "small" regular margarita for $4.50.  \nThis wasn\'t small!  I\'m glad I only got the small, because it was so big I couldn\'t finish it.  This was my favorite part of the evening.  It was a good, strong margarita, and I\'d go back for happy hour just to have a couple of these, for sure.  \n\nFor dinner, I ordered the nachos, no meat (also on the happy hour menu: $7).  \nMorgan had the combo carnitas taco and shredded beef enchilada, served with rice and beans. \n\nMeh. \n\nThe portions were enormous.  I ate a ton of food, and it looked like I didn\'t touch my nachos.  The waitress actually came over and said "You didn\'t like them?"  No...there\'s just WAY too much food on the plate!  They tasted ok, but I\'ve had better at Qdoba. \n\nMorgan wasn\'t impressed with his, either.  The enchilada was good, but we make better at home.  The carnitas taco was bland.  \n\nService was awkward too...our waitress was nice, but had 0 personality.  She disappeared at random times, and the checked on us twice within about 3 minutes...space it out! Its ok to let us eat for a minute.  Really.\n\nFood was pricey for the quality.   I don\'t know that I\'d come back for anything other than a margarita during happy hour.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 2, 'date': '2015-06-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '80usuzaSkwvAFplIboiHqg', 'review_id': '-n2oe6E2udOZnjtEeeqkUA', 'text': "We just came back for a Father's Day dinner. The ambiance was very nice, the inside was very clean, and the staff is exceptionally friendly, always checking on you to make sure you are content.\n\nSo why three stars? \n\nSimply put, the food is mediocre at best. The two dishes we had came with wonderful presentation, but the food was bland. Meat had very little flavor. All in all, we were very underwhelmed.\n\nBut the cocktails are really good.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2015-06-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': 'GcsS-Jc3RxAXUefvO75g0A', 'review_id': '0kGh-QP9N_HjLkt4s6Su1g', 'text': 'Good food, good service. Happy hour in bar only! Daily specials!! I will definitely go back.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2015-06-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'CQhAYEwiL9z9LEJFTOaVeA', 'review_id': 'EOnHoF8VhujVczmA7HIAjQ', 'text': 'Dirty plates were never removed from our table. The quality and portion sizes were not worth the price. The worst Mexican food I have ever had.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 1, 'date': '2015-07-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'X4J7-_dkvksPXOsq_flFEg', 'review_id': 'XfHhmLiRd6xtEINhHEsuhg', 'text': 'Fabulous service and wonderful food. Thank you Lee and Freddie for our amazing service today!', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2015-07-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'yD-Ar3xF7ZtHpiFV_Ien2A', 'review_id': 'F1o85ntNLaB9OQAr40-Cew', 'text': "This restaurant WAS HORRIBLE....The guacamole was horrible, chips are crap....I wanted to give the food a try....The Fajitas came and AGAIN....HORRIBLE, No flavor nothing...Hubby had ground beef enchiladas; again NO FLAVOR....So sad...I expected more...I'm horribly dissatisfied!!!!!! :(", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 1, 'date': '2015-07-11', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'v2FJ3D317sAtgSstVUBcMQ', 'review_id': 'pT_6raCGqKDRmDd6gsE2Qw', 'text': "Went there last night. My husband  ordered  a chile relleno and it was terrible  tasted old and stale. We told the manager and she took it away and brought an enchilada  it too tasted stale. I ordered  taquitos $8 (4 rolled tacos)  and they were  burnt and tasted like they were defrosted and reheated in stale oil. Very  greasy,  No rice and beans  like other restaurants,  just sour cream  and  Pico on a tiny bit of lettuce.  When I told them they didn't taste good they said  their food was fresh. 10% discount but i still had to pay for the whole meal. Never eating  there ever!!!!", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 1, 'date': '2015-07-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uY1F1UTdSuBRZPvM5NtFjg', 'review_id': 'jkKgtLI1z_FSABlHbbJWKA', 'text': "Come here and drink with Chelsey. She's great and will keep the drinksdi cominng i'Ve been dr ur jking damnt i mean drinking and this is really good corn. HEY I ASKED FOR GUACAMOLE... darrn mcdonalds clow. Just took my banana. America #1 ARRIBA LOS CHURROS", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2015-07-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LVJHhPcRE8MZrnaLYTTmeg', 'review_id': '7zRcZ5RTefu18MNjfr-m2Q', 'text': "Awesome restaurant all around. The chips, salsa, and bean dip are great. Recommend carne asada, chicken ricardo's, and chicken picado. The margarita are awesome! Go here every time I am in town.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2015-07-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ksRnJgmcrNlgI07Roz_sQA', 'review_id': '6W0klaITO-FHE3UtBOsJZw', 'text': 'Always love the lunch Buffett. The only problem is I eat more than I should! Definitely a must place to eat! Great friendly service as well!', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2015-07-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'KEQSmNI3fMKVaSmNmmx_pA', 'review_id': 'RjcZaMHU-zvOQS3dno8eSg', 'text': "Not great. Mexican food is not hard to make. I understand they are cooking for the masses but the food needs a revamp. The beef is bland. Almost like it came from a can. It's just NOT great. \n\nWe ordered the lunch menu Ricardo's burrito and the beef taquitos. The taquitos were over fried and my burrito was topped with some sauce, not chili nor beans. It was a weird sauce with chunks of something unidentifiable. \n\nI picked at my food and waited for the waitress to come by and ask if something was wrong because I placed my burrito off the to the side and waited for her. She never came back (She got busy with 2 other tables and attended to their order). In the meantime, the bus girl came over an refilled or drinks but couldn't do anything about the food.  When our waitress finally remembered us was when she was walking by our booth to get refills for the other tables, and I asked her for the check (at this point I was done with this whole experience). We paid the $26.00 for our food and left. \n\nWe will never be back again. It USED to be a great place to eat. The service was ok. The place have changed their food suppliers, or recipes to cut costs or chef because the food is not what it used to be. Very sad.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 2, 'date': '2015-08-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'j9WqEFFu1UiLYSjKwP-a1Q', 'review_id': 'kOFDLFb8R8LGbLHLXHoe6A', 'text': 'Amazing food and amazing place. I go there after work sometimes at 3am, and I love the food and the drinks!! Great margaritas, great chips and dip, and great food all around. They also have some of the nicest bartenders and even the kitchen and the dishwasher staff wave bye to me when I leave. I love this place!!', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2015-08-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '84o3A1R7kmLsGh1NtkHUyQ', 'review_id': 'IQ3HRwgcOPgMIR8HyjFVgQ', 'text': 'I have been coming here since I was 8 with my family. This place still has the same people. I love their food and still love coming here. Miss the days they had a guitarist though, but still love it.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2015-08-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'YhehU4DO_i7-C0ZAAs4wTg', 'review_id': '9xSn6dQa2vAt-ubvnrJJ7g', 'text': "Ricardo's, Ricardo's what can I say? Well I am a bit upset with myself that I am just now trying out this place! It was very good and the service was fantastic! I went with my best friend on the spur of the moment! I forgot they are available with opentable.com and we were both in the mood for Mexican and looked up some things that were in the area! Ricardo's appears and sure enough we booked a reservation for two please! As soon as we arrived we were greeted immediately from the host and a server that was already available! Seated swiftly! I think we are on a roll here! After we were seated our server came over introduced himself and made some great recommendations! I had a huge burrito that was filled with I believe rib tips or something in that nature can't remember all I know is that it was very filing and good! I will be returning soon!", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2015-08-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KdG_d38odZECrn5vW4Zb2w', 'review_id': 'K2mMOBFPokaiBRYgKkXdKQ', 'text': 'The bartender Juan is a great guy and very attentive and makes great drinks...the staff overall are very friendly and alot of the food ive tried here is good.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2015-08-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PJlb0fWeue2NPzX6upwceQ', 'review_id': 'J50bQlpfz4G0Dzkj-FKtvw', 'text': "Best bbq pork sandwich I've ever had! Delicious complimentary chips and dips...and the staff is very friendly and helpful. Highly recommended!", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2015-08-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'x3t9jU7yIwsGbdsrm9Fg-w', 'review_id': 'Jyv9fYckqXgEZ_Qz0pL8DQ', 'text': 'So I went here with bf since we were in the area and he loves Mexican food. . .\n\nAnyhow, the chips and salsa were awesome!  When I say salsa. . .I mean they bring you a trio. . .a normal red salsa, bean dip and a green salsa that is NOT salsa verde.  The green salsa almost tasted like it had a little bit of avocado in it???  It was creamy but still thin with chunks of onions and cilantro running through it.  Would I go back for just the salsa trio that comes out with chips?  That would have to be a yes. . .I am not a fan of the bean dip. . .but OMG the green one was da bomb!!!  =)  And did I mention that the salsa trio and chips are FREE!  LOL  =D\n\nOnto the entrees. . .\n\nI had the nachos with beef. . .it was really really good. . .It came with sour cream, gucamole. . .well pretty much the fixings. . .and no pics cuz someone. . .mainly me. . .was starving!  The meat was tender and no it was not ground beef it was shredded meat.  The only bad thing were the beans and that was my bad since I forgot to ask for it with no beans.  \n\nThe bf had the enchilada and taco combination.  He said that it was really really good.  He barely talked to me. . .he was so busy eating. . .now you know that means that it has to be good!  LOL  ;)\n\nService was where I took off the 1 star.  We had to wait to get them to bring us our ticket. . .and then when we wanted to use credit card we had to go into the bar to pay as the bartender was the only one that knew how to use a credit card swiper. . .weird I know!\n\nSo yes I will definitely be back!!!  And the cool thing?  They are open 24/7. . .now I know where to go and eat when nothing is open late night!  LOL  =)', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2015-09-03', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'Iu4pnIksqN7BFRC0WKjBpQ', 'review_id': '63SdqhcXCbCDz0kRxzm-Ig', 'text': "Ok I love that I can stumble in here at 3 am and get service that doesn't come with a drive through window. \n\nThe decor is what you would expect a Mexican restaurant to be. The walls yellow, the wood tables and chairs and some little embellishments hanging on the wall that scream pancho via might have had some carne asada from here.  \n\nThe food is ok. I do love that they give you two salsas and bean dip for your chips!!! I eat like two servings of dip on my own. Bad side is after the bean dip and chips I'm too full for my food. The flautas are good. Deep fried flour tortillas filled with chicken. \n\nCorn allergy alert!!! They put corn in pretty much everything! So if you are allergic let them know. \n\nAll in all I've had better but generally not at 3 am lol!", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2015-09-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DAflc3dM_UM8PTG0iupD7A', 'review_id': 'apYcstz238tk3WLA2jlhhg', 'text': 'Waiter was great and would give him 5 stars, but the food was just average. Nothing really blew us away in our party of 4, but it satisfied our craving for Mexican food that day.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2015-09-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MMxky8CSK84Bk3RY0pdMZA', 'review_id': 'Tt4AtX2FZ5GBWAnF2Wndvg', 'text': "Ricardo's is a staple in my Vegas outings. It's open late (maybe even 24 hours? I forget) and their food is always high quality. We usually have to be wheelbarrowed out! I've been here with Emijandro, the BGB Harry, and even my parents The Griswolds, and it's always great service, strong margaritas, and plenty of great food. I personally recommend their breakfast burrito, or their Burrito Ricardo's. I'm certain I'll be back again, I'm sure.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2015-09-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6lmbz8js6gAlulCmsR6vaQ', 'review_id': '4IWt9zsSLJNmZLQFm-Uj0Q', 'text': "This place is always a good place to eat. And now they r open late, very late for those drinking hungry people. Lol food has always been good and the service has always been good as far as I can remember, haven't been here in a while ,but we were staying down the road in a date night out. The Margarita's r always good. This place is a must try least one time if u come to Vegas.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2015-09-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uejPV3BHRiKCqC9RLH6bxg', 'review_id': '_qJtjpWkx5dB3kH82AZwBQ', 'text': "Have been going to Ricardo's since I was a little girl and they were located in the Meadows Mall too.  Still love this place! The bottomless salsa trio and chips is just the starter, but is easy to fill up on and not be able to eat your meal. Had the shrimp and lobster enchiladas and they were FANTASTIC! Mostly lobster made them even better. As someone else posted, they have a barbeque pork sandwich, which my teen ordered, I was thinking, it can't be very good from a Mexican restaurant. I was horribly wrong! He said it was one of the best sandwiches he had ever had and it came with fries and a large side salad. The service can't be beat! Very attentive, never an empty glass on the table and they're extremely friendly and always smiling. Will continue to go back again and again.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2015-09-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UmRAHpvh2lr_KaG46Xdm4A', 'review_id': 'gfjhHGB5I_ldzDmNIecwxQ', 'text': 'They have a great little buffet that changes every day. Sat have fajitas and they are super yummy. \n\nBut I highly recommend asking to to sit with Debbie, she has been here forever. And even after on the away she remembers your order. \nAnd the chips and dips are great.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2015-10-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '8dbDEjagDI5ly-FHsdP7uQ', 'review_id': '-5nJLa5HA-n2YpZFg7ZRUg', 'text': "I LOOOOOVE this place, always come here when I'm in Vegas, LOVE that its open 24 hours so we can come here after a night of partying, or just to have more drinks.... after a night of partying. They have good Margaritas (Small, Medium, and Large) good prices, and the dip trio and fresh chips are tasty. Service is always friendly, and that's a plus. I haven't tried the food yet, however my friend had their Huevos Rancheros and it looked amazing! The only reason I give them a 4 out of 5 instead of a 5 is because I had my mouth set on trying their Lobster Flautas and they ran out of lobster when I was there, and I live in California, so I'm not there often. I'm going back for my birthday next week, so hopefully they have an abundant and fresh supply of lobster... Salud!!!", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2015-10-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FQExg5vJaOpwNddENE4TcA', 'review_id': 'QjIpbWFirZns6xuLsRZdwQ', 'text': 'HORRIBLE service and HORRIBLE FOOD.... We only ordered 3 drinks and chicken nachos... Nachos was so nasty!!! Anyway.... It was 3am no one greeted us nicely just said just sit anywhere w/o eye contact or directed us were to sit anyway we waited long just to be helped and were the one who got out menus everything took forever to get to our table... We suppose to order more but how the service is we didn\'t... To make the story short the reason why I gave 1 star Is when I paid the bill I didn\'t put any tip yes I didn\'t because of how they treated us and how the service was... They bother asking the other table how their doing but didn\'t bother asking us if we want anything else or hot sauce for our nachos we have to ask for it for several times before it came... The person who got our check said to me "WE WILL SURVIVE WITHOUT YOUR TIP" so unprofessional I\'m a good tipper but the way you guys treated would NEVER make me go back... Plus tip must be base on how you take good care of your customer!!!!!!!', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 1, 'date': '2015-10-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5tmxqdxG7o4fRXPM6XH4Sw', 'review_id': 'VwqjwRZnzjyAsWYG7d6gow', 'text': 'Good food nice atmosphere. Great Ritas.  And very close to me And they are alwasys open.   You can go late at night and still have good service and good food', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2015-10-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'RHhwFmIomPtorKFO7XbZgw', 'review_id': '0PwOZ9L0Ri7buZ-3wwUU1w', 'text': 'Wife and i had lunch there 2 weeks ago.  Food and service outstanding.   We are going back to Vegas in December.  We will be returning there for lunch, maybe dinner or who knows maybe both. We highly recommend Ricardos for a meal.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2015-10-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'LAm4-wuiwMJxrJyRrYEGFA', 'review_id': '0mupe-LfZBrju_yw7jG--Q', 'text': 'A very good place to eat Mexican food. The staff is very friendly and the place is well decorated. I love their fish tacos!!!  I eat there about 1-2 times a month with my friend over the last 3 years. I have not had a bad experience.  I strongly recommend.', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2015-10-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mj2kWWqa1FTzNG5DbEX2LA', 'review_id': 'niO8O7KT_j-ZQN2tasWaig', 'text': "Good, very authentic Mexican food. You can nit pick about anything in any restaurant, but if you want a real Mexican food experience that isn't one of the million Roberto's in town, this is perfect. Our server Jeronimo was really nice and helpful, and knew a lot about the food. I got the taco, enchilada, and tamale combo plate, and the shredded beef was marinated perfectly.  My girl got the lobster and shrimp enchiladas, and she loved them. The chips and salsa came with two different types of salsa and bean dip, which were awesome. A great place.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2015-10-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WqDY-RLIqMdkVE-Z6IqGfQ', 'review_id': 'xQjicy-iw_q6HpMQDrMPZw', 'text': 'A nice place to eat after work !! The carne asada and nachos supremos are awesome!! We came in here all the time and leave with a big smile , also the dining room is very comfortable and the music is nice!!! Thank you guys !!!', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2015-11-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3KAAJOW9fUMUqu1dBTTjxQ', 'review_id': '33u4w4omsX2l7rwiDOrSAw', 'text': 'Anna was very rude to us and the food had no flavor.the beans and salsa are from a can.very disappointed', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 1, 'date': '2015-11-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': '2l2lRFuHLdyGjAuusqPDag', 'review_id': 'BLcWRu9nAR2VtOaO0OtpAg', 'text': "I saw lobster floutas on the menu and knew this was the place for me!\nUnfortunately, my appetite didn't cooperate and I only had room for an entree. The seafood enchiladas were good, but lacked seasoning. There was plenty of fish and less shrimp, but both needed some flavor. I dumped the salsa from our chips 'n salsa on the enchiladas to add that flavor. I also asked for some hot salsa and got a fruit based hot salsa which was very good. The rice was not the traditional Mexican rice I'm used to, it was white rice and was probably better. \n\nI liked the ambiance of the bar/dining room where we ate. They have cool globe lights on the ceiling and the backdrop of the bar is very inviting. I had a prickly pear margarita which I think is hard to find around here and it was very good!", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 4, 'date': '2015-11-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LJYshZTevFEVGRA0VOlQ2w', 'review_id': 'Mm3_IcaBdJVmmsYEyk1ynA', 'text': "I just enjoyed an hour at Ricardo's!! Great food, atmosphere, and wonderful staff!!  I highly recommend this place for the entire family!!", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2015-12-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Fu0KMrxVBR-4udX2gnqZxw', 'review_id': 'trlAn798IZVWVFppn-vx3Q', 'text': 'Had 2grab last minute party tray. Went in & saw incredible marketing promotion. U sign up 4 free 2 their loyalty program, every time u eat there u get Cashback, + their card is accepted & 50k biz as well 4 Cashback. No stings, TY Ricardos 4 this great gift of free Cashback card', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 5, 'date': '2015-12-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'U4NytkxSuHVYjZe4fMDcrA', 'review_id': 'twEc46JZDY_ue01EebO91g', 'text': "Best mexican food I've ever had (no joke, the food is amazing! I had the super tender cheese covered New York steak)\n...but the overweight waitress (that wasnt even my table's waitress) was such a total ***** at the register, it ruined this restaurants review.\n\nI had a restaurant.com gift card for $25 off a $50 bill. She said It had to be over $50 and my check happened to total $49.83... She said it had to be over $50  before tax (huh? Tax on food? Guess I never payed any attention to that before). She rang me up a small drink worth about $2 but charged me $10. My new bill after my gift card now totaled $35. It's actually quite hard to spend $50 here for two people, everything is priced pretty fairly.\nAlso:   Literally all of the other restaurants I've used these gift cards at don't even care if you don't meet the minimum purchase requirement.\nHonestly the whole gift card thing wouldn't have even bothered me if it wasn't for her absolute terrible manor how she talks to her customers. \nIf you are the owner/manager reading this: Fire her asap.", 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 1, 'date': '2015-12-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'EaP8mXx9g4zYwmK3wGMZAw', 'review_id': 'wkbzalzAdeAmOWgzqRGSvQ', 'text': 'It was authentic but nothing too special. Worth visiting again but not one the must have list', 'business_id': 'w4b7gW_l4uL1DdWwwPTucw', 'stars': 3, 'date': '2015-12-20', 'type': 'review'}
