{'votes': {'funny': 1, 'useful': 2, 'cool': 3}, 'user_id': '_M2Q-1d_aNXPTVJD-DP2vg', 'review_id': 'MpbXpnwdMo9W9lLb7ZiCfA', 'text': "We got to check this place out during its soft opening and it did not disappoint. \n\nFood is great. \n\nMixed drinks are on point. If you like whiskey, try the Smashed Irishman. \n\nWe didn't get any beer, but their selection is great. \n\nOur server (Kirk) did a great job at recommending drinks at dishes. My wife almost ordered a spicy drink, but he warned her and turned her to something else...super thankful. \n\nTwo must haves: \n1. Pork Belly Nachos...amazing!\n2. Korean Style Ribeye Cap...super tender and delicious. \n\nThis place will be our new spot in Tempe for sure. \n\nWelcome to The Yard!", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2014-12-04', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'rWVlUIa2PX9t7lBKtzq6Dg', 'review_id': 'I7X2ujBYpR64GWNPN3SexQ', 'text': 'Came here on one of the pre-opening nights and the food was fabulous with great service.  Fun vibe, high energy and a great addition to Tempe. Started with antipasti; then we had the rainbow trout and Korean style ribeye cap. Very limited availability so ask for it asap.  Dessert was the bourbon black bottom pie. Yum, yum! We enjoyed plenty of wine and scotch drinks.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2014-12-06', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'K6k3tULQVD7cEnUMytHobg', 'review_id': 'vAb_Gg3e7FEpgjOqxMe67g', 'text': 'The Culinary Dropout at The Yard is a GREAT place to go for food, fun, games, drinks, events or just to hang out and relax. \n\nThe menu is awesome, the staff is friendly and the place is a lot of fun. \n\nThe Antipasti plates are a great way to start. They also have salads, soup, sandwiches and some really good entrees. The roasted salmon is tough to pass up. Other things on the menu are Shrimp and pork belly ramen, Meatloaf, fried chicken, a bistro steak with gorgonzola that is *really* good, sweet potato cannelloni and more. \n\nDo yourself a favor and save room for the "Bourbon Black Bottom Pie" for dessert. You\'ll thank me, I promise. \n\nThey have a full bar and a bunch of specialty drinks, too. For local brews, they serve up hops from Four Peaks, San Tan, Huss Brewing and more. \n\nThe place is cool, for sure. Good for small and large groups. Private meeting space available, as well.\n\nValet parking is available.\n\nA great addition to Downtown Tempe.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2014-12-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'm8AOu-5s9wkrNtWJo-umgg', 'review_id': 'MTpFDvSVQyEA3VZ-xt5g-A', 'text': 'I was privileged enough to be at Culinary Dropout\'s soft opening this past weekend. Sam Fox has done it again!!! What a great restaurant! The ambiance is very cool and casual. It caters to a 30\'s something crowd which is just what downtown Tempe needed. \n\nThe decor includes hanging lights, cozy couches with fire pits and murals of Johnny Cash and Freddie Mercury. There is ample space for large crowds or something a little more intimate, if you prefer. \n\nNow for the food! My friends and I started with the pretzels and fondue. Sooo delicious!! Not quite ready for entrees, we ordered the cheese plate next. I highly recommended the goat cheese. It\'s perfect!\n\nEntrees were finally decided. I chose the meatloaf. Most people wouldn\'t dare order something that "only Mama can make". I\'m here to tell you this meatloaf will make you slap your Mama! It\'s that good! Savory and flavorful and a generous portion. The green beans were on point too. The mashed potatoes seemed to be the instant kind. Easy to overlook with that meatloaf begging to be devoured!\n\nAs for the cocktails, they left a little to be desired. I ordered a Moscow Mule. For $10 a drink, I expected a little more punch. Nonetheless, it was a great drink.\n\nFinally, the service. Every person on the staff is friendly and courteous. They are all more than willing to tend to your needs. The only problem is, they blend in with the patrons. There is no uniform or name tag worn. You have to look for someone carrying dishes or drinks to know who they are. \n\nOverall, this is a much needed addition for the City of Tempe. I highly recommend supporting this restaurant. You won\'t be disappointed!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2014-12-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'V5PfDx_SJdcog2y4Vq5sFg', 'review_id': 'fueQALqZsoZcsu9H8n0LMQ', 'text': "Opted for the burger on my first time in. It was perfect. I'll be working my way thru the menu. Welcome to the neighborhood", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2014-12-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': '_NKidcveEUG7zKq-nKegkQ', 'review_id': 'Rc4SrTSp-PMJcmepVm9kBQ', 'text': "Went here because a friend of mine suggested it. And I'm glad she did. I guess tonight was the official real opening (said my server) . My only complaint about my experience was that the wait staff had no identity. None of them were wearing name tags nor did they have an official uniform. But that did  not take away from good service. Was just an observation.\n\nNow to the food. I ordered the fried chicken. It says on the menu that it is worth the wait. Well I really didnt wait that long. Out came a plate with 3 pieces or perfectly cooked chicken, accompanied by mashed potatoes, cole slaw and a very fresh biscuit. Everything was great. The batter on the chicken was crispy and flavorful. There may even be some cumin in there. And I did order some dessert to go...the bourbon black bottom pie. I cant give a review because I haven't tried it yet.\n\nDefinitely a great experience. Also, from a male perspective, between the female staff and other females dining at the place there are a lot of things to look at. Including the tv's.\n\nI will definitely be back.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2014-12-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'Eaf8rp_tMi4rRo_WsIP-EA', 'review_id': '0sCMVnCKew_MCYPlgaVV_g', 'text': 'Wonderful addition to downtown Tempe. Watched the AZ Cardinals game, they actually play game sound in the back bar. The menu is different from the Camelback location, but still fantastic. There is so much space for large groups and games. Will absolutely be returning - try the Shrimp & Pork Belly Ramen, delicious :)', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2014-12-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'c24VDIxfBOEEu8pOG8RwvA', 'review_id': 'X0WON-wgIXNNmfPzxCKQTA', 'text': 'Really nice staff (hosts, servers, bartenders, and security). Food was delicious as always, drink menu is fun to choose from too! You must order the pretzel and provolone cheese fondue!! I had the seared ahi tuna salad (incredible) and my boyfriend had the MAC burger (so indulgent.) The "Room Service" cocktail is so good! Our server was so nice and attentive and the atmosphere is great. We went on a Thursday around 8/9pm and there was a live dj up on the stage re-mixing popular songs, they sounded pretty awesome. Gorgeous, huge geometric light fixtures, tufted leather benches/couches, and the outside Yard area is beautiful - complete with a bar, shuffleboard, pink pong, and cornhole! \n\nThe Yard is a fantastic area for larger groups to enjoy drinks, order food, play games, and hangout. We live literally across the street from Culinary (Tempe) and have been anxiously watching the building process and awaiting it\'s opening. We were not disappointed! I would absolutely recommend Culinary Dropout Tempe to anyone!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2014-12-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'PE8HXIrlsywX57rIYUGGsQ', 'review_id': 'nDwhmmibqzc5llI6axhMDA', 'text': "What a beautiful design! We really loved the rugs, the eclectic mix of warm traditional furniture and industrial looks. There was a great band playing for lunch. Totally appropriate volume and really a treat. We shared antipasti and fried chicken. It was so delicious. The kitchen split our chicken for us so we didn't have any fights.  the server was so nice I wanted to invite him to eat with us.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2014-12-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5bl7TmwzEpWdJGJlXfguJg', 'review_id': 'SSURwIM7NpLPSupOQrkbNA', 'text': "Went to dinner at the Culinary Dropout last night. Had a truly amazing time. the atmosphere was truly amazing. The wings, pretzels and yesterday's soup was delicious. The staff was very happy and the food was delicious. The outdoor area is very large and had a lot of corn hole and ping pong tables. I cannot wait to return.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2014-12-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'YSf4D_rt75nnb_gRgYLY_A', 'review_id': 'jZNy5Swf3-KRSFfkGCGwMw', 'text': "Wow.  . . I loved the ambiance of this place. While I am no longer in college, I didn't feel like this was a location that only served collegiate customers, there appeared to be all age groups enjoying the company of everyone. \nWe sat in the back, pass the bags and ping pong tables and it was a great atmosphere for talking to your group or meeting new people. While the menu is limited here, or it could have been the time (we arrived around 8 p.m.) the food was delicious. I had the Thai wings and several of my peers ordered the cheese and pretzels. The beer selection is pretty decent, for this time of year a lot of the micro brews have holiday selections, I recommend the Sleepy Dog. \nDespite the large crowd, the waitress was amazing and attended to our requests with a smile on our face (did I mention we were a large crowd??) I wish I had her name to give her a shout out! But all of the waiters seemed to be really on point.\nI am hoping this place becomes a regular for my friends, I couldn't be more happy with my experience.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2014-12-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'iAD9GVUI8m5KaHgi1CnJBQ', 'review_id': 'sVO1vxtorZcIysnQiS0fuw', 'text': "Culinary Dropout in Tempe is beautiful - a really nice space. Busy even on a Wednesday evening. The staff was incredibly friendly. \n\nThe fried chicken was probably the best or next to the best I've ever had, all time. It was amazing. Everyone else I was with loved their food. I also thought the grilled cheese sliders were great. They didn't try to over-fancify them. Just good, traditional grilled cheese. \n\nIt is a bit overpriced for what it is, but oh well. The menu didn't note that it was grass-fed or organic or anything, so I am not sure what kind of chicken it is to be so pricey. \n\nIt is a great atmosphere and delicious. I will definitely go back. Maybe next time 5 stars. I think they are still getting ramped up - I asked for a box and they threw away my food. They did make a completely full new meal for me and the waiter was super nice about it. The valet also took a pretty long time.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2014-12-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'aIAjAU-6NH583EkQ6E9KRw', 'review_id': 'fwK1tR2uX6dT_c8ZUbfrMg', 'text': 'First, let me say, I am so happy to have Culinary Dropout open in Tempe in the Farmer Arts District. I think it is going to be an  anchor establishment for lots of other development in this area and talk about a well run establishment, wow, one can almost hear the hum of operational efficiency in how this place is run and it is a big space and so popular! I took my work-team to lunch here today and honestly, no detail is overlooked and I have no doubt that in going here folks will have a consistently positive experience.\n\nAs for why it is only marked as A-Ok right now - well, my first time at this location and as with the other culinary dropout I find the food to be good but nothing, at least this time, sent me into foodie heaven. I got the fried chicken and while it was good, a bit sweet for me for some reason. Part of the reason may be that I had the Asian fusion style fried chicken from Welcome Chicken + Donuts the day before and it suffered a bit by comparison. Probably the big thing, the mashed potatoes come across as a bit too smooth - something like mashed new potatoes, done a bit thicker, would be a bit more in alignment with the sort of stomach grabbing mashed potatoes that complement fried chicken - same for the gravy, feels as bit too smoothed out versus say, a thicker gravy with a stronger component of black pepper. \n\nI will say that the sweet potato cannelloni one of fellow diners had was well received and someone else had the M.A.C. burger and said it was one of her top five burgers. Accordingly, I bet most folks will find the food good enough. If one is a bit more of a foodie I would look to the antipasti menu where one can pick a variety of cured meets, cheeses (including pimento cheese - yum!) and other snacks - I saw some boards of those going out and they looked delicious. \n\nOh, the music was at a low (good volume) when my group sat down for lunch at 11:15 and then as things started to get packed, they cranked up the volume - I have a feeling that is meant to help keep things moving quickly or even more likely, I\'m becoming a grouchy old guy but keeping music at a reasonable level so that it adds to the ambiance but does not overwhelm or overshadow the level of conversation seems important. \n\nKey point here, a Yelp review is deeply personal and to some degree we have to throw in a level of "it connected with me" as a diner so that is why it is a  three star - I don\'t hate it but I also don\'t go - wow, that was an uncommonly good eating experience - I\'ll make sure to go back a few times and see if things change as I try more things on the menu, including some of the house cocktails - at the end of the day I\'m extremely happy to have this establishment in my neighborhood.\n\nP.S. - one thing that was amazing, the apple monkey bread with ice cream dessert -  that was amazing and worth getting again. :-)', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2014-12-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'fQbzPP4BunAti5_EcpgLLw', 'review_id': 'OQ_C2Jlb7v1f1dRAx6k7Xw', 'text': "This decision isn't one that I'm happy about. As a first time patron at the Culinary Dropout, I have to say, I will not be returning not because of the food (by the way, the food was OUTSTANDING) but because of the our waitress. On a Friday night, one could expect to have a delay in being seated, having orders taken...but to wait 45 minutes for your drink to arrive after already waiting 15 minutes for your waitress to acknowledge our table, is ridiculous! On top of waiting, a lady in our group asked for her drink three times, in which the waitress walked away twice while the request was being made....I mean who does that? Oh and by the way, never ONCE was I offered a refill on my Diet Coke during the 2+ hours of being there. \n\nNow on to the food, as stated above, the food is outstanding, however, due to our waitress not bringing our food out in a timely manner, my steak was cold. By this time, I had enough of the service issues and just wanted OUT. \n\nThe check arrives, and lone behold, it's wrong...waitress fixes the check, and proceeds to cash us out...our total bill for two is a little over $60, I hand the waitress a $100, and should have received $41.36 back in change....guess what, the waitress returns $41 and no change. So needless to say, your waitress should be thankful she kept the $.36 in change because that's $.35 more than what she was going to get from me. \n\nI honestly hope the Culinary Dropout reviews this and either contacts me for more information  before this waitress is allowed to ruin what could be an amazing experience for others.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 1, 'date': '2014-12-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'tV-CHD0zlQqea54XuogRwg', 'review_id': 'Ed8crCQ-SwYa61W80VCsUw', 'text': "We have been here twice now. \n\nWhat I like - service is excellent. Ask to be in Jay's section! \nThe overall vibe, music, ping pong, corn-hole, TV screens, seating areas & beer selection. An excellent place to hang with friends!\nThings that could improve - very spendy for the qualify of food, if you sit in the outdoor area this time of the year prepare for your food to arrive a little cold, if going for a football game (they have great TV screens) the visibility on the outdoor screens is a little off in each of the areas.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2014-12-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ax17acn_vuNAxORvvGvd-A', 'review_id': 'KxW-Qf-FmJarjiP47hY8Mg', 'text': "This place is so much fun! I wish I could remember the name of our server, he was absolutely fantastic! I even forgot my dessert at the table and he chased us out the door to bring it to us! It was very busy but definitely fun to be able to play ping pong while we waited for our table! The only down side is that it is on the pricey side and as good as the food is, I'm not sure it's worth the amount we spent. Will probably go back for drinks and apps!", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2014-12-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '09LlTKOPOObQi5vqJLbClw', 'review_id': '85LsJfq8i3XSF_FUsLR2CQ', 'text': 'This place is amazing! I like it better than the other locations. It has a great vibe, lots of games and an awesome food/drink selection. Would recommend for dinner or late night drinks. Thinking about going there for nye this year!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2014-12-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'oadAHaxRU2NlVzyJCvrjTQ', 'review_id': 'QJQqx3Nqlh6F1QODfxiWLQ', 'text': "Great food, great staff, great hip vibe. If you are a 20s something you'll love the vibe here. Very cool. Even for a middle aged dude, I love it. \n\nSeating is inside and outside.  We sat outside by a fire pit which was nice. They also have an area for games like cornhole, ping pong, etc.  However you must be 21 to enter!\n\nFood is always good here with unique twists on traditional dishes. Another great chef here.  The Dropout in Scottsdale is great too.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2014-12-30', 'type': 'review'}
{'votes': {'funny': 6, 'useful': 5, 'cool': 2}, 'user_id': 'eL2AbD_vXdP57eewFH21lQ', 'review_id': 'XkXKgsVxNsnMtK6VKYXn1w', 'text': 'I am an extremely huge advocate for how amazing culinary dropout is. However, this location needs to take a few pointers from the other two locations. I didn\'t even get a chance to sit down in this restaurant before being treated like trash by their hostesses. The four airhead hostesses that you had working tonight need to learn their job before being sent out into the world of restaurant hostessing. \n\nI\'ve been a hostess. Your job is just that. To host and to be the first and last impression that your guests  have of your establishment. It\'s not hard to at least pretend to care about your customers.\n\nNow that I\'ve had my rant, let me tell you about my 2 minute experience that left a sour taste in my mouth about this particular culinary dropout location. \n\nUpon walking into the establishment the hostesses just stared and didn\'t even greet us with a simple, "hello". My boyfriend had to stand there for several moments before they acknowledged him. He told them how many it would be (it was going to be 4) and the hostesses, upon him asking how long the wait would be, responded "I literally don\'t even know right now." And we just looked at them. Then they go further on to say, "all of the tables we have for the rest of the night are going to reservations, but you can sit on the patio at an open high top." She also told us that one had just freed up and that we could have it. So, without even offering to show us the way, sends us out to look for the open table that supposedly exists. We go out there, no open high top. We walk back to the hostess stand and say to the girl that there are no open tables. She just replies, "oh, sorry. You can sit at one of the couches on the patio.. But it\'s not full menu."\n\nOh. Thank you. I didn\'t come here to eat dinner. (Sarcasm).\n\nWhen we tell them that we have no where to sit because we want to eat dinner, they again, blankly stare at us and respond with a less than sincere "sorry."\n\nMy boyfriend is not patient and tells them we are leaving because they are refusing to even offer to help us find a table. Again, less than sincere, "sorry" as we walked out. \n\nI understand that it is New Year\'s Eve and that you have a lot of people to accommodate, but your hostesses, instead of standing there at the host stand, clumped together, should be out doing everything they can to try and accommodate ALL of the guests who want to dine in your restaurant. (That includes bussing tables, walking the floor to find open tables, or find almost finished tables). I\'ve been a hostess and a waitress and these girls did not know anything about customer service in the food industry. And even if you can\'t seat me tonight, at least try and act sympathetic and show me that you\'re doing everything in your power to treat your customers well. Otherwise you\'re going to continue to lose customers to Postino right down the road.\n\nAgain, I love culinary dropout as you can probably tell by my previous reviews of the other two locations, but this one needs some work. The other two locations have customer service down to a science.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 1, 'date': '2014-12-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wqwHih7XF1BPSdFyK1U-fw', 'review_id': 'jY6asDrsyJc6Hlth4EyGpw', 'text': "Came here for a friends birthday.... This place is pretty cool... Pricey but cool.\n\nI just love the set up and the food was delicious!\n\nWe were stationed in the middle area in between the main dining room and the area where they amhad ping pong and corn holes. There was a big group of us in the couches and chairs.\n\nThat night was freezing and the outside heaters kept us warm... I just wish they had a bigger area to eat out food because our table had a bonfire type thing in the middle and my fave felt like it was melting when I was eating my food lol.\n\nI got the chicken sandwich and it was sooooo good! I was very happy with it... And my friend got the ravioli... She let me try some of it and I wanna go back and order some for myself! The PaB buger was delicious too!\n\nI was very happy with the food and the atmosphere...plus our server was very good at keeping track of all our orders throughout the night :)\n\nCan't wait to go back!", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-01-04', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '9-H3rn1aNKWg0H2DSbe06A', 'review_id': '4Y7QRiH3JP2qgMdEHCMpjw', 'text': "This was a cool place. My aunt and uncle are h-u-g-e advocates of any Fox restaurant  and have been to the Culinary Dropout in Scottsdale. They were surprised at the decor and lack of an employee dress code compared to the Scottsdale location. I loved the hipster-y vibe and outdoor games! Perhaps no employee dress code because they've recently opened? We weren't sure. Some of the outfits we saw servers wearing we'd hardly call appropriate for a nice restaurant like Culinary Dropout. \nMy family had reservations, so there was no wait once I arrived. We were seated in the main area with cool wooden tables. The metal chairs were cool but not comfy - my cousin and I were sad we didn't get the comfy-looking floral-patterned chairs. \nService could have been better - our girl was hit or miss with us - I saw her pay more attention to her other tables. It kind of was one of those nights where we saw her when we needed to order drinks/food, and then once they were delivered. \nThe food was amazing! Pretzel roll balls and the cheese sauce were great, ordered per my aunt and uncle. Everyone enjoyed their food, but the portion sizing seemed a bit off, comparing pricing/portion for my Ramen bowl to my mom's entree. \nOverall cool place but some kinks should be worked out.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-01-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'BYeNwc-hMZqlCX6wOnreuA', 'review_id': 'U_59-WRvdvR9eeBE_FXRkA', 'text': 'Loved this place! Great atmosphere lots of space to hang out. The food was amazing, we had the Pork Belly nachos and the fondue pretzel ! DELICIOUS! Great drinks & hangout, our server Ryan was awesome too!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-01-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FW5o1j_WytQAT6vGgs7tvg', 'review_id': 'd3kMdui9-A_2alOEOaXXvQ', 'text': 'Fox Restaurants is part of my portfolio of good eats, however Culinary Dropout in Tempe is not 1 of them. First off; the make up air system for the exhaust grease hoods is waaayyy off, when you enter the building you experience the "wiff" of a back alley Japanese teppanyaki grease fryer-smoke sensation, I had to drop off my clothes at the dry cleaners the next morning to rid this odor. If your not familiar with make up air its the air that is pumped in from the roof to provide the exhaust grease hood to make up for the air its exhausting, sometimes too close to an HVAC unit on the roof it gets pumped in for the patrons to breathe and smell. Second; the layout feels like a junior high school cafeteria with tables lined up in parallel, with all the "cool kids" having fun tossing bags of beans back and forth in the adjoining Yard. Third; our server was pleasant, speedy, but lacked a smile, maybe had a bad day who knows? Fourth; we ordered the "36 hour pork ribs", mistake, they were cold, apx. room temperature or just below, I felt like a cave man chewing the hard to separate meat off the bone, after which we asked where the restrooms were so we could wash our hands from all of the bbq sauce, our server pointed the way down a dreary hallway, why don\'t they provide a wet nap at minimum, for the $25 plate they should provide a hot towel! \n\nCulinary Dropout is a great matching name for the restaurant, I think every one staffed there may just be Drop Outs...', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 2, 'date': '2015-01-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'K3LiyDAhLx5L3EZLRigmkQ', 'review_id': 'fecUc2kFbGSk2XR2Sp_-1g', 'text': "I have been here two times\nI can't wait to go back\nAwesome food\nAwesome service\nAwesome bartender Nick\nGreat for families\nGreat for singles\nGreat for happy hour\nSuperior food", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-01-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ZsvWRueYzI1slvgeeHnBaA', 'review_id': 'kzNNQuHq849wIzbNGYdS8A', 'text': 'Food was great & drinks were great too!! The atmosphere was amazing, totally cool. Inside & outside bar with couches & electronic fire pits in the middle. Ping pong tables, corn hole, & shuffle board games in the outside part! So much fun!!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-01-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '6N4vsvEZcc314lmFnqqXjw', 'review_id': '_w4jbrOOgxcOs1NmieJuxg', 'text': "I love the atmosphere here ! From ping pong ,corn hole to the bar I'm a fan. Culinary Dropout/ the Yard is right down the street from my apartment so I can walk there and not worry about parking. Like most bar/restaurants around the mill ave area parking sucks. So be prepared! The seating within the restaurant is comfortable and eclectic. The crowd is diverse as well ! \n\nService : Interesting to say the least ! She kept walking off in the middle of us ordering.   I  really could care less about service as long as you are bringing me my food.  \n\nFood : Pretzel and cheese fondue pretty damn good. The pork belly ramen was pretty bland. Then again I like my ramen spicy! \n\nPricing : Slightly more expensive than most of the restaurants in downtown Tempe. But the atmosphere makes up for the expensiveness in my mind. Also It's one of the nicest places in the area other than La Bocca and House of tricks.\n\nKeep in mind this location is still pretty new , so they are still working out the kinks. Be kind :) and check it out !", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-01-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'd8B0rpK3LRPKry8AXydEZg', 'review_id': 'OF9hEEP2IauQs67co9zlyg', 'text': "Fabulous place! I don't like going out much on weekend nights because I don't like being asses to elbows with other people, but this place is nice and spacious so it never felt crowded. \n\nWe just came here for post-dinner drinks and fun so I can't say anything about the food. Drinks were a little pricey (i.e. a Stella is $7). But they have a a cool $2 brown bag special where you get a random beer in a brown bag. I had wine, but Ryan got one and I think he ended up getting an Amstel Light.\n\nThere are 4 ping pong tables and 4 cornhole game setups spread out nicely in the venue. We played both games until closing.\n\nWill definitely be back!", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-01-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DHoGsTTz5eePKYdX9qn5kg', 'review_id': 'xaL3nD0TOGY8GdJDMiIyQg', 'text': "If you're looking for a quick dinner, this is not the place to go. I waited an hour just to be seated. But on this current friday night (1/9/15), when i was finally seated, it was by one of the most down to earth and genuine waitress, her name was Bri, she was absolutely adorable, always smiling, very attentive and cared about our needs. i went into this restaurant irritated and annoyed but after being taken care of by our waitress i left wanting to come back. The food was great and having the experience of a great waitress made up for the wait. I can't wait to come back.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-01-10', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 3}, 'user_id': 'm9_1jCgU7mvSkL6oLPJT5Q', 'review_id': '6-34qh_Tcoxdz2HE8eSx3Q', 'text': "Let me just admit something right off the bat. I ate SO much on my most recent visit here that I am almost (yes, almost) ashamed of myself. But when the food is this good, you can't stop yourself!!\n\nThe house potato chips with onion dip....OMG, get in my belly! So flavorful and crispy! Then, let's have a little chat about the soft pretzels and provolone fondue...I may or may not have eaten almost an entire basket by myself!!\n\nOk, and then here's my major confession: I am a veggie-saur, but pregnancy cravings have me devouring a juicy burger from time to time and this my friends was one of those times. The pub burger was incredible! Juicy and bursting with flavor! I could only fit half of it in my stomach after the little incident with the house chips and pretzel bites.\n\nThe service was amazing and the decor is gorgeous! They will even give you a tour of the restaurant at any time during your meal. What a great place to hang with friends, co-workers or your special someone. \n\nThe house potato chips, did I mention those yet?? Get them!!", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-01-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'CgfIRB7t_7a8l_MlrUuX6A', 'review_id': 'EBla73legbjSypQi7b6Ukg', 'text': "amazing food and atmosphere? Fantastic service. Can't wait to comeback and bring friends.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-01-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HnBgEYHsGQaL5Q1p-fIefA', 'review_id': 's_Nuzd6j4nLQefYUfbci5Q', 'text': "This place is GREAT!!!! I was a fan of the Scottsdale location so my expectations were really high. This Tempe location is definitely on par. The space is very spacious and beautiful warehouse chic. It is kinda dark in the evening, but has romantic lighting. Now on to the food parts! Our table ordered an assortment of appetizers. The Pork Belly Nachos (more please), the Parmesan Brussel sprouts (yes!), some charcuterie (cheese & meats oh my!). My main entree was the ramen. Very good!! The service was excellent. I had my 9 month old with me, and the servers were very attentive and friendly with her and brought our her food right away. Even though I live closer to the Scottsdale location, I can't wait to return to this one very soon. The only thing that need improving is the parking situation, but in time I am sure it will be less confusing.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-01-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DvhXy5Zp2lF2Lo4oTT3wrQ', 'review_id': 'KCnNUC9rS5YLDRe-FUcZhQ', 'text': 'My wife ordered the meatloaf and the kale/Sweet potato salad; A virtual Carnival in your mouth. The Kale salad contained perfectly mixed hints of sweetness with sprints of tart and bitter emanating from the kale and goat cheese.  While the dressing was light and slightly lemony.  As far as the meatloaf goes -way above the standard but not exceptional -exceptional, tangy, sufficient portioned, tomato and vinegar-based red sauce on top but the meat itself was just slightly above average for the caliber of the restaurant.  I ordered the Brussels sprouts.  I lived in Germany for two years, and have eaten brussels sprouts throughout Europe and America. Most restaurants have no idea how to make brussels sprouts the favorite spot on the dinner plate.  Let me just say this much, the culinary dropout is where you go to taste brussels sprouts if you want to like them. I also had the pork ribs which were also delectable.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-01-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vhos3azFOE0E-YGeJcFVrQ', 'review_id': '1P0uiFGAYeIkQoLOJFRRPQ', 'text': "Great place!  Very unique and cool atmosphere, great service, and the food is outstanding.   The closest thing to my mom's meatloaf that I've found. (that's a good thing)", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-01-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MNtGOpL--258MTLPLj1Izw', 'review_id': 'ToRBnJX09xjkzqaLSPLemg', 'text': 'We have visited this place twice and both times the food was good but the service not so much. We will try it again because the atmosphere is fun and the food is good and hopefully the service catches up!!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-01-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'Cu6Fx8R3GD7xegX87XmAwA', 'review_id': 'Zt5dWIfpQv1eDcxFfRqT8Q', 'text': 'Culinary Dropout/The Yard is an amazing spot. Great food, great drinks, great atmosphere. Plenty of space, full of games and fire pits. I usually enjoy the fish and chips with a nice fresh squeezed IPA by Deschutes. \n\nHowever, one thing to warn you about. Went there the other day and bought two drinks for a friend and myself. The total for both the drinks was $20 after the tip. My card was charged $25 for whatever reason. Called to have it fixed to no avail. $5 is definitely not a big deal at all, but my only concern returning here going forward is getting overcharged again. This place is great besides that one little flaw.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-01-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'wIh4y3bOcqWx6wtGU3T2ig', 'review_id': 'a0Fr4CMugxp7cy_5z_W9Fg', 'text': 'A friend just took me to this place.I must say it was amazing. Food was excellent. Service was good .I highly recommend this place', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-01-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ef3cFjUXJRFTvsDv1gYhUQ', 'review_id': 'WEuB8BKMU-Yo7wk8_pqXGg', 'text': "I'm torn between 3 or 4 stars. Five for ambiance -- great building with a modern rustic feel. Love the bar. Fire pits, an eclectic mishmash of chairs, great lighting, shuffleboard, ping pong -- a cool vibe. Great for happy hour or to watch a game as there are a ton of TVs. The crowd is more on the young side and feels kind of Scottsdale like. It gets very very very crowded, so if you want to get a table get there early. The food is eh. Not bad, but not great. But also not overly priced so I guess it balances itself out. They also have love music on weekends which is a plus!", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-01-17', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 8, 'cool': 4}, 'user_id': 'MqdtOVPREZffdHmRacWKEQ', 'review_id': 'ImPQVWl2iNVuJ30cyL1j-Q', 'text': 'It just goes to show that you don\'t need a formal culinary education to cook beautifully. Culinary Dropout hits all the right notes with its delicious food. Take great ingredients, interesting compositions, and beautiful presentation and you have CDO. \n\nThe place can be quite boisterous as it gets later on in the day. Sit at the bar if you\'re dining alone and have a few beers or some wine. There\'s local Arizona beer as well as canned beers in paper bags. \n\nDon\'t miss the charcuterie. It\'s only $5 for a healthy one-ounce serving of any of these meats. It\'s sliced paper thin, almost transparent, leaving the flavor no space to hide. Prosciutto is classic. A supplement of $8 is what it\'ll cost you for the Jamon Iberico, a truly special kind of meat that comes from special, acorn-fed Spanish black Iberian hogs that will leave you hungry for more. Rarely do I see it offered at restaurants but when I do, I always order it. You should too, as their slicing technique is perfect and the meat is perfectly salty and flavorful.\n\nI also ordered the special (very limited) Korean style ribeye-cap. Ribeye cap is the fattier end piece of ribeye that is normally discarded after grilling or broiling a whole ribeye steak, but the kitchen does wonders with it, recognizing with a keen eye that we should not treat it as a second-class cut of meat. Instead, they marinate it in soy, ginger, garlic, spicy Korean paste (gochujang), and other aromatics, grill it until nicely charred on the outside and medium rare on the inside, and serve it dressed with sliced zucchini, bean sprouts, beech mushrooms, onions, cilantro, raw garlic, and more of the soy dressing. The raw garlic is amazing, providing a zip and delivering a respectful nod towards authentic Korean BBQ.\n\n"Yesterday\'s soup" also caught my eye -- the name on the menu is meant to do that. The name will definitely solicit questions; maybe they should change it. But I enjoyed a bowl of chicken noodle, rich with flavor, as if my grandmother had been simmering a pot of chicken bones for hours. My only complaint is that the white meat in the soup was dry and flavorless. In the future, maybe the kitchen will learn that tender chicken meat in soup is welcome (either dark meat or white meat that\'s just perfectly cooked).\n\nIn any case, the service is wonderful, the space is lively and noisy, and the food is amazing. I\'m looking forward to visiting again and seeing what a culinary dropout can do.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-01-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'TeR1SIGaqN1c8SdEivi5vw', 'review_id': 'Is_x451eyFjdKY00wY5E4w', 'text': "This is a fun place to hang out and grab a quality bite. This place is essentially a megabar with cornhole, ping pong, and TVs everywhere! If you're looking for a solid night out and you're not into the club scene, you should grab your posse and head here.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-01-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '4D4UzEOu-QG4-jkyfynhPQ', 'review_id': 'BtFQdFr_ZS7F8dlFGkuzFQ', 'text': 'I had my eye on the new Culinary Dropout location ever since I knew it was opening in The Yard... I love love love the entire concept and the venue space... There is a lot of parking and there is even complimentary valet... We went on a Tuesday evening and were able to get a table upon walking in... The hostess was extremely nice and friendly... She asked us if we had been to the/a Culinary Dropout and we said they we had been to the one in Scottsdale... Our server Chris was very attentive and great with recommendations... The Fried Chicken was really good and it didn\'t take as long as I thought it would... It also came with mashed potatoes and a veggie that I can\'t remember, but it was super filling and yummy... I had a moscow mule and although the pricing was a little steep for a small "clear" glass, it was made to perfection... I agree with other people and I think that $10 for a pretty small, "not copper" glass is a bit much, so hopefully something changes there, but I did enjoy the drink and can\'t wait to try the other mixes. As full as I was at the end of my meal, I wanted to try one of the desserts (they all sound amazing) and so we went with the Bourbon Black Bottom Pie. The pie was super good and completed the entire meal, I had to roll out of the joint... On our way out, we walked through the "play area" where there is cornhole and ping pong... I like the couch areas with the little fire places, great for "cold" nights... I can\'t wait for the summer to roll around because you know that area will be crazy busy, but crazy fun... Oh and there is an outside-ish bar on the North side which has Happy Hour, all the time...', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-01-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zCes08sxlNrJGG8nwOblKA', 'review_id': '3jSptCOg66NEszmQNeDbUQ', 'text': "The atmosphere of the restaurant was so amazing. The servers have really good customer service and are very attentive to the customer. It's a really nice restaurant", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-01-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'dl6py4gxW2Gxw56VStl1WQ', 'review_id': '7W0UKv7xRVrUIiMXpNXj2A', 'text': 'Great service. Delicious food. Cool atmosphere. Heard a lot of great things about this place and it delivered on every spot. Very similar to Arrogant Butcher, especially when it comes to the delicious pretzel bun on the turkey pastrami, but those are not comparrisons to shy away from. The deviled eggs with prosciutto tasted fresh and the M.A.C. burger was simple, yet savory.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-01-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VPedojSvmBjH9HQWjl17dg', 'review_id': 'h4IE9rXWkmvHPoT8sTrAsA', 'text': "Let me start off by saying WOW! We had the fried chicken, shaved prime rib sandwich, and the Korean rybeie cap. All three were to die for! Cooked perfectly. And the homemade ranch dressing?! Spot on chefs, spot on! Shout out to Gean and Marlo awesome managers who made sure we were having the best experience we possibly could. If you haven't been here yet you are missing out!", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-01-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'gE9OAeJ_IXY575wmI-8YEg', 'review_id': 'woTOH06CV9ucffBLvK38zg', 'text': "This one isn't like the one in scottsdale. Its so much better ! The atmosphere is awesome. Great location for walking around afterwards and they have a great patio. Highly recommend for large parties.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-01-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qJRRu3wERghgSfmJDW85VQ', 'review_id': 'owOLF_7lOnUYoEWZN-Eg4w', 'text': 'Service was  terrific.  Atmosphere was fun, clean and inviting.  Food was very good quality and fair price. We will definitely coming back and recommend to other people.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-01-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'OrDrWxT-66mvNL9ucN8Grg', 'review_id': 'Rca4G72_8BeTnClt540s2g', 'text': "I'm in town bartending for the super bowl and staying in tempe. I am from San Diego and pride myself on great food, solid cocktails, and a rad ambiance. This place is on point. The staff def gets a 5*****. My fav is the raddest Manhattan from my boy Jake killin it in the service well. Brian is full of rad hospitality and helpful recommendations. Ivan's service skills are on point as well as his cocktails and his jean vest. This place is def as rad as all the beards I see. Well played boys. And a mighty thanks. Def recommended!!  Cheers and hangloose baby.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-01-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'iKHwDEjP3aIiOjC2XV8S7g', 'review_id': 'o82RBCSIoaNiBUtP7Hgldw', 'text': "Made a special trip to check this place out and they were closed for a private party. Seriously? On a Saturday? One of my biggest pet peeves when restaurants do this because ultimately, it's not good customer service. Can't recommend this place until I am confident they are open to the public on a consistent basis.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 1, 'date': '2015-01-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'V14fLPJmEVXdtGR1MTELlg', 'review_id': 'DAy16zfHksQpkKeuwZwm7w', 'text': 'Great service. Great evening. Thank you !!  Ryan is a rockstar!! The entire staff went above and beyond making an epic Super Bowl Event!  Well done all!!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-02-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JwaxWcEG0R_uHAxmbjyIiw', 'review_id': '_APGMGKNTCB0f-vf5rDz6A', 'text': "As far as hip Tempe places go, this is a great place. I figure this is a lound happening place for people to go and see and be seen, have a great drink. For the rest of us that want to eat something nice, well.  if they are trying to make a cool foodie place they missed the mark.  The food reminds me of Chili's or Applebee's, not a Culinary place. Too over priced for a place that doesn't hit the mark.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-02-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'EJiF5leWLl_AGres0DwoFA', 'review_id': 'cC8CNfTF6Yx_BKOFAXdkSA', 'text': "Tempe, Arizona\n\nOut of towner's perspective.  The vibe and service were 5-star.  Seemed to be a very 'Trendy' place with a lot of pretty people if you know what I mean.  Being a loner I sat at the bar where I was served by several barkeeps. All were excellent.  \n\nMy food was really pretty good as well.  I had some of the mix and match anti-pasta items and the Korean Endcap.  Both very good.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-02-05', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 4, 'cool': 2}, 'user_id': 'q9XgOylNsSbqZqF_SO3-OQ', 'review_id': '1cYDYDQqbFo3bWTGuXwgNw', 'text': "I like Culinary. I am fond of the space and the patio (The Yard) is beautiful. You can't go wrong with ping pong and corn hole although I didn't have time to play on my last visit. The service is usually pretty superior too. \n\nI came for lunch the other day and I think we were the first to arrive. The chopped salad that I ordered was delicious, it had salami, provolone, turkey pastrami, ham, pickled vegetables and large couscous. It was so big I couldn't finish it. \n\nThe only drawbacks are the prices which are a tad steep, and that they don't have any wine specials during happy hour. Either way I know I will be back, this is a great addition to Tempe and I am sure the college kids will have a blast playing games if they can afford the beer.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-02-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PvXHuR6SzPADSnb7cI5uOA', 'review_id': 'sG3gDgLZJyZQjRgqMZQIfg', 'text': 'I really enjoyed our recent trip to check out the new "Yard" location.  I have always enjoyed culinary dropout, it is hard to keep from indulging in everything on the menu!  I always love their array of cheese and snacks to start off with, it is hard to choose between the Pretzels and the Meats and Cheeses!\n\nI had the Italian Chopped salad and had the rest for lunch today.  Though, they really made the lettuce more of an afterthought and was less salad than I wanted.  My boyfriend had the Shrimp and Pork Belly Ramen, and said the pork belly was nothing to write home about, but good.  \n\nThe space itself is very beautiful, but we were sat in a half booth that backed up to the cornhole games, and personally, I would not want to sit there again.  Randomly having some guy yell in my ear is not what I want.  I felt that was different from the Yard in Phoenix because the dining and the games are a little further apart.\n\nAll in all though, I look forward to my next visit!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-02-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KmNWM5AlYVGEAYrenRUcsg', 'review_id': 'ckZ77MZh04FiUaR-rj38jA', 'text': 'Went here for the first time for appetizers and drinks. The pretzel bites with cheese fondue are amazing! My drink was good too...it was a champagne sangria. Our service was amazing as well. The prime rib sandwich was very good too. I got mine to go since I had an appetizer. Everybody at our table was happy with our food and service. I plan to go back.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-02-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 7, 'cool': 1}, 'user_id': '6fNsUZe4mAFZQ0kvdPLSFQ', 'review_id': 'F87nCO4ovsStIdcM4gef5A', 'text': 'Incredible atmosphere and food.\n\nWhat peeved me about this place is if you order an appetizer and drinks, the food always came out first--something that is really confusing for me.  Not to mention the poor service that came along with it.  I came here to celebrate my birthday and left rather quickly because the drinks were coming out so slow.  Our waitress was very nice, but she had no interest in actually doing any work... \n\nAnd to throw one more thing on top of it, I showed her my email from fox that stated I was entitled to a free dessert... She never brought me out the menu again so I could choose one. Anyways, by this time I was ready to move onto the next place!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 2, 'date': '2015-02-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'sxkHVRgj6NrWrrSQ9HuYIw', 'review_id': 'gKdVnBqjr3oc2N8nav6pzg', 'text': 'I love this place! Service was great, food was good. The yard reminded me of all the fun times at my grandparents. All the vintage decor brought back many childhood memories. We will definitely be a returning customer.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-02-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Hq1Bx2DEJbTMhmGbPxtIZw', 'review_id': '43BtoNCMBiCibzQ8LjV7jA', 'text': 'I am a huge fan of Fox Concepts Restaurants, but not this one.  Not much ambience for me with the industrial look, but others seem to like it so maybe it is personal taste.  Went there for the second time today - this time  for happy hour.  No wine on the happy hour menu and the food offerings were deeply discounted, but sparse.  I had the meatloaf sandwich and finally found the meatloaf after peeling off the huge layer of bread on top.  As a Tempe resident, I am very excited to have this new Fox restaurant and hope it does well, but it is off the beaten path and pricey and will have to compete with other new places like Postino, which offers pitchers of craft beer for $5 and wine for $5/glass until 5 pm plus delicious food and wonderful ambience in the beautifully refurbished  old Annex Building on the ASU campus.\n\nThe service was great.  I sat at the bar and the staff was very friendly and accommodating.  Good luck, Culinary Drop Out.  We want you to succeed.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 2, 'date': '2015-02-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'vUBWg3dXVCDWvbGwWLrpbw', 'review_id': 'lGqVf6gzsJytIjgbXI6kLQ', 'text': "The place is impressive. That's what get's all most of the stars.\n\nI'm not a fan of FRC food, but this time I had something half decent. And at a reasonable price, on top of it.\n\nMeatloaf it is. The beet salad was OK too.\n\nIt's not cheap but at least I didn't leave disappointed as it usually happens to me at Sam Fox's restaurants. \n\nThe service was barely OK and the valet parking was rude.\n\nI'll go back once in a while but there're plenty of better options in the neighborhood (unless you want to be seen in a cool, overrated, overpriced, mediocre place, then this is your spot!)\n\nCheers", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-02-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'brANKFEue-5LtY_BNqe5xg', 'review_id': 'Efm9_vhtqitXdrF_IgQwXg', 'text': 'Fun and trendy! Our waitress was very attentive even though she was slammed. Pretzel fondue was amazing, I recommend it to everyone.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-02-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': 'TIwqQZm6dxnd2491UJYs5A', 'review_id': '1Q9WmqEnTQ5YSvNItGD17Q', 'text': "We love Culinary Dropout.... but not this one.\n\nThis one is new (opened almost 3 mo) and seemed very chaotic with the staff.  Unfortunately, this was the first visit for 3 of my family members and it may mean they never return to a Culinary Dropout.  It took 15 minutes for drink refills (water included in that).\n\nWe had their famous pretzel and cheese appetizer.  That was delicious.  My brother had a burger and found that it was good.  My sister in law had the chicken salad and said it was way overdressed.  My mother had the nachos app and disliked the thick greasy chips.  I had the ramen soup and it was so salty I could't eat the broth and barely any of the soup.  gross!  Given that it took 15 min for drink refills I couldn't choke down the soup.  \n\nThey never came by to check on the food so none of it was sent back, we never saw the manager but at the beginning when he came to change a chair out telling us we couldn't use that one even though the hostess had put it there.\n\nNeedless to say, we will not be returning to this location.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 2, 'date': '2015-02-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dcHpmt6nQnpVamCdGIKJ-A', 'review_id': 'CRAOxeEX9NgS_A_BdepRJQ', 'text': "The atmosphere is amazing. I went there last night and sat at the bar with two other people. The service started out fine, but by the end of the night the bartenders and servers were more concerned with closing down then helping us out even though it was only 9:30 or so.  We had to 25 minutes in between getting our drinks until some random guy walked past and we grabbed his attention to order food. He wasn't our original bartender/server. The pretzels and fondue are the best thing there hands down. Everything else we had was just all right. When our food came the food runners didn't ask if we needed anything else. We had to wander around to other tables to get silverware because we couldn't get any servers attention. I've been there one other time and the antipasto platter is tasty also. The drinks were anything special. \n\nOverall \n\nAtmosphere/location- 5 stars \n\nFood- 3 stars \n\nDrinks- 2 stars \n\nService- 0 stars", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 2, 'date': '2015-02-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CDVYgq-NWa5vhOXO48ZoLw', 'review_id': 'E_1uQIa0fDplquMrA2m8xw', 'text': "Weekend trip to Tempe, and I ate here twice - this place was fantastic for kicking back and grabbing a drink and some snacks. I'll definitely be back next time I'm in town.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-02-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'g1C0lluSl81omBYrw2vLlA', 'review_id': 'l2OrQb59cLGujxNjNeCqpQ', 'text': "This place is freaking awesome! Totally recommend this to all my friends and people coming in looking for a chill hangout atmosphere! Will definitely return soon! Can't beat $3 happy hour mugs (includes all beers)!! Woot woot!", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-02-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hnlDR0-5pVOOodXPmcQ5qw', 'review_id': 'COIpchGayXO7Cfbd5sJlAQ', 'text': 'Amazingly good. Fun spin on food. Great cocktails. A truly unique and awesome dining experience. Next time I want to try the pretzel bite fondue. It looks amazing!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-02-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oYjiNjLKZ5o9a12Zt0fOvA', 'review_id': 'zhPq6f3jT2UInrXr01enKQ', 'text': 'Only have been here once on a Sunday for lunch. Really a neat place! Huge with alot of cool areas to hang out and eat /drink/play. Its bright and comfy! Our service was good..no complaints. My husband and I shared their Pub burger/fries with a side of ranch dressing which they make there. It was different  and we enjoyed it with our fries. Lots of neat things on the menu to try and we will definitely be coming back! Will adjust our rating as we go, so far so good!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-02-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'aJMXwwUYzKCBWilNDCJhgQ', 'review_id': '3YVHgpLFT1lKhNS9h8QJtw', 'text': "Culinary Dropout is a great place to get good food and be very social. This location is great for groups and has extra things to do because it is connected to The Yard so you can play ping pong, cornhole and shuffleboard. \n\nLindsay was our server last night and she was great. Customer service was on point and she has a sense of humor. \n\nIt's a little pricey but you're paying for the environment.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-02-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'RyX1dtn2eACiehBSj7rxEw', 'review_id': 'IazYjZ1juv-PfVwcf1bkkg', 'text': "We to Culinary Dropout one evening which I've seen many times right behind Mill Ave. The reason I was excited to go by was because it was still in Tempe but not right on Mill. It was really busy as it was a Saturday night but we were able to find a seat at the bar after just a few minutes of waiting. The bartenders were very helpful in recommending drinks and ensuring everyone got refills in a timely manner, etc.\n\nDuring our outing here we ordered drinks & the pretzels and cheese fondue. The pretzel bites were really large, warm, and soft. They weren't overly salted & went well with the cheese dip and our drinks. I'd definitely recommend getting those to munch on.\n\nIt was really crowded so unfortunately we didn't get to play any games but they had ping pong tables & corn hole. Many of the patrons sitting at the tables seemed crowded by those standing around the bar area & wherever there was space; I definitely want to go back to enjoy some more time playing games & also grabbing some dinner at this location (we've been to the one in Scottsdale) but maybe when it's less busy like on a weekday.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-02-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'onPPIsOuapHADtNxwdQclg', 'review_id': 'RpaDrVvUPcO-qmqqhWEgYQ', 'text': 'I absolutely love this place... great atmosphere, food and entertainment', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-02-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'Qllc3ntOgU-kNeBQegBgUw', 'review_id': 'pusDqUWPYW6Uqg4mPkf4Yw', 'text': 'I found this place on Yelp and the reviews were accurate.  The food was very good and the service excellent.  I went there two nights in a row.  First night alone and had the trout, it was great.  My waiter, Joey, was great.  He was helpful in suggesting choices of food and beer, plus he was really nice and made my night a great experience. So much so I went back the next night with a coworker to try the Korean steak.  It was great and our waitress, Jackie, was awesome as well.  She made it another great experience.  Great place', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-02-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '_cqqeQaaE3-ZU3GlmmEQ2A', 'review_id': 'dYgX6EtyLcpI51z7OjqYOw', 'text': 'cool place, house potato chips are delicious, big open bar with plenty of seating, definitely recommend it.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-02-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'yuOd0AGt7YK8QjtXzvt6hQ', 'review_id': 'RtXzj8-HG6KlaFnAvxAsHw', 'text': "I think this place is so awesome!!! It's so different and exciting. We were seated inside and got an extremely comfortable leather booth.  I do wish we would have been seated outside but maybe next time.  We ordered the pretzels and fondue and it was awesome!  Huge portion and worth the $10. Also tried pulled pork nachos and the chips were bomb!  \n\nBurgers and fries were good too but next time I'll try another burger.  Mine tasted too similar to big mac. \n\nService was great.  Waiter was attentive and gave us to go beverages.  Very courteous.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-02-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '1o1yT8fVKcSQxZNTpeShtg', 'review_id': 'lgs5aY6VF0gh2eKnV60WLg', 'text': "I'm a big fan of the CD  concept and for good reason: they make some of the best sandwiches/Entrees/Salads  for lunch  in Tempe . It's gotta be tough to carve out a niche amongst the tough restaurant competition in Tempe, but CD has done it, and done it well.\n\nThey have a good menu of sandwiches and Entrees available, including burgers, cold cuts, hot sandwiches, and vegetarian options. You can find down-home staples right next to globally-inspired experiments, and it's all delicious. \n\nOne of their staples is the meatloaf, which is great. Thick, crusty,  Its Tomato topped with a thick slab of griddled meatloaf, beans, and  sauce. It's a mouthful, and it's great. Not for the faint of heart . \nService from the minute I walked in were on it , from Chris who sat me to Victoria my waitress who was very professional and atentive going as the extra step and bringing me a great cup of coffee  .\nSam Fox has another winner on his hands .", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-02-26', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 2, 'cool': 2}, 'user_id': 'L8miNJHnvMBeazs58_nGgQ', 'review_id': 'Z3nSaKMUvQtIUdZxkz8nWw', 'text': 'Culinary Dropout is setup with 3 unique and very cool themes. The first part reminds me of a swanky apartment. There are plenty of tables and would be my pick if you were going out for dinner to enjoy the "gastro" part of this gastropub.\n \nThe second section is The Yard - a covered patio with plenty of patio couches, fire pits and backyard games. This is where I spent all my time so I\'ll tell you a bit more about it below!**\n\nI believe the third part is called The Shed, or the Garage or something like that. It\'s a smaller, very rustic, barn-like building at the far end of The Yard and looks like it could be a whiskey bar or something to that extent. It was closed at the time so I didn\'t get a chance to check it out.\n\n**I over heard a guy and a girl talking about how much they like corn hole.\nI looked at them like a cow looks at an oncoming train. You could hear my eyelids blinking in confusion through the silence until another, more savvy Canadian at our table filled in the gaps for me...\n\n"It\'s that bean bag game, Dale." Suddenly it all makes sense!\n\nThe Yard is awesome. It\'s like a gentrified version of cousin Cletus\' famous family BBQ - Fried chicken, pretzels, fire pits and games galore, including (you guessed it) Corn Hole! Maybe I\'m taking this a little far. The Yard is by no means redneck. It\'s relaxed and quite lovely - you could hang out here after work, bring the the kids, go on a date, or yell belligerently about your college football team late at night. I have no doubt that this place must draw quite the party crowd on weekend nights, but you don\'t need to be that crowd in order to have a good time here.\n\nThe food is and upscale version of American comfort classics. Even though I was pretty fooded-out by the time I arrived, I still suckered myself into the fried chicken and I regret nothing. So dang delicious and served with a sweet sauce and a slice of corn bread.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-03-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'YkVy1Tvenj6TXm6tZ8eYCg', 'review_id': 'NG6JjCuzWrZ7n4WMDNfD6g', 'text': 'Good food, great service, and an awesome atmosphere!  This place is a must for anyone visiting and looking for a good place to socialize, eat, and drink.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-03-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'f6cj5osEFdWILMjta_BSGw', 'review_id': 'iDw-afFRAnoQowusVAiFuw', 'text': "My boyfriend and I have been here twice and really liked everything about it, so I decided I wanted to have my birthday here. I called a week and half in advance and they told me they couldn't reserve the spot that I wanted for my party but I could come at 5 and wait around until 7 so I could save the spot. I declined. I had my boyfriend call back the next day to see if we could reserve a table or tables in the patio area for 12 people. They said yes they could do that. Today the manager called my boyfriend back and told him that they couldn't reserve a table for a large party after 6pm (party at 7). They told him if we wanted a table at 7 we would have to come as 'walk-ins' and take a table that was available (if there was any available for that many people)\n\nOverall I felt very discouraged and unwelcome. What Resturant doesn't take reservations for large parties? Wouldn't a Resturant want to have large guaranteed party to come in to spend money at their place?\n\nI highly doubt I will go back anytime soon which sucks because that place is pretty cool but their policies and staff are not!", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 2, 'date': '2015-03-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lzIyGPLGbSP3wPzDim2IOQ', 'review_id': '0LvEHZgAaECiMhQieJO1RQ', 'text': "If you want to stare at cute college girls, you picked the right place! If you want good food or service, drive to Scottsdale or Las Vegas. 3 attempts and all we experienced was long waits, cold food, and bad service. As someone who loves the fox franchise, it's sad that their name is on this location.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 1, 'date': '2015-03-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6MkOKVxt_Mz8nb1LHrkWwg', 'review_id': 'juuH77YFSyJOCzwQBKmibw', 'text': "Love the one in Phoenix but the service here is horrible. Waited 40 minutes for table (mind you they were not busy) I received a text at 3:25 that the table was ready and didn't even get seated until 3:40. I asked to speak with a manager ... James came over and apologized and said he would make sure the food came fast. I was in the service industry for 5 years he could have at least offered an appetizer or small discount. I love Fox Restaurant but I will never come back to this location. They were more than staffed to handle this volume and they seriously need to get it together. I witnessed two other complaints.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 1, 'date': '2015-03-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'HvluxguF--aQ4XcgSfaXWw', 'review_id': 'sFxr4HTLHUxWM8mH5I4whA', 'text': "Terrible service and there is no accountability.  Servers are way under staffed, running around and losing track of tabs (every time).  The manager thinks he is a big hot shot mover and shaker.  We went there for a co-workers birthday and it was a nightmare!!!  When we asked to close our tab they had lost both of our credit cards.  It took them 45 minutes to locate them.  The manager's idea of rectifying our issue was to give us a buy one get one free beach cruiser rental (No Joke)! Great games, drinks, food, and atmosphere!!! Unfortunately, the service ruined the entire experience!  Stick to going to their Scottsdale or Phoenix location! No complaints at those locations.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 1, 'date': '2015-03-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'OC-NUpjh48_rDYrpslmg9Q', 'review_id': '5BrdAVoUT8K5n-qjcs71yQ', 'text': "It was a great night here!!! Great staff! Very awesome vibe! Good food! I would definitely come back again. The only think to say about this place is don't come hungry and expect to wait about an 1.5 hours or more.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-03-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SbzwdyCNXsYjHrPeNdnx7Q', 'review_id': 'vi499CJ526PYtO9GjXEFfQ', 'text': 'My boyfriend and I had such a wonderful experience here. The environment is so lively and carefree. The live music on the weekends is fantastic and the food was absolutely delicious. The service was outstanding as well.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-03-08', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 4}, 'user_id': 'UsTUcm5ZFP_kqh0bNkFL4g', 'review_id': 'i0Hoc53sASiJikqzQSyfhg', 'text': "This is definitely somewhere that requires a return visit! \n\nWe were quite a large group and were seated out in The Yard - a large covered patio space filled with cosy couches, tons of super hot fire pits, and games. Sadly I didn't get to try the games this time around but hopefully I will next time - I feel like that could have been a highlight!\n\nWe sat at a fire pit with a large L-shaped couch on one side, and several adorably mismatched chairs surrounding the other two sides. The fire pit was HOT, seriously hot! Open flame and booze seems like a risky combination to me, but who doesn't love a good backyard fire pit?? \n\nIt was a little tricky eating our meals off the side of the fire pit, and there was more than one occasion that had me concerned I was going to a. set something on fire, or b. have a melted beer glass from the sheer heat of the flames!\n\nMy beer was quite tasty - a good local brew. We shared some tasty devilled eggs, some ok potato chips (a little greasy and under-flavoured for me), and some well done hummus (you can't go wrong with hummus!). For my main I had the grilled cheese sliders; I'm not sure what I was expecting but the flavour wasn't quite there. The three little sandwiches were super cute and filled with well melted cheese slices, bacon and tomato - great for when you're looking for good throwback food to your childhood!\n\nI'm looking forward to my next trip here - I think it has huge potential and I had fun, I just think I could have a lot more fun next time! :)", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-03-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Zs74cSZXcDXC0mRMmWg_Ew', 'review_id': '1vuggqbDs4hzTQzAiOJ6YA', 'text': "Big space, I hit it early , during happy hour,  $3 draught beers.  I love hand cut fries, they have these on the menu and they are just ok.  I suspect that a person in the back feeds them to a machine., better than super processed for sure.  I also ordered the Thai wings, the wings were just ok for the wing snob, but OMG I could have eaten 5 pounds of the slaw, cashews, sesame, lime amazing - I will try to reproduce it.  Service at the bar was both great an not particularly attentive, especially given how busy it was, not very.  I may be high maintenance,  though I wouldn't have guessed so.  All said I would come back, bring friends.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-03-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XYOnJxW6apvJFhhBcuFyCQ', 'review_id': 'r5hf1oBLDGFIUPO7yXBKaw', 'text': 'Both locations (Camelback and Tempe) are fantastic! If you are looking for a relaxed, chill atmosphere where you can sit back and enjoy great food and great service, I highly recommend either location. This is now one of my favorite places to visit. Love it!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-03-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GCauq1MARyH48AXpOsoMBQ', 'review_id': 'N9B6pgPUyPyh4NXUI6uX9w', 'text': "This place is a much-needed restaurant in Tempe. I'd describe it as a mixture of hip, fun, and classy, and the food reflects the atmosphere and taste of other Fox concepts.\n\nThe service was what really pushed me to write this review. Over the past couple visits, our waitress, Taylor, went out of her way to make sure that our party was absolutely happy. It was refreshing to see such great service, and we'll be sure to keep coming back!", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-03-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '_CZEVp2gAryC41auedsREw', 'review_id': 'FP-1zJ_0lQDhoRV9BiPZlw', 'text': u'I had the pork ribs with jalape\xf1o and molasses sauce It was unbelievably good The staff was very nice and helpful The new culinary in tempe is friggin huge! Definitely a spot for a huge group to go together One thing I will say is that all those hipster bartenders need to shave their beards', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-03-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ODq0AXGKtuezjwoVrVUpEg', 'review_id': 'gwhxrqNzRcYwS0IblsaLqg', 'text': "Breakfast Sat AM: overall okay. Food was quickly served, which was good since there weren't many people around. Service was attentive, also a good thing considering how slow it was (sometimes servers slack off when it's slow). \nIt was pretty empty so got the pick of seats, asked for shade outside, but the hostess tried to sit us in 1/2 sun. She was nice enough after asking again to move us to full shade. \nEgg white fritatta was good! It was served with Kale but that was kind of tough; doesn't look like they massaged it well enough to soften it up. \nFamily had eggs & bacon, and biscuits & gravy. Expect french-style bread- quite crusty so unless your mouth is used to it, it can hurt your upper palate. However, it was toasted on the grill and buttered nicely. \nBiscuits & Gravy was good, but oddly had American cheese on it. I was put off, but my brother liked it. \nIrish coffee wasn't really. Not sure if this was the SAT AM bartender, or not. It was just Jameson and coffee, no cream, no sugar.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-03-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'LR858TVV0JpI_GOU1Y8cEQ', 'review_id': 'QKmGfZpUMDTcRTykFd8l6g', 'text': 'Unbelievably unreasonable business practice. They won\'t take reservations for a group over 12..... How does that make any sense? "We will take your money if there are 12 of you, but we don\'t want the extra money from the other 8." Business must be so good that they just don\'t need loyal customers or groups.....\n\nWon\'t be back.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 1, 'date': '2015-03-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'LblDJ0Ti33kxdRlTcsydUQ', 'review_id': 'DLbhmAR3xUid_rbajl7jeQ', 'text': u"My wife and were in town for one night on our way to visit the Arizona deserts and we stopped in here for an early dinner... Wow!\nMy Pub Burger with fries, complimented was a side of freshly chopped jalape\xf1os was delicious! And to finish our dining pleasure, we wrapped it up with fresh-baked Monkey Bread for dessert. Double tasty! Also, our ASU server, Shawn, was very friendly, attentive and engaging, adding to the experience. Love it!\nThe Culinary Dropout building was originally a retail lighting store for over fifty years and the current application of subdued lighting reflects that history, as well as creating a relaxing, casual environment.\nVisit... you won't be disappointed!", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-03-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vzViQv_srWKnqrfbrd3Rmg', 'review_id': 'o3zATtpy2IeYOD-tF35viA', 'text': "I've been here two times. The first time, so delicious. If I were to have done my yelp review it would have been five stars at the time. My second time at this place not so much. My food simply wasn't not as amazing as it was the first time. I ordered about sandwich this time and honestly, it came out about room temperature. A little disappointing.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-03-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HvluxguF--aQ4XcgSfaXWw', 'review_id': 'g66Rh3BWfC5QLC8LRwdggg', 'text': "Went back a second time for another birthday with a large group.  It was a little better, and our wait staff seemed a little more experienced.  Bottom line, they do not do well with large groups.  The young hipster staff act like they are entitled to a 20%+ tip, and that they don't have to work hard for it.  2 strikes, probably won't go back for a third time.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 2, 'date': '2015-03-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '9yLmJ65HFdGgYPW9LA-dUg', 'review_id': 'briHxC3yKhhoJlu5rdOd0A', 'text': 'Came here with a group for work. I made a reservation.  We were seated at a table in the rain.  Upon our request not to sit in the rain the hostess sat us at another table with the understanding we had to leave within an hour because that table was reserved.  She did not appreciate my logic of sitting some other dummy in the rain. The service was odd, indifferent and slow.  The food was just ok.  It was $350 for 8 people and completely embarrassing.  Stay away for business functions.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 1, 'date': '2015-03-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9JnaX9lai40OQQfXAoLqFg', 'review_id': 'LK0NJhDKXt8FD6KyMplfWg', 'text': 'Well we just happened to stumble onto this restaurant the other night because we thought the name was funny.... It was one of the best stumbles EVER!\nThe antipasti selection was wonderful and almost everything we ordered was mouth watering delightful! The only "meh" item was the "spreadable chorizo" we were expecting something....well...spreadable, instead it was just a slice of chorizo cut in half. But other then that everything was great and I Highly recommend the deviled eggs!!!!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-03-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'bss89AsBdrRC-JL-1lrsHg', 'review_id': 'D-z_mNa9seC6vwJy22OnAg', 'text': "Exceptionally knowledgeable server had gluten free suggestions. New eclectic loft decor with play areas. Appetizer order form for prosciutto, olives etc. Fish and chips were orange and had spicy coating. Bbq ribs soso, over priced. Shrimp Cesar salad ok, nothing special. Banquet rooms seem to have $100 per person minimums.... It's new, trendy for hip young professionals.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-03-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'MGVbnW9-eYx_DDXmWIpGRw', 'review_id': '1e64Ry0MiICfnVBE9BzKKg', 'text': 'I gotta tell you ..... I love the concept and the general format rocks.  So forget about what\'s good about this place  and let\'s talk about the elephant in the room.  \n\nMaybe the worst service I\'ve ever seen!!! The wait staff is confused and completely unorganized \n\nPlease, I\'m begging you ..... Don\'t make me beg for a cocktail.  The staff is "nice" enough but we were there today with a group of maybe 25 people (happy hour) and with a bit better service,  the bar tab would have doubled \n\nI\'m not going back .....  What do you think?', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 1, 'date': '2015-03-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7rYQbQ8ib2Cx7YXTOTCZMw', 'review_id': 'zrpW8518_5dtNnUV71ykZg', 'text': "So we went on a Friday night and their valet service sucked! Awful.\n\nThe hostess uses text messaging to tell you if your table is ready which is an excellent option, and one more places should use.\n\nThere was about an hour wait for a table so we went back to the bar in the cube, and service was slow until a guy named Matt came and took our order and was easily the high point of the nite. \n\nIf you see a happy bartender with a bushy beard, and he is taking care of you, you will know you are in good hands.\n\nWe didn't get service from a server, but our busboy went out of his way to keep our water filled and empty glasses and coors lites off the table, which in some places is a forgotten art but not here.\n\nOur bartender Matt recommended the turkey sammich which was great, the Thai wings and nachos were also good. \n\nIn conclusion, I walked in with a real shitty opinion of the place because of their valet service, and left knowing Matt the best employee in the building, and California the busboy and they made up for everything and then some.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-03-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yLZNHSIWMeEaWdreELWAGw', 'review_id': '1j3c3vYFzqk667l90ony8Q', 'text': 'Very cool place, had the antipasto which was awesome , lots of fresh deli meats and asparagus and special breadsticks , excellent, the salmon was great Andy friend had the fish and chips, and another had the chopped Italian salad, all great!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-03-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'aJNzWa4aP6wBfrR7R8tY3A', 'review_id': 'ZqOEVfOtD7SVoeXX7ujGnA', 'text': 'Pretzels with cheese dip on a warming candle, awesome.  Burgers big enough to share, fried chicken good as well.  Wings not enough meat on them, these chickens. Tricerahops on draft and wild blueberry lager, interesting. We even picked more up at BeV Mo on the way back to Cali', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-03-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VXmr5JDeHpSJleLETYUl0Q', 'review_id': 'ZPdIFLNiSfZ_Uxm5t9xxWQ', 'text': 'Dude special order the italian hot with a sesamie briouche bun\n...baguette, nah, forgetta a bout it! They dont know yet their menu standard can be jacked up to a better version. Ask Mike for the killer mescal margi pictured', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-03-22', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 4, 'cool': 5}, 'user_id': 'ax8rl8kEo3r4lBtuf39X1w', 'review_id': 'LuQYCBtykHKx_navMzYJuw', 'text': "Whoever decided to put this bad boy together is a genius. It's casual but cool, funky and fun, sportsy but sexy. It's really got something for everyone and I have to assume that it's regularly packed with patrons. If I had a backyard, I'd totally build this bar there. \n\nOur food was decent -- I had a good salad and nibbles off the appetizers but nothing that stands out to me as gastronomical bliss. It's got a solid selection and range though and our servers were pretty prompt. I get where they're going with the fire pits but I think the execution leaves something to be desired. \n\nFirst, glass near fire seems problematic. Also, the fire pits are like really on fire. So you can't reach across the area to share and it becomes this odd game of pass the plate. Our water glasses were hot to the touch and you can imagine what that meant for anyone with a wine or a cocktail. Their menus are paper... and as it turns out, paper can catch on fire. Ours did not but I see the potential for serious hazard. Not sure how you remedy this architectural snafu but maybe turning the blazing pits down would be a good first start. \n\nIt's legit though -- I'd come here for some beers and pretzel bites, a round of cornhole and some flaming fun.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-03-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '2Sq7zaX-48ZD44x_Y-igCA', 'review_id': 'uQZxUlaicDIZ9lKVwg4vvw', 'text': 'Loved the atmosphere and the decor. The menu had a great selection.  The service was, as others pointed out, a bit sketchy. Our fries were cold, but they brought us hot ones. We never received our second round of drinks. However the food was really tasty.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-03-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'RM16Mr4RAPFNx3Q40cWKAg', 'review_id': 'WYKUjobaCBCmNQCZQJwvrA', 'text': 'When I first heard of this place, I was very intrigued by it. I loved the concept of the big open floor and live music. When a group of 11 of us went there last week, we were not impressed. The service was terrible.  It took 25 minutes for the waiter to come around and take our orders. After taking our order, the food took about 40 minutes to come out. Unfortunately, they forgot to place one of our orders. It took another 40 minutes for our friend to get his food.\n\nAs for the food, it was terrible, at least for me it was. I had the beer batter fish and chips and I felt like I was eating  cardboard. It was flavorless and tasted like it was fried in old, overused oil. However, my husband had a burger and he loved, but seriously, can you really go wrong with a burger? \n\nThis place is just not amusing.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 2, 'date': '2015-03-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IQgBfNzJ1xlF2YOo6GnFNg', 'review_id': 'I3j2qw3NsFAeqz2knJDFkA', 'text': "Great location, artsy, cool, fresh, and it won't break your bank. Appetizers were great as well as their beer selection, and the ambience was fun.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-03-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dx6SrvzyCdPF0p0HovjcqA', 'review_id': 'QwHdS0-NPlNfapKsfJ6gqQ', 'text': "Okay Culinary Dropout round 2.  We hit the one at The Yard a couple weeks ago and last week for lunch I brought my kids here.  Yep, I'm one of the few people who think it's important to train our next generation in appreciating food, atmosphere and service.  And how to behave in restaurants.  And to let you know my kids are both double digits.\nSo it was lunch, on a Wednesday.  Things were pretty slow, as I was hoping I really don't want to be hanging out in a bar with my kids.  BUT the food was so good the last time I had to come back.  \nService was not as amazing as it was at the yard, I feel that Jeff was a gem in the culinary world.  It was good, Ashlinn didn't warm up to us until half way through our meal. She was surprised by my children food selection and their conduct.\n\nOur meal!  Yes the most important part of the review...  My son ordered the chicken club sandwich.  He devoured every bit and said it was even better than our favorite place back in Wilmington, Nc.  My daughter has now deemed their muscles the best EVER.  I concur now that I've had them twice, in 2 locations... and the bread. YUM! They finally sold me a loaf as it was mid week (YAY! and it turned into THE best french toast I've EVER made, topped with strawberries and my amazing 'little bit of heaven' vanilla sauce.\nI had the Shrimp Caesar again... there is something either the breading on the shrimp or the dressing it like crack... YUM.\n\nCulinary Dropout has quickly become my favorite place to grab some grub.  It's amazing food and atmosphere, I love how every thing is so casual.  If I were 20 years younger I do anything to work here.  I now need to check out the Scottsdale location.\n\nThank you Culinary Dropout!!!!", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-03-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'swy98NZE1tGgV-4v7GqqSA', 'review_id': 'Av9U9UD42qHHzqDlJ6g6Kg', 'text': 'This place is awesome!  Reminds me of the Duce.  It has that laid back hipster feel.  The great thing is it breaks the mold on traditional eateries in that it encourages you to get up and mingle, or sit back on a couch by the fire while you eat.  It is an extremely casual atmosphere with great decor.  There are various activities like cornhole and ping ping to play.  \n\nThe food menu is a great.  There is a wide variety to suit all levels of adventure.  The fried chicken is a great choice.  \n\nThe drink menu is plentiful and they have very creative twists on old classics.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-03-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'Q9LJfrQxllWZGKGoCBunWQ', 'review_id': '-SxQELzcSV2EyPoJiZq3aQ', 'text': 'I was recently visiting Tempe and stopped by on a friend\'s recommendation. This is honestly one of the best dining experiences I\'ve EVER had in AZ, even after attending ASU and living in Tempe for 4 years! \n\nTo begin with, the atmosphere is unbeatable. Parking isn\'t the best but we lucked out with a spot!!The building is huge and one of the only "bar" scenes I\'ve been to in Tempe that isn\'t cramped, a million degrees and smelly. Not in the slightest. It\'s decorated industrial chic and has bulb lights strung all over. The space is very large and well-cooled (even on an 85+ degree night) and there are I think 3 bars!? There are ping pong tables and corn hole and a few spots to sit and enjoy your appetizers and drinks. Even a live band came on (and they waited until the final 4 was over to bring them out which I highly appreciated). We waited about 40 min for a table but with the above factors it wasn\'t bad at all. They text you when your table is ready which I also appreciated vs having to hold on to one of those annoying buzz things. The table we were sat at was very spacious, had super comfy giant chairs and good views of the basketball on TV. \n\nThe server was totally hipster but very nice and speedy! Everything on the menu looked awesome and it was hard to choose. We had the pretzel bites as an appetizer ... They were good! I ordered the steak and potatoes for dinner - it was cooked PERFECTLY and was seriously amazing. My boyfriend ordered ribs which he loved and my two friends each got salads that looked awesome. For dessert we got the monkey bread which was perfectly shareable! \n\nI will 100% be returning here for dinner EVERY time I\'m in AZ!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-03-30', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': '_VJaW2M7LCrW70zUC46XYg', 'review_id': '5-EChTVImNyg5wjWjwAajg', 'text': 'Noisy ambiance with hard surfaces, loudish music, and cavernous spaces.decibels reading via my phone was 85, and this was on a Tuesday late\nLunch.\n\nUninspired menu. We had difficulty choosing what we wanted to eat, not because there were many options, but because there were so few. Little that could be called healthy eating, our impression was that this was a young mans restaurant. One of us had the cannelloni, which was good. Tomato, asparagus and shallot in a butter sauce with Parmesan. Another had the kale and sweet corn salad. Mostly kale with tiny amounts of roasted cauliflower, snap peas (2), avocado, almonds, goat cheese. It was suppose to have roasted beets, but I never found them. Dressing was bland and unremarkable. Our third had the BBQ pork belly nachos. Interesting"chips" with a little pork belly, a nice amount of guacamole, some salty black beans, covered with a glutenous cheese sauce that weighed down everything and contributed to a general sogginess after about 5 minutes. \n\nServers near us were dressed in short shorts - lace or leather, contributing to a hooters- like atmosphere. Service was good, however.\n\nParking is challenging, a short trek across a dirt drive. About half a city block. Only one handicap spot near the door that we can see. Grateful we didn\'t need it.\n\nFood was pricey for what you got - not worth it', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 2, 'date': '2015-03-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'EYxs5iOW5mdMhY3d-G19Jg', 'review_id': 'mMnvlyyRcStKo2S6cAqHSQ', 'text': 'Cool spot and nice atmosphere but the service could be better.  They always have alot of bartenders and servers on but they forget orders and take forever to get back to you. I will go back in hopes they will change', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-03-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6GuyWEg8Mp1zNC32w65xLA', 'review_id': 'pgHzUTivv5syZUQqXxgavA', 'text': 'My first time here and Culinary Dropout is one if my new favorites! The salmon was crispy on the outside, but moist on the inside and perfectly marinated. The soft pretzels and fondue were perfect! I love the choose your own charcuterie! The service was fantastic, music was hip, atmosphere was lively. My 4 yr old son loved the kids menu too. This is the best of living in Tempe!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-04-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WXTdCYc_mOMICHTmWep4Fg', 'review_id': 'gTKUwsW8Scs_FdvecGQEng', 'text': 'The best part about this restaurant was the unique setting.  It is a quasi-outdoor warehouse with casual seating areas (apart from the restaurant seating) and outdoor games.  Aside from that, not much to recommend it.  The service is awful - slow, inattentive, amateurish, and uninterested, the drinks were weak and just so-so, and the food was bland and did not live up to the restaurant\'s self proclaimed "gastropub" moniker.  But then I\'m probably spoiled by the Twin Cities\' more sophisticated, maturely developed, and creative restaurant scene, which Phoenix just can\'t touch.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 2, 'date': '2015-04-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mU0dwPiL0wT0j3mBNqGbFg', 'review_id': 'wbNNQpp-bby82f6MoQz_2Q', 'text': 'One of my favorites places to eat. My only complaint is that they close a little early for a bar/ outdoor patio', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-04-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'WxUdJDuexeCy4dVPq_pM7w', 'review_id': '_S_UXJdbh01jgyhzUsl2-Q', 'text': "Had the chance to check Culinary Dropout w/ some co workers & their spouses and this place was excellent. The vibe was great, they had something for everyone (single or not) ....definitely will be going back, but I'm going to valet the car this time Haha.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-04-04', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': 'FrvHeCDq3eSMM-i6DVRK5w', 'review_id': 'dTND-AUXFkku9RgjsA0OxA', 'text': "Absolutely horrendous service. We tried to make reservations for a party of 12 two days in advance and they refused. We tried to call ahead to get on a wait list the night of and they refused. So we ended up waiting for over two hours for a table, several people in our party left to eat elsewhere and meet up with us after they were done and they still came back before we had gotten our food. 90% of the people at our table that did order food received it cold.  I ordered a straight whiskey which it took thirty minutes to receive, even though everyone else in the party that ordered mixed drinks received them in a few minutes. It is also impossible to identify who the servers and cocktail waitresses are as they carry purses and wear regular clothes so it took us twenty minutes to flag down a waitress while waiting in the bar area because she didn't come and take orders from our table and we had no idea who worked there.\n\nPoorly run, and the food isn't worth it.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 1, 'date': '2015-04-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'j324-yufxcirlUBEy80dWg', 'review_id': 'pGiihuZjy8FMpeCCz-y7kw', 'text': "First of all, it's an awesome space and concept for a restaurant/bar. I loved all of the different seating arrangements and of course, being able to sit on a patio in a beautiful Arizona night. The restaurant in terms of space and atmosphere definitely gets 5 stars.\n\nWhat gets me is the price. The mixed drinks and food are good but not superior to other drinks/food I've had for a lower price. Not knocking them, I understand the need for profit...just saying it's tough for college kids to afford going out to places like this. Hopefully happy hour offers a bit of relief for the wallet!", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-04-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vbN1gSo7JXTrraSMAqegPA', 'review_id': '994_orWmUDXw5b9Xeig5WQ', 'text': "Researching a place to eat this restaurant group receives high marks so we made the trip from the east valley.\n\nThe service was good.   Our server spaced it a few times but was hustling so it wasn't a big deal and we really appreciated his effort.  He was friendly and polite and to the point.  \n\nThe food was good.  The thai chicken wings were spicy and full of flavor.  The Kale and corn salad, a heaping side of greens and goodies.  Perfect dinner salad.  We also ordered the Ramen.  The broth was savory with the perfectly cooked runny egg split open.  Noodles cooked nicely as well but the lack luster zucchini was pretty boring.  Still a great dish though but I wish I would've chose the fried chicken.\n\nThe atmosphere-\n\nLarge space with tall ceilings and a large patio.\n\nFrat house-Bro bar mixed with upscale Hampton-ish hipsters with a side of beautiful people.   Strange.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-04-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'edUm8D0ow-K45yWLuUcAmw', 'review_id': 'zNl4aL4LizwcQ4avx-mahg', 'text': 'Its a combination of The Yard and Culinary. Best place for team happy hours. They have 3 ping pong tables. Great Beers and food. I loved their Deschutes " Fresh Squeezed Ipa", Oregon.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-04-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LZZadga_c9pnPtoSnjwOeA', 'review_id': 'EGhdJSwKFeELGoRo6VsQDg', 'text': 'Love this place! It\'s walking distance from my office and our office has now made this the "official birthday lunch" spot. The food is always great and the servers are super friendly!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-04-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7_NytWPdEBfpiqFSyQEKwA', 'review_id': 'S9O9peSJh3HhFuz63bsgCw', 'text': 'Went here tonight for my birthday dinner with my bf and his family. Ordered a drink at the bar which was yummy (two soft words). Our food came out very quickly..after only like 10-15 min. Bf had the PUB burger which he claims is one of his favorites. I had the fried chicken. Tender. Juicy. Delishness. Even though we didnt order any dessert, they gave us a small thing of monkeybread with ice cream as a birthday treat.. supposedly the person in our group who made the reservation mentioned it. It was enough to tide us over for my after dinner treat of sprinkles cupcakes. Also had a fun game of corn hole (beanbag toss game). Service was awesome', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-04-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1vn9-OZ6ONCAbQpcbzFAeg', 'review_id': 'AqS6Evc4Tnx7ezTGndoG-g', 'text': "I have been to the one in Scottsdale and in Tempe and like them both.  Great atmosphere, great service and fantastic food and drinks!!  I haven't had a bad experience once and have been there many times.  I am so glad they have one in Tempe now so I can go even more.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-04-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UFft2KKwefoLdOcUpP67GA', 'review_id': 'PutPfcR-MV59O2NW0m5mqA', 'text': "A very cool and hip place to hang out with awesome food. Get the big pretzel fondue. It's big enough to share and very tasty. We also had the burger and meatloaf. Both were excellent and the portions are more than generous. \n\nThis place is huge, spacious and has cool bar and game areas, lots of outdoor seating.  There are also plenty of tvs to watch for sports fans.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-04-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rAZgTQMFVKvtKYJb3Y44mA', 'review_id': 'jTo_tWGL3rgx8ywQyx0gTw', 'text': 'Great atmosphere, good food.  Close to light rail stop is a huge plus in my book.  Service was ok.  Appetizers were very good, mussels were done well, ribs were tasty.  I was disappointed in the corn cannelloni, it was good but not special.  Everyone in our party had a good time.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-04-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xMXLsMFGIsOR12ssHKAX6g', 'review_id': 'LkREZ-murMD_-tbOOV3nIw', 'text': 'Had a great time here. Great beer and we really enjoyed the food. Great ambiance a it the place. Will be back soon', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-04-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8kzUrEQrkebpJByTP1TA2g', 'review_id': '15gnx499JbmOG6sIUQsjcA', 'text': "Been there for a Sunday night dinner. Nice atmosphere, good service ok food. \nI'm not that impressed by the food. I think the presentation is awesome, the meal is ok  and the prices are high.\nWe'll be back.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-04-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'SGV3RcLpE5i5pWGmABZXOw', 'review_id': 'S5nO7BlDgqgZf7iJQFXG4g', 'text': 'The food was terrific but the service was even better! Our group of 7 had a server named Martin and he was excellent. There was some mistakes in the kitchen but the food was still terrific and Martin made sure everything worked out in the end! The burgers were awesome and so is the environment!! Super fun place for groups.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-04-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'F0gb_GmjFowEgCf14yMEpQ', 'review_id': '3A6ntKnI5HylU9pFWIm8VQ', 'text': 'Pretzels are great!  Apples go great with the fondue as well.  But LOVE, LOVE, LOVE the house chips and onion dip.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-04-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'EqCn5pUX79BvLhFVzZa9VA', 'review_id': 'XGR76iAsV5sfhQUxxh4gNw', 'text': 'Fun environment, great fun service. Fabulous ribs and fried chicken. Flexible host stand and friendly staff throughout.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-04-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'RpAhE5lBl8pKwqtQJsNDJw', 'review_id': 'bzrroCBefgS07JnFx1CqPw', 'text': 'Absolute TERRIBLE service. The bartenders are incredibly rude and charged me $24 for two lemon drops. If I ever go there again it will be for the games and NOT the actual restaurant.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 1, 'date': '2015-04-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9LZTu6RiZM8G2Zjn5OCZ9g', 'review_id': '5an2egKnXH_k4mMhmTc1VA', 'text': "Very cool space and vibe....add great food and you can't go wrong.  Live acoustic music on Sundays is an added bonus.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-04-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GGOH_X7npmcf3xYNtMeWcA', 'review_id': '6hPj1gY6pPxlefALCDiGdQ', 'text': 'This place takes the typical pub food but takes it to culinary genious. The pretzels and fondue are amazing. All the food is pretty good and the prices are what you would expect for a higher class establishment. Valet parking is free which is a nice perk. They also have games inside. Come on down and enjoy where the hipsters hangout. They know good food when they see it.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-04-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cOh5x9fw5pjPnFwFNREMsQ', 'review_id': 'AoEgZaJNkdhErdL5hyxIVA', 'text': 'Good food and great casual dining and, yes, it is a great space like everyone says. The service was a little slow when we were there but the place was packed. Food was surprisingly good for the incredible volume they manage.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-04-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LZnbHRA5itcrMrHavxVfjA', 'review_id': 'y28VbLAdClZwmrpAYjgCYA', 'text': 'The food is DELICIOUS. the place is huge and really fun.  its a great place to go to hang with friends, play some games and enjoy the whole evening.  expect a wait on weekends, but really fun place.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-04-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'pyby3vH3h1PIfkxEXhIT_w', 'review_id': 'TKoMl1FNlsqaTsiZVm_6rA', 'text': "My co-workers and I decided to come here for happy hour and I really enjoyed it. When you first pull up it can be a little intimidating because there aren't any empty spots to park in, but luckily they have complementary valet and those guys are really nice and do a great job taking care of your car. I went in to get a table (very spacious -- loved that) and they told me it would be an hour wait and at first I was hesitant on staying and I'm glad I did because I was seated within 10-15 minutes of my arrival. If you decide you want to wait outside (as I did) they will text your phone when your table is ready. I had the cheese sliders and fries and they are soooo good! I also played it safe with the cocktails and ordered vodka and cranberry juice which was made to perfection. Everything went well with the exception of our waitress shorting me $10 on my change, but I quickly forgave her for the mistake (I hope it was a mistake). A lot of the people there (you college aged) were casual and some were really dressed up (a little older working class) and I felt so underdressed because I had scrubs on (came straight from work). I was able to get sliders, fries, and two cocktails for only $20 during happy hour... Not too bad! I highly recommend this place for a girls night or a group outing.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-04-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Om-r07yI3dTm7wWerhQ5jg', 'review_id': 'UTnRxdtsEI6QgleCqjplrg', 'text': 'I had a French dip sandwich, which I have to say, was the most tender "roast beef" sandwich I\'ve ever had.  Unfortunately, it was so loud with the live band playing that I could not hear my companions, and felt a bit ripped off that I had such good food but wanted to get out so fast.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-04-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'N26DBXsQ3v09qx2X5CEQ8Q', 'review_id': 'XEEVtMaVgHT5eQ5V6XJ8tg', 'text': 'Great enviroment, good beer selection and delicious food. What else could you want!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-04-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3XaBtAD5wcg7AA36MKkXPA', 'review_id': 'c6DcdFwrbAL2gLEbvV8kfA', 'text': 'Terrible experience from start to end. Hoestesses have no idea what they are doing . Bartenders are rude. The manager has terrible customer service. He has no clue how to treat his customers. we waited 3 hours and were quoted 2. They lost our reservstion. He was supposed to help our large party, pretty much accused me of lying and never came back to our table. We could have spent hundreds of dollars there but we were so mad we left. We will never be back. First time experience was horrible.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 1, 'date': '2015-04-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '7xHra9hs42cspY6XLTtKaA', 'review_id': '9xYddUSutqKW3VdI9HQnoA', 'text': 'This place has everything you want in a hipster restaurant.  The space has a very open feel and the bar and restaurant are divided in sections that just feel right.  The food was quality and cooked correctly, but boring.\n\nThe food was a little LCD for my taste. (least common denominator = great for the whole family).  BBQ was tame, the coleslaw was nice, the fries were good, and the fried chicken was fine.  It almost seemed healthy.  This menu needs a kick in the tail!  The sleeper must awaken!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-04-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Yb0ttswiSpsEw2Z_9CaN3g', 'review_id': 's7cKloHqjo-ttyY7O35PxA', 'text': 'Best bar in tempe, pregame spot is perfect. The drinks are great, the atmosphere is so legit. They have cornhole, ping pong and shuffleboard. This is just. Great place to enjoy yourself and watch the game. The food is so hit or miss. The chicken wings are to die for. Do NOT get the pretzels and fondue, whoever says to get them is an idiot. First off the pretzels are kind of firm, like scones. Then the cheese isnt even melted, its kind of similar to velveeta cheese. So thats trash so dont get that. The salads look bomb, i highly recommened this place', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-04-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Z2XUS7wNeK7i30tiF3L1nw', 'review_id': 'i5UInndjuv9qBUXfEcPLsQ', 'text': 'Place is huge and love all the bar games but also has a fresh look to it! And the food is good!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-05-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1amV-cjeImfcjmB0rr9cxA', 'review_id': 'W2vfeGphCxixjKD6bx3leQ', 'text': 'Really fun and BIG place. Don\'t expect to walk up and get a quick table if you go on a Thursday night like us. We had to get lucky to get our own table in the open seating area on the patio. It was a really nice area though. Lawn games. TVs with sports. Fun "living room" seating areas for groups to sit on couches in a circle. \n\nI ordered the meatloaf and it was PHENOMENAL. So tender and the mashed potatoes that came with it were so creamy and rich. \n\nAs for beer, I got a Deschutes Black. They have a decent selection of beers but not a whole lot of them are on tap, so don\'t be expecting a yardhouse selection. \n\nOverall fun and tasty but loud and busy.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-05-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Gi7PHfNgtsE6w4iucGaiSg', 'review_id': 'rjE74iSmPluMmn8pBVtiXQ', 'text': 'omg the food was amazing the service was great as well everything was just great no complaints', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-05-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'aGTpMHryH7tX6842L1Fypg', 'review_id': 'hmhHZ-DM0vv6hOiKj-WQLw', 'text': "Came in for date night and the place looks awesome! Sampled a couple beers on draft from local breweries. We ordered the turkey pastrami, chicken chili and house salad. All the food was fantastic! (If they have the chili, order it! It's a sin not to) Shawn was a fantastic waiter too!", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-05-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8Fhyi6U9-3OZC0j8DY3TPQ', 'review_id': 'vDO9x_i5pZ_dY0Gp9pK99A', 'text': 'The mixology chemist behind the bar are good. They have a few really good drinks. I like the Smashed Irishman. Pub Burger and Turkey Pastrami are outstanding! Awesome for groups and hanging out with friends. Cornhole, Ping Pong, lots of TVs.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-05-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GIQxc-nn0LApag1GTsVcVw', 'review_id': '_x2eQpmPRSAJ7lcE0BfdLQ', 'text': "I LOVE the pretzel balls and cheese. The entrees aren't all that great. I had the fried chicken which wasn't very good. The ribs are great and the meatloaf is great. Otherwise, not that into it. But the service is pretty good and the drinks are decent.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-05-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CFbkGQ88mSxFYdN-0iuVtA', 'review_id': '4pjwUMJxfk_3Xeudcr3IaA', 'text': 'Love the burger at this place!! Couple locations all filled with awesome staff and atmosphere.. Also one of the best Moscow Mules :)', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-05-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QQ_RbZS2scUh9dem3x1JnA', 'review_id': 'EWe6kBv_GQNtkEus37sQgg', 'text': "This was the coolest restaurant I've ever been too. The atmosphere was awesome and the food was even better. I had the shrimp cesar salad and it was the best thing I've ever had!!! The band was great too.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-05-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hH4DclHlmxSbI_qiUl4F1Q', 'review_id': 'rqU1asl1PAAEgn6eZ3LkoA', 'text': "The wait here is pretty long on the weekends, so you should call ahead and make reservations unless you want to wait 20+ mins, although you can still go to the bar and get a drink while you wait. I definitely recommend the soft pretzel and provolone fondue to start. I got the two soft words cocktail and  fried chicken upon the waitress's recommendation. The drink was fruity as expected and the fried chicken was good, but did not live up to the hype the waitress gave. The monkey bread is really delicious and a perfect way to end the meal. \n\nThe yard is pretty loud and hard to have a conversation there, so I recommend a table inside if you are planning to chat. \n\nOverall it is a good place to go on the weekend to have some food and drinks and hang out in the yard. The food was pretty good, but pretty pricey for what you get, especially the drinks. The bill adds up quickly here, so beware.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-05-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WV1SKP9991QFXS5iJt2fLA', 'review_id': 'OwnETUhuRjp7RRQsz5-tkA', 'text': "GREAT PLACE !!!! I took my friends out 2 eat yesterday & I ordered the Fried Chicken Dinner & the Chicken was Phenomenal ! The Coleslaw was ok needed sum more mayo but the Mashed Potatoes was  ( Thumbs Up ) , Biscuit needed sum more Flavor , it wasn't bad but it needed that Kick... Overall the Food was 8 out of 10... Service was Great , Connor was my waiter , he was cool & keep my drinks flowing.. (Pepsi only) , they have a Ping-pong table u can play After u get done eating.. It's also a bag throwing game on the side.. I like the Place , first seen it @ the Hard Rock Casino in Las Vegas ,Nevada so I wanted 2 see how good it was in Arizona & I wasn't disappointed...", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-05-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'S492uXz2CG-2iIj43BqOxQ', 'review_id': 'SxdaMpXg9QvReMvBXuHXyw', 'text': "OMG. Took an out of town friend here at 9:30 PM. I was starving. Ordered a house burger. Killed it once it arrived. Half way through said the texture is a little weird. Looked at it. Completely raw inside. Not rare. RAW!!!. Complained. They brought me a new burger I took home. Went home to bed. 1:00 AM - Woke up - What's that noise? 1:30 AM - Why am I sweating. 1:45 AM - Burger plans escape. 2:00 AM - Burger makes escape via two exits. Really guys. Making a burger isn't that hard and not  killing your customers should be a main goal. It's called a meat thermometer. Now I know why they call it culinary DROPOUT. I'm definitely out! Feeling a little nauseous just thinking about it. Next call. Board of health.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 1, 'date': '2015-05-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'S71TdWjKuHrwd9bh6b3KMw', 'review_id': 'Zp7qVPuMtTlhvk8te8paIA', 'text': "I called in for a large to go order (6 people) like I've done before) and I was told due to there large reservations tonight, they aren't accepting to go orders.  Nice to know that you'll only accept to go orders when your slow on business. I will take my business elsewhere.  Thank you for coming across like such an elitist place.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 1, 'date': '2015-05-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WgvGstvzFl-nv-Ym_iIDAQ', 'review_id': 'gj_Tc9g5ldqO3zqdsfOYbw', 'text': "The facility is very nice with an large open patio. Family friendly with cornhole games and a casual environment. The food was decent, expected more from the brunch menu. The service did not live up to it. Staff dressed in casual jeans, whatever shirt they wanted and converse in all colors. I'm not necessarily opposed to it, but it made it impossible to determine who was staff. Waiter sat at our table to ask about drinks, food, etc. - awkward. The meeting spaces looked nice. The weather was nice enough to sit outside with space heaters and misters that spray everywhere. That seemed like a design flaw. Huge wrap around couches which were actually plastic.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-05-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '0JDiZgdCw7vUdS1Owj6VJA', 'review_id': '59TDW0IVTG4eh1LtLekSig', 'text': 'The pork belly nachos as an appetizer is definitely my favorite. Best part is the chips are made to order so that kicked it up a notch in my book. \nI had the fried chicken for my main course and one of the top 5 fried chicken places I have ever had. \nThe female wait staff is easy to look at so I never had a shortage of entertainment.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-05-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Qgc1qX4K4AcfD_gcEAOz5g', 'review_id': 'moSrvt0cMjlRg3dQ9IWi6Q', 'text': "PLACE IS AMAZING!!!!!! the food is awesome, the atmosphere is incredible, the staff is pleasant to look at and talk to. if you go here and don't enjoy yourself I would be shocked.....", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-05-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UeJ80SCYvNMR10n7w_xfTQ', 'review_id': 'Bxnp9W5SHAZGJXS_h7qpBA', 'text': 'I only gave them 3 stars because the atmosphere is nice. I went with a big group so lots of different food was ordered, none of it was good. Fried chicken was supposed to be one of the top rated dishes, I was not impressed. Biscuits and gravy, salty. Broccoli n cheese soup, tasted like week old soup- to cheesy and lumpy. The waitress was great and the Shandies are awesome.  Make sure you try a Shandie.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-05-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4M5R6oDbNruO2Dq1aLvE7Q', 'review_id': 'GFd3yU-NFSauGTFx1Cgxew', 'text': 'Hip meets gastro-pub with a dash of college fun. I loved this place. The food was comfort with a twist and wonderful.  The space itself is massive both inside and out.  Outside is covered with mist machines to keep it cool.  They have tons of games as well.  This place would be fun to get "over served" in.  I would highly suggest coming here.  In short good food, great atmosphere and a lot of fun.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-05-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pudywmH_a-LNZLpMoeZguw', 'review_id': '9FpAhrchPnq0T6SBAcrJ9Q', 'text': "Absolutely fantastic!  Great vibe and excellent food - and we didn't get past aps (Pretzels and Fondue) and dessert (Monkey Bread).  Both were delicious!!", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'af-gH5ZuivJOHHe7LUtAGw', 'review_id': 'nDl5gg6xrkafZcBSjRqKhA', 'text': "Went here with my boyfriend and his colleagues. The environment is interesting. No privacy and too loud. The food was much to heavy for me, I just ordered some champagne and cheese with bread. The bread was burnt and so hard that when I bit into it, it was a struggle. I didn't even finish the bread because it was so burnt. The champagne was good! I guess this place is just for hungry ASU students. :)", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 2, 'date': '2015-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'A_v92RuRmco_jpTVzdgGkw', 'review_id': 'eNqo7Wy4OySEdi-g-mDKNw', 'text': 'First visit was a weekday lunch. I ordered the kale and sweet corn salad. It was excellent! Everything ordered by the group looked great. Fresh and flavorful.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'c7rNrV0KvnNsy9Kyy4EJAw', 'review_id': 'zKwCBuiDjDimphvOLYCmSw', 'text': "Went here with family and friends on Saturday.  Most of us were out of towners from San Diego, but a local recommended us to drop by here.  My girlfriend and I split the steak, and a chicken sandwich.  Both of which were really good.  Our fries were very cold, which obviously wasn't ideal, our server got us a new batch after we mentioned it though (two others at our table also had cold fries).  Our veggies were really really salty.  \n\nThe game room was very fun, we did ping pong and corn hole for a couple hours and then called it a night.\n\nIf I'm in the area I would come back.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'do8TLgrNbnpZY06kPOPMxA', 'review_id': 'JtrhGaMbHk9ZtC64G2y1Cg', 'text': "This place wasn't as good as the hype surrounding it. The food was expensive and not super health conscious, just creative. I thought the pretzel cheese fondue everyone talks about was way too salty. The fabulous elements of this place are in its seating, decor, games and ambience. The mood is totally urban and for adults that want to drink. Since we don't drink, it wasn't as fun for us and way too loud. My parents took us out for my husbands birthday, and it felt a little too rowdy to visit even though they liked being hip in the city.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-05-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yBeCfWDEDSj1_V15PnS6kg', 'review_id': '_HZbp4fnrE8vo99pxwaPfA', 'text': 'You guys should really update your yep page to what type of environment this is. Is it 21+? Your yelp page says kid friendly?????', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 1, 'date': '2015-05-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'V5PfDx_SJdcog2y4Vq5sFg', 'review_id': 'ebC_sQdKbADnON2XSOxi8A', 'text': "This place continues to amaze me. I eat out often, and go here often. The staff is incredible and well trained. The food is delicious, and the atmosphere is vibrant. No wonder you can't just walk in and sit down. \n\nPlease keep this great food, service, and vibe going in the Farmers Art District. Don't know where to point you on food selection, except just pick one. \n\nDaniel, Christina, Kayla, and Tony, you guys rock.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-05-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MZS37pBU8JFiPZmRYi-W2w', 'review_id': 'ln2arZhDkUhB91kWM2hKWw', 'text': '3 1/2 stars, and I\'m just not excited enough about what I ate for my main course to move this up to 4 stars.\n\nFun, open atmosphere, friendly and helpful service, decent food.\n\nAfter walking in through a seemingly endless hallway (with an admittedly nice view into the kitchen), I arrived in the main area of Culinary Dropout. I immediately liked the setting, from the openness of all of it to the modern tables. I don\'t think the smaller tables with the pub-style seating looked very comfortable, so I\'m glad I didn\'t sit there. I was with a large group, and despite that, the service was always quick and attentive.\n\nWe had a few appetizers to start. The BBQ pork belly nachos were delicious--guacamole, black beans, some tender and saucy chicken, and a few other toppings were all on there. The soft pretzels and provolone fondue were pretty tasty as well.\n\nI ordered the shrimp and pork belly ramen. I had reservations about ordering the ramen, but I had been craving ramen for a while, and this was the opportunity I had to have some. The waiter convinced me it was delicious, so I went with it. When it came out, I was sure that he had been right. Everything in the bowl looked great! The pork belly looked awesome, the cilantro, mushrooms, and sprouts were nice and fresh, the shrimp looked tasty, and the soft-boiled egg was delightfully tempting. I was hoping for a slightly larger bowl, but it looked great.\n\nOnce I started eating, though, I just wasn\'t impressed. Don\'t get me wrong, the ramen wasn\'t bad. It just wasn\'t all that great. The pork belly was cooked nicely, and the soft-boiled egg was perfect--nice and runny inside. But it was all rather bland. There wasn\'t much flavor to any of it. It was pretty "meh" to me.\n\nNow the reason I added half a star and was tempted to add a full star came at the end of the meal. The bourbon black bottom pie. It\'s ridiculous. The chocolate ganache is fantastic, and the graham cracker crust adds a lovely texture. But what really did it was the salted caramel sauce that is on the side. Oh, man, this is good pie!\n\nIf it was all about the pie, this could be 5 stars. But my disappointment with the blandness of the ramen required a lower rating. Maybe a subsequent visit will convince me to bring up the rating.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-06-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XN4cbto31GE2W-yrSTUiWA', 'review_id': 'cZs58fNR-52OrbJJ49Dtiw', 'text': 'Great prime rib dip sandwich and the Margaritas rock', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-06-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'AuQ28IMcqAloDmlFI7CKoA', 'review_id': 'kSY0jnEzUkN0Pf0vzOr6cQ', 'text': 'Really enjoyed our visit.  Have visited the Phoenix location numerous times and this is quite comparable. Service was good, location and atmosphere are the comparable.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-06-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': 'OOxLwlNadygUwL_aG8KnSQ', 'review_id': 'A2JZjN0mP8z6kOmP_83YZg', 'text': "Pretty awesome to have Sam Fox add this addition to the Tempe- Mill Ave area. I've been such a fan of all his concepts for years. We came here for a company happy hour and had a great time. Prices are above than what you are used to paying in Tempe, but hey... It's worth it if you are having a great time. We shared the fried chicken and it wS delicious and juicy. \nThe only bad thing about coming here is the parking. You either have limited parking or have to pay for valet. \nRegardless, I would still be coming back to this fun and hip place!", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-06-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XosHxT9SY3xm_bScQHaTBA', 'review_id': 'zOJ0lFDaZnULybZ5cPpjDg', 'text': 'This place is totally fun and hip! I was surprised that the waitstaff is dressed like they shop at Urban Outfitters, but it does add to the chill vibe here. My friends and I came for lunch it was perfect. There was live music and the food was pretty delicious! We shared the pretzel balls with cheese fondue as an appetizer and I got the kale salad for my main. The salad is so yummy and it is filled with all kinds of goodies - like crunchy nut bits and goat cheese and avocado. Yum!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-06-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'h4jF_IXthn5RDUySZB3QZg', 'review_id': 'AgnL7l2uqDeScwxFVj6ZYw', 'text': 'The Mac Burger was like combining grilled cheese and a double burger.  So delicious I did not even add any ketchup.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-06-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ed5KlQBQOGpjOhQj2Zu2fQ', 'review_id': 'Rp1FlMf8_G4rWggcB1SZVQ', 'text': "Yummy food, nice staff, fun atmosphere. Wish the outdoor seating was cooled better (even with the misters it gets very hot/uncomfortable) and that the pricing was a little lower, but overall I'm pleased with this place and go often.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-06-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5KusWBILujfWA5ZzFiYYkg', 'review_id': 'uxHMXUop6iJe8KvJ-Z6I4A', 'text': "Amazing! Prime rib beef dip is the best I've had! Howie the bartender is great too! We will definitely come back for more!", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-06-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hKcubct_FUZPLRk-VFBDXw', 'review_id': 's8NctHGCOcoRbrj7r716IQ', 'text': "Trendy and overpriced.  The staff, and overall look of the furniture and fixtures make this a very hipster hangout restaurant.  I tried the Korean Style Ribeye Cap which was touted as one of their signature dishes.  I expected something marbled with fat and as tasteful as a cut of wagyu beef and I was sorely disappointed.  It was not that much meat and didn't come with any sides.  I had to add a desert just to fill me up.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-06-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hr7JnYlf72VY9FeuPZj7aw', 'review_id': 'D3g8tc7Cwv4raXLyQONZeQ', 'text': 'I have been to the scottsdale location which I think made better food. We had the fish and chips and the fried chicken neither were very memorable. Their potato chips we had were about the best thing we had there.!The restaurant has an unnecessary hipster feel you cant really tell who is working there and it was 115 degrees outside and it felt just about as warm inside. This is Arizona be generous with your A/C.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-06-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Jh6njgabQDbeHnG3kexJyw', 'review_id': 'mWIrPL3HoJWaz8MIdy_sog', 'text': "Did not have bud light crown royal or fireball which are bar classics. Very Scottsdale crowd but yet they had their beers on special served in brown paper bags. Good seating and presentation. Good parking and off the main beaten path but still close to Mill Avenue. Probably won't be back", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 2, 'date': '2015-06-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DlIYVySw5C12T2Kn7xZa3w', 'review_id': 'DTQhWe-OCw5qqY-DGgy5mg', 'text': "Wow what a great venue. Open and lively. Good selection of beverages as well as entries. We all ordered different meals (4 of us) and we're happy with what we got. Very delicious and the portions were filling. The pretzel appetizers and cheese dip were so addictive.  the atmosphere is electric and the server staff works double time to ensure prompt service. Take a minute to watch the kitchen staff hustle in the hallway. Moving like mad men to ensure fast service for the food. No waiting around to see who will address your needs. They are on top of it.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-06-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '71qf9nk1lPviXXlxG5fnzw', 'review_id': 'l6CjnM_sC6EFypMFvCxtzQ', 'text': 'Stopped in for lunch with a girlfriend of mine visiting from San Diego.  Got our Girl\'s Day Out started off right by choosing this place.  Walked in and were greeted by very friendly hostesses.  They seated the 2 of us at a table nearest the host stand which I was worried might be high traffic and annoying, but it was actually a great vantage point for people watching.\n  \nOur server came by and was very friendly and informative as this was our first visit.  We ordered a starter that was a "build-your-own" type of snack menu.  Ours was spreadable chorizo, herbed goat cheese & grilled crostini.  Nice flavors and perfect starter portion.  Entrees were the Sweet Corn Canneloni and the Roasted Salmon.  Both were DEE-licious!!  \nAll in all, great experience.  Can\'t wait to go back for more!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-06-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'rq4nUlfylDa_aK6JBafRgw', 'review_id': 'JSTql31igqZFUDK2EHlzZg', 'text': "Awesome vibe, great food (gotta get the pretzel balls and cheese). \n\nThis is a cool place for a working meeting during the day, a first date, or a happy hour with friends. Nice, but not stilted. Like all sam fox restaurants, you really can't go wrong.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-06-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 0}, 'user_id': 'f5CqKZlqK9Sox9z9wuooCQ', 'review_id': 'cvw05M5iO7b74g_XZPavAw', 'text': "The locations in Scottsdale and Las Vegas are better period.  4 of us ordered a meat and cheese board, trout, 2 fried chicken dishes, a sandwich (can't remember) and some drinks.  The chicken was good not great.  It's been great at the other locations.  The server brought our first round and it took 20 minutes for a couple of old fashioned's, a manhattan and beers.  We told the server that we would appreciate light on the simple syrup because we don't care for sweet cocktails.  We want to taste the whiskey.  They were still too sweet.  Asked again and brought us manhattans instead old fashioned's.  Tried to tell us that they were the correct drink. He was maybe young 20's and barely knew what each drink was made with.  Trust me we were given the wrong drinks.  The trout was disgusting and excessively salty.  Told the server and figured he would get a manger or take it off the bill.  Guess what, neither happened.  He asked if we wanted a box for it and we repeated its gross and salty.  Brought us the bill and we said fuck it.  We had plans and tickets so we left.  Disappointing experience.  Won't come back here.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 2, 'date': '2015-06-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': 'uY2BSeGryK2ZE46iEyKvgA', 'review_id': 'IQPhbeBIEAp22_jYnjQXuw', 'text': 'Fun place where you can eat drink and play games- all while listening to music!  If youhave not been here, give it a try. They tend to have a younger crowd- but all there seemed to be having fun!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-06-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6GXeV9X2YfaLnXbSmZ284w', 'review_id': 'qUzCqBsMMh_ix1pTscfeag', 'text': 'I went there for breakfast way too hungry to enjoy the open, airy ambiance and the delicious Eggwhite Frittata topped with Sriracha sauce. \n\nThis place is nice for a first, second or multiple dates if you get there as soon as it opens.\n\nIt is also a nice place to go if you love to be doted on...waitstaff and the owner I think -- were absolute sweeties.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-06-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0eATHUTKNwHeBddVuSIqwQ', 'review_id': 'i-N5ymc70Qh-sOgzGuX28Q', 'text': 'The food is pretty good, however, the prices are a little inflated. Probably has to do with location. It is a really large place, we were there on a Friday, it gets pretty crowded. Because of how large it is sometimes you feel the staff may have forgotten about you.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-06-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'pEVf8GRshP9HUkSpizc9LA', 'review_id': 'DCQ6uHO4dqY-V_jp47J6ZA', 'text': "I love that Sam Fox has opened another Yard...this time in Tempe and on the light rail!  It is such a great concept, but it sure does get crowded!  We stopped in one night with friends and enjoyed some drinks, dinner and a lot of ping pong...what a blast!  The kitchen completely messed up our order, but rebounded quickly and made it right.  I would give this place 5 stars if it didn't get so crowded all of the time.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-07-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'p1F6Unak4Wlj0CouSEO6aQ', 'review_id': 'oE_8VQ-AoKq1OkvJb9fZ6Q', 'text': "Although I was here for a work social, it met all my expectations and the outdoor area is really comfortable. It's just a great location with a lot of space, very open, airy, and comfortable. Perfect for large gatherings, reunions, etc.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-07-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2eICeRlxg8Mb51cTnw4r0A', 'review_id': 'wD-KI2PrMHbBHCzjg0u9YQ', 'text': 'Came here for dinner date on a Friday.\n\nWe got seated fairly quickly, and got servers drinks quickly. We ordered the salmon bruschetta with fried chicken entree. The salmon bruschetta was really good, and the friend chicken was on point.\n\nI would definitely come back again.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-07-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XWRfTljCBYtOyPfls3xATg', 'review_id': 'Z1XG7qDuuJiRVZc0qtQXwg', 'text': "Awesome! This place was great. The food was really good and they had a pretty good happy hour.  If you want to have a good time with a group of friend the dropout is where it's at.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-07-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9v5wa45etAWAY8LrmRAW0A', 'review_id': 'zb5E2oCC4AphCJJeWtlCsw', 'text': "Went before the fireworks and it wasn't crowded. The staff really tried to persuade us to sit outside. We had a quirky waiter. Never did bring sweetener for my tea. My date ordered a side salad that came out right away. Then my salad eventually came out & it tasted good.  He ordered a chicken sandwich that must have taken over 30 minutes or longer so we never ate dinner at the same time. Very weird. The GM came to our table since he realized it took so long. Told us dinner was on the house. Then the quirky waiter came back and charged us for my tea that I never got the sweetener for & the salad. I don't plan to return after this first experience. Good luck!", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 1, 'date': '2015-07-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'TtjJKAo77qv158SQPRR7vg', 'review_id': 'UzDnEouNj9q2lUjAhAAgiQ', 'text': "Horrible experience. Went here with my mom and my older brother and they told us they couldn't seat us at a table because they reserve them for bigger parties, even though we called for a reservation. They said sorry but the bar was fine for us to sit at if we could find available seats. Also the whole place was so loud you had to yell just so someone could here you.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 1, 'date': '2015-07-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3CiE338sJ-56jqv-aGdfMQ', 'review_id': 'KuWdEvYBLiBeey7vEuZDJQ', 'text': 'Great place for lunch or just hanging out.  Went for lunch yesterday and thoroughly enjoyed everything we ordered but especially the house potato chips with "famous" onion dip and the pretzel fondue as appetizers and for entrees the fried chicken and the amazing turkey pastrami sandwich.  My wife\'s fried chicken came with a biscuit that she said was the best she has ever had and she\'s a biscuit-aholic, so that\'s saying something.  My turkey pastrami sand on a pretzel roll was equally fantastic...so we\'re definitely looking to go back, soon!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-07-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fhMNqRFj2-7Y-qxU3eSE8A', 'review_id': 'XlxqaisquJiM7qkfnpw8cw', 'text': 'We come here often and everything is pretty great. We usually head straight to the bar and order drinks. The service is pretty fast and the servers are all really nice and friendly. The prices are good here and everything is top notch. My spouse usually gets the brown bag special, which is a mystery beer for only 2$\n\nWe would come back here again.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-07-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '6mRi_G3bLtJvOjMXcbTSxQ', 'review_id': 'o_Of-DBkO5SWcFgdkmroGQ', 'text': 'My girlfriend and I came in on a Wednesday for HH and the place was packed but got a table and we had the best server Christian. We both work in the service industry and Christian was very helpful and suggested many different drink options as well as being very knowledgable on food items. For how full the place was our food came out in a very timely manner. After eating we ended up staying another hour or so based on Christian being very energetic as well as the atmosphere. We also got a complementary desert from Christian which was their Monkey Bread which was awesome. Will be coming back for sure for HH next week.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-07-10', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'vq1vMvt4PIR3LbMZzLfthw', 'review_id': 'VUuwk31sOhQaGEwjwxQa9Q', 'text': "I love this place! Wish we have more places like this in CA. Both the indoors & outdoors area are really cool. There's cornholes and lounges in the outdoors area. \n\nThe drink prices are reasonable and the mixed cocktails are delicious. You can't taste the alcohol in the Deviant Behavior and it seriously tastes like a strawberry lemonade. The Gin & Tonic is also decently good here but I guess you can't really messed up on that. \n\nReally wished I was able to try the food here. Heard the fish & chips are to die for. I might have to come back to Arizona to just try the food here...maybe just maybe.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-07-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'MWENBelI8nsO96JKGYQ9Vg', 'review_id': 'kxKEw5nlNJQ5w0czVjaUJg', 'text': 'This place was great. My bf and I were in town and looking for a place to eat when we found the Culinary Dropout, we went because of the name, the atmosphere was awesome, there was life music, the tables were spaced out perfectly, they didnt try and cram you in. It was just what we were looking for. they had games you can play, a free photo booth and misters to stay cool. I highly recommend this place(our waiter was not very great and they switched out mid shift which was a little confusing) But overall the experience with the food which was incredible, we got the prezel bites with provolone fondue and it was scrumptious. The friend chicken was really great as well.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-07-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'e0HWqdH_ZyrjpsRyPbkYAQ', 'review_id': 'SpZmeGwHLP2g9tiCb6frxg', 'text': 'Wow great atmosphere great food! Loved everything I have gotten fish and chips perfectly breaded. Pork nachos have great flavor and enough to share. If you love rainbow trout this is the place to get it! Various beers and my fav Deschutes Black Butte Porter!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-07-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'b9TcMqRXE0suDiBgNlOBdQ', 'review_id': 'bjrLU3xdYQLgoLYnGIqryQ', 'text': "Came here for a business lunch. Didn't know what to expect but found a gem. The place has a very hip warehouse feel. Think of restaurants in San Francisco. This place feels as if they transported one of the restaurants there into Tempe. \n\nWell the atmosphere is one thing but the food is among the best dining experiences I've had in a long time.\n\nI had a dish called Korean Cap. It was perfecto.  Perfectly made steak marinated in a Korean sweet spicy sauce. It's hard to describe all of the tastes involved on this dish. You have to experience it for yourself.  \n\nWe then had a bourbon infused dessert, it was delicious but I bet that if you had the whole pie you would certainly get a DUI.  It's Rich. But it's really good. \n\nOverall it was a great experience. I will certainly be coming back. Service was also great and Victoria was on point with her recommendations.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-07-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '26BYcAieLrlEw06NKj-2ow', 'review_id': 'ImeNEoDxpRcLwFmfpp8Ybg', 'text': 'Love their Kale salad.  The pretzels with fondue I rocks!  Great service. Fun energy.  Highly recommend.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-07-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cXFifIa6f3yeMSRTOKG-uw', 'review_id': 'VDMGrGPkWMKzmY_35t544w', 'text': "The second star is for our server. This place has okay food, however that's about all they have. The management is pretty lousy.  My friend got kicked out for being to loud. In any other bar that may make sense although he had a mental disorder. The security guard stated that everyone gets one chance before they get kicked out.  We asked security if we could get a manager to the table and no one ever showed up for about an hour and a half until after we had ate already and my girlfriend complained and talked to head of security, then one of the three managers offered us free food after we paid. The security guard also stated they have been open 7 months and don't want to ruin their reputation. I have never heard of any rules against anyone with a mental disorder being in a restaurant.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 2, 'date': '2015-07-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'MGNDxAm0XyGuzbicbcJmNA', 'review_id': 'xDQ7kbVFIQSQWW8XfFOoFQ', 'text': 'This place is delicious! I had the kale corn salad with grilled salmon and it was beyond perfect. My hubs had the pub burger. He really liked it but a bit greasy.... Still very good. Also had the room service cocktail and that was great. Decor is sooooo fabulous. Service was above. The monkey bread signature dessert was lovely! \nGotta hit this spot up!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-07-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nf3aAASezgrhHN6MlHIirg', 'review_id': 'W3-_TlUWKYE2v6yTTIf57w', 'text': 'First time having lunch there.  Week day so good crowd from local businesses. In our party  had two salads and the chicken sandwich. Couple of pale ales as well. Great service ~ fast service. great food!  Will come eat there again when in Tempe!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-07-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'doRI45WmYLuSF106eGcgMA', 'review_id': 'KTuVFi4RUZ4QLyjzh1sZ3g', 'text': 'Had a good experience here when I came for a school fundraiser. Good service, nice atmosphere, delicious food and drinks.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-07-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6Qt-bLnnEH1Tm_FImic37A', 'review_id': 'eX8HacT94AdF_FfITvvkBg', 'text': "The food and drinks were fantastic. Only giving it 4 stars because it's not the best place to watch a game. While they have a ton of TVs, they're all facing one way or the opposite. So if you're sitting to the left or right, you can't see the game very well.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-07-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LOxeeZNWCPeR1NkIT1OUig', 'review_id': 'giw79DgH9zm33_6wP1-gCg', 'text': "Have been to Culinary Dropout/ The yard a few times and haven't had a bad experience yet. The staff are friendly and attentive and the food/drinks are good. Nice atmosphere and pretty cool that you can play cornhole and table tennis etc. My brother and my best friend were in town from Australia and raved about the pretzel bites!", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-07-28', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'fJScxkN9ZYJFiGGAixRVFQ', 'review_id': 'VwAINFlVbcWwtnxJprTzsw', 'text': 'Bad food.  Bread was more like crackers, mussels were over cooked, shredded pork nachos had almost no shredded pork.  Seats were uncomfortably hot and management refused to turn misters on.  If you like terrible food and hipsters, this is the right place for you.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 1, 'date': '2015-07-28', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 2, 'cool': 2}, 'user_id': 'L-n4yvae_PDlCCfY56sakg', 'review_id': 'Fui_EeeITLvrMAE1pfoH7g', 'text': 'TEMPE, AZ: Came in today for some Culinary Dropout fare and was impressed!  The room is busy, the waitstaff was knowledgeable, the food was good.  They have a game area in the back and bring in live music as well.\n\nWe tried the Pretzels (4 stars), like big, salty, bready, soft doughnut holes.  The dipping cheese fondue was excellent.\n\nAlso enjoyed the charcuterie plate (4.5 stars); had the prosciutto, goat cheese, and fig bar.  It was delicious as well.  Great place, excited to return and try more!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-07-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'X5OXVkObP-9-wEb9W1ETIA', 'review_id': 'ONiHIAMMYNqulh-SrwSGrQ', 'text': "Best place in tempe! Awesome atmosphere and the food is delicious! I honestly can't choose a favorite because everything I have tried is amazing. I definitely recommend trying the pretzels, turkey pastrami and the sweet corn cannellonni... I promise you will not regret it! The service is always awesome as well! Not too in your face but very attentive!!", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-07-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zz4iaqRAIT-wju1J8wicgA', 'review_id': 'BTb_nRsE9GxiqlDDj6E98g', 'text': "I really enjoyed coming here on Saturday night. It wasn't as crowded as I expected it to be, and the drinks were top notch. The food menu on the patio where all the games were was pretty good as well. I loved the pretzels and provolone dip, but my favorite thing was the brown bag special beer. Its basically beer roulette (I peeked, sue me) and I took the better out of the bunch and gave my three amigos the others. We did this a few times, so you can imagine the hilarity after drinking craft beer for the past years and then getting a Milwaukee's Best. I like that there is a huge parking lot in the area, that makes my life a lot easier in Tempe as well as the live band.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-07-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kQ_TpIa4nCKrKV_GTk_k9Q', 'review_id': '1Bhsi-nBarO8J67VshoT1w', 'text': 'Took 4 of my best friends here for the first time tonight, and they really enjoyed themselves... Our server was amazing, she made sure everyone was happy and really went out of her way for us. My friends loved the atmosphere and were so happy to be apart of the trendy vibe going on. I love this place and I was so happy to share this amazing experience with my friends. I would highly recommend this place for honestly any occasion. I cannot wait for my family to visit to take them here. Thank you so much Culinary Dropout team for such a great night!!!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-07-30', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': 'Aj29RhdOWiaZ5q3FMj_lAw', 'review_id': 'BA1C3Ly-4oOPxMzHbqCNqg', 'text': 'Food is amazing, get the fried chicken. \n\nWill definitely be back when we have more time to play some games and get some fun drinks', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-07-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '1jyNMw5sbi9Qkdd-WmI5Nw', 'review_id': 'iRs2y7zo32LsPPdwhgNq_w', 'text': "We stopped here for an early dinner prior to seeing a show at Gammage. The food was good, but we had some issues. My water glass had something random floating in it. I requested a new glass and it never arrived, so I drank from my husband's glass instead. I asked twice and was disappointed it wasn't resolved. However, then they served me a drink in a chipped glass, When I brought that up, they fixed it. I guess chipped glass gets fixed, but dirty water glasses don't. FRC needs to step up their game a bit and pay attention to details like this. I did enjoy the location and the food, but the servers need to do better and maintain the level of quality that a patron expects when dining at a FRC location.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-08-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '66oDhsKSB_eSrhCKiERDow', 'review_id': 'gB20GUhUGmlOj5_PIOGw7A', 'text': "Got the fried chicken dinner, about $20 after tax and tip.\n\nThe gravy was VERY salty, as was the crust of the chicken.  I could handle it but I can imagine many could not.  The chicken was very juicy, though the two dark meat pieces were the best.  The crust was a little too oily and soggy on the bottom, and thinner than I prefer.  The mashed potatoes were very whipped and smooth, and I would've preferred more lumps.\n\nThey did not have any misters on over the outside seating which made it quite uncomfortable outside.  I also found the music too loud, which made conversation very difficult.\n\nThis Yard location does have much better parking than the Phoenix one, but you are forced to walk across a vast swath of roped off valet only spots to self-park.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-08-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '81YQyZ2FVPu23ezdYqTH8Q', 'review_id': 'jtRE-QK-YAVN_7_RRqiRjw', 'text': "They have the best pretzel bites out of any restaurant that I've ever been too. The aroma of the restaurant is very nice and comfortable they have something for everyone there", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-08-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'iMZ97e-9XpMztSh882vyDg', 'review_id': 'swhoqWuCnupJHVEt4l2TGg', 'text': "Loved this place today! The vibe is really good. Very open setting. Super cool to see in kitchen. Everything local, fresh, creative. I was there on a business lunch so I only took a couple pics. Our server provided several great recos. We shared the amazing pretzels and dipping sauce. The pretzels we're golden and salted.  \nI went with a recommended burger black and blue style and I had it wrapped in lettuce. Amazing taste. Loved the pickle and salad. I hope to come back next trip and experiment with the menu. Great service also.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-08-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lwmMNnKUJgurenHAotoS3g', 'review_id': '4yTY38XWqYgKfeXR94z9-Q', 'text': "Another great Fox Restaurant . Steak and potatoes for the win ! The pork nachos weren't as good as expected , the cheese was too much . On the other hand the pretzel fondue was the bomb.com. My drinks were to strong and the waiter was more than happy to get me something else . Would go again !", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-08-07', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'g4gqF8jR7NZS-FYjSVGVSg', 'review_id': 'lF0EpfhNqHy4xLmnRfbsNw', 'text': 'To who it may concern:\n\nThe atmosphere was of the upmost enjoyable experience. However as a "help me I\'m poor" woman... I was very disappointed in the brown bag special. The first couple "brown bag" specials were surprise crap beers... But by my ninth it was just Milwaukees best. Just kidding... I love Milwaukees best... (P.s. Don\'t take the brown paper bag with you... You will spend the night in jail)', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-08-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rdnxb2GtTuEFT4PZL8ZRSQ', 'review_id': 'hFFlMHlnb3PbQXm2NIeWKA', 'text': "I've been to this location twice within the last month. The first time was on a Wednesday during happy hour, and we had great customer service, our server was very attentive and helpful. We ordered the hummus as an appetizer and it was great! I also ordered the sangria, my server let me sample both the red and white and both were good! The second time I went in with a group of friends on a Saturday night. It was pretty busy and we didn't see a hostess so naturally we sat our selves. After waiting a while without service, I had to go to the bartender to get a server for us. Aside from that little hiccup, everything was great and service was good. I tried the blueberry beer and it was AMAZING! Also the pretzel bites are the best pretzels I've ever had!", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-08-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'Z-W2Rkw7Cl0H8iYE3SPwNQ', 'review_id': 'uknm7IRrul6c1a1CcugndQ', 'text': 'First of all the look of this restaurant is the cutest thing! The atmosphere is so fun! Everything is cooked fresh here daily. The nachos are beyond bomb! The cheese is provolone fondue... WHAT?! Insane! The service is great and really nice. If you want to try something new definitely go!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-08-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BzuoAf8g_AWdjbnWDrNn4g', 'review_id': 'wAo92VdJGbJoxeje2vwu5w', 'text': "Top Notch!  Staff is friendly.  Food is unbelievable.  Well ran.  I take clients, friends, and most importantly my wife.  I've never had a less than stellar experience.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-08-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5RjT-MCPXZJXrjp7v5cM-w', 'review_id': 'KJr294WYCTdsKU64pxWQIg', 'text': 'This is a great place. I had the streak and potatoe entree and. It was delicious, but get the get the sauce on the side.  It was a bit over kill.  \n\nThe outside is fun with the whole setup of ping pong etc. Overall a fun place for friends to come hang out and have a good time,', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-08-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lua6lCUPA2XJiKKeOBI60A', 'review_id': 'Fmxz0tzZA4z7uPjOW0BwdA', 'text': 'We just ate there and 4 out of 11 had sea food and now we are all sick bad food poisoning maybe heavy metal poisoning ...on our way to the e.r.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 1, 'date': '2015-08-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fzPQy6w831osYMO6aWyVwQ', 'review_id': 'cNg-VZrsBhIESjk6IFcfXA', 'text': "You don't find a place like this everyday; great atmosphere, over the top service, incredible drinks and the food is awesome.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-08-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zcbxaBOkdIObwDCIpnJhpQ', 'review_id': 'vhZY2_M5F0a9jE_6p2Br4Q', 'text': "This place is great. Excellent pretzel apps. Humus was awesome. Dinner was cannelloni, ribeye and burger. All sensational. Drinks cold refreshing and tasty. Very cool atmosphere. Went late Sunday after moving my son into ASU. Manager thought our order took too long so apps and dessert were comped. Really not necessary. Can't say enough good things. We will return.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-08-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9zHXvA4QrlFd4_QWiN6JaA', 'review_id': 'mZW-n9yHQyJu34mAvjIyWw', 'text': 'Came in late for dinner while on a business trip. Fun vibe, good service, good beer and a tasty seared ahi salad.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-08-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'gmNJqrNscjSr80XKWF7Ihw', 'review_id': '3mWG8AzYAoeKxS2Sguyhjg', 'text': "They have great happy hour deals for food and drinks especially the pretzels and cheese and the sangrias! Plenty of seating indoors. Really fun, hip atmosphere for all ages. Backyard games, like cornhole, to play outside with fans and misters, but it was still too hot for me to even want to outside, so I didn't really check it out. I only looked from the window. The only qualm I have is the small parking lot. They do have complimentary valet.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-08-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'U2Ez3lMr3CHuNl8NFww4QA', 'review_id': 'iVHR3NC7D2Z-0aSVW6QjWw', 'text': "This is a fabulous HH spot! Trendy atmosphere, games, sports, $3 beer mugs, $4 well drinks, $3 Sangria {and more} and a variety of full sized apps for $6. {Of course, my favorite app is the pretzels + fondue} YUM! Both 'Yard' locations are on point! {Central Phoenix & Tempe} HH runs from 3pm-6pm Monday -Friday!", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-08-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'DCHjsxtyJscMeTCTew0bFw', 'review_id': 'yACde_Rs5S6xw4BpFiQnAg', 'text': "MY NEW FAV PLACE!!!!! \n\nI cannot be more excited to write this review because everything about the Culinary Dropout was a successful bliss. I love the concept of this place-big, open space, high ceiling, warehouse with cool lighting and hipster servers left and right providing excellent service. \n\nIf the ambience wasn't cool enough, just sit down and order something on the menu. My coworker got the meatloaf and he was swimming in it. I ordered the Steak and Potatoes and was drowning in it. Definitely going back with my hubby to try all of their yummy cocktails and other dishes for sure. Probably this weekend! lol\n\nThis place would be a great place to rent for company events or even weddings and parties! If the chef was a culinary dropout, thank goodness he dropped out to create The Culinary Dropout.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-08-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yKjVoXOYbPUOOdAc6ktbeA', 'review_id': 'VFLZuDygjaAsVQdNmUlGUQ', 'text': "9/26/15 - So last night we enjoyed another evening at Culinary Dropout in Tempe. This follows a bad experience we had there a few weeks ago and and I must say they did a great job. The food was great, the service was excellent and a we were indoors (Yay!). A shout out to our server Joey - he's the best, as well as manager Samantha. Thanks for a fun evening, I'm sure we will be back. I updated my review to 5 stars.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-08-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DPf44SWT4mc3AvJWG-GzSA', 'review_id': 'CP06sH-P3hzMJoJto7_j_g', 'text': 'Great bar staff, super nice and quick. Food was killer. Thai chicken wings and The pub burger were ridiculously good! I am a fan. Plus bags on the patio and ping pong what more could you ask for... Oh football... Yes showing the game too! Ahhhh winner winner Thai chicken dinner', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-08-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 7, 'cool': 4}, 'user_id': '0EgiHCjfGKwIH7tOlLYrzA', 'review_id': '4N-j-bHgHj1SnIVAtojPUQ', 'text': 'Great place for drinks and big groups.  They can keep up with the numbers.  There are tons of staff to keep you and your friends happy and glasses full.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-08-23', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 1, 'cool': 0}, 'user_id': 'x__ETgIOlkXijg-8U0_YDA', 'review_id': '0qzsDPy4s7kHmca4lDYCEA', 'text': 'Culinary Dropout used to be my favorite go-to destination in Tempe. I\'m not saying the food is that great, it was more because of the personable and accommodating bar staff, great ambience, diversity of clientele, and live music on Friday and Saturday nights. However, on a recent visit, my husband and I experienced a rather unusual and disturbing encounter with Jason the General Manager that I won\'t soon forget. Call it corporate political-correctness run amok, but the way Jason tried to represent his other patrons at the expense of alienating two of his best was inexcusable. Jason was not rude, but let\'s just say he was a bit...snarky? smug? condescending? Jason came up to us from behind the bar and interrupted our conversation to explain that we were this night, or in the past, a bit too brash. I don\'t remember his exact words, but this was the gist. This is a bar, after all, and I thought it was typical for people to have loud and lively debates, but I digress. As I challenged him because he clearly did not have his facts straight, he refused to be specific, only saying that "other people" concurred. Humbly, I admit that my husband and I can get a little heated in our conversations, WITH EACH OTHER, and if Jason could have identified what either of us said that was rude or offensive, perhaps I would understand. During this berating session, I just looked at him completely bewildered because we had been there less than 30 minutes. Whatever his goal, Jason handled the situation very poorly. Would it not have been better for us to talk directly to the people we offended, if indeed we offended them?\n\nIncidentally, since it\'s opening, we were in the habit of spending over $300 a week at this Fox restaurant alone. We have chosen to spend that money elsewhere.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 2, 'date': '2015-08-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'RnT_jkLlk9Hq5sCDmGa7OQ', 'review_id': '9LJ4F81g8yZu4UaFpr67LA', 'text': "This is new since our last time in Tempe and we liked it enough the first time to come back (yes we ordered different food!) again within two days. The venue itself is large with a big indoor space as well as an outdoor space. It's Tempe and it's August...we chose to sit inside. Happy hour prices for both drinks and food are good and they have a dollar beer-in-a-bag. We liked our food a bit better the first day when we selected soft preztels with a cheese fondue dip. Those were delicious, but rich, and we couldn't quite finish between the two of us, though we did take the leftover pretzels home. Out other split was a kale salad that had corn and all kinds of other good stuff in it and that was completed with a light and flavorful dressing. On the second trip we had a pimento cheese appetizer and potato chips. Both were good; we needed bread for the cheese, but were able to get by with the potato chips. One person in our party got a chicken sandwich. It was good, but there were a couple of bones or pieces of fat/cartilage in the chicken that were a bit unsavory (our guest was polite and didn't explain). We ordered the grilled cheese sliders the second day. They are rich and good and just a bit too much for how I've been eating lately. Rather than ordering a plate for myself, I'd be more inclined to split an order and a salad.... All in all, the food is good, the ambiance is great, the service is above average for sure, and the portion sizes are generous for the price. Came back twice in a couple of days...I'm sure I'll return again in the future.....", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-08-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-yRLeYiBOjWW305IJPzFfg', 'review_id': 'w9xrydZ037H18WwWhaOUrg', 'text': "Went here last night with a group of friends, great place for a large group. We ordered all the top recommend items pretzels, fried chicken, and the salted Carmel dessert. Everything was awesome! The only reason I didn't give this place five stars is because the temp. Inside had to be 85' it was so damn hot!!! We actually left early because it was so hot inside. I was there a month ago and it was hot inside also. Dress cool!", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-08-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'p7VKdqjT3WNvL7dRNNetcw', 'review_id': 'HOzeuOuGgBKkAMdrNoi2Gw', 'text': "We had a 5:45pm reservation and arrived at 5:30pm.  Despite there being open tables, the host told us we had to wait until our time.  So we stood there and watched the open tables and had a bunch of people seated before us.  Lo and behold, after waiting 15 minutes, we were seated at one of those open tables.  WHAT???  Insulting.  They never called us - apparently I was supposed to know they were going to text me; phone is in my purse and it is noisy in there so I didn't hear a thing. Finally seated and the waiter was great, but the typical wait way too long for the check and the payment processing.  \n\nThe food was mediocre.  Appetizers over $10 and food over $20.  I had the nachos and they were okay - I wouldn't order them again.  Friend had the meatloaf and said it was good.  Two other friends had burgers and they were just ordinary - and very salty. \n\nI have no idea why everyone loves this place.  The place is in Tempe, so the college crowd probably loves it.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-08-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'l9GGMi-zf2ZTbHbW8wrkTw', 'review_id': 'wa0iXCIvGAf86Ip3dVlUOQ', 'text': 'I love the atmosphere and our service was ok. We only ordered an appetizer, the pretzels with beer cheese, because we are on a search for the best pretzel/beer cheese. \n\nIt was good but not "the one". Our server forgot about us couple of times so it took far too long to get a to/go box and the check. She was friendly, knowledgeable and bubbly, but forgetful.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-08-31', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'y_5DfxEpBVQp50FblQZa7w', 'review_id': 'fqHrN1Jgwtq06PKKGvL2ng', 'text': "Definitely fits into the new Tempe vibe. It's got a great atmosphere where sports fans, hipsters and families all feel welcome and right at home. The wait staff was incredible and my glass was never empty. We started the night with the pretzel and cheese fondue. The pretzels were the star of the dish. My girlfriend and I had the pork belly and shrimp ramen. This was my first ramen dish and it was incredible. The pork belly gave the dish a wonderful smoky flavor and the  cilantro and bean sprouts added a real freshness and nice texture. I would recommend this dish to everyone. For dessert we sampled several dishes. They were all delicious, but the real standout was the caramel custard topped with caramel popcorn. I could get addicted to this stuff. I will never come here and not order this. I don't remember the name but I call it caramel crack!", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-08-31', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': '7rj3N1PtfRY8tkZpXsd30g', 'review_id': 'SoD23fBChIxMJjy8_JbIJA', 'text': 'Went here for a rare date night with my husband.  We had a reservation and were seated promptly.  This was our first time there and I was amazed at how loud it was inside at 4:30 in the afternoon.  When our waitress finally arrived, I asked for lots of water.  It\'s damned hot out in the summer!  I explained to her that I would like LOTS of water.  \nFast forward to the food... it was average.  We had the pretzel bites for an appetizer. Not horrible, but not spectacular.  He ordered the fried chicken, and I had the fish and chips.  His complaint was the chicken was over cooked and too crispy for him.  I thought it was cooked fine, but really lacked flavor.  The fish though, that was pretty tasty.  It was a lot of food.  Too bad I spent most of my meal with an empty glass that should have had water in it.  LOTS of water.\nI had to ask the hostess for a refill as well as the food runner.  My waitress was very visible on the floor, but could not seem to be bothered by checking in on such a lowly two-top.  Will we go back? Probably not.  This place did not rank on my list of "must have again". And thanks for the migraine due to dehydration... That makes the visit even better!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 2, 'date': '2015-08-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'onWHId2QaCtmqgPK9Gz0sA', 'review_id': '4ENxZaBqBfcYiwXTjItk7Q', 'text': 'Overrated! The food was cold when it came out and the service was decent at best. After we couldnt eat our food the manager paid for our whole meal which was amazing. I will try it again', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-09-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3PBoVJZw3p1vqektD4EKyg', 'review_id': '4Gcmq9k8IsDek9FaCwcydw', 'text': "Took my wife out for her birthday, we were both looking forward to trying this place out.  But it started off confusing walking through a back door past a 'gym' and standing at an intersection as people walked past  with no words of where too go.  We made our way too the check in, hostess area.  We were promptly seated and than waiting for our server, and waited.  After being told we were gonna be started with water we looked over the menu and was disturbed with someone else's drink order.  We went back to the menu, waiting too order, and waited.  We,ordered drinks and our meal at the same time cause of the wait.  As we sat we weren't comfortable with the atmosphere, first a train went by blowing the horn every, 10 seconds, which is understandable, but than the music, this was now a club that served food.  We were than disturbed with another other that wasn't ours.  We understand once but twice...  our food came and my burger was good but my wifes meat loaf was buried under ketchup.  We ate while rolling our eye at eachother about our food.  The noise level was ridiculous for a simple meal.  I wanted to leave after we ordered water, but the wife said no.  Should of trusted my gut. I will not be going back", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 2, 'date': '2015-09-02', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'mDS8rlDOcgRT3PMHGz3tug', 'review_id': '00BvNiXrJksA6whbZvRBlA', 'text': "We've been once before and couldn't wait to get back. Their Social Hour is incredibly priced with wonderfully prepared treats. Think fresh seared ahi, cheese fondue, pork rinds, spiced nuts, olives, watermelon salad, mac & cheese, and more. The beverages are perfection, and the service cannot be beat. Love it.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-09-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'n7gi1zRqVLIkxs58cbIlzw', 'review_id': 'BZtcnNs2paiPfOL76KW83Q', 'text': "The atmosphere is incredible, the customer service is amazing, and the food is fantastic.\n\nI came here with my girlfriend for Labor Day, and from the moment we walked into the store we were impressed.\n\nAs starters, we ordered the Prosciutto Di San Daniele as a Meat Antipasti, and combined it with the Garlic & Herb Goat Cheese, which was a wonderful combination. \n\nShe ordered the Italian Grinder, and I ordered the Fried Chicken. Both were great, especially the Italian Grinder. I actually enjoyed her meal more than I did mine, although both were very tasty.\n\nAfter all this food, I decided to order the Grilled Cheese Sliders (apparently my eyes were bigger than my stomach) and I couldn't eat them. Half of the reason was because I was pretty full, and the other half was they just didn't taste that good. My expectations were soooo much greater than what actually came to the table. They make them sound and look way better than they actually are. Three tiny little grilled cheeses with a quarter of a slice of bacon in them, which apparently are supposed to have tomato as well, according to all the other reviews I've read on here, but mine didn't come with any; alongside an ungodly amount of French Fries, which I can't really complain about, because their fries are amazing.\n\nOverall, I am very pleased with this restaurant. The food (for the most part) tastes great, and the atmosphere is really cool. Plus, they have $3 Sangrias for happy hour! Unfortunately however, $10 for that unimpressive Grilled Cheese Slider plate is gonna cost you guys a star. I will definitely be back though for that Italian Grinder.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-09-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'h8viN9zOKKqZkj-lcmrrdw', 'review_id': 'goZTWCD9vEzSF5IihcBXdQ', 'text': "Awesome service, great food that's VERY reasonably priced and a very fun environment! Coming back for sure!", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-09-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': '5v5kfSCSxCScnevRBhIJyA', 'review_id': '4PkytJ9dVJI6JVVCFjsToQ', 'text': "Good food, not great but that's not what you visit this place for. The atmosphere is very tending and affordable. This is not the quietest eatery, so it's not the best place for a first but it's solid place to go out with friends in a group.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-09-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'cEUwQWA8A30Haft-Xh7Meg', 'review_id': 'kuDPgv5zVAwL834cJgHxMQ', 'text': "This place is awesome. Service, food, ambiance, all of it. I'm from Colorado and I wish there was one in Denver. Jealous there are 3 in the Phoenix metro! \nI inadvertently ended up here on an ASU game night so lots of fans and the game on. Super friendly, fabulous open space. \nI tried the antipasti plate which is made up your choice of meats, cheeses and other snacks. The grissini is a tall thin crunchy breadstick. Terrine is a fig date walnut granola bar thing. Also tried the pretzel fondue. I've never had such a delicious bowl of soft, warm, pretzely goodness. And then add melted cheese. Heaven. \nSome interesting signature drinks. Extensive beer menu with several AZ brews. \nLive music on Fridays and Saturdays, although not sure how that works with the game on? \n\nOh and didn't even get to 'the yard' a large covered outdoor patio (with misters cuz it's AZ) where several games of corn hole can be played.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-09-12', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 2, 'cool': 3}, 'user_id': 'xGRJsXsEeHweFoKyAS5hyA', 'review_id': 'x206cZ4Rlmfe82FNuroLJQ', 'text': "what did you say???\n\nsorry, I couldn't hear you over the noise...", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-09-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'lSB6eL4Tf1ot7S2dy9sKEA', 'review_id': 'cpGkpQDcoRUzw47tUGNV3w', 'text': 'Fantastic food and cocktails ($10). Outside games. Live music. Great place for a party.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-09-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '0usxfARATUKugH-rQtIp6g', 'review_id': 'rjYL0ja5VrcDWNfSEmFY1g', 'text': 'Took my mom and my 7 year old here before a show at Gammage. The place was not crowded at all as it was Sunday afternoon.  The service was great (weird though having two waiters shadowing each other, kind of creepy) and the food was delish. Even my kid finished her plate. The ambience is super cool, and I wish there had been a band playing on the stage so we could have experienced the nighttime atmosphere during the day. I will definitly go back the next time I am in Tempe- wish we had some cool restaurants like this out in Peoria.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-09-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'vchlSciUl7rwVi93sPsQ9Q', 'review_id': 'UesN7UPWeFEFIWlO9FKs0A', 'text': "I went here twice for lunch (almost in one day). Everything is made in house. Non of that soup in a bag nonsense. Yesterday's soup is pretty good by the way. I had the tortilla chicken something or other. The fried chicken is pretty fing good. The biscuit? Phenomenal biscuit. And I can make a mean biscuit. Let's see.. Oh I had the corn chowder cannelloni. That was amazing. I didn't get to try any drinks but seeing that there was some hipster guys behind the bar with righteous beards that made me feel less of a man I think they are probably pretty amazing. (The beards too). Anyway if you are in town eat here. You probably will not be disappointed unless you are a terrible human. Sorry for the lack of punctuation. I didn't pay much attention in public school. Cheers!", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-09-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'FLxSr8dBfjyIzq7Xm4C2Pg', 'review_id': 'yRs0VU0tgTNQz2_j75Yr9A', 'text': "This is a really fun place and the food menu is excellent. The games and choice of atmosphere are great. The only reason I did not rate 5 stars is because the wine list is all very sweet. Between myself and my friends we tried every wine on the menu - all were very, very sweet. I don't want a cabernet that tastes like fruit juice. Beer is clearly the way to go at this location, preferably with some of their delicious pretzel bread and provolone beer cheese. \n\nAlso - most of the wait staff is excellent, but we ended up with a dud on this visit. He was a douchey hipster in a hat who at one point said I could not order a glass of wine because it was on tap at a bar on the other side of the restaurant - somehow another waiter had no problem getting it for me.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-09-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'RyKF9WpyxDikoF6ADsHMDA', 'review_id': 'sB0zW-1qjM6ATg-2z2QOmw', 'text': "Wanted to like this place, but the server fit the bill as a dropout! We ordered a charcuterie plate and received it with no bread; trying to get the bread was, no kidding, a half hour process, with asking more than one server. Don't get me wrong, I understand when things come up, but our server pretty much admitted she forgot to order the bread.\nBut the best thing we ordered was the provolone fondue. I can still taste it, it was to die for! It comes with pretzel bites, but any bread will do. If you are ever there, please do yourself a favor and order the provolone fondue!\nThe shrimp and pork belly ramen is a must try too.\nI would like to say I want to go back, but the service really did me in!", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 2, 'date': '2015-09-18', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 5, 'cool': 4}, 'user_id': 'wFweIWhv2fREZV_dYkz_1g', 'review_id': '1Eh_kPkdNCiRvpOVxYHfUQ', 'text': u"Came here for a late lunch with my mom and grandma (who are the cutest lil women you'll ever know) and the food was absolutely delicious!  I ordered the seared tuna salad and it was like a party in my mouth, so many flavors.  My mom and grandma shared the grilled cheese sliders.  I tried to get them to venture out but these weren't just any grilled cheese so they were utterly pleased with their selection.  The service was just okay.  I really enjoyed the d\xe9cor and the open seating but we sat in metal chairs that make it uncomfortable.  I looked at everyone sitting in cushioned seats with chair envy.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-09-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '8sVEE1a-t25pOsY6BY_Gew', 'review_id': 'pYDh3d2pIv7MpujMZyZX8w', 'text': "This is the go-to place in Tempe if you want a laid back place to eat & drink, while avoiding the college-y Mill Ave vibe.\n\nThe soft pretzel balls with cheese fondue are a MUST. Everyone I know raves about how they could drink the cheese because it is just that delicious.\n\nOther items on the menu that I would recommend are the pub burger and the sweet corn cannelloni. The one thing I would not recommend is the ramen - it was pretty bland, didn't have shrimp as advertised, and when I asked for Sriracha to jazz it up, I never received any. That was probably more of a miss on my server's part though.\n\nThere is tons of space for activities, so it is GREAT for large groups. But heads up: if you go to the back area near where the games are you can only order from a limited food menu.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-09-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '6Kaejy_XcgJGm8jyZhXSkg', 'review_id': 'QjV0dvcq8DtNpW-LiVuVAw', 'text': "This location is very hip with a funky vibe.  A little too funky for my taste.  I felt very out of place, not dressed like a hipster.  The food was pretty good though, servings a little small but tasty.  That being said the pretzels and fondue weren't out of this world even though the server told us they were the most popular item.  I will say service was spot on so mega points for that!  I don't think we'd return to the Tempe location, but we might check out the one in Scottsdale.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-09-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-0-LfcTRW9A0Lkhp-xitig', 'review_id': 'TNj_Q1Wpr9Eqy_q0NQD91w', 'text': 'Had a wonderful time there tonight. Food is always  great and servers help each other out when they get busy which is great to see. Security is always on point, knows when to take charge, super friendly, and especially Rob makes it a point to know the guests!!! They are great addition to your staff!!! Looking forward to joining again soon.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-09-19', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'RyzzI97Vq4IelbSp5wwGtg', 'review_id': 'e3xAfNMsud0uXxNmqHnGvQ', 'text': 'A fun, loud happening place in Tempe! \n\nThis place is huge, loud and happening! There are ping pong tables in the back, plus the bean bag toss game.  The place is always super packed with people, especially on a Thursday night or on  day of an ASU game. \n\nThe service is pretty slow but they get the orders correct. \n\nFood is interesting and tasty.  Note that the cheese plate is just that - one slice of cheese! No bread unless you order it separately.  \n\nThe drinks are interesting and tasty.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-09-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'QRKnn9yz5fW-3_4xctF7xg', 'review_id': 'oLNw0iI5CyrQe0kWzUKhaA', 'text': 'Do not come here on a weekend to eat if you want to spend less than two hours for your food.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 2, 'date': '2015-09-19', 'type': 'review'}
{'votes': {'funny': 6, 'useful': 2, 'cool': 1}, 'user_id': 'Yi0FmxcLmtleXpLV0ycr1A', 'review_id': 'RxwQRN7prZQTPFDqq7EkWw', 'text': 'Waw. I have given this establishment 3 chances and now I am ready to describe my feelings. The title is very descriptive of the experience because it feels like it\'s ran by a drop out. After waiting about an hour for a table, prepare for at least a 2 hour overpriced meal. The food is artesian inspired but is more basic tasting than an Instagram selfie with no filter. I\'m surprised I even got my food after waiting 45+ minutes every time I\'ve had the displeasure of dining here. My drink (the only good thing) was constantly empty and I never received an extra side of ketchup after 3 attempts. I\'m convinced Chingy receives better service than this "chillin\' at the Holiday Inn" ... Their "scratch kitchen" also ran out of tortilla chips AND meatloaf... UNFORGIVABLE. \n\nIf you\'re a basic wanna be hipster and have a lot of extra free time to overpay for mediocre "artisan" food that they probably ran out of... Feel free to come on by.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 1, 'date': '2015-09-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'EWRTDuguwiVgYWgPJyLEwA', 'review_id': 'd4eHhGJG8aBnGwWvL557Eg', 'text': "This establishment is so cool!  The design, atmosphere, and decor are great!  There's a large dining area with neat tables and a gorgeous bar, the second phase/ room is more tables with a mix of chic chairs and couches with lawn chairs, corn hole, shuffleboard, and more fun, then the third phase/room is like a huge barn with another bar and large tables, chic couches with tables, and gorgeous lighting arrangements.  \nThe bar offered a variety of beers, cocktails, wines, even a brown bag beer special!\n\nThe food, oh god the food- so good!  The pretzel bite things with fondue for the starter were to die for!  I was a little bummed in that I ordered smoked salmon, but was given a grilled salmon with risotto- the server claimed it was the smoked salmon, it definitely wasn't,but it was still ah-mazing.  The risotto was perfect.  \n\nGreat service, love the decor, very spacious and open!  This place is a real gem- must try when in Tempe!", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-09-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'UyBONmVWxzHwRWgSPAIMtA', 'review_id': 'ibx0Fog1bWbdXOZF-AolZQ', 'text': 'Very satisfactory dining experience. Loved the ambience.. Very hip and trendy. All the servers were polite and courteous hipsters. Fantastic selection of craft beers. Menu offered a plethora of new American cuisine. I indulged in the Black Mussels steamed in Stella Artois. This paired well with an IPA. Service could have been a little quicker, but besides that.. No complaints from me. Being close to ASU, I would have expected more raucous students. It was a very balanced crowd though. Young professionals, married couples with children, and students all mingled and enjoyed the good food. I highly recommend Culinary Dropout to anyone looking for a laid back night out on the town!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-09-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'OjH84aBGrQmAVkQELR8CWA', 'review_id': 'cqPU1FcLHQYpqY4dZPLlyA', 'text': "Don't let the name fool you, these guys exceed culinary artist, Gordon Ramsey. With each bite I took, my taste buds were in ecstasy. Definitely somewhere to take your lady out for a nice treat.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-09-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6GJM8bWV3m2cOYPjDjohJA', 'review_id': '-fNNZemWVk_Yau4m1j80JQ', 'text': "Everything our table ordered was delicious. It's got a cool, open vibe inside the Yard building. The fried chicken was so juicy and flavorful, it didn't need hot sauce. The pretzel bun app, and turkey pastrami were both top notch. Definitely coming back.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-09-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '_4lqpCYCqOQzbB6xQGGhrQ', 'review_id': 'ScCw_WkvOTFyZZn3WEXYmQ', 'text': 'This is definitely one of the cool new places I have had the joy to discover.  Services was great and their food options were wonderful.  I highly recommend their pretzel bites.  Delish!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-09-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'pmu7FTolC1NnQm_vU6YCYQ', 'review_id': 'pDLSeAJcjf1wCNMbuL1FMA', 'text': "My sister hosted a baby shower for me at Culinary Dropout (my suggestion based on great feedback from some coworkers) and we were treated so well!  We had a large-ish group of 10 people plus cupcakes and gifts.  I have to honestly say, I have never been treated better at a restaurant with such a large party.\n\nThe group ordered everything from the nachos to the grilled cheese sliders to hamburgers.  We also ordered the pretzels and fondue and they brought out an extra order since our meals were taking longer than expected to come out.  The food was absolutely delicious!\n\nI can't wait to come back when not pregnant to enjoy some cocktails with my husband.  The manager guy (I think he was the manager) came over and said some kind words, spoke with my mother in law about the live band that was playing, and made sure I was satisfied before we left.  I cannot speak highly enough of this little hipster haven!", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-09-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xUGhdr4HVirQlBXFi3OQpQ', 'review_id': 'syx0Hdj2rq-j0dzReC-uLQ', 'text': u'Great environment, casual open yet current vibe with good choices of Moscow mules and charcuterie choices. Had the jalape\xf1o and molasses ribs that were delicious. Request wipes as this will get messy. The Korean style ribeye was ok and meat portion was smaller than expected but vegetable accompaniment was flavorful. Overall fun and good place to try', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-09-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'i8bjzH7a4EdS8YieDOKRyg', 'review_id': '4Qe6VkbrWJs2-4QpuSq_og', 'text': "Enjoyed time here after the USC vs ASU game. Great beer selection. We shared the potato chips with onion dip (yum!) and the grilled cheese sliders (also yum!). Our server kept the right blend of leaving us alone and making sure we were taken care of. I hope to go again to Culinary dropout if we're in Tempe again, if only for the Monkey Bread. The couple next to us had it and it smelled AMAZING! We were just too full too order it.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-10-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FYkg56uH3795-TXr6WA15g', 'review_id': 'fSuTJumBQE6rk4qxpJWTTA', 'text': "Service was great and the food was great as well.  Really like the fact that they have an in state selection of beers. I will definitely return for another meal here.  The atmosphere is relaxing and it's not too loud.  Great place to hang out with friends", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-10-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vaiKeqku_IsgjCAyReGsDw', 'review_id': 'PAYNVUtHR4ZMklHqZsEQHA', 'text': 'Fantastic. Extremely fun environment with friendly staff from the minute you walk in to the second you leave. Food and drinks were wonderful. The bartenders are extremely knowledgable and attentive. Soft pretzels and deviled eggs are must have apps. Very reasonable pricing and NO "no-name" cheap rails. (Some of you true enthusiasts will appreciate the significance of this alone) this is a must stop!!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-10-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '7scZp-RI7WNP4JjOLz0CJg', 'review_id': 'immo_LjzwyaWBEflvoKnew', 'text': 'I had the trout and it was cooked superbly.  My colleague had the salmon and it looked great with the barley cooked like oatmeal underneath.  Beers were great.  Cool place with a great vibe.  Food is not overpriced.  All was great.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-10-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VZmjh4DrycVfTw3WigMQaA', 'review_id': '2yZ8aZMNuZtwroSHxHYczQ', 'text': "My wife and I happen to be in Tempe and without kids. Since the Cosmos aligned, thought we would try a place that doesn't have a slide or play place attached to it..\nCulinary Dropout sort of hard to find yet well worth the hunt!  \nAfter walking down a long, cement hallway, it opens up to an airy, hipster yet welcoming main area. \nWe were quickly seated and quickly attended to. \nThe food consisted of a variety of burgers etc with some culinary twists. We shared the roast beef dip and also had the pretzel bites to go.\nFantastic meal and the bites w/the cheese sauce are dangerously good.\nGood craft beer selection of local favorites along with some non-local goodies. \nThe server did give me the wrong beer yet I did not complain...it's beer!\nAll in all, great place to dine and if the Cosmos aligns again (or we get a sitter), we will head to Culinary Dropout!!", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-10-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'tpip9F3_zreB0Rn4-fbnPA', 'review_id': 'HtkFzjqFT932GDRuGKpxWg', 'text': 'Really good, fresh food in a fun environment.  The service was very good and the food came out and was very tasty.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-10-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'HjXI6jd9YQy7TwPEgJyd0g', 'review_id': 'vV-M7FNJZjZ82Pq3BQjAzA', 'text': "I thought the food was pretty standard for a gastropub. I had the fish n chips and it was solid. The atmosphere was nice as well. There was a pretty good beer selection. However the service was really lousy. Our waitress stopped by twice over the course of an hour and 10 minutes. We evetually just started walking up to the bar for our own drinks. It wasn't too busy so I'm not sure what was going on. Price was pretty high too for what you are getting. I'd skip this place and head to four peaks.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 2, 'date': '2015-10-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Rq4IhvibuHGgfT1r9juUIg', 'review_id': 'PN0_dLq2XZ6NLz4V2DIukw', 'text': 'This place is HUGE!!!!!!!! Great for Birthdays even when its crazy busy the staffs very calm and relaxed which makes u feel good! The prices are kinda pricy but its worth going! Plus parking is perfect!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-10-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'LLE98MBcow3rHx67DRP4Zw', 'review_id': '6qPQD0a4J9279eV3lWg1gA', 'text': "We decided to give this place a try after the Iron Man race at Tempe Beach Park.  It looks like it is in a warehouse...and is awesome inside.\nWe ordered the preztel bites (seemed like every table did as well), pork belly nachos (mmm, i appreciate the use of nacho cheese), fried chicken and ramen (pleasantly surprised with how good this was...and i'm asian!)\nThe food came out really fast, the servers were nice and on top of it (drink refills came before i even noticed!) and the food was great.\nI will definitely return the next time i am in town...and might even play some games.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-10-19', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 4}, 'user_id': '8Knppc9FtlyJNi9ySRz8XQ', 'review_id': 'sO1DLVjEkCmGFb6kppueIQ', 'text': "I heard that this was a great place and wanted to check it out for my birthday. The security is very strict in the evenings. I had just moved to Arizona so I had a temporary paper license and my old license with a little hole in it (that's what they do at the DMV). When I presented my old  license, the security guard was very stern and would not accept it and told me to come back with the paper version of it which I left in my car a mile away. (Even tho I'm way past 21). I get it, it's a college town, there are liability issues, but the guy was so unfriendly, I left on the first occasion, not wanting to do a 2 mile trek to return.\n\nI came back for lunch to give it another shot for football Sunday. My friend and I ordered a cheese fondue which I found to be rather mediocre. The cheese resting in a mini cauldron sits on top of a little candle. The cheese hardened within minutes. However, the salads are decent as well as the monkey bread. There are also a multitude of TVs so you can catch whatever team you're rooting for. Great spot to watch sports. \n\nThe outside leads to The Yard so you can play all sorts of games like corn hole, ping pong, take pics at the photo booth, or just hang out.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-10-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'UN4jGWw_XkgAg_14PTVLaQ', 'review_id': 'YTqi8K-wcjW1Ha7uiwjF2g', 'text': "From the pretzel balls to the salmon entree and the corn and kale salad, the food is delicious. The ambiance is casual cool. They have ping pong tables, selfie stand for group photos and good vibe. It's more than bar food, its culinary dropout.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-10-20', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 6, 'cool': 3}, 'user_id': 'f4CExFYr3GTMSBD4BccDQw', 'review_id': 'oYvyMy8Y-lRoj4QA9Nu7pA', 'text': "A little disappointed when I came here the other day. I have been to the Culinary in Scottsdale so I figured this would be great to. We stopped in for an early dinner, had the rainbow trout and the steak and potatoes. The fish was bland, usually covered in a caramelized sauce, almonds and really tasty, I was actually craving it, that's why we went. It was cooked well, just lacking the caramelized sauce, which unfortunately made the dish a little bland. I was really looking forward to it too :( Now on the other hand, the steak and potatoes were delicious! Cooked really well, seasoned deliciously and made my taste buds dance! I think next time Ill have a plate of that myself or try something else on the menu. A little pricey for hit and miss food.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-10-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '0trYkEZFTej_lt8mi0ELWw', 'review_id': 'Z4SM-7vYPUvkzVmoalDKpQ', 'text': "Love going to the location on 7th Street so when I was able to make it out to the Tempe location, I was psyched. It's in a great location and is huge! If I still lived in Tempe, I would be here all the time. Great food, great drinks, great happy hour. Don't forget to order the pretzels & fondue!", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-10-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'vj4i5hGJ08ljfGzmqk3ehg', 'review_id': 'TJ0fPQCVchUN8maO4Pgdpw', 'text': 'Went there twice and love the atmosphere. Was a little frustrated with the long wait since I had a reservation but the good food and service made up for that. The first time I went I got the meatloaf which was perfect. The second time I went I got the fried chicken that was a bit on the salty side for my opinion but the biscuits were perfect', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-10-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'TMmxB675KyM3F0oUDvls6A', 'review_id': 'dc5TK7KcVYT6Ns4-Fr0smQ', 'text': 'Went with the extended family and some guests from England.  Service was very good, food was good but not great (so 4 stars). Really cool space with lots of beautiful people milling about.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-10-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'ryDua_8A7UAWbyq_LT1Q3g', 'review_id': 'fZpKGtAjExfcPScfjcFq2g', 'text': "Great food & environment & restaurant but every time I go the service always takes longer than usual, whether if it's just first greeting the table or coming back for refills & even the food has taken long to arrive. Other than that the food & drinks are awesome. They just need some help with the service & they have a lot of staff so it shouldn't be that hard.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-10-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'QghGTkP4tpO97PP75B2r8g', 'review_id': '1ZqJFA2lcf5SQvQXe4NcPw', 'text': 'Go during happy hour the food is reduced prices and smaller portions but you get to try so many amazing food. Its worth it for.the food must try the beet salad and pretzels', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-10-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'cFtEju9t5xesX6HEl1_IUw', 'review_id': 'kiMBnVJK-VdO_fgBWRf2tA', 'text': "Very good, everything from scratch. The pretzels, fried chicken, biscuit and fries were the best I've had in a long time.  Matched it with a new Belgium slow ride IPA.  We are from Milwaukee, and wished we had a place like this back home.  Free ping pong, shuffleboard and bag toss too.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-10-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PPfxiZJU5qvRax-nInEPmQ', 'review_id': 'LykeR2zhhEOhK-ZMdcKg9Q', 'text': 'I liked it. it was a good environment. nice music.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-10-27', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': 'vHoKL-4FCgGSfDrPr43Opw', 'review_id': 'ZDAvph0JrPTHsV49Idn_dg', 'text': "I am in love, love, love with Fox Restaurants. Never been disappointed with anything I've had. The atmosphere was fun and engaging. We got the pretzels for an appetizer and they were soft and fluffy little pillows that I absolutely adored. And I might have drank the cheese sauce it was so good. I got the kale salad and every bite was delicious. My husband also really liked his Italian sandwich, although it wouldn't have been my first choice. They were out of the beer I wanted, so I ordered another; and it was fine. Just a little annoying when they run out of their special beers on tap. But still, I had a great time.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-10-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'b5FTmiyEjJJrPMkZ1voftw', 'review_id': 'm1nSC7C3h-epZWSyWWjXxA', 'text': "Fantastic happy-hour. The pretzel fondue is my personal favorite appetizer--As I'm sure it's many other peoples as well.\nHaven't had a huge variety of items off their menu, but the honey fried chicken has been wonderful the few times I've had it.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-10-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'WLDqVeWShKE9pUVNIFTfig', 'review_id': 'SfaBSJNDHHE_fmzw9YBmKg', 'text': 'Great atmoshpere, drinks are no lite ;) which is great. Got the pastrami turkey which was delish, and pretzel fondue yum...that is a meal in itself!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-10-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '0dMia6PaaewX_RcUokWh0g', 'review_id': 'lfbJxRhjCr2z3GokJmS3MQ', 'text': 'Great food, fun atmosphere. Can be a little pricey but the food is worth it. Really awesome cocktails!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-11-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'Jk_RqHrQrBR4QLZd9X_r6g', 'review_id': '-j7xNhE4kaH62960U3s5MA', 'text': "Went here with a friend on a quiet Wednesday night. \nThe good part's were that it is a very cool place to eat. There seems to be a lot gong on and it's very relaxed. The atmosphere was pretty good. The food was pretty good as well, I got the fried chicken. The sides were fantastic, the appetizer of pretzel bites was great as well. \n\n\nThe only real disappointment with the food was I wasn't a huge fan of the fried chicken. It seemed almost sweet. But it was cook perfectly, just cause my palette didn't agree doesn't mean it's wrong. \n\nThe big let down here was the service. We were in on a slow night, in a pretty slow section but service seemed disoriented almost. We sat down, got a menu, and our server walked away. After that she came back and asked if we wanted any appetizers, and we ordered and she walked away again for the second time without taking our drink orders. I had to ask for drinks when she came back with the appetizers. After the appetizers, she took our orders and we didn't see her again until entree's came out, and again I had to request another drink without being asked. \nI've worked in the service industry a number of years and it just was over all very underwhelming. THe service lacked attentiveness on a seemingly slow night.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 2, 'date': '2015-11-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IjozJ-lCqfmmiAtmVVbdtA', 'review_id': '_2JXcbMjH9O19G5YW7bBqg', 'text': 'I love culinary dropout its one of my favorite restaurants in tempe! Last time i went there i had the fried chicken and it was cold inside, i was so disappointed..', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-11-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'bvlZOGoPmO5mxedxcnqs5A', 'review_id': 'FKM6fM5ALDh8aki081grNQ', 'text': 'Big open area great for large get togetherness. The bathroom doors are 90% see through which is very uncomfortable. Beer selection is good. I recommend  the brown bag special . Food is ok nothing spectacular or must try. I did have Asian tuna salad and there was barely any tuna in it. The cashews and sesame seeds were a nice touch of crunch and umami.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-11-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'csN9GyUXGfxZl37uyz2iEw', 'review_id': 'wr1lIUr4hkEDS2HKuV41wA', 'text': 'STaff is amazing. The bartender suggested the French dip(prime rib)  by far the best I have ever had. Keep doing  it right gang.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-11-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'mSEYVVMMwssCyxyVaOlqsw', 'review_id': 'CBA8EfkO7JFastEa4Ht_Zg', 'text': "The drink menu is fantastic! And so are the nachos. This is a really cool place with great seating. Corn hole and ping pong as well. It was extremely loud in the outside area but I guess that's part of the charm for a big party scene. Excellent food either way.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-11-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': 'GLSkiHPyho8lithQongENQ', 'review_id': 'l6MA_32-CR-0iCMb_AMkRw', 'text': 'Hip little hangout near Mill. The food is unique and delicious. The "Ma...The Meatloaf" is absolutely amazing. I truly enjoyed the food and the atmosphere.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-11-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'K_r9apA7mKD0o2ENM_uneA', 'review_id': 'TCBRvWMg2omHT_ueVI4T4w', 'text': "I have to start by saying there was a weird vibe about the place- like 4 hostesses waiting for us, a couple big security guards walking around... It just doesn't have much of an inviting ambiance like the one in Scottsdale does. But we kind of got over that once we were seated.  \n\nSo my boyfriend and I started with the house-made potato chips and french onion dip. These were SO good and I'd definitely recommend ordering them while you wait for your meal. \nWe ordered the Thai chicken wings... So, we're both from the South and we're kind of wing/bbq snobs so maybe we're being picky. But these just were not good. They were pretty slimy and a little bloody as if they weren't cleaned well enough or cooked long enough. However, our waiter was VERY nice and accommodating when we asked if we could order something else instead. We got the fish & chips which came out pronto. They weren't bad, maybe a 3/5.\n\nOverall our waiters and the staff we encountered were very nice and helpful. This place was not horrible by any means, but I don't think we'll be returning.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 2, 'date': '2015-11-10', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 1}, 'user_id': '3LOQP8QhEZq3RL5HPew6QA', 'review_id': 'gclmxIuRXHzoji6EV_IK9w', 'text': 'Well, the name is apt, that\'s for damn sure. I can clearly see how and why he/she/they dropped out.  The "culinary" isn\'t all that bad, albeit over-seasoned. But, it\'s like a sports bar that met a country farm wedding in a barn.  The service is just not good. I sat, invisible, at the bar for a good 10 minutes at 6 (not busy). Then, when I finally got someone\'s attention to order a couple of bites, I was asked to "check the box".  Really?!?!  I hate that (and the stupid waste of paper). If you don\'t have sense enough to remember 2 items (or be able to send them to the kitchen for production on anything other than a grocery list), give it up!  I made a couple of scratches on the sheet and was pleasantly surprised by the taste.  I\'m still confused why the "bites" would all arrive on one dinner plate ... Poorly arranged (as opposed to separate small tapas-style plates). And that cheese chunk (with no bread) was laying right there along with all the rest: ODD. Plus, the Brussels sprouts were as cold as a stone. I don\'t get that either. The thyme with beets and balsamic was a treat (can\'t wait to try that at home).  But, one beet bite was overlooked and the next was raw. Too bad. \n\nService never got any better, unfortunately ... Received the wrong items  after scratching them on my grocery list and had to practically strangle one of those bartenders for another cocktail (actually a glass of wine). Too bad.  \n\nFinally, stop asking for my damn name. I was asked 7 times in an hour and 15 mins by at least 4 different people. If you can\'t serve 10 people at the bar on a Wed night with five people back behind the bar, then yes ... Please: DROP OUT and GIVE IT UP!', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 1, 'date': '2015-11-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'jU6iSyW_IC8nfLsRxQheRg', 'review_id': 'ZAWaumD5duDJeaVxNra0UA', 'text': 'Great place for a team dinner with 20 employees - fast service, fun atmosphere, and the food was great.  Had the pretzels and cheese app, amazing butternut squash pasta and the monkey bread dessert was insane.  Others has the ribs and fried chicken - tasted and was outstanding.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-11-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'GoDjpEPTyUQoQVRwPljIgw', 'review_id': 'dkY6LXTl3bODvL8P71NOzQ', 'text': "If you sit at the bar, the service is 5 star worthy.  If you sit at a table, good luck getting any service ever.  My three star review is the average experience we've had so far at Culinary Dropout.  \n\nThe facility is fantastic.  They have some of the hippest bathrooms I've ever seen.  I want that grey geometric tile in my bathroom at home.  The sangria, especially the red, goes down way too easy, so we make sure we come by for happy hour.  I love the spicy thai wings and the peanut slaw they sit on top of.  It's a great place to watch a game or just hang out with friends and talk.  The Happy Hour is one of the best in Tempe.\n\nOn our most recent visit, we were ignored for 30 minutes while our server seemed to be stolen from the area by a huge table on the patio outside.  No one else came to check on us or ask us if we'd like to order food.  We eventually flagged a random server down to get our check.  That experience left a bad taste in our mouths that I hope will never be repeated.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-11-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KpIUc2_sPq0U1G2Zn5v1kQ', 'review_id': '4LoM71bNy3QIOsc4_tn7cQ', 'text': "I came here for lunch one day. My table got the chicken nachos and thai chicken wings, which were both adequate--wings were tasty, but small and bony. Beer selection was pretty good as well, and wait staff was very helpful in finding us beers that we would enjoy. Portion sizes were good.\n\nOur server definitely seemed like he was trying a little too hard to be friendly. Service was slow--our waiter took a long time to materialize after we sat down, and the food took forever to come out. Yet our waiter would linger for excessive periods of time and make weird, desperate jokes when he did decide to grace our table with his presence. I am probably being overly critical, but I found it a little odd.\n\nI know that the cheese dip and pretzel bites are absolutely to die for--I had them at the Scottsdale location once, but resisted chasing the dragon on this visit. I recommend getting that if you want an appetizer.\n\nAtmosphere is pretty good. The decor is lovely--I love the tables and chairs especially. But even as an design student in my early 20's I thought the whole vibe of the place was a bit too hipster-y for my tastes. Good place for mustache and beard spotting, though.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-11-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'NDAuPdt0lSpZh-O7OZBYbA', 'review_id': '27SGWYPthfmzWnfO1F_9RA', 'text': "Culanary Dropout Tempe is one of FRC's crown jewels. Friend and I loved the open space atmosphere, a pleasing and unique counterpart to the space at NoRTH Italia over in Tucson (and many other Fox Restaurant Concepts). (We are huge FRC lovers!)\n\nGreat selection of local beers and the food was simply amazing. The happy hour meatloaf sandwich was quite delicious and the delicately roasted salmon was very very on point. If you're a grilled cheese fan, make sure to get the grilled cheese sliders! \n\nAs expected, the service was prompt and very personable.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-11-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tmOpf3ijo6U85VUvJu8TJQ', 'review_id': 'VZxohJC6NrdIXZ8lUpSYTQ', 'text': 'The happy our menu is a little misleading as the grilled cheese doesnt come with bacon as mentioned in the reg menu.\nMy husband comes here for the fried chicken.\nI dont like that you can see into the mens bathroom through the womens bathroom.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-11-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'f1BdyPq6syd0QKPpMgdWzw', 'review_id': 'wgGMFomcWRNtaVU_unq_Yg', 'text': 'I woukl give zero if u could.  The bearded douche that presented himself as the manager tonight was a total ass. The check came as 43 beers my friend inquired about the check and was escorted out with excessive force. The bar attached to the culinary drop out is a waste of time and I  would spend  my hard earned money  in a  different location', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 1, 'date': '2015-11-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': 'JsFX0G2uBVWxJ_5IY_XAnQ', 'review_id': 'eS5oOOlcjVzNkpLDCtrICQ', 'text': "The cocktails are pretty poor and the food is pretty good. Ramen was surprisingly good. Last time I went, our server didn't know what an old fashioned was and had to ask me. I told her the bartender would know and she insisted I explain it to her just in case. I did. Then I received a watered down, semi-cold Jack and Coke.  \n\n*Editing my initial post to remove some snark, since the manager contacted me and offered to make it right. Not interested enough in the restaraunt to take him up, but still a nice gesture.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-11-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'jq13ePzjq-48yeNxHY9Pvw', 'review_id': 'A8sAPG-SMx0QLzahG62Xgg', 'text': "I'm from Vegas, so its absolutely awesome to have you guys here! Great, calm service. Awesome atmosphere.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-11-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'IkC2BKzADqgPlvaac5gRHg', 'review_id': 'MHqbfj1q2se3tJ_aTWmFsw', 'text': "Such a cool place to grab a meal or happy hour. The atmosphere is always lively, but it works for a work lunch too (not rowdy, quick service, and tons of tables). The menu doesn't have a ton of vegetarian options but the few they have (pasta, salad) or that you can make vegetarian (burgers without the meat) are good.\n\nI especially like the corn and mushroom cannelloni, which is an awesome vegetarian entree. The flavors are complex and satisfying, and the dish is filling on it's own without an appetizer or salad. The salads are decent sized, but I find I usually need something extra to make it a meal (some cheese and crostini from the tapas menu, a side of fries).", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-11-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': '7zUVMjg-gwwWB6-A04Kh-Q', 'review_id': '_K8h0Xn2lojSnzVnRQcaCw', 'text': 'I was visiting my friend in Tempe, AZ, and she had to work for the day, so I took a stroll to lunch by myself. This was only 6 or 7 blocks from her townhouse, so it was a perfect walk, and it was something we had not yet tried together. \n\nSince I was alone, I decided to sit at the bar. There were about 10 other people at the bar, and the bartender was understandably busy. However, when someone who sat down after me was greeted before me, I got a little frustrated. I stared down the bartender, and we made eye contact. He came over and apologized for the wait and brought me a glass of sauvignon blanc and the menus. \n\nThey have a small plate menu that you can check the quantity of each item you want or write in what you want if it is not on there (entrees). It reminded me of a sushi restaurant. I asked him whether he liked the Kale and butternut squash salad or the Chicken gorgonzola salad better, and he recommended the Chicken gorgonzola salad, so I got that and the roasted brussel sprout small plate. \n\nThe brussel sprouts were cold, but so cold I assume they are meant to be served that way. They were drizzled with balsamic vinegar, and they were delicious. The chicken gorgonzola salad was also very good. All of the unique flavors combined together very well. \n\nI loved the atmosphere. This place is huge! It would be interesting to see what it is like at night. I would definitely come back here if I was in the area.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-11-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dqLSiUiFniWyxJq-Ydvhig', 'review_id': '4uI4ovhEDzNFxQIwRa80bA', 'text': "We went there on a Friday night last week for a friends birthday,  We sat at a table in the back near the bar.   The chairs were great!.   The service was pretty bad.  Took forever to get drinks and the server never came around to check on us.   It took about 10 to 15 min to get the drinks to us.   The servers don't wear polo shirts or any type of uniform either.  So it was hard to find them.    Also  the hamburger we had tasted like a big mac from McDonalds  I guess it was called the mac Burger maybe it was suppose to taste like that.    The pretzels were awesome though.  They came out in pretzels balls  best ever.    Hope they work on the service at the tables.  The bartenders were great!   I asked for a Pepsi and she gave it to me free!", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 2, 'date': '2015-11-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': 'pxQJauLSRy5mnhv0uQOjyA', 'review_id': 'z9aCfDu_3IujrNZqGeLF3g', 'text': "This Fox location has provided me with more disappointing experiences than I can count. I've had 6 or 7 visits here, and I've had service missteps every step of the way. I've gotten my appetizers after my entrees multiple times, the servers I've had are poorly versed in their menu and bar capabilities (not to mention often highly unusual and hard to notice since they're encouraged to dress like they would outside of work), and had overall unpleasant experiences. It's painfully obvious that they value aesthetics much more than service; there's no way I can get behind a restaurant like that. \n\nI'm not a Fox restaurant hater - I've worked at one, been to many, enjoyed myself most of the time... But the way they treat their employees and their guests (at this location in particular) leaves a lot to be desired. This doesn't include the fact that Fox cheaply and lamely copies dishes over from other menus, making it almost impossible to have a unique and new experience by visiting other restaurants within the concept group. Culinary Dropout in Tempe has given me no reason to return.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 1, 'date': '2015-11-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 4}, 'user_id': 'vy0nm2MYGayJ2JcRtfaWxg', 'review_id': '2Aink2ZRP5xs1lQ-3yekKQ', 'text': "Love the ambiance of this place. A cool establishment, very trendy, with a scratch kitchen and  some quality crafted cocktails. The food was a bit underwhelming and pricey, but live music, the transformed warehouse, hip and friendly waiters and the overall experience was definitely 4/5 stars. You'll definitely drop a pretty penny here but I don;t think you'd leave disappointed since the overall experience at a place like this is hard not to enjoy. Fresh food, a large, visible kitchen and great selection of beer and cocktails. A cool place to bring a date or a friend to.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-11-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'yhZxCcGyhltqsJN6foL_Wg', 'review_id': 'HeCsRhcp5WD6cvXu5OUQ2w', 'text': "Meh, this place is what it is. The decor and overall atmosphere is pretty cool but the whole games thing doesn't seem all that original anymore. \nI've had both great and very mediocre service here over my few visits. The pretzel and cheese fondue is to die for, and usually the fried chicken is a good choice. Craft beer options are pretty limited here. At a certain time at night, this place turns into college party central, which isn't really my thing.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-11-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': '5kMA-fpIqCIzCNGOMW0TYg', 'review_id': 'hmgajVuHNZMGy1PMhl4LJQ', 'text': 'top notch food and service in an industrial design setting. Had a party of 7 and got seated right away. It had something for everyone of the foodies in my group. Consider ordering family style and sharing. Good vegetarian options as well.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-12-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uhrjfsCFUP6Kfx-gOGJM2w', 'review_id': 'K-epRCfVmlpEF6VpxeC2NQ', 'text': 'Great ambiance.  Atmosphere is great with bean bags.  Good looking crows.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-12-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XndZOK5rC9DZE7rcOj8Qtg', 'review_id': 'MVGn5dfEFK8RCeKAHbMeOg', 'text': 'Pricey. Great for friends to gather. Liked the fire pits. Only been once when they opened.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-12-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'r7X4wYaTeYmV5OqsVfEP_Q', 'review_id': 'JZJc5DDxenUHd-ndyBbB6A', 'text': 'Great vibe--even in the middle of the day. Staff super friendly. Cool atmosphere--lots of spaces and different seating options to suit any preference. Oh yeah--and tasty food.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-12-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CQVPwymzvS01Re6O4DATGQ', 'review_id': '1XFz3wpwK_tF-_rvOLzKpQ', 'text': "So....ordered some food to pick up today for lunch. Ordered the Pub Burger, a Gorgonzola Chicken Salad and the Caramel Corn to split with a co-worker. Food was great. My issue is with....value. Here are my thoughts when looking at our lunch items individually. \n\nPub Burger: It is a simple, well constructed burger with a great flavor profile. Thick cut bacon, havarti cheese and barbeque sauce. The burger was cooked to a perfect medium. It was on a pretzel roll which really complimented it well.  At $12 including fries...a solid A for me. \n\nGorgonzola Chicken Salad:  Chicken, Gorgonzola, butter lettuce, radicchio, arugula,\nfennel, smoked almond, and tart cherries. So here's the deal....the salad was delicious. But....if Gorgonzola is the first word in the name of the salad, I expect to see more than three dime sized pieces of Gorgonzola in it. Didn't see any smoked almonds either. And at $13 for a salad...I think that I should.  Value? No more than a C.  Maybe ordering a salad to go isn't such a great idea.\n\nHouse Popped Caramel Corn: I LOVE caramel corn! But, at $4 for two cups I expect more. More corn. Taking the time to cover the corn with caramel more evenly. And how about making some effort to remove the unpopped kernels before you put the caramel on? We had 6 or more unpopped kernels in our two cup order. That is just lazy. Value? D-\n\nSo I will definitely try this place again....but I will order a burger and lower my expectations.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 3, 'date': '2015-12-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6K2e_FDL3SWVGgo1lGLkrQ', 'review_id': 'ypWk2Osr38fRP_LtDenCTA', 'text': "I've been a few times to this location, 3 to be exact. All were okay except this last one. I went on a Friday night (it is beyond busy on weekend nights by the way) and I sat outside with a group of about 8 at one of the fire pits. When we were to order, the waitress took each of our cards to start a tab. I've never been anywhere before where they do this, but it's not something I'm comfortable with to say the least. After about 2 hours of hanging out and conversing, we all paid our tabs and left. I woke this morning to get breakfast with my mom and noticed I didn't have my card. I immediately called the location and they took my information down and told me they would call when they had a manager in. An hour and a half passed and I still had no call, so I went in. Once I reached the hostess stand, they grabbed me a manager immediately. Why wasn't I called when she arrived like they said? I explained the predicament and she checked all 3 places they would put it, found nothing, then called the waitress. The waitress claimed she gave it to another one of the girls in my party. When I called all of my friends, none of them had it. The manager also brought up the fact that I hadn't asked for my card back that night. I'm sorry, but what other restaurant do you go to where you have to ask for your debit card back from the waitress? I had clearly forgotten she had it since it had been nearly 2 hours after she had taken it. Opening tabs is not something I'm used to, I hadn't noticed. Her remark angered me, obviously. So now I've gone through the process of cancelling my card, requesting a new one, and a painful truth pulling experience all for the price of a mediocre pretzel fondu.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 1, 'date': '2015-12-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2ms8CR-BYPUUDal0khWQeQ', 'review_id': '_oCywAt9aTA3uQn67JZrbQ', 'text': 'I live in Tucson and travel to Phoenix frequently we need one of these as soon as possible the concept is amazing and definitely different. We went on a Sunday and there were many drink specials and food specials. We sat outside where there was plenty of outdoor seating with couches and tables perfect for large groups of friends to relax. We were able to play different games and watch football on the TV all while participating in different drink specials. It is definitely a place that we will have to visit again and hope that they will expand to Tucson', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-12-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0D6Biv-L6WnXk9nR3jMBoA', 'review_id': 'SXQmZ-ZAu3lMyxpynwekLg', 'text': 'My family was in for the Vikings game and stopped in to the location in Tempe. I had the trout with green beans and almonds. I was not sure at first if trout in Tempe was a good idea, but decided to go for it. It was SO good! Big filet, very moist, just the right amount of garlic sauce. Yum! The green beans were the way I like them, fresh and not over-cooked. My husband had the 36 hour ribs and two sons had the steak. Everyone was very pleased. We would definitely go back.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-12-15', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '6uDo9AyfxiXmaedcmpcVrQ', 'review_id': '5uuXTCCZe8zvnUDuEH5pOg', 'text': "We absolutely LOVE Culinary Dropout! We had Jack, who is such a sweetheart, and he suggested the perfect food and drinks for us. We had the fried Brussel sprouts, prosciutto and cheese, potato chips with onion dip as appetizers. Then we had fish and chips and Thai wings. EVERYTHING here is RIDICULOUSLY good. Not to mention the drinks are perfectly made. We had the After School Special and a few others I can't remember. For dessert, Jack surprised us with a delicious monkey bread style dessert! Being from California, I get a lot of out of state visitors and I can't wait to bring them all in for a laid back night full of tasty drinks and great food.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-12-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KCqGLAKcR-4scvQslzIutA', 'review_id': 'F60PTpNK4k_XNGqhGhNFgQ', 'text': 'Small portions...very, very small. Pricey for what you get. Decent quality but usually under staffed in the kitchen so the wait time can be extreme. Better location on Phoenix, but as this one is close to work end up here with co-workers.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 2, 'date': '2015-12-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'y42yifgdSltZ3nmRO5P7BQ', 'review_id': '_bnuny5ultKr5ueJbH4ESw', 'text': "Wow this location is huge!! The mixed drinks are amazing, the pretzel bites and cheese fondue were off the charts!  My chicken sandwich was so delicious and definitely a huge portion.  The french fries were ok, but everything else was delicious.  The service was really good, our waitress was super friendly. Pretty hip crowd, might have to bust out the cool kid clothes when you come in into CDO, jk, but the atmosphere screams hipster.  Drinks are on the pricey side but are made well.  Definitely check this place out if you're out in Tempe, it's in the perfect location to grab a great meal if you're thinking of hitting Mill Ave for a night out.", 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-12-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pAqDUn-W4JpYT5_ZKwWqbw', 'review_id': 'as6vgAz7Cv1Tbz8TAtiixg', 'text': 'This last weekend I was here with my family (5 of us). We got a table and ordered food. While eating our dinner my husband let me know the burger was really rare but being that he has worked in the restaurant business for a long time we did not complain. After dinner we all decided to play bags (cornhole) we got up from our dinner where we left our stuff just to have someone bus our table and give it away. Again, we did not complain and our server that night was super cool and continued to serve us over by the game. Half way through a game my husband says he feels sick from the food and goes to the bathroom. While waiting for him some people walk over to our bags game and the guy very rudely tells us we can\'t hold the board. We explain to him that my husband was in the bathroom and we will be playing shortly he then says "I don\'t really care you can\'t hold the board" I probably got snippy back and replied my husband is going to the bathroom just walk away when his girlfriend steps in and says "you need to calm down" the man causing a scene then let\'s me know he\'s the assistant general manager and he can do whatever he wants. He tells my party and I this multiple times before walking away. Strike three..... We will not be returning and will take our business elsewhere. Bad food bad communication and bad management.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 1, 'date': '2015-12-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '38D89nAgQ87Ag3wGOyXGbA', 'review_id': 'lz9oHb7REXtEzvVBpCbA0g', 'text': 'Liked this place so much we came back twice in our visit to Phoenix. Love the huge outdoor area with firepits and a wide array of games. We played cornhole, ping pong, and shuffleboard. Great place to come as a group or as a date night. A must try when in the area.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 5, 'date': '2015-12-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SgoNkfucg2Eho2ERYrYjNw', 'review_id': 'MDxzuXWiwz-j80QliNCmyg', 'text': 'Great food, Great atmosphere, a little pricey and sometimes extended waits due to popularity. I would definitely recommend giving it a try.', 'business_id': 'wXRD9u4j_UCg_Xm4fSR78A', 'stars': 4, 'date': '2015-12-21', 'type': 'review'}
