{'votes': {'funny': 2, 'useful': 3, 'cool': 4}, 'user_id': '-NKMogyXoqMW3emthoM2BQ', 'review_id': 'c0JcOJLhbnr8g_2nii1cvA', 'text': "I was a little hesitant about going here,  because it just seemed like it would be lame, but what the hell, sometimes you just want bar food and this is THE ultimate bar food.\n\nI mean who doesn't like wings w/ a HUGE variety of dipping sauces? Sometimes a few brewskis and some wings is JUST what hits the spot.  So get your nose out of the air and go get some wings!", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2008-07-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kUO60fi3y_UW5JsuscBmMA', 'review_id': 'no-Zog4omr6XCKIeiVAvrg', 'text': 'pretty good, we tried a couple flavors but the parmesean garlic and honey bbq are my favorite. \n\nwill go again since the house is nearby anyways =)', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2008-10-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JHxp_D7GxuZVZhmcCgwkfA', 'review_id': 'uPy_s2wj-A5-7dojOJtg0Q', 'text': "Went there really late (10:30pm). It was pretty empty, so we got full attention from the waitress. The food is great though. I had the bbq wrap, which was made perfectly to balance with the meat and the lettuce. Mmm. The sauce in it was yummy. \n\nThis is would be a great place to just hang out with friends and eat great wings. Must visit again when I'm there.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2009-03-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'l_F94aAj-K1Yx7FtAyygxw', 'review_id': 'PLx81_k4O82LHkGs77U_iw', 'text': "I eat here every once and a while.  It's not too far from where I live and sometimes you just feel like some wings.  Now in terms of wings, I would ranks this place as average.  I've gone to a wing joint in Cali called Wing Nuts and their wings are far better.\n\nService is good, fun at times depending on who you get.  The bar has a decent selection of drinks. (Edit:  Now corp owned, the drink selection has shrank)   The food normally comes out quickly.  I tried to work my way up the heat scale and got almost to the top.  However, my efforts were wasted one night when I drank too much and had spicy chicken sitting in my beer filled gut all night.  Let's just say that my esophagus has never been the same.  That pretty much ended my spicy food career.\n\nOn some nights the music gets a bit loud and you have to yell at your buddies to converse.  But all in all it's a good spot to get some wings if you're in the area.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2009-04-01', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 3}, 'user_id': 'f5vgLcoKpFcTvD4lOUxcTQ', 'review_id': '3rTnbG3tqbeyFl-Ny_1scA', 'text': 'I love chicken wings but the wings they use here are a bit too small. The boneless chicken wings is the best way to go even though it looks like chicken nuggets. The variety of sauces are pretty good. This may be the only thing that redeems this place. Everything is ala carte which means expensive for bar food. For the price...not worth it for me . Just buy your favorite  sauces and cook your own wings at home.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 2, 'date': '2009-06-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'Jy8rw-hk7yGGcg0McUS9vQ', 'review_id': 'tRBqgTwCFz8H7bs3nVQqaA', 'text': 'Worst.Service.Ever.\nI realize that bartenders are not servers. I understand it is not in their job title. Foodtender...does not have the same flow right. But if you are going to serve food at your bar (that you are tending) one would assume that you kind of have an idea how the process goes. I waited for over 45 minutes for our order, was served the wrong beer twice. ( I ordered Newcastle, recieved BUD LIGHT?! then a bottle of Corona...) i finally gave up and drank the damn Corona. After I reminded her 3 times about our order, she brought it. cold. and with no silverware. Excellent!! She was rude in addition to being incapable of performing her job. Enjoy the 10% tip sweetheart, you were lucky to get it.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 1, 'date': '2010-01-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1wotnFLHBCKwPBHMPidLHg', 'review_id': 'SLsg736iuSIpmHkcsurH9Q', 'text': "I love Buffalo Wind Wings (BWW) in any location but I especially love this location because it's where I was watching the college National Championship bowl game and that is where Texas lost and that obnoxious Texas fan parading around the bar had to sneak out of the restaurant because they lost. Haha. Anyway, I really do enjoy BWW because I love fried chicken limbs doused in sauce. I would say that their service could be a little better but it wasn't so bad that it ruined my meal.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2010-01-24', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 6, 'cool': 4}, 'user_id': 'ylg8C8GDRGpFn9WLQQaxuw', 'review_id': 'Xv8G3ZSvPsH6PRiFlIL8EQ', 'text': "This is the ONLY one American restaurant I'd like to go every week! \n\nGrilled chicken wrap\n+\n12pcs wings garlic sauce\n=\nperfect Friday lunch\n\nor\n\n+\n1 cocktail\n= \nperfect weekend meal", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2010-03-04', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 6, 'cool': 5}, 'user_id': 'ylg8C8GDRGpFn9WLQQaxuw', 'review_id': '1befh2cTGtra2FNke7vZQw', 'text': "Ha...... I'm here again! Seems like I'm visit here every Friday :) \n\nI love ( lunch special ):\n1. Traditional wings & fries: $7.49\n2. Cheeseburger slammers & fries: $6.99\n3. Buffalitos & salad: $5.99\n\n but I always order: \n1. Grilled chicken wrap: $7.99  --- cuz u can choose 'buffalo wild wings' sauce\n2. 12 or 18 traditional wings with 'spicy garlic' sauce\n\n\nToday! I'm going to try Chicken Carsar Wrap........ I love the one in BOMAS more :)\n\nAlso, what I want to mention is, I'm kind of picky and change my mind sometimes after order, but their services are good enough to treat me:) she still remember me 'hot water with honey and lemon' but they never provide honey :(", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2010-04-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'haQaMRoN74xRLDoc0gq0Jg', 'review_id': 'UTJDlm8_uM2RgZzgHNOCkw', 'text': "Did I mention that I LOVE Chicken Wings? Especially, Buffalo Wild's Tuesday special for .45 cents per bone in wings! \n\nOh my oh my....I am like a crackhead that needs her fix who makes a weekly stop at Buffalo Wild's for Tuesday special to annihilate these wing tips like a crack pipe in the car before heading home for dinner!\n\nFor all boneless chicken finger lovers, don't fret! They have Thursday specials for .45 cents a finger as well! \n\nEnjoy the specials! Also, please don't worry and try not to bother if you see a tiny girl eating her wings in the car.  It might be just silly old me getting my fix on ;-)", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2010-04-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BpZ-Apl_2ZodZLgJ7Xupsg', 'review_id': '4P-jKHcafzWSsoK9oXdGqw', 'text': "Standard BWW fare here, open 24 hours. I shit you not, I had my first real cheeseburger here and did not get sick, so that's saying something.\n\nGood beer selection on tap, standard bar food, good wings. What else is there to say? If you're in the mood for wings, here you are.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2010-05-07', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'kGgAARL2UmvCcTRfiscjug', 'review_id': '6KoR8QgMRAhQd_ksfs3i8Q', 'text': 'I\'ve been to this location several times for various events.  Most recently I was there to meet a friend.  My friends and I love BWW because of the FREE Wireless Internet.   it allows us to work while we play.\n\nIt only gets 3 Stars in my book because the food is ok....nothing special.  Also, their beer is so/so.  The last visit I had their Wheat Beer and it was kind of blah...not much flavor to it.  I switched it up to Blue Moon after one glass.  i can get Blue Moon anywhere else.\n\nThey get bonus points for their service at this location...it was pretty solid.  However, the tables in the bar area were pretty nasty.  There was a huge layer of "gunk" on the table we were sitting at....so bad that the napkin under my beer stuck to the table.  It was gross.  They lost 1 Star because of that.\n\nWill I return?  Yeah, because I have friends who like this location.  There are better locations in town.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2010-05-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WlyuxZP2E7jyCrSna7P67w', 'review_id': 'tUvcrEcboK7FaLL_sYOTsg', 'text': "This is one of the best BW3's I have been to in the Vegas area.  The staff is very personable, and the machines seem to pay out often, and well.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2010-05-17', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 3}, 'user_id': 'QyLOjgOOfj_n9HK3AcsEAQ', 'review_id': 'JfqVxyfTY4GZzIkaasPglA', 'text': 'How can I miss $ .45 per wing with bone at BWW on Tuesday night??  So I ordered bunch of wings with all different tasty sauces as usual.. (Of course , I had one of my favorite beer, "Blue Moon" with slice of orange in a tall glass!)\nWell, this is what I found,, one of the sauces called, "Asian Zing" which  is very close to the one I used to have & enjoy the most at Korean Fried Chicken(Yangyeom Dak) places in L.A.  The Hot chili pepper, soy sauce, ginger, & sweetness were all well blended  together... Yumm!!\nHmm, I\'m thinking I might go back on Thursday night to try the boneless chicken fingers wth Asian Zing sauce.. I am ready for  burning/numbness on my lips of hot chili pepper once again~!!!', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2010-06-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'haQaMRoN74xRLDoc0gq0Jg', 'review_id': 'fJCucPD14j4e1XPdmKGyxg', 'text': 'Yum! Yum! \n\nI love their new dry seasoning chicken wings! I tried their Buffalo flavor with extra crispy wings as usual and it was delicious! \n\nIt is a MUST!!', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2010-07-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tmuVweJdPKDnZGnQOq2L2Q', 'review_id': 'NiLIW-JA1kOsT5JMp5z59Q', 'text': "If you're a chain restaurant, how can you not have consistency!?  To be honest, I think I've been to BWW almost once a week for the past few weeks.  Tuesdays are $0.45 bone in wings, and Thursdays are $0.60 boneless wings.  You go in, you tell them how many wings you want, and then you specify what sauce you want your wings to have.  Ranch costs extra.  The food is good bar food, but one day you may go and have your wings drenched in delicious sauce, while another day you could stop in and have dry spots on your wings.  Service is always just okay, what I'd expect from a bar.  Want wings?  Is it Tuesday/Thursday?  Then stop by!  I haven't been early enough, but I believe happy hour is from 5:00-7:00.  Open 24 hours.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2010-07-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'wbIU917ctOGp8-NdeVxIWw', 'review_id': 'mm6UfF3tjzrpqb9q0Lf37A', 'text': "love the wings! garlic parmsean!  also love the appetizer plate.. and playing video poker while drinking  linen kuegals.  \n\nthe service is always friendly and it's a clean establishment.. but not very big for patrons who do not want to sit at the bar... the location on las vegas blvd is actually a little bigger.. not much.. but bigger.\n\nit's in an out of the way location, so seating is pretty easy...", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2010-07-29', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 7, 'cool': 5}, 'user_id': 'kGgAARL2UmvCcTRfiscjug', 'review_id': 'b2Fpnu66IOAcjc51b8J7pg', 'text': "I don't know what it is about this location, but it's not as good as the others.  I come here because a friend of mine comes here regularly, but I wouldn't come to this BWW otherwise.\n\nMy last visit was this past Thursday evening.  I was waiting for my friend in the bar and wanted to order a Ranger IPA.  I was told they didn't carry IPA on tap or bottled.....WTH?  The other location on North Durango & 215 has two IPA's on tap.....I was there 2 weeks ago, so I know they carry it.  I asked the waiter if they recently stopped selling IPA's and he said he didn't know and didn't even know what an IPA beer was!  I settled on a 24 oz Newcastle and put away 4 or 5 before the night was over.\n\nWow, I thought that BWW's were suppose to be consistent with their product.  I guess I was wrong.....whatever.\n\nWill I come back?  Only when I come to visit my friend, otherwise I wouldn't come to this location.  There are better BWW's in Vegas.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 2, 'date': '2010-07-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'FBPYAlvYkqfw5BsuCsqiUw', 'review_id': 'wZkxeHzUSOvts5bRQOj7lw', 'text': "A good place to have the Las Vegas Internet Marketing Association meeting, it has a good sized dining room area, including a large bar in back. Believe it when they say they have spicy wings, as I have done the red hot wings contest. I didn't win, but the guy who did had to leave after. They do have WiFi available, but it is not always working, so bring a backup. The sampler items are pretty good to nibble on. I have yet to have a full dinner at this location.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2010-08-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HzaG5mdrRZ_WVTHGs3rLVQ', 'review_id': '8MG2AR8T0ZmB-SSYYnwyGA', 'text': "Since moving to the area last month, I've been trying to locate another Wings place nearby that matches up to the tasty ones from Hoagies and Wings in Sherman Oaks.  Buffalo Wild Wings can definitely fill those shoes.\n\nThere were a couple of BWW in the Valley in CA that I knew about, but I never gave them a try simply because I was already happy with the food and service at that other place.  I tend to be very loyal to a restaurant once I find one I like.  \n\nThis BWW is, literally, less than a mile from our house, so we gave it a shot.  The wings were meaty, the chicken club sandwich was juicy, and the Southwestern Chicken flip that my girlfriend got was delicious.  The service was also very good, albeit a little TOO friendly at times - made it seem as if we were being served by some wings cultists looking for recruits or something.  That's not a complaint (as overly good service is always preferred over the alternative) - it's just that they didn't need to try so hard.\n\nWe've definitely found our local wings restaurant.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2010-08-05', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 2}, 'user_id': 'k5p3YP1ZjCa8ZS3xqXgBug', 'review_id': 'Kr-kQWGkbMF0F9-4KBRLTA', 'text': "I stopped by to watch Randy Couture embarrass James Toney  (UFC 118), which was shown for free. That's right, NO COVER! I foolishly got there an hour before the main event thinking I could easily get a table. The place was already packed. So, we waited for an hour and luckily got a table. I thought their wings were very good -- a little crispy, plenty of meat, and good flavor. I'll be back.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2010-08-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': '74Z3JWjgpHoUVfdbfNkcWQ', 'review_id': 'XmaiwJFuGE89bMJSjeZe3w', 'text': 'Newly renovated, this location maybe the nicest looking bdub\'s in Las Vegas.\n\nService was good, food was good.  Great place to hit up after your night shift.  \n\nCaribbean Jerk Traditional Wings rule!  But what happened to those awesome "Cheeseburger Bites"?  \n\nAny executives from Bdub\'s reading this, do us favor and bring the "Cheeseburger Bites" back!', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2010-08-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'PkO62FvSCwyZx2VI4tUgPQ', 'review_id': 'uonkNclNa23Xw8RAew3g-Q', 'text': 'Went here for lunch and the lunch specials were so affordable. Our server was a sweet heart and the fod was very good.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2010-10-01', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 1}, 'user_id': 'EJwyZsIS_tFY0S3wjkUZhw', 'review_id': '88NooGIWIPSJcY0Psn5CDA', 'text': 'om nom nom', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2010-11-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ODC7YWAuvM8POacaQ4WV5w', 'review_id': 'QpiScBK0UVVE6N-wlXlstA', 'text': 'Love these wings!! Mango habanero and spicy garlic are delicious. Potato wedges are yummy too. You kinda get hooked with this place. Always available, open 24/7. Never fails.\n\nps: stay away from the "blazin\'" sauce!!!!', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2010-12-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'x6ITCOSTk1UlbQu-HshyMA', 'review_id': 'kP2yPQ7B_Elx6s_uOk2x-Q', 'text': "Good wings and I got a killer burger there.  Liked Hurricane Wings better, but this place is a bit more casual feeling and does have a good selection of dry rubs/sauces. The habanero sauce was good, but a bit too heavy on the habanero flavor.  High ceilings, clean tables, good service.  If you like sports its a good place because thats all they had on their tvs. No news on though. Had some sort electronic trivia game too where you can compete against other customers.  I'll be going back.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2011-01-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UTtK5S4o7yhHsNcPMI9RMg', 'review_id': 'H1htVRaEDacFM4wXBLO7qA', 'text': "Love this place! The food is great. My wife and I have been visiting this place for about two years now. It's one of our favorites and only fast food places we will visit.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2011-01-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'OldskeQ-d3sonyBvgqP5fQ', 'review_id': 'ZX9xszfe7Me7hEeIuns-0A', 'text': 'There are a few good things about BWW.  First, the mango habanero sauce is great.  Second, I like playing the trivia game.  Lastly, the beer is reasonably priced and cold.  On the down side, the wings are so small that there has to be a law against killing chickens that young.  The service is hit and miss.  3 out of 4 times the service is fine, but if you get a bad one, it is really bad.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2011-01-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'hTgOP1wuCbtwuleCmQSEUw', 'review_id': '8P4Sm3TQJFOkQmYF3iaZmQ', 'text': 'two words. MANGO HABANERO ;)\n\nim a regular on tuesdays for .45 cent wings... but damn, do i have to bring my own bottle of Ranch sauce in my purse, since they charge .50 per little bitty serving? I GUESS.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2011-02-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'DSDtctow7-1OXd3_1J1O9Q', 'review_id': 'eBxyNCUfEPfJLd5I5syXzg', 'text': "Everytime I've come here, it's been fast and friendly service and good wings..I can't complain. It's never too crowded here except on super bowl Sunday of course ;) I usually come for boneless wing thursdays and they never disappoint!", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2011-02-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HfEjLlPBsJIfUy4EBlbxZQ', 'review_id': 'DZrvHx79NlttbttQt1sLJA', 'text': "Ate here on 3/19/11. They were getting ready for UFC Fight night. The hostess must have asked me 3x if we were staying for the fight. Each time I said no. Ok, we finally get seated, didn't have to wait long but no waitress to take drink or food orders. We had to flag a poor waitress down to get noticed. My wife got the shrimp with Mango Habanero sauce. She loved the sauce! Daughter got the mozarella sticks with ranch. I got the boneless wings with spicey garlic sauce. The wings were good just on the little large size. Good ambience and alot of sports action going on (March Madness, NBA, etc). Too many of the same tvs showing the same college basketball game but overall ok.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2011-03-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'T7emU3xCiPYnickSWN2y5g', 'review_id': 'IMiU5o-4zVaPAIOukG8LVA', 'text': "Great Place to watch sports and eat wings, especially with the big projection screen that plays out important championship games and most definitely, the NBA playoffs! Lets go Lakers.\n\nGreat selection of flavors for the wings.  My favorites are the asian zing, caribbean jerk and the mango habanero (it's hot as hell and gives me a stomachache every time.  Their fries are pretty good too.  I haven't really tried anything else to give an opinion about it.\n\nBest thing about this location is that it's open 24hrs, so if you're craving wings for some reason late at night, this is the place to go!  It's .45 cents a wing during late hours and on tuesdays.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2011-04-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ADY_SKhyun_07OiEM2Yvfg', 'review_id': 'BLt4O27oKz-JvDTYueuppQ', 'text': "It's a chain folks!  Nothing spectacular, but for any of their daily specials and/or Happy Hour deals, just get in the car and go!\n\nFANTASTIC PLACE to sit back and watch a game; which ranges from hockey, baseball, basketball, all at the same time.  Wide variety of beers to choose from and you KNOW what you're getting.  Small problem with my order, but was quickly remedied and staff/manager came by to check-in.  A nice place to just shoot a couple of hours and connect with friends or after work comrades.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2011-04-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uma8mr3KU6Qe85teeOy60g', 'review_id': 'rIZTbXdg0PLoMNc1sFEslg', 'text': "your average BWW,  pretty clean, good items on the menu Clean awesome TV's", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2011-05-30', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': 'mk80lr-kMwWk-fbrRoDj3w', 'review_id': '5pPuDnqau7t4r2kXX9LcuA', 'text': "I have been a huge fan of BWW's for quite some time now and I still love going there about every week or two. The food is good, the servers are usually pretty friendly, the atmosphere is nice, and the prices aren't too bad. \n\nFirst off, the most important thing here, to me, are the wings. I love the traditional wings, but I've been enjoying the boneless lately because sometimes you'll get a gross chicken wing that came from a chicken on 'roids. You know, that super buff chicken that was always a jerk to all the other chickens for not being as muscular as he was... Anyways, those always taste like crap. So I've been sticking to the boneless; they're also more filling. Now the main thing at BWW's are the sauces. They have 14 sauces, 4 dry seasonings, and from time to time they will introduce a new sauce or seasoning, such as Captain Morgan sauce or Thai Curry seasoning. My all time favorite remains the Mango Habanero sauce. As far as the other food, it's really nothing special, some burgers, salads, wraps, and other basic menu items that most American casual dining restaurants will offer. Of course, you can add your favorite sauce to most of the menu items. They also offer a kid's menu and desserts. \n\nNext are the servers and atmosphere. Most of the times that I have been to BWW's, I have had a pretty friendly server, but there have been times when my server just really sucked. But I guess you will find that with a lot of places and you shouldn't be too concerned about that aspect because it will change by location, time of day, etc.... \nThe atmosphere is fun! A bunch of flat screens all over the walls, some projectors, there's music, (which you can pay to pick, jukebox style), playing in the background, trivia games going on, and even games that you can bring to your table and pay to play. They are always showing basketball, football, baseball, soccer, and softball games as well as Nascar races, UFC fights, and other sports events. It's really a family friendly sports bar with good food. \n\nThe prices aren't bad. A plate of wings will cost you from 6-12 dollars, depending on how many you get and if you choose bone in or boneless, which are slightly more expensive. They do have some cool deals though, like traditional Tuesdays when traditional wings are offered at 45 cents each and boneless Thursdays when boneless wings are offered at 60 cents each. Typically, ranch and celery/carrots come on the side at no additional cost, however on these days it costs 60 cents extra for each cup of ranch. \n\nBuffalo Wild Wings is a good place to grab a quick lunch or to watch the game with the guys and enjoy some good wings and a couple beers. If you haven't been, I would recommend it!", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2011-06-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'biifI-JRFI-2IfAA9TdZ-w', 'review_id': 'cSodYWs-1ARhxNtbypU6CA', 'text': 'I can put away wings, in fact I offer to eat them dry with just a squeeze of lemon, this way I can fill up without burning my insides.  They have great specials, and as far as splats bars go, there isn\'t many out there that can compete with what they have going on.  Oh yea, the fried mushroom appetizer is my favorite item on the menu that doesn\'t "Cluck"...', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2011-06-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'eD9VAnbyW3a1Vg3bfLoX9w', 'review_id': 't3Zh_qfZTXFlHCzreF-n5w', 'text': "I have enjoyed the BWW chain for years so when I found myself on the otehr side of town on an errand, I stopped in for lunch. Our server was accommodating and very sweet to my hard-of-hearing Stepmother. The facilities were clean and the restaurant is heavily equipped with large screen TVs. My reason for taking away stars is simply because of the price. A lunch for 3 people cost me $60+tip. I'm sorry, but for the bar food we had (sliders and wings) this is just ridiculous! I've had wings at so many different places in town and can't say that the ones they serve here justify the high price tag.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2011-07-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ebLC3dkdWBGa9Om_9QdlQw', 'review_id': 'zfzgLjjUTDd_Euxu3s5dGA', 'text': "This is a chain that originated in Ohio but I am glad that it made it out west to Las Vegas. Although it can get pricey, since they don't have an actual happy hour, I do enjoy going in here to watch Kentucky basketball games with the other UK fans that frequent the bar. I usually take advantage of the Tuesday 45 cent wing nights. UFC fights are also fun to watch but you got to get there early to secure a spot because they have an awesome setup with many projector TVs and two separate zones for sound for watching and listening to sporting events.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2011-07-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'kMxakI94AIOvAuQvK82Eww', 'review_id': 'Y_KS8y-_0W4KrhLniDxfig', 'text': 'THE best place for wings in Vegas. Great place to just hang n chill with friends, have a couple beers and chicken wings, and watch the game!!\nThe place does tend to get busy during the games so come early if you want a good spot.\n\nTuesdays are .45 wings\n\nFavorite sauces: parmesan garlic, spicy garlic, asian zing, and mango habanero\nThey also have awesome fried pickles.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2011-07-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'f62vICvbeIEHXG2ZbEHHlw', 'review_id': '4Lr4WKqRjYQh9cvw2cMECg', 'text': 'This is the First time I have been to this BWW. I absolutely loved it. We went on a Tuesday night. Our server was great, she really took care of us! I really recommend this location.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2011-09-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '52afqpKvwCA0Ji9GkJeeDg', 'review_id': '9twzcJBG8u38cdUis4gzMQ', 'text': 'I am here at least once a week - rain or shine. I don\'t know if this is a good or a bad thing - probably good for my belly, bad for my heart.\n\nI went to school in Buffalo and Wild Wings is the closest you are going to get to the authentic "wings" you can get in good ole\' western NY. \n\nThey have a great atmosphere, great staff, and great food. Sports buffs can be found crowding both the bar and the dining area during games as there are screens galore throughout. \n\nI honestly like this location better than the one on Hualapai & Flamingo, even though this location is slightly smaller.\n\nIf your new to "B-dubs", they even have a scale of how hot/spicy their different sauces are. And, if you\'re not in the mood for wings - they have other stuff on the menu too (from salads to burgers to a variety of appetizers).\n\nDon\'t forget about the "seasonings" for the wings too. Essentially dry rubs, there\'s salt and vinegar, chipotle BBQ, buffalo, and desert heat. \n\nAnd now I\'m hungry. Good thing they\'re open 24 hours a day!', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2011-09-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ushckPZc-8RhvhLN2Q0HRw', 'review_id': 'RCli8eBV-WhDmspZMy6QSw', 'text': 'Love the asian zing & honey bbq wings!\n\nI come here religiously & have never been disappointed.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2011-09-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dC31ddiBFfWnk_PkiZuNoQ', 'review_id': 'wTlV7TpmZhUf5DpouHHYtA', 'text': "Got to love wings! Every sporting event you can imagine is broadcasts on one of the tons of TV's they have around the bar and restaurant section. Family friendly as well. They have great happy hour specials and on Tuesdays they have wing specials. They have a game you can play against others in the bar while your there and compete monthly which is fun. Service is good, quick and friendly. Place is clean and sport friendly. They also have an outdoor area with TV for those cool nights when you want the fresh air and still catch the games! \n\nHighly suggest for watching sports, great apps and wings (honey BBQ my fav). Also good for the family, my nephew loves it.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2011-10-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vSoa2Z_jVTW0ywOxGftBcg', 'review_id': '9e1yu458mWszfZEgisegEw', 'text': 'I Live right next to this place and everytime that i go there it is great service food and a great time.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2011-10-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 5, 'cool': 4}, 'user_id': 'ia1nTRAQEaFWv0cwADeK7g', 'review_id': 'PVqqLY8mgoiCob3VDysknw', 'text': "Mango Habanero wings are my guilty pleasure here. \n\nWe don't really frequent Buffalo Wild Wings, but during football season the place beckons us. It's one of the only places I can convince my fella to go during the day on a Sunday. They obviously have great football viewing as well and a huge variety of wing flavors. My fella always goes for the spicy garlic and I order the mango habanero and a large cup of water. \n\nThe service is really attentive and friendly which is impressive since they get so busy. \n\nDefinitely a great place for sports viewing and spicy wings, 24 hours a day.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2011-10-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nBVQ5DgtSF9jbSdf0sju8w', 'review_id': 'hOm6zA2kQMmDWMtvhgtK_A', 'text': "okay, we've been going to this restaurant since like 2 years ago. Me and some friends have this tuesday tradition going there. They've been great, but ever since they renovated it and added a whole new crew of staff, they've been slackin off with the service. youd think since were a regular they'd treat us better. so yesterday when me and my boyfriend went there for the tuesday special, i mean they got us seated right away even though they were super busy. FOOD WAS SUPER GREAT, like always (: but then the girl only checked on us once, and she was really late with giving us refills with the drinks. After we ate our meal, we tried getting the check, and it took us 4 times to call her and get it for us !! she passed by us like 3 times and i saw her look at us and YET she still didnt come up to the table. until i finally yelled out EXCUSE ME then she turned around and came up to the table. tsk tsk. OVERALL though, the food was amazing. service ? eh, it was okay", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2011-11-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WnsPLkIKlGvp4h7OdTEskg', 'review_id': 'FZfEjUD4tPsgAEneJ0Bq0w', 'text': "Well what is there to know about this big chain restaurant?\n\nI only ever get chicken wings from here for the fact that it is what they are known for. The selection of sauces and rubs are nice. The wings are fried pretty well and the breading is pretty decent. The area has tv's everywhere and sporting events on them. That's at all of them, but that's the best part of going to buffalo wild wings, to sit down and enjoy a nice game with your buddies. I wish they served food that's wasn't fried but still a nice place.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2011-11-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MfC2UCrHUYUvA5yoZZFRqQ', 'review_id': 'On8mTbyJZvUkI-dU7XY-ng', 'text': "My favorite sports bar to watch sports games, and since its within walking distance of my house it's even better. I come here on a regular so the food is good and the drinks are just right. \n\nMango Habanero and Garlic  Parmesan are my favorite", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2012-01-28', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'fUYKpiwoHW_oJdVrw23qPw', 'review_id': 'fka_osLyE-R9BcPA62w9GQ', 'text': 'What the heezy?! My wings are dry! This is the second time! Come on guys!', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 2, 'date': '2012-03-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IrzHAVpjBUSLnnrY5jG2OQ', 'review_id': 'zCdiu-tafIMdlCnILM9LFw', 'text': "This B Dubs has the distinction of being my favorite location in the valley.  Full Disclosure: It touts itself as an unofficial University of Kentucky bar so I am predisposed to love it.  Setting that little fact aside, the traditional and boneless wings are consistently hot which can be an issue at BWW.  The servers are very nice and generally on top of things and I like the fact that the bar and dining area are connected.  \n\nAnyone who says BWW doesn't have the best selection and flavors for sauce is out of their mind or really just a big fat liar.  In either case, I wouldn't take their advice.  This location is a really open space and a great spot to watch your favorite team.  Go Cats!", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2012-03-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'P2FD7E392y01VcBVWli6og', 'review_id': 'EZ0X4OdmsmBSaMq3fMS4WQ', 'text': "Yelp Challenge! Started 8/20/2011 (37 of 365). I have a lot of catching up to do!\n\nGreat establishment.\n\n1 star = for the massive number of TVs they have in the bar, including some huge displays for the big games of the day.  They are willing to seat you near the TV that is playing the game you are interesting in watching.  They are also willing to change the channel for you if the current ones playing aren't of interest.\n\n2 stars = for their selection of drinks.  They offered us green colored beer on St. Patty's day too!\n\n3 stars = for the food!  Besides their wings, they offer quite a selection.  All of their appetizers are awesome.  Make sure to have their soft pretzels; the cheese sauce is amazing and has kind of a curry or cumin kick to it.  Their sliders are huge, and their pita chips w/ spinach dip are yummers!\n\n4 stars = duh! for their wings.  Order them naked so you can try more than one type of dipping sauce; they have lots.  Garlic Parmesan is one of my favorites.\n\n5 stars = for having games to play at your table.  They have trivia to play against other people at the bar as well.\n\nThumbs up if you want to watch a game and eat good food!", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2012-04-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1LQE8QEaxJYCOgq7Gx5Icw', 'review_id': 'wQH7wZheZWEpIyXxv6JiiQ', 'text': 'Amazing! I looove boneless honey BBQ wings! Every time I come here the bartenders and waitress are great, always polite and take care of what I need. The only downer it takes Sooooo long for the wings, even if there are no people there. Oh well everything else rocks. Great beer selection for a local bar.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2012-05-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'RQ0D3XBCFJJ1xm9IoEwHVA', 'review_id': 'TiGCsFYaOkYazXtuwMrpbQ', 'text': "I love that B Dubs is such a relaxed, chill place AND is open 24 hours, although I have yet to even be at one past 10pm. Whether it's to go or dine in I've never had a big problem here (if there's a mistake it's very small and corrected very quickly), always get great service, good prices, great selection of drinks (although the mixed drinks are always super weak, so do yourself a favor and get beer or something nonalcoholic), and now that it's baseball season I love watching games while I'm eating. Food always comes pretty fast even when it's busy, and the food is always ready when they say it will be when I get it to go. I've always been curious to try the trivia they offer but am kind of busy stuffing my face and have messy hands, so it's still entertaining enough to watch it on the tv whilst waiting for food.\n\nWe go to B Dubs almost every week (mostly at this location too) and I can't imagine getting sick of it. I try to avoid busy restaurants on the weekend nights but this is always a good default when you don't want to be waiting for a table for 30 minutes to an hour somewhere else. This is a somewhat small location though and on nights with big fights or big games it is pretty crowded, so then I just go to the location on  Hualapai and Flamingo :) the parking lot is shared with a lot of other businesses so the few spots right in front of B Dubs can fill up quickly and you'll have to park off to the side. Almost nothing better than wings and beer, and I tend to order only medium, maybe some honey bbq or mild once in a great while! Garlic parmesan is alright and I'm not a big fan of the teriyaki. My only beef with B Dubs is that the mixed drinks are really lame, they're just so weak that you shouldn't bother ordering one and being pissed about the missing alcohol. Oh well!", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2012-05-12', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 2}, 'user_id': 'UKWZqWF1xusbDBKdZP5ScQ', 'review_id': '9ub03O1t8gZO-PafONEC-w', 'text': "Pretty disappointed with tonight's service. Ordered on their website for pickup. I was given a pickup time of 50 minutes later! When I got there, the food wasn't ready. I get home and I'm missing an order of 14 wings! Called them up and they said come back. 15 minute drive back and food wasn't ready. After we received food, we didn't get any reimbursement for our troubles. I'm wondering why I gave a 15% tip for this pickup order. \n\nThis was the 2nd time we've done a to go order and it's been bad. The fries both times have a serving size of a happy meal fry, and it's $3.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 2, 'date': '2012-07-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7n3lhDVKOJ0whcDlAcMprQ', 'review_id': 'EpSggTuI1oHD6Fs3zz9ysg', 'text': 'Manager was very accommodating, despite the fact that I called the day before to book a family gathering for my mom and dad for about 16 people.  I booked for a Tuesday lunch before my dad had to have his procedure done on Thursday so that he could have something in his belly before his 24 hour fasting.  They were pretty packed for lunch but still managed to fit us in.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2012-07-23', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 2, 'cool': 1}, 'user_id': 'M7gu56kwPFjci6OqNly8Kg', 'review_id': 'YQxNNpg7A_FIhqnZ1bY8vw', 'text': 'If you plan on placing an order for pickup with the expectation that it\'ll be a quick and convenient idea for dinner, think again.\n\nLast night, my sister and I went to this location and placed an order for TWO wraps and an appetizer.  The little girl with a horrible attitude at the pickup desk, ARLENE, read our order back to us and I stopped short when I didn\'t think I had heard both wraps be read back.  I asked her if she got both wraps to which she nodded her head enthusiastically while my sister joked to her that there was no way our total would only be for one wrap and an appetizer, which ARLENE laughed at with us.\n\nWe left for the requisite 15 minutes to Vons and after that time, I went back to get our order.  Arlene brought my bag of food around and opened every container for me to see, but I noticed that there was only one wrap in the bag, so I asked her where the second wrap was.  She tells me, "you only ordered one."  I lost it.  I RE-PLACED the order, went outside to grab my debit card and gave it to my sister for her to handle the order...again!\n\nApparently, my sister voiced her frustrations to this girl and was met with no apathy or readiness to please the customer due to her error.  My sister asked how long it would be for the additional food and Arlene told her it would be another fifteen minutes, at which point my sister expressed how upset she was that the rest of our food would be cold by then. Arlene\'s respone?  "There\'s really nothing I can do about that."\n\nAfter waiting an additional fifteen minutes for the rest of our order, Arlene held up the bagged item for my sister who snatched it angrily out of her hands.  Rather than let my sister\'s anger be the ending to this horrible experience, she closed the night off with a sarcastic and loud, "Friendly!" remark to the other waiting customers.  UNACCEPTABLE!!!  \n\nThis yelp will be superceded by a call to this location\'s manager and, if nessecary, further action up the corporate chain.  My advice to Arlene is that if you don\'t want a job that involves customer service and having to deal with upset customers, especially when you mess up and can\'t even take responsibility for it, then find something else that would benefit from your limited skill set.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 1, 'date': '2012-07-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'HoZdBadhBsNz28UzH8XXqg', 'review_id': 'Na5wjLxLqId6OrFEVo43Mg', 'text': 'Great wings here. Finally a place that can make a spicy buffalo wings. Our waitress Brittany was amazing and very attentive, happy and friendly.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2012-09-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Vi77s0AS-cIzPoBq5AbEaQ', 'review_id': 'A_rvp5QE9HENbtzZ97FjBQ', 'text': 'Awesome place to enjoy a cold beer and bar food. Tuesdays and Thursdays they have wings specials.   Wings Tuesday and  Boneless Thursday.  great Atmosphere and perfect place to watch UFC fights or football games for free', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2012-09-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 't5oEzwLDl_9SpM8MUwfQtw', 'review_id': 'F28D1RkbpO7n7WjYazREEQ', 'text': "I come here often, a few times a month.\n\nService is a hit or miss here. Their berry lemonade is amazing! Definitely my favorite. Food is alright. I've learned to stick to their wings and fries. \n\nWhen gambling, sometimes are drinks are comped, and sometimes they're not. A little bit of inconsistency here, but will continue being a regular.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2012-10-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'My196VEbVfpQlIDjsKumrQ', 'review_id': 'kfERjs61IeX2dhA00spOvA', 'text': "I am there every Monday for MNF and Stephanie is always our waitress. She totally takes care of us like we're kings! I would give it more stars, but it's just a BWW....", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2012-10-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'b-wPxDfMh4Z7lst0n0zZ7w', 'review_id': 'O48QtnNRV49UmutcjGI80g', 'text': 'This BWW is home to the Las Vegas Texas A&M club for 2012.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2012-10-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '85KL10WuNZvTymufnPyfDA', 'review_id': '-LoPx7PbgCO1WlQzJ-Se1A', 'text': "This is my regular hangout and there's a reason why.  The staff is great, I've never had bad service, whether I'm in the bar or restaurant side.  Their selection of beer has something for everyone, they've recently added lots of new microbrews for you beer snobs.  \nI can always watch my favorite teams play, the staff is very accomodating to let everyone get to see the game they want to see.  Plenty of TVs so everyone has a good seat for the games.\nThe food is always hot, fresh and tasty...I love the boneless wings and corn dogs!", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2012-11-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'efEXkh9yk-hteA8NxUH6vg', 'review_id': 'G9LZsagR__M-sNZr-XXivg', 'text': 'Ordered to go and our food was ready in no time! I love their wings and onion rings! Had the left overs the next morning. Tasted so good that I wanted more for lunch. Plus they are open 24/7. Awesome!', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2012-11-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wcah_IvW6Vn2Ac9oFKZacA', 'review_id': 'FiCUR54iu8UPDPVH5sX6kA', 'text': 'Excellent food and even better service.  Our Las Vegas Texas A&M Club  watches Aggie football games at BWWINGS and we have been treated like royalty.  The management of this store has even gone so far as to get pay-per-view when one of our games was not on regular TV.  The food and beer are served promptly.  I would also like to take this chance to nominate Stephanie as the best server in America.  She truly makes our game watching experience special.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2012-11-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'e9e_8jAXmbbdeDun5utznA', 'review_id': 'GbcfExkM0Jerex1RPzZEig', 'text': "Wings and huge TVs showing sports. Sounds like a quality lunch spot to me.\n\nTo save time I usually call in my order ahead of time, then plan my arrival at the restaurant for when they predict my food will be ready. Servers are always nice and don't mind splitting checks, which is nice since I'm usually at BWW with co-workers. The prices are great if you go on Traditional Wing Tuesday or Boneless Wing Thursday.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2013-01-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ChgmBht69bnqSdDxpWMAqQ', 'review_id': 'yTrCPft8Hx9zfH5N26bUYg', 'text': "Decent enough... They were super busy, as the NFL playoff games were being shown. Service was expectedly a bit on the slower side because of that, but they didn't rush us or pressure us to order more food/drinks while we were there.  I found the mango lemonade to be super sweet. We got the nacho burger and fries, which were both way too salty. The wings, however, were good.  Lots of TVs, and they happily split the checks and prepared a to-go order at our request.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2013-01-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'N7wNlo3_EaHUWHiFDyGh5g', 'review_id': 'bUwqBxl5VHArLTCUTMqSOQ', 'text': 'I know I shouldn\'t like this place, but I really do. I\'ve been visiting this location since I was in high school! Geesh, long time, and I\'ve gone through phases. I used to love it, then I couldn\'t go anymore because of health reasons, then I finally went back in moderation and now I love it again.\n\nThere are a lot of dishes that could use makeovers, but I\'m not here for fine dining, so I order a few select items and I stick to them. I almost always order wings (or "boneless" when I\'m feeling lazy or don\'t want to get messy) and potato wedges with Cajun seasoning! Delicious, delicious, delicious. Actually, I only order one sauce now: Chipotle BBQ (well, it\'s a dry seasoning, but even better because I love seasonings more than sauces). When I\'m in a saucy mood, I go for Hot BBQ or Honey BBQ. I\'ve had most of the other sauces and seasonings and they\'re all good. The potato wedges are just soo good. The chive and onion seasoning and flavorful, crispy exterior creates delicious potatoes. They used to have the Cajun option on the menu, but have removed it for a few years, so just ask for it and they know. And trust me, the Cajun MAKES it the best fries (well, behind duck confit fries..and well, yeah you get the picture; it\'s not the very best, but it\'s darn good). Oh, and don\'t forget the vegetable boat and ranch dressing. Yum.\n\nI\'m sure everyone knows about Wing Tuesdays and Boneless Wing Thursdays (and late night happy hour as well?). My brother and I calculated it before and it\'s only worthwhile when you order a certain amount of wings and if you don\'t want the veggie boat or dressing/dip (since these are extra on those orders). I like those things, so the wing specials don\'t matter to me as much.\n\nI\'ve had my share of appetizers and other entrees and for the most part, they\'re tasty, but not amazing. I do not like their nachos, so I would avoid those if I were you. Also, not very Vegetarian-friendly here; even all their salads have meat, but I\'m sure you can order them without the animals.\n\nOh, and they\'re open 24 hours. Can\'t complain!\n\nEDIT (02/26/2013): Now you have the choice of traditional or boneless on Tuesdays and Thursdays don\'t have a special anymore. Also, I just noticed that they have a black bean burger as a protein option on their menu!! How exciting! And I almost swore them off for Vegetarian eats! I\'ll need to try that next time I\'m here.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2013-02-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ieaT3v0coUNrSqVgY342cw', 'review_id': 'yXgXKp5jZkGyW6RfjfIjFQ', 'text': 'I\'ve noticed the quality of wings have gone down-hill over the years with the chain in general.  They have added additional flavors and styles (such as the dry rub) but I always go with either traditional or boneless mild/BBQ.\n\nThe main thing I notice isn\'t as good is how the wings are sauced.  Sometimes all in the same order one wing will be loaded and another one almost dry.\n\nService is always really good here though, servers refill drinks quickly and there are TV\'s everywhere you go to watch the game.  Lunch specials are available and they even have a frequent lunch card.\n\ni might try other wing places, but I\'ll seldom turn-down an invite to "B-Dubs"', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2013-03-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UDOe7JEQDTNMMaMO4X8zYQ', 'review_id': 'N120FCyL-c-_4rOD1e93nQ', 'text': "Been here a buncha times, mostly for late nights or Wing Tuesday or Thursdays, when theres wing specials. I believe  the graveyard wing special no longer exists and its $0.60 tues boneless or bone-in now. I remember when I first moved here in '06 and my sister told me about this great wing place that had $0.25 wings on Tuesdays and I love my wings. My eyes literally got big at the thought of it. What followed was I visiting this B-dubs every tuesday and ordering 3 different sauces of 6 wings each. I worked my way down their heat scale from the mild to hot til I tried them all. Did I say I love wings? haha\nThe wing special price has slowly creeped up in the past 7yrs sadly and now is more than double what I originally knew.($0.25 to 0.60) Might not go as often as before due to the happy hour not being as good a deal anymore but I'll still go sometimes.\nI do try other items on their menu on ocassion but usually I'm there for the wings! My fave sauce has to be the spicy garlic. The fried pickles and their onion rings ain't too shabby either. Service for the most part has been great from the bartenders and waitresses. The few times theres been a problem it was promptly corrected without hesitation. Drinks refilled before the current one is empty. Great place to grab some late night grub since they are open 24hrs.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2013-04-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'bl8mPrTM1lzqGqa1RaDB8w', 'review_id': '2shZQKwvlAaEeJkbP4jXOQ', 'text': 'Have been here many times. Great food. Your server can vary, i\'ve gone from great to "eh" but never bad. Came here to watch the fights. Put a nice dent in their kitchen with nachos, chicken, and mozzarella sticks for good measure. Can\'t lose  with BDUBS', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2013-05-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-zaFQpPVefA_fjL5yvfnKQ', 'review_id': 'u8_FB6UYgB2a83M0Xdc4pQ', 'text': "Yelp 100 Challenge 2013- 15/100\n\nDon't expect anything fancy. Decent selection of bar food...I'd recommend the wings (of course), especially the honey BBQ or Spicy Garlic. If you're with a group consider ordering  the sampler which includes some delicious fresh chips, soft pretzels, some super spicy wings. Ambiance is decent and there's plenty of seating and TV screens around showing all types of sporting events. They also get bonus points for being  having the entire restaurant Nonsmoking .. (rare in Vegas).  They also serve my favorite 'beerish' drink...Pear Cider. Yes, I'm a weenie and I enjoy cider.  Also, they offer 60 cent per wing ( boneless or bone-in) on Tuesdays.. Go get your grub on...", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2013-06-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'HrAKwGJV4Cm1SF-x0Hj3Aw', 'review_id': 'WxYb8D48EZ_EhAJRNP6jAQ', 'text': "Ive been here a million times and this place never disappoints! Sometimes the service is slow if they are busy but they keep your drinks full, they have a million TVs and the game to keep you entertained until your food arrives. the atmosphere is great for game watching and having a large group of people, never have to worry about being too loud or disrupting others. I'm obsessed with the mango habanero but they have a flavor for everyone.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2013-06-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oKMA8jICFInz1tIC5AudMA', 'review_id': 'SmPx7io9Nt6FIVT-Nm8jVg', 'text': 'UFC fights for free...get here about 5-6p to get a seats for mediocre fight cards, for big fight cards like with Jon Bones Jones or Spider Silva you need to be here about 4-430 for a good seat. Service is always good......', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2013-06-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '40jcM3sPUIGfK3_rdJCmWQ', 'review_id': '0RaJUodpDBYVJdJzDi3y_w', 'text': 'Watching the HEAT game! Stephanie is the best server hands down. She makes the BWW experience unique and makes you want to come back because she always comes to say hi whether she is waitressing our table or not.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2013-06-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'aprrNxu7TgDtSEKNtgygtg', 'review_id': 'ZkEoQN0y9Pj8P0ut2mmoXA', 'text': 'Out of all the Buffalo Wild Wings I have gone too in town, The Warm Springs Location Definitely has the best Vegas Hospitality! I usually sit at the Bar, Shane The Bartender is Great at his Job. Im never waiting around for another Drink, and My food is always out hot and fast!', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2013-07-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Bq3E_lmuVCS_9SHk-9pqbA', 'review_id': 'fwmi1vJzsJq9LPKfYcpAQg', 'text': "The wings are great but sometimes the service is less the spectacular. On our last visit we were seated promptly but that's where the great service ended. It took about 5 minutes just to get water and about another 15 for straws. The staff looked like they were cleaning but it never appeared to get clean. So after we ordered the wings took longer than usual and another waitress brought them out (which is not a problem) but our server looked confused that we had food. That was also the last time we saw her. Never got refills and had to flag down someone after finishing and waiting for 15 minutes with empty baskets and drinks. Bdubs you have to step it up, you can't hope your wings make people forget lousy service!", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2013-08-03', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'V-4RQc4L9Q5aaD-NVJIIgA', 'review_id': '_qqYBTsl8WdxEmbqrnAw7g', 'text': "This Bdubs finally screwed up my order. \n\nI've been here probably ten times. Having a Buffalo Wild Wings in close proximity is .25% of the reason we bought the house in the area. I like what the business does and they usually do it pretty well. However, as happens when you employ actual people, one of them made an honest mistake and put meat on my wife's nachos. Which we didn't discover until I had returned home.\n\nI called them back and relayed the problem (we have dead animal on this stuff. We specifically asked for no delicious animal murder on these chips) and they offered us free food. We said we didn't want free food we just would like an exchange please.\nThe nachos we recieved looked like the menu. You know how food never looks as good as it does on the menu? These looked like Mario Batali plated our Bdubs nachos. They also *forced* chocolate cake on us. The manager personally apologized. All of this highly unnecessary but very appreciated.\n\nI have come away impressed every time I've eaten here. The beer list is great (this varies from Bdubs to Bdubs) the service is good. The only bad thing is they get full during big UFC events. Completely reasonable.\n\nHighly recommended.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2013-08-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'P4HgVeyXQEtt62qUiYo_jw', 'review_id': 'Z8iE1-hj7eCclcabOVDyTw', 'text': "Great wings, and definitely have some unique flavors.  Total guilty pleasures.\n\nYou get seated quickly, and it's not bad service, but I think general, we did the bottomless boneless wings, and they took at least 20-30 minutes to get us the refills.  Similar type of service for drinks (less than the 30 minutes, but it's a wait).\n\nI can't say that I care a lot about the service during the work week.\n\nGreat food.  Hopefully service is better, since we come to this location quite a bit for lunch.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2013-08-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7qMz0BsAB0-X7hwVv6mHsQ', 'review_id': '7c0bdDcbdENOIVthTH5QnA', 'text': "Every time we come we leave satisfied! We get the same hostess Tara, every time we go and she is soooo sweet and friendly. The waitress's are always on their game, the place is clean and the food is always 100%. Tonight I had the Mediterranean salad and I'll be honest I never thought of getting a salad at a place like this just cause the chicken n burgers are always so tempting! But my salad was so amazing! My hubby had the nacho burger and our daughter got the buffalo blue cheese burger which has become their usuals! We love this place!", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2013-09-01', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 1}, 'user_id': 'n_id-rRZ6MAzqQCyIt8IZA', 'review_id': 'XWlOBIvBqMKJCpyFwuyP2w', 'text': "Went to order some wings for dinner, the young girl that took my order repeated my order twice and also got my order wrong twice. \n\nI asked for 36 wings (12,12 & 12 of different sauces) and she even advised me to get 25\n& 10 would be less expensive. But I. My bag only put 24 wings. Then she didn't put the salads I ordered into the bag. \n\nI understand if they were busy to maybe make one mistake,but they weren't busy. \n\nI want to give them a good review since I've been to other Buffalo Wild Wings and they went above and beyond. \n\nThis Buffalo Wild Wings needs to work on its customer service skills and there needs to be someone to double check the orders. \n\nNot returning any time soon.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 1, 'date': '2013-09-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LxO8DYKa_-1km2yJEiRKxA', 'review_id': 'f0FyrLcnO2oL_QDGrBZxpQ', 'text': "Good Happy Hour specials. Draft $3 domestic , $4 and $5 draft import. Half off appetizers and plenty of TV's.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2013-09-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZCS0lVBeGdeIeyHuftv7_w', 'review_id': 'mtcy-u6Vzm1ON3TRBrS4gA', 'text': 'Great fun place to eat and watch the games, great customer service..', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2013-09-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xQZpIwtb5rI9gVX8MF6YHQ', 'review_id': 'fpE4tJX39vl4mDNI02supA', 'text': "We had a number of issues when we ordered online, so they put our names in the book to make up the order the next time (calling in rather than going online), but they forgot a few things again (we were in a rush and didn't have time to check our bags), so they put our names in the book again. The third time, the General Manager took care of our orders and bagging and went through each box of food to make sure everything was there- success! \n\nEveryone was very nice and helpful, just make sure you order at the front or via phone (and check your bags if you have a large order). They did everything to make us happy and I appreciate that. \n\nWe'll be making BWW a weekly thing :)", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2013-10-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_oUuQ5NrrMCQG-EABbK-mA', 'review_id': 'x7rykgbLDukLdoZkOxd2Lg', 'text': "Awesome like always! This is the one I visit the most and always a good experience. Their new app (onion rings/potatoes/prime rib/ nacho thing) was amazing!! Can't wait to get it again! And on Tuesday nights wings are cheaper. I thought it was a pretty good deal considering how many wings we got.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2013-10-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '843CASoamAkFkgCMyY0NeA', 'review_id': 'lNdwNXk-U2SWh4d7UD_97w', 'text': 'I am very impressed with the staff aswell as the food. This location is great for watching UFC or any sports.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2013-11-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FQicCABFuQY1FPL3rIvwtA', 'review_id': 'ycMFPFgBSxmvmjxEZMFBVg', 'text': "This place is near by my house, went here with my bf for the UFC night, it's crazily crowded, and it's understandable that the food is not as good as other time. They were so busy, I had to wait a long time for my wings. When the good came out, they were wrong sauce. I had no problem with the services, all waiters worked their butt off. Just try to make better food when you are busy and that's all I want. Good food, good company, and good sport will make smile", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2013-11-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CWw5C2I7Vz_YYI43WId4wg', 'review_id': 'QJMaFJSqFh8nDtYDeSNBDw', 'text': "My go to weekly NFL spot.  I arrive every week at 9am and stay till the Sunday night games.  It's a cheers like atmosphere where you know everyone.  Brenda is always my server and she already knows what i want to eat and drink.  The food is consistent.   It's not gourmet but they consistently put out good food at affordable prices.  Great spot for NFL, college football, UFC and Boxing PPV events.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2013-12-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'X-eMa2XVVtrtWObyfBALCg', 'review_id': 'hggHvtw9evzxpwR3DeVsMA', 'text': 'Food is "meh" however love the bar, reasonably priced drinks AND they show the UFC fights. Fun environment and the bartenders are friendly.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2013-12-10', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 2}, 'user_id': 'ylSCq3ABtpVhCbPMvBoLsg', 'review_id': 'JMsfq7pvPixsbuAuVKDR2w', 'text': "I live between the locations on Las Vegas Boulevard and Durango. This location is definitely my preferred choice.\n\nSetting: It's a sorts type of wing bar. I was seated promptly after arriving to a Tuesday bball game night with $0.60 wing special. Place was packed.  As always, I order myself Garlic Parmesan and Honey BBQ and boyfriend orders the same along with Thai Curry. A basket of onion rings for appetizer. Not anything special, just hungry for any protein that will curb hunger.\n\nWhat was supposed to be a routine 10-15 minute wait became a 45min wait. The manager did rounds to each table about 20 minutes in and conversed with customers, greatly apologizing. He said one of the fryers was down and kitchen was insanely backed up. He explained that was even no excuse for the wait and that they'll take care of our wings. (I understand that it's not human error...they're doing the best they can!) Staff was sincere and working hard. Server consistently checked in on us and refilleddrinks.\n\nOverall: Food was ok. Onion rings were battered. Not breaded. Not really worth that long of a wait, but what got this place four stars was service.  Service was attentive despite their backup and when the manager said they'll take care of our wings to apologize for the wait, he really meant it! All the wings that night were free of charge.\n\nOne of few places where I know manager routinely does rounds with the customers' table. I don't even think other restaurants would try be so accommodating while you wait. Best bdubs in the valley for service", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2013-12-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '2xgvMsY8EQD_NGc6l1Pj0g', 'review_id': 'QTyyqHZ3zVrXDEPWsCqDaA', 'text': 'Happy hour from 2pm -7pm & 10pm-6am Monday through Fri. $3 appetizer/drink specials. We had cocktails, boneless wings & mozzarella sticks. Food was hot, fresh & delicious. Excellent service. Brian was an awesome bartender! May be my new local spot.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2013-12-26', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 1}, 'user_id': 'mgViQiuQG_3d2CmLTNW9rA', 'review_id': 'BGXrRUlSs8QcUNumLt9mzQ', 'text': 'Came here to watch Silva lose in UFC 168. And lose he did! MUAHAHAH!!! \nThe fights start at 7pm. I told the guys to meet up at 5pm. WHOA. The place was PACKED already! We did score a table out on the patio however ALL of their heaters were BROKEN so it was QUITE cold but service was great. \nNext time we will have to arrive at 3pm! EEK!', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2014-01-04', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'n0GH-IAovki1Zm6bA2fCrg', 'review_id': 'bXUzju_fuYKbgODgzctRRQ', 'text': "We met up with some friends to catch UFC 168.  They had gotten a table outside on the patio so luckily we had a place to sit.  The place was jam-packed inside.  The TV's outside are a little high, IMO, so you're constantly craning your neck up unless you're standing up. Also, it was freezing and I guess their heat lamps died.  \n\nOn the plus side, they do not charge cover for the fight, which is rare.  I guess beggers can't be choosers.  We had to go inside and order drinks at the bar as the wait staff was completely swamped.  Surprisingly, service was quick and efficient once you were able to worm your way in through the crowd up to the bar.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2014-01-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FLI3_OpdYZxEM3rX6bQUPQ', 'review_id': 'OD8pNccDmfVBWpBkUX6-EA', 'text': "Love this place, really do. BWW is an awesome place for happy hour, to watch games, catch up with friends, hang out, whatever! Good bar food, nice atmosphere. BUT today, the service we had was just terrible. Beth, our server, was atrocious. There was a time when we almost asked her if she was trying to get off work, because that's how extremely rushed and uncomfortable she was making us feel. There was even a time when she came by and actually asked if the check was ok, when we told her we were alright and didn't need anything at that moment. (Mind you our drinks were still half full and we were all in a fun conversation just chit chatting and enjoying ourselves). It was just unbelievable. Of course I will be returning to BWW, but if she's ever my server again, I will be promptly and politely asking for another.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2014-01-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'OsLvv0ck97w8jeR5jGeh3A', 'review_id': '_VQa9eNUMuhCjHW-hg4suA', 'text': 'Best place for wings and games! If there is football on thats where u will find me! Try the chillycheese frys', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2014-01-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'CCiVFuU_jV73A483iuae5Q', 'review_id': 'pvIuPjtSb0nBb8IFxgU2PQ', 'text': 'Normally my experience is good here, but tonight I ordered a side of the fries/cheese and almost got sick. The plastic coating on the bottom if the box melted into the food and thankfully we caught it before eating too much.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 1, 'date': '2014-01-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'DxVe0Tnc7jlAm2wSgcoZtg', 'review_id': '3nB9cngsKW0_zCiyeCVTpw', 'text': 'Went there Friday night. The wings were good. The bartenders were friendly and they had a good happy hour ($3 cocktails and domestics.) Me and the hubby played some trivia which I had never done before at a place like that with their little devices. It was my first time to a BWW and I would go back.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2014-01-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Z0L078Q5D1FJ0IDC8r9Idg', 'review_id': 'uJlRP6D4J25StJ29e1bbIA', 'text': "BDUBBS!!! \n\nLove grabbing drink and wings here. My favorite sauce is the hot BBQ. I also like getting the boneless wings. I feel like I get more that way. \n\nI like that they have mikes hard lemonade. I know, weak drink, but sometimes I just want something other than beer and hard liquor. \n\nOnce in a while i get the chipotle dry rub which is pretty good too. I've been meaning to tell my brother to do their blazing challenge. 12 of their hottest wings in 6 minutes, goodluck!!", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2014-01-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KdmED6XmJJ4YXiJOc_yiIw', 'review_id': 'i_qr1DaCZSnTTgfTT3px1Q', 'text': 'I come here regularly and the service is always excellent. Their food is great and love the wing deals they have. Plenty of selection with drinks and have a variety to choose from for food.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2014-02-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nSmPLaLx1pHBq4YRy2N8wg', 'review_id': 'Eg1YKUjzYN4fIgYGsOUpng', 'text': "I always had great experience here. The service is alway great, staffs are very friendly and fun. Great place to watch UFC and sports. The wings are the best. My favorite is buffalo dried seasoning. You should try cheese curds. It is the best. This is My family's most favorite restaurant.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2014-02-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TwsGXcwQt8iWFiDi-aEsOg', 'review_id': 'NIL2lba726MsSWjbQJHURw', 'text': "Whether I'm getting lunch during work or having some drinks and wings with the crew, he spot. The Mango is hotter than the Wild, FYI. Huckleberry lemonade is nice during work, and Dos Equis on tap is even better after work.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2014-03-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lWeiFEl8EnY6Qu2xE2O4Pg', 'review_id': '8Jl0OAATv6SWyD1UHjJrmg', 'text': 'Fantastic BWW! Third time here @ this location & awesome each & every time! Katrina was the best server & went the extra mile to make our visit a great one! Love this sports bar! Wings, salad & flatbread were great! My husband had hot chocolate caramel brownie w ice cream & passed out for a nap! Way to deal with Daylight Savings Time & springing forward! Thanks BWW for making a manic Monday better!', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2014-03-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xjiVfjsLW7Hho7ta8HHXXw', 'review_id': 'fotl2oFTcepAnN0-3m6lSA', 'text': 'I cant get enough of there medium spicy boneless wings.  They are my favorite in town.  \n\nThere lunch specials make the please more reasonable.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2014-03-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'D7cHP0yn-g0QJkj5xsRgAg', 'review_id': 'FCKoFZ4QmGJlOXfl4IDXag', 'text': 'Great place for the big games, went for march madness. Service was great as usual at the bar. Love the selection of games and brewskis. If you want the sound to a particular game they have no prob switching it or polling the crowd on which game to listen to.\nI catch this place on tues or thurs when they have wing/boneless specials, wanna say happy hour is 4-7 pm. The wings are usually just a tad too breaded with less meat, this time it was a perfect combo but the last two times they were less saucy than a Mormon Christmas party, other than that a great game/dining experience. Kimberly is the best bartender at a busy bar you could ask for. Only knocking it a tad cause wings are in the name so you should have those down pat. 3 out of 5 this time.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2014-03-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'hcg6vqqrRc8z9vyard-CuQ', 'review_id': '-wfccjr1uqsGJfY48PyLxw', 'text': "Great specials on Tuesday $.60 bone in wings and $.60 boneless wings on Thursday.  Great flavors and varieties from the mild flavors to the extremely hot. You can buy all their sauces and take them to go. Must try the salt and vinegar fries. Great tang. The chopped salads and flat breads are a great healthy combination.  Bring the kids for the video games and if you're not a sports fun they have great trivia game.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2014-03-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'RbbIahWLojqPIoMNXT9CYg', 'review_id': '1nY0L_GlgUTy6An6sKpAqw', 'text': "Another place I usually feel gross after leaving. I do really like the garlic Parmesan wings. I also like that you can get a carrot stick boat. What I don't like is how they skimp on their beer pours... Literally 8oz of foam or more sometimes, and they try to justify it with a lame excuse about how their tap works. Not so... 1/2 the beers poured are full or close to full, the other 1/2 are crap foam buckets.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2014-03-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'RbbIahWLojqPIoMNXT9CYg', 'review_id': 'POJTQvG1wGDc4az1pImuKg', 'text': "I really should be giving them a 1*, but I'm in a generous mood. Service was terribly slow tonight. I had to ask a manager to bring waters to the table. It was boneless wing night, so we tried them... Disgusting. Where's the chicken? I got a basket of hard, crunchy, fried breading. I do not know how this qualifies as food, let alone chicken. Ordered the roasted garlic mushrooms... Since when is a roasted mushroom fried!?!?!? Next, tried to order a Batch 19 draft (from the beer menu)... Oops, we don't carry that. To top it off, the only real food item on the menu (veggie boat) is no longer on the menu.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 2, 'date': '2014-04-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'hGYfWo5rppO1NyVlkUCTwQ', 'review_id': 'DnWfsQb4RF2ziU_cXRviWg', 'text': 'the wings and sauce were on point. the draft beer selection was impressive.  I hunted down the manager to ask him if he could change the sound from the nfl draft (3rd round) to the nba playoffs. he took a poll over the mic immediately and changed the sound the fairest way possible(crowd reaction). the only reason this establishment is not getting 5 stars is because my friends and I all had trouble with getting comped drinks that we deserved based on our gaming.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2014-05-10', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 1}, 'user_id': 'ezn21evL_tkH9vtldGU15Q', 'review_id': 'e-y-DOhUX8-ALFcd5Fa5Sw', 'text': 'Bartender was very rude, management came out very unprofessional when I asked to speak to him. I spend at least $200.00 every week at this BWW. Workers know my family and I by name from how often we go there. My first bar experience at BWW  bar was a horrific experience and I will NEVER GO THERE AGAIN!!!\n\n That Being Said You Lost A Regular Customer', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 1, 'date': '2014-05-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2hXyvpsuk6j1LK-Mc1YBFg', 'review_id': '-LRKY60CtBVqr9iuJknrRw', 'text': u'My fianc\xe9 and I have been to all the Buffalo Wild Wings in Vegas and this is the best one. Great service. Food comes out fast. They keep an I on there tables if anyone needs refills. They have never gotten our order wrong like other Buffalo Wild Wings have. The waiters are very nice also.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2014-05-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'aVYbqZX-yCh2lVBhH3STcA', 'review_id': 'ruTfVBMnADXnoIFHJtOuFg', 'text': "I like BW3 in general, but this location is DA BEST!  Been coming here ever since they opened (6-7 years ago?) because our house is just around the corner, and it's always been a great experience.  So no, their food isn't French Laundry, it's just wings and other bar foods.  But I'm going to give it 5-stars based on one thing - the Mango Habanero wings!  I've had this at other BW3s before, but they're not 5-star-worthy.  This one is.  Mango-y but not too sweet, big time habanero that is fiery hot and does justice to this sauce being the 3rd hottest out of the 1000 sauces they have.  I'm just scared for #1 & 2...\n\nThe other sauces are also great (maybe not 5-star worthy), and their burgers are really good as well which was a pleasant surprise.  Service is great all-around, especially the pretty sweetheart at front.  And this place is just hopping all the time with great vibe and lots of TVs.  Just such a fun place, if you can get a seat!\n\nSo 4-star value on the food except the 5-star Mango Habanero, at least 4-star service and a can't-fail 5-star enjoyment all rolled into a place walking distance from the house.  How can you go wrong?\n\nTable-for-1 Factor:  So there is a downside, you probably can't enjoy all this if you're alone unless you're willing to take a chance on walking in by yourself.  Awkward...", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2014-05-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LYa2ahCK9vWBV0U1xIc_gw', 'review_id': 'uKdYr_m91XNRj5SgY8nxdw', 'text': 'Expensive! But friendly staff, my food was cold when they brought it to me, they replaced the whole order and gave me 10% off.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2014-05-26', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 3, 'cool': 2}, 'user_id': 'Q9BMDPfaawiPk0Gbq7v5Vw', 'review_id': 'ZOS-VN9drPTt3KkypIRljQ', 'text': 'This place is disgusting. After not having dined at a Buffalo Wild Wings in YEARS, my husband did not want to stop at Wing Stop on the way home, and since BWW is just around the corner from my home, he urged me to try it again. Never ever again.\n\nIt was Thursday and they have a wonderful deal of $.60 boneless wings, except that they ended up coming out as fried little pieces of sub-par "chicken". We got 5 sauces: mango habanero, spicy BBQ, Thai curry, lemon pepper,and garlic parm. They were all terrible. The garlic parm was HORRIBLE! They squirt slimey, sticky "sauce" all over these wings, without a hint of real cheese or garlic and call it good. Lemon pepper was the best, although probably because they were plain fried "chicken" and weren\'t coated in one of their disgusting sauces. Thai curry shouldn\'t even be a flavor of chicken wings because they were disturbing. Spicy BBQ was nothing original, and on the same level as lemon pepper. Mango habanero were so spicy that we could only eat one each because we didn\'t want to be in agonizing pain.\n\nWe also ordered a side of fries, which were cut skinny and fried crispy. I liked the fries, and tried the salt and vinegar seasoning. The seasoning was tasty for the first couple of bites, but got old very quickly. Overall, we tossed most of the wings because we only tried about 1 of each, when we ordered 30 wings total followed by extreme bloating the following day. We will definitely stick to their competitor.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 2, 'date': '2014-05-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'qIRlqTsWPm1NMW1_VG9kGg', 'review_id': 'YBol7AKcckpFnhZS0KSe9A', 'text': 'If you live in the deep west side of the Valley... You will appreciate this location! It literally is walking distance from my house and is in such a great plaza.\n\nAnyways, this location is a decent size. The service is "on point" though. They are usually very quick on seating you. Just like all the other reviews - BWW is the perfect place to watch your sports shows. It gets really packed and full of energy during college basketball season, especially when the Rebels are playing.\n\nMy go-to order is a toss up between the honey bbq, chicken parmesan, and mild wings. I almost always have to get a regular order of french fries or potatoe wedges with cheese. It\'s a must in my book anyways. They have a good drink menu. I love their bahama mama - its the perfect fruity drink for me.\n\nTo sum it up, if you\'re craving wings and are on the west side. Don\'t forget to hit this location up.\n\nTip: Try to go on a Tuesday or Thursday for their discount price on traditional and boneless wings. If you like traditional go on Tuesday and if you\'re a fan of boneless go on Thursday.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2014-05-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'aa-HbrqUkcJNM67jm39gJA', 'review_id': 'y-D_JdylU7rIMnxgxAx3nw', 'text': 'Chili on fries was dry (as seen in photo) wings were slimy and full of excess skin.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 1, 'date': '2014-06-02', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 5, 'cool': 1}, 'user_id': 'X2bSSXlxoppk3DIduFNpKQ', 'review_id': 'bx6F3LhbVHb9Ks1n1au2_w', 'text': "Me and boyfriend have been coming here at least once a week for the past month , and he always plays poker when we come so we sit at the bar obviously , today we came in and he put his money in as we waited longer than usual for the bartender (not our usual one ) he finally came and once we tried ordering our drinks he walked away then came back without our menus , we ordered our drinks and the menus did not come after our drinks came he gave us the menus , finally after about 15min of us waiting he tells us to move because we were not playing the machine quick enough ? Not to mention his attitude was far worst than ever , we still had money in the machine and he was being a complete jerk !has he ever heard of customer service ? I think not . I get that you have to play the machine and those are the rules to sitting at the bar , but hey let's try this thing called being polite ya jerk ,after we were forced to move no one sat where we were sitting guess the demand was pretty high to sit there ? On a lighter note out server Wes was a doll and the food was great as usual  , and To the bartender named Brian my tip to you is be kind when has rudeness ever paid off ?", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 2, 'date': '2014-06-05', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 1}, 'user_id': 'XtQKvytpCRr8tdcWbWRgkw', 'review_id': 'kRRH2lL0f38BlaPDl7YiTg', 'text': "This place has the worst, most horrible service ever!!! Even when your sitting right at the damn bar! Don't ever ask for a side of hot sauce or anything that doesn't. One with your item. The little botches behind the bar can't seem to figure out how to make it happen!", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 1, 'date': '2014-06-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 1}, 'user_id': '9GlPdCzNp8WsAyiOxmf2Qg', 'review_id': 'gEqP4UKrP1bbzOiyxI9zrg', 'text': 'What a complete and utter disappointment!  My husband and I went their today for a late lunch, and by late I\'m talking about 3pm, so we completely missed the lunch rush.  The place was not at all busy and we sat at a table in the half empty bar.  We sat there for 10-15 minutes and no one came over to take our drink orders, give us menus, or even acknowledge our presence.  We didn\'t even get an "I\'ll be right with you."  After waiting for as long as we did and still thirsty and starving, we got up to leave.  On the way out I mentioned to the hostess who thanked us for coming that we were never even served.  She said she would tell a manager, but who knows if that happened.  Afterwards, we drove to Hooters and got excellent service and were served immediately.  The Buffalo wild wing server lost out on a big tip.  Next time serve your customers.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 1, 'date': '2014-06-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JS05dxPhEQLDCFk_CWiz8g', 'review_id': '5DthakUNDJ4xVtelzLIH3g', 'text': 'Good, greasy, cheap happy hour for hang overs. Order your wings bare and then you can have as many sauces as you want by dipping them into "samples"', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2014-06-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ARZvtaCbn3uZX7X6QUqngA', 'review_id': 'cfhOTSbTCZE8yqKgSpAwiA', 'text': "My boyfriend and I have been in here a couple of times and both times had the same bartender taking  care of us. Not only did he have great recommendations but also just great over all service. This yelp is 100% service related being a bartender myself it's always refreshing receiving great service when I dine out. Buffalo Wild Wings you did a great job when you hired Kyle and because of him we will be in more often!", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2014-07-03', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'LsYyJKCs6bI7-qD6RMCj-A', 'review_id': 'adi0cJL1RjfjWZJf8wUiDg', 'text': 'service was fantastic as usual! my boyfriend and I came in for wing Tuesday and some beer. it was moderately busy, but our server Kimberly was extremely swift and super awesome! we kinda knew what we wanted, but she made suggestions to help us make a final decision. we left with our bellies full along with our left overs. (:', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2014-07-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'YAjMnT_aU3pNDgYO-rUUFg', 'review_id': '037-SbyTJ-K7G90zM1qhDg', 'text': "Great lunch spot.  I'm a fan of their 8 wing lunch special.  Wings, fries, and veggies.  This is also our go to spot for Champion's League games.  They show every single match!!  \n\nUnless you've been hiding under a rock all these years, you've been to a BWW location SOMEWHERE on this planet.  You know it is all about the wings.  My personal favorites are mango habanero (which I think is way hotter than the blazin), Asian zing, and thai curry.  \n\nThere are a good variety of beers on tap, something for everyone I would say.  The food is always fresh, servers friendly, and always a fun time.  Only problem is that, depending on the sporting event, it gets way too crowded.  But that is part of the fun, you have massive crowds cheering for both teams.  Almost feels as if you're in the stadium.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2014-07-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'lWeiFEl8EnY6Qu2xE2O4Pg', 'review_id': 'yU1JcnDyKFdoz56IFw_eXg', 'text': 'We love this BWW so much & Katrina is one of the best servers ever! Really fun location with great food & drinks & fantastic staff! Go to spot for gr8 Sports & Munchies & Decadent Desserts!!! Thanks BWW!', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2014-08-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xhnGxhyFwrxTGrt7VqlzKg', 'review_id': 'OKffHc2usiACUmUClbvCfw', 'text': 'Great place! My husband & I went on Friday night, not too long of a wait and the place was pretty packed. I had the buffalo ranch chicken sandwich which was juicy, not greasy, and full of flavor. The fries were fries, but ok, nothing really special abt them. My hubby had the mango habanero wings and he said they were good, even for his picky palette. We had draft beer which was a little pricey, 6.25 for 16 oz. the service was great, we were never left unattended or felt we needed service, and our server helped us with our choices and had nice recommendations. We will definitely go back!', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2014-08-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'AWUKwt24NY0FSKglBJ3XDg', 'review_id': 'tO7kmu2YtIwpzT4G38aYqA', 'text': 'We decided to come here, as the location closer to our house has disappointed us twice now- this one did not! We were instantly greeted by two hosts as we entered and were immediately waited on upon sitting down. Our food came out in a very timely manner and our server, Rae, was very friendly! Attentive without being overbearing. Restrooms are clean, music not too loud. We will def be back here!', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2014-08-11', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 1}, 'user_id': 'qx7C29eWOVON13HmC8sqLw', 'review_id': 'dRgNMLdtVdc1DmUTobCkOw', 'text': 'Let\'s face it... it\'s Buffalo Wild Wings which is pretty much standard when it comes to BWW food you\'ll find at any BWW. Visited this particular BWW about 5 times to visit with friends to watch some games. Been to several of them across the nation and honestly.... not my first choice of places to go in Las Vegas (or even in my top 20 places for that matter) with so many GREAT places to go.\n\nFood isn\'t bad but nothing to rave about. Mixed drinks are pretty weak. Do anything more than your typical drafts and you\'ll be paying the price.\n\nNever really worth reviewing this place in the past but the following incident earned this place a fantastic 2 star rating.\n\nMet up with several people that love to go there to watch a game. Ended up at the bar and a couple of people were sitting at the bar next to us as we played the machines and we chit chatted a little. The girl I was with easily put over a couple of hundred dollars in the machines and I also put in some money and played. Ended up with a tab (yeah.. it\'s one of those places) which I paid. The people sitting next to us were also playing the machines and ended up leaving. Guess one of them did not pay their tab.\n\nRight after they leave... I have a Bartender ask me in front of the lady I am with: " Are you going to take care of his tab?"\n\nI asked him why that was my problem and he went off on me. Next thing he says is: "I\'m tired of you guys coming in and not tipping me"... SERIOUSLY??? The few times I\'ve been in there I\'ve always tipped over 20% so I got a little upset to say the least.\n\nBut it gets better....\n\nWe leave to go somewhere else and then eventually end up at a bar down the street. Low and behold there are some employees wearing their BWW uniforms and one of them starts screaming and yelling at me across the bar that he\'s going to kick my a** and everything else because some person that I happened to talk to did not pay his tab and I was responsible for it???\n\nWhat fun.....\n\nNeedless to say, I\'ll NEVER, EVER go back to this particular Buffalo Wild Wings. Too many other bars in Las Vegas to waste my time and money where the employees understand service and taking care of people. Especially customers that plop money into the machines.\n\nI prefer to rave about good service / places but this negative review is certainly well deserved. Not just because of the above incident but from my experience, the bartenders there on swing shift seem to be miserable every time I\'ve been there, rarely smile and their customer service skills are shoddy compared to other places I go. \n\nCheers!', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 2, 'date': '2014-08-15', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'QRIGeIJXaKWnvlLW5siJoA', 'review_id': 'wqCb_85Ew-RG0vZrYtO_5g', 'text': 'Tried calling in a order and was on hold for 15 min. Called back 10 times and line was busy. FAIL FAIL FAIL', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 1, 'date': '2014-08-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'EKJVvRrFZiBjbkp6OcF4AQ', 'review_id': 'zW1xzbRCjY8k_lj0h3aQJw', 'text': "You want a wide array of wing sauces? You got it! You want great happy hour specials? You got! You want a friendly and attentive staff? Forget it! Just kidding the staff here is incredible, friendly and helpful! This is one of the best BWW I have been to.I recommend. If someone docent stop me, next time I am doing the atomic wing challenge! Live it up, you are in Las Vegas for cryin' out loud!", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2014-08-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'yW6R9fLJsRDD0lqMFGxQcA', 'review_id': 'BLyRkTmTNL2cqrC_10tm6A', 'text': "We love B -dubs and usually dine at the hualapai location a few times a month. This time we figured we would try a new location just for some change and we are so sorry we did. Service was terrible. The waitress talked about the new caramel wings they had for this month and when my husband asked for a sample (like we are always offered at other location) she looked for every reason possible NOT to bring one. Seriously? I used to be a server so I understand how it gets but she had no interest in being at our table whatsoever.  Empty drinks, my husbands order was completely wrong. Food was good as always but we won't be back to this location.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 2, 'date': '2014-08-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'vcWOk-RXKJZTFDCBhoOqgQ', 'review_id': 'Sc7c36AYurTmRrO7PZ8wJw', 'text': "Pretty great happy hour! Lots of tv's with numerous games/events on. A little surprised the the Yankees game was on one of the smaller ones but.....\n\nThe staff seemed to work well as a team. Food was pretty good. Great neighborhood spot.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2014-09-06', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'Sv4BvK-hbOF9hQxU6GqLLA', 'review_id': 'PXT41BDWtkZL4fLwkT2Uxg', 'text': "I just noticed I've been coming here for about 2 years and have not written one review. The place is great, the atmosphere is nice, the staff is friendly, and the food is all very good.\n\nI've ordered pretty much everything on the menu and the fried cheese curds are the #1 thing I would always get. However lately me and my girlfriend have been ordering the sampler because it's big enough for two. For dinner the boneless wings are a must-have, but if you're not in the mood for chicken with spinach artichoke dip Pizza is to die for. I never thought bar food tastes so good. \n\nBuffalo Wild Wings is definitely a great place to come and relax after a long days work. Big 5 stars for this location", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2014-09-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'LlUgJmQoyrJgRk_zbeL99g', 'review_id': 'wrEqKoLuYqbKKKIJ2ZnLgA', 'text': "Great happy hour, great food ,love to come here after work for a nice cold beer .Katie always bring me my favored beer and my double cheese burger , she's an amazing person with a great attitude I wish every where I go they provide the same service, that's why I keep coming back , I could go to 10 other sport bar to watch a game and have a cold beer but a good service you can't get it every where , if ever come to the Wild buffalo wings on Durango/Warm Spring You ask for Katie", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2014-09-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xgTSmnoULBBhUScopkZARg', 'review_id': 'SJrvnLlj1obT1-BpHLP7qg', 'text': "I'm here right now and it smells like feet. This place could use a deep cleaning. Service was good though.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2014-09-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'YhehU4DO_i7-C0ZAAs4wTg', 'review_id': '-NhML9sryrCu_u3QUTVKOw', 'text': 'You never can go wrong with a local Buffalo Wild Wings! This past Sunday was my first time at this particular location and I must say that it was a great experience! Originally went to the casino to watch the football games and due to the over crowdedness we headed up here! Greeted promptly when we walked in but headed straight to the bar where there were plenty seats! The bartenders were all very pleasant and professional! Good came out very fast and fresh which is always a plus! But then again how long do traditional wings and it boneless really take? You can tell that there are plenty locals that come here on the regular because there were plenty people greeted by names by the bartenders! Will return again!', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2014-10-01', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'rzHZ3iYVQe_8h2e42DbUsw', 'review_id': 'Uy0msmJ-Uup0nMuV2pzpeA', 'text': 'So their wings in my opinion have always been just alright. Love the variety and they are never greasy but if they could make em just a tad crisper. I feel like they are a bit pricey as well. Staff that I experienced are friendly and helpful, never had to wait too long. \nAnother bummer, this location no longer shows the UFC fights, even if they are not pay per view.\nNot too bad of a place to catch a game, grab a snack and a beer.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2014-11-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'uVMk4xD33Mu-ZJn_L6KAOg', 'review_id': 'xHr4czjyyuCajZNhsq4ibA', 'text': 'Great Bar Area, You can see every TV screen from wherever you sit. Lively crowd, late night.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2014-11-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'PzY28tHeXbFTol6J_-R0lw', 'review_id': '5hn3AkdATJNtuHnWBH5L8A', 'text': "I've been a lover of B-Dubs since I lived back home... so this place is like a little slice of home to me. The staff is consistently nice & they have shown consistency getting our orders correct and out in a timely manner.\n\nSo a few things are different about this Buffalo Wild Wings than the ones back home, if you're new to town like me...\n\n-It's open 24hrs. So if you have a random craving for an assortment of chicken wings, you can swing by at any time!\n\n-As with most places in Vegas - there are video poker machines at the bar. They have keno as well!\n\n-There is a pretty sweet happy hour! Mon - Fri 4-7p, (select) $3 appetizers, $3 drafts, $3 Jack, Captain,  or Absolut drinks... I do believe there is another alcohol listed, but I can't remember right now :( \n\nOther than that, if you've been to one B-Dubs, you've been to them all. I just can't emphasize enough how great the service is here though - it truly is a neighborhood bar.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2014-11-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'iRg71EvOjegzZkGgJUfW4w', 'review_id': 'D_EpljPrn9ZJnwR-dmsMuA', 'text': "Service, atmosphere, and food are just all okay. It's only the 60 cent wings and happy hour specials that make it worth.\n\nTypical bar vibe. I only ever get bone-in wings and sometimes they end up dry - it's a hit or miss. The only flavor I really like is spicy garlic. The rest are just ok and the lemon pepper is downright horrible compared to Wingstop.\n\nI'd only go here if I was in the area and it happened to be happy hour. Lots of TVs to watch sports if that's your thing.\n\nWarning: It gets really cold at this location (at least all the times I've been there).\n\nTip: Get the regular fries with chipotle bbq seasoning! Pretty darn good.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2014-12-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KOI1cDE5lZsv-kCOYLlzLA', 'review_id': 'kEIqXXyfTJFgsqwB35kTkA', 'text': "I love Tuesday 60 cent wings! Their wings are fat and it's soooo good, I recommend mixing lemon pepper with buffalo. So delicious. You can mix and match any sauce you want, it is so worth it and it's cheap. Definitely coming back. \nNow the bad stuff, the last two times I came here, they messed our orders both times. I'm really hoping it's just a coincidence. It took them another 20 mins to get my orders right.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2014-12-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'CsQSPT3Kheiqe3ZNvFW6BQ', 'review_id': 'Rrvomu22w2bK9aywTbkgmQ', 'text': "Decided to go there late last night and was surprised to see it pretty busy. The noise level was a lot louder than norma, but that really didn't bother us too much. It made talking a challenge but we worked around it. \n\nService was pretty good, although our server seemed a little agitated at points but overall service was good.\n\nThe food was on point as always and came out pretty fast.\n\nFood\n\nPretzels - 4 Stars - Nice & Soft and better with the Queso Dip\nCheese Curds - 5 Stars - Tasted even better with the Marinara sauce. A very nice size portion.\n\nWIngs - 4 Stars - Nice and Meaty - Could be cooked a hair longer to make them slightly more crispy.\n\nChicken Wrap - 4 Stars - Solid Dish\n\nCinnamon Squares - 4 Stars - Fine without the caramel sauce, but is awesome when you use the caramel sauce\n\nCheesecake Bites - 5 Stars - Nice and Creamy, full of flavor.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2014-12-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'JQGTBMjHvqaNkn3NetxZng', 'review_id': 'PIyh-8iaijreImv3FPc-og', 'text': "Their new temporary menu with the potato wedges has to be one of the most amazing items I have ever tasted off their menu. They do have an incredible happy hour and a full array of choices on their menu. The only thing I don't like is all of their sandwiches have to be ordered well done. I can't order any of my burgers medium rare which really sucks so I just stick with the appetizers and wing menu", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2014-12-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'p98ru_PdnYmFSq1N8UFm4g', 'review_id': 'FX5ob4BkJbpgXoJoiXyJ8g', 'text': 'Absolute best BWW in the valley. The service and consistency of quality has made me a regular.\n\nPhenomenal Service\nGreat and large variety of food', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2014-12-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'SF7C9cFqT06KllAwISBNIA', 'review_id': '2I41nGx0KwDtWiI9dQrzfA', 'text': 'We have eaten at this location quite a few times, and every single time the servers are great and the food is always wonderful. \nThis time was a bit different. I was trying to win something out of the prize machine, and I won one toy, but I wanted another. I tried again, had the toy in my claw, and then BAM-- it dropped, much to my sadness. \nWe sat down at our table and the manager surprised me with a free toy due to all my extra effort. \nThe staff is wonderful and so is the food.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2014-12-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DJWC4idmjq_FmcOCbTljLw', 'review_id': 'CXkQUQXfPerZqwFtUKIVZg', 'text': 'I\'ve been here a fee times over the years.  Each time I\'ve left, I left with a good impression.\n\nThis place excels at service.  If our party size is 12 people or 4 people, we have the same impressive service level.\n\nI\'ve had their wings before. They\'re good. Its in their name so it better be good.\n\nThis time, I got their Asian Zing Chicken Salad.  It was good, I especially like the wonton chips that came with it.  I also appreciated the fact that they gave you the sesame dressing on the side and let you control how much you want.\n\nDrinks were filled quickly each and every time.  We actually joked because when were talking to friends the waitress startled everyone.  One second, their drinks were low. The next second their drinks were full!  And the question was "Where and when did the waitress do this?"\n\nClean establishment.  Ample parking.  Excellent service.  Will come Herr again for sure!', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2014-12-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yNkzchTygibGePSOmaRntg', 'review_id': 'DKlWPrhhTK_T5RA8roeTCw', 'text': "Service is usually good and food is better than most other BWW locations.  They don't dump all their reject chicken wings on you during Tuesday wing specials like other locations.  Food prepared well consistently and usually good about having the popular games on TV with volume.  Other locations may or may not have a big game on the right tvs and play music instead of the game.  Pretty sure it's supposed to be a sports bar.  This location seems to be the best in town!", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2014-12-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'jHoIBtzCB5PWCVhLyhNTQw', 'review_id': 'vBsc8iwCpQnr6MbPATCA-A', 'text': 'Never be seated by a waitress named Kimberly. She would never pay attention to you. She would set our food down on the table rudely; Never refill drinks; Never checked up on us. Take our orders wrong. Very disrespectful.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 1, 'date': '2015-01-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '8L8Qrkn-tQn-8Wgbe0hZvw', 'review_id': 'UPMmUr1hlgYhbHA7ylBwXw', 'text': 'We our huge fans of bdubs as my husband is a HUGE wing lover. So every state we have lived in we have frequented our neighborhood buffalo wild wings. But I have to say this location is hands down THE best! They are always accommodating even when they are packed. They usually have a lot of staff ensuring everything is quick. \nCraig is by far the best server there. He will make sure you have a fresh drink before your glass is empty. He remembers everyones orders without writing them down and just has a positive friendly attitude. But all of the servers have been great, even during happy hour/sports games when they are swamped they do a great job with a smile on their face. Food always comes out hot and delicious, also appetizers come out on time. Just very efficient. I will not go to any other buffalo wild wings in Las Vegas. This is our favorite spot we go once or twice a week with our toddler and we all have a wonderful time.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2015-01-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '-VJNuSsHWqvB2d3X1NpLcA', 'review_id': 'r8d9I0QvzPML8xFMafT-DA', 'text': 'Jamie was an awesome server and Captain Jake brought us samples of beer and mixed sauces. Best wild wings!!!!', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2015-01-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9jGGzFLYjygi_WrJpv3IWQ', 'review_id': '9sx21fqd9taCa2y4ey2mpQ', 'text': "My first time checking out this location, and it was worth the try! I've always used the one on S Las Vegas Blvd, but was surprised to find that this Decatur location is much larger, with better layout of the televisions (the extra space is really nice all around). I ordered a fairly basic burger with a few wings and a dessert. Even on a quiet night, that's a 45+ minute wait at the LVB location; the estimated time was 20 minutes over the phone and they had it done in 14. The service was quick and polite and they even had a fair amount of tables occupied for a Tuesday evening. \n\nThe burger was cooked wonderfully despite not being asked how I wanted it done. The wings weren't greasy, and seemed a bit better-selected than some previous places I've tried (I and a few friends have come across some odd miniwings in a to-go box at BDubs in this state). The Cinnamon Squares were cooked better than the LVB location's, as well. \n\nThis is the biggest BWW I've seen in Vegas or CT, and the quickest service out of all of them. Will return.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2015-01-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'KOI1cDE5lZsv-kCOYLlzLA', 'review_id': 'ZPeVCEIjSWc6vFOyJVJn0A', 'text': "Wow. What a big difference than what I had last time. \nOur server was so much better than last time. \nHer name is Linnea, such a sweet sweet girl, I'm hoping we get her every time we come back now. She was so nice and friendly to us, honestly can't ask for a better service than today. \nShe knew what she was talking about, when she wasn't sure about something she went to ask for the info for you immediately. Friendly and talkative to us, which I appreciate bc some servers couldn't care less about their customers. \nI'd like to say thank you to Linnea, if you are reading this. We really appreciated your great customer service. \nWe came on a Saturday which I thought was gonna be busy today but since football is over, not a lot of ppl is here.  \nOrdered two beers and she got them for us like right away. \nWhat a great day today. \n:)... Oh and the wings were good.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2015-01-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ppDrWM99hTD_k0mlOYm9ig', 'review_id': 'bem47Lld38cHh6_6JtK-2g', 'text': 'The food here is good, my boyfriend and I go to BWW often for the wing specials or happy hour which are both a good deal. There are just two complaints I have about this particular location; (most) of the staff is SO rude and don\'t really have a concept of getting their job accomplished (the waitresses mostly) but also the girls who take orders at the front. My boyfriend and I have literally waited to be acknowledged for several minutes while three girl just stood LITERALLY 2 feet away talking and laughing we even said "excuse me" and they finished their conversations and then one of them came over. And when ordering take out you are told your food will be ready in 15-20 minutes, you arrive and the food is not ready ok, no big deal so you wait and when the food is ready it is ALWAYS 100% of the time wrong, and it\'s always different temperatures its like they make 1 thing first and let it sit and then make something else so by the time you pick up your food half of it is cold and half is blazing hot! Anyway I still go here cuz the food is good but they suck at their actual jobs.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2015-01-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'j9Rvo1_BsXXh8kY89PNU_w', 'review_id': 'HiDgxmiXE-IWEoTpeiHF6Q', 'text': "I stopped in at 12:30 to grab some lunch and was told I needed a reservation because it was Super Bowl Sunday and that they were booked up. Excuse me? Its 12:30. Super Bowl doesn't start for another 2.5 hours. I will be contacting their corporate manager for refusing me service.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 1, 'date': '2015-02-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1aNyBVJe2hNSXrVY5zsR1Q', 'review_id': 'shKq3sqxMQT5y2OI9AWZmw', 'text': "I went here the other day because it was a Tuesday night, and my friends were a bit bored. Their Tuesday special is now 65 cents. I remember when it was 40 cents. That was only about 4 or 5 years ago. The price just seems to keep rising. \n\nI read that they offered an happy hour. I was unsure of what the time, and I asked when there hh was over. The server said, I don't know what time it is. uh.... okay. HH is 3-7. The appetizers include mozzarella sticks, onion rings, roasted garlic deep fried mushrooms among other things. \n\nThey also have a limit of 20 guaranteed flats per table. The wings tasted normal. The service was okay. Nothing exceptional. She did check up on his a few times. Before I got there, my friends wanted to try the buttery maple flavor. Another server brought us a sample of the sauce with fries to dip it in. The fries were awesome, not the flavor though. \n\nNothing special about my visit and nothing special about the visit. Slight irritation about my hh question. Isn't point to promote business?", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2015-02-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'xuVRYA1L9pI66uhdKjWT7w', 'review_id': 'F5cJklo_a38_FUWuxoKR4w', 'text': 'My family and I went to Buffalo Wild Wings this evening, although we had a bad experience last time. This time food was excellent, managers Mike and J were extremely welcoming and wonderful guest service from Denny. Very accommodating and friendly.We will definetely be back and with all our friends to!', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2015-02-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PmZJBU6JA48ckF3WVrMEUQ', 'review_id': 'Ov2YMtXT55A7iU1OPbf2cg', 'text': 'If I could, I would give 0 stars. My girlfriend and I come here at least twice to three times a week. Worst service ever this time. Granted I understand its late and you can\'t expect top notch service at 2 am, but you can\'t get an order THIS wrong unless REMEDIAL is in your vocabulary and every day life style. Almost tempted to never go back after this experience. The server was rude, unprofessional, and down right disgusting. After politely saying the order was wrong, he decided to say we didn\'t say it"CLEAR" enough. As if the crowded room of 6 guests was too loud for him to understand. Excuse my canter, but after having Michael as a server, I can say with confidence I will never be stupid enough to let him"serve" us again.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 1, 'date': '2015-02-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PmZJBU6JA48ckF3WVrMEUQ', 'review_id': '4P-UFfnkFywVgruobAv-3A', 'text': "Continued from my last review. I just want to add that was just one person at this establishment. The only reason why my girlfriend and I continue to come is for the GEC Donte. He is great at what he does, he's funny, communicative, and really makes coming here a fun experience. Hence the 5 stars. I would give him more if that was an option. So I suggest if you've had a bad experience give this location another try and hope he is here and you won't be disappointed at all.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2015-02-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pQu1Nk-vf8fR3Pjs0xFRtw', 'review_id': 'juAvhSyDj-XlLQn1m2b65w', 'text': "i've had some pretty terrible service at some of the bww, but this one is amazing! the host, Jocelyn or something like that, was super nice. she offered my nephew a video game tablet that he enjoyed while waiting to be seated. our waitress was really friendly and patient (we were a rather big crowd). while we were waiting on our food to come, someone named Tara came and offered us to try different sauces. she was super friendly, and brought out things we'd like. It was just an all around great time, I will definitely be back soon. :)", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2015-03-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5kyAkdsthR4xx2togaRrSg', 'review_id': 'qzsJ2dYAkeA1FuQU6zu64g', 'text': "I love Buffalo Wild Wings, and this location especially is always nice, polite, and quick in service. There is only one time that they were not very quick due to only having to here servers and it was literally packed. But they are very nice and quick. One thing that my husband doesn't understand is how the hot wings are hot but doesn't have much sauce to t, but the mango habanero and wild flavor wings are drenched in sauce. Either way, they are so good. Will always go back.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2015-03-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'WdzFfqEoVWqh8bp9mkzPfA', 'review_id': 'K42szyDmA-Py8Berz6aBgg', 'text': 'Of all the places, I did not expect to find one of the best wings in Las Vegas at BWW. My snooty self was thinking, "Yeah right, whatever." The BWW establishments in California were not very good, so I came in with a bias. \n\nHere\'s what to order IMHO:\n\nAsian zing chicken wings- 5 star. it has a crispy exterior, and has a great flavor. It\'s the closest to the Korean chicken wings (Kyochon chicken, OB bear, Soyo Barstaurant). The chicken tasted fresh, and the interior was cooked to perfection. Sweet, and a tiny weeny bit spicy. \n\nMango habanero- 4.5 star. This was good as well. A totally different kind of finish, not crispy, but definitely delicious. \n\nDry rub chipotle- 4.5 star. It\'s worth giving the few dry rub selections a shot, since this one turned out to be flavorful, but not overpowering. I also appreciated the crisp exterior--something that I like to have in my chicken wings at times. \n\nJalapeno Poppers- 4 star. So, I\'m a jalapeno popper fan at Jack in the Box. This is a "fresher" version, as though they breaded it at the restaurant instead of cooking the frozen version. It\'s definitely delicious, but maybe not the best I ever had. \n\nService was stellar 5 star. The dessert (chocolate fudge cake with vanilla ice cream) was SOoooooooooooo good. It wasn\'t "too sweet" which I can\'t believe, but if you\'re in the mood for chocolate cake and wanna overload, this is a great buy for $5. Since when can you get a dessert for $5 really. \n\nI\'ll be back. I\'ve found my 5 star chicken wings for now.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2015-03-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '3AZNg5JVft14SLF3d5s0yQ', 'review_id': 'aOAQpsdlp6qZoZXcXlOwyw', 'text': 'This is the best Buffalo Wild Wings by far. Everyone is friendly and fast service on a Friday night!! Stephanie was our waitress and she was fabulous !', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2015-03-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '0Z1P_DjMKg7H-5zxHJar6w', 'review_id': 'B5NgmXk-bqcDSNgOdoIO4A', 'text': "Always have a great experience when I visit this location. Just moved to the area and love having BWW a few minutes from the house!! You can never go wrong with the mini corn dogs and pork sliders! I tried a West Coast flatbread the other day and it was EXCELLENT! Perfect size, good amount of chicken and dressings, and the flavor was awesome! Not to mention $3 happy hour cocktails to top it off! \n\nPlenty of TVs all over the restaurant so you can always catch a game in the bar or the dining area if you bring the family! They also have a pretty large selection of draught beers to choose from! Can't wait to return to try some more new things!", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2015-03-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'cAs84AMuiSsgzlWv3JP1uQ', 'review_id': '16-CmX2fDvJHm3Nb5LUq6g', 'text': "Great spot to chill, watch the game and eat some great wings! My son loves this place and his favorite lemon pepper wings are always on our order. \n\nThe variety of wings they have is unreal, so much to chose from! Carribean jerk and garlic parmesan are my favorite. \n\nWe got to try this new sampler. It has so much good, honestly could be someone's meal. Mozzarella, flatbread, hummus, mushrooms...all so good!!!", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2015-03-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'B_Ld3sF4CdcGCdq74GkZPg', 'review_id': 'LLknO5_gFqjAAcu6eW_Q8Q', 'text': "Ask for Craig. The BEST server ever!!! He was a ninja! My iced tea would barely get down to half full and a new one just showed up. Every time. We never had to ask for anything. He was ON it!! Smart. Fast. Friendly. Not intrusive. We barely knew he was there. We were just taken care of. Then, when we did have a back and forth with him, he was polite, friendly and fun. To top it all off... I accidentally left my cell phone on the table when we left the resturant. He ran... not jogged a bit hoping to catch us but, if not, big deal... no... he, outta breath when he caught us, hollering to get us to stop, SPRINTED, across two parking lots, to catch us before we pulled out into the street, to bring me my phone. Freak'n awesome!!! Great wings! Big and meaty and cooked just right. Lots of sauce choices. Great appetizers. Good iced tea. Tons of TV's. They were even very friendly and accommodating whe we asked if they could try to find us a hockey game. What a great experience!", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2015-03-22', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'NxnZYkszWlH1GNEGv0ZSjg', 'review_id': 'UGNPEOnDjlvhpoPc9eUBHA', 'text': "As much as I'd like to rave about  how much I love Wings from BWW. I would have to say that my co-workers and I order from here at least once a week. They have messed up our to go orders multiple times in the last month. \n\nFirst time they forgot my wings completely. The whole order was missing.  More time missed off the clock running around during a work day. Had to drive back to get what we paid for\n\nSecond time they almost gave us one order for free but being the kind hearted honest hard working type we told them they had to charge us for one of the orders. This comes with after waiting for 20 minutes to get wings we ordered 30 minutes prior online for pickup. They stated that one of their cooks did not show up for work or called out.\n\nTonight was the last straw though. We ordered online again and I wanted dry rub on the side of my salt and vinegar order. I ordered garlic parm as they put that sauce on the side as well despite the clarification made in the ticket under the notes field on the website. Anyhow.... I also chose to get one Bleu cheese with my take out in which I did not get. All and all....  I am just tired of the complete lack of paying attention to small details. I am not sure how they have such a high ratings here but I am convinced and I will not eat here again just because of the amount of mistakes that happen over and over. I do not like paying for things and not receive them,", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 1, 'date': '2015-03-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HtKDIcnUK9FKWmJjrT65-g', 'review_id': 'utNMNmKIOnC4tLArpDQhUw', 'text': "Excellent service.   The waiter was very attentive and polite.  Love the buttery maple dipping  sauce.  Chicken fingers were good.   I thought the potato wedges were too spicy hot.  I also wish the curry dipping sauce wasn't as spicy either.  Nonetheless,  still tasty items, i just couldn't eat much of either.  The only item i did not like at all was the salsa that came with tortilla chips.   Too sugary sweet for my taste.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2015-03-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GM-FoJi4Ciam2U8Mbrea1g', 'review_id': 'RN-9jzJraUac0L9rSbJ-Yg', 'text': "You can count on great service with great food. I love their wings and onion rings. When I was on on a special diet, BW's was able to accommodate me. That makes this one of the best sports bars around.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2015-03-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '_iRnI0LnJgzLXBdPz9oijw', 'review_id': 'cAqiMUM1g6Iq-ed1niHdqg', 'text': 'Came here on a Monday midnight/Tuesday and they started their Tuesday wings special which was great! They have Happy Hour 10pm-6am! That rocks! Their drinks were great and I had a great time late night when the place is slow and quiet, not routy or crowded. Tuesday traditional wings are $.60 or .65! Cocktails and beers at happy hour are $3!', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2015-03-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': '0yILgiqKx3TgH6_2lbf_mQ', 'review_id': 'cPJKE6y8sYZehl_dnWw4hw', 'text': "The best server I've ever had is at this location Katie is amazing . I drive from trop and Pecos just to come to this location. The rest of the staff is amazing as well the food is awesome .", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2015-04-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2l2lRFuHLdyGjAuusqPDag', 'review_id': 'GALNIJMBjUMW6uJqdkgobw', 'text': "I'm getting back into Buzztime trivia after a lengthy absence, and BWW reigns over the Valley in locations to play Buzztime.\nI chose this location cause I was in the area and wanted to try their happy hour apps.\nThey have $3 apps, such as mozzarella sticks & mini corn dogs. Both were excellent for the price! The bar area is huge, with gaming on one side and plenty of seating for trivia/socializing. \nI don't watch sports, but you can't ignore the oversized TVs all over. Luckily, the volume was not up on them.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2015-04-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'vfxwaGy-ruGjjVJWuiF6tQ', 'review_id': 'T8mJIvIKUUqw4gzO46YWIg', 'text': 'Great bartenders, great food, do not, I repeat, do not play the machines.... they are the tightest around.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2015-04-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'OUDY0Q19BEYJm8HZiCMoDg', 'review_id': 'wilBpTR41sJpjlAQwaDywA', 'text': 'Plain and simple. The food suck badly everything was discusting, from appetizers to the beers. This is the third time this happens will never go back.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 1, 'date': '2015-05-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mImt49PheWqFuLPsSyg6Ng', 'review_id': 'y_YiuooG1C2Hk6BX-LNdIA', 'text': "This place has decent food and good service, but you've got to be in a particular mood to put up with the noise and crowds.  BWW is really more a sports bar than a restaurant.  There are TV's all over the place with every sport event happening around the world playing on one TV or another.   I can handle this place for about an hour and then I'm ready for some Motrin and a quiet room to find my zen.  \n\nIf you are a sports nut and love bar food, BWW is probably your home-away-from-home.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2015-05-12', 'type': 'review'}
{'votes': {'funny': 9, 'useful': 11, 'cool': 10}, 'user_id': 'orxwdyuvc5jxZBypYpWVDg', 'review_id': 'yhpABK65rPcgi6xutMZYwQ', 'text': 'Went to this Durango/Warm Springs BWW location tonight around 9pm. It was NOT packed and there were several tables vacant at this late dinner hour.\n\nHere\'s what we experienced in 7 to 8 minutes time frame...The hostess seated us in a booth directly in front of the kitchen entrance. In other words, impossible for servers to not pass our booth as it is less than 10 feet from enter/exit the only kitchen access. \n\nWe looked at the menus, made our dinner decisions and put the menus down as a universal silent hint to servers that we are ready to order. We looked around the restaurant that was NOT that busy....\n\nWe watched servers come & go from the kitchen walking inches from our booth, watched servers bus two tables away from us- but did not even make eye contact, let alone greet us, nor ask what we would like to drink/eat. After 7 long minutes without contact from any BWW employee, we got up and left.\n\nOn the way out, I stopped at the hostess stand at the front entrance and expressed dissatisfaction regarding the unfortunate poor customer service. \n\nThe manager on duty, wearing a red shirt, by the name of Geoffry looked up at me while I was speaking to the hostess and two other young ladies next to him, and asked if we were in booth 121. I asked what his employee position is and he identified himself as the restaurant manager.\n\nI said I didn\'t know the booth # we were seated at, however I described the booth as directly located in front of the kitchen entrance and mentioned to him that we were passed at least 2 dozen times by servers, but not one stopped to say hello, take our order, identify themself as our server, etc.\n\nWithout even acknowledging my complaint, let alone apologizing for his staffs poor customer service; the manager walked away into the restaurant. The hostess watched him walk away from the apparently difficult situation and then said to me "I am really sorry for his lack of leadership." Clearly, Geoffrey is the reason why the servers get away with poor customer service.\n\nI was looking forward to eating some wings, checking out a few games, tipping 20% and offering a 5 star Yelp rating tonight, but how many stars are listed above?\n\nTIP TO BWW: Get rid of Geoffrey and offer better customer service to patrons!', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 1, 'date': '2015-05-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 0}, 'user_id': 'JRbRDnEZgkUGNjv1JB4I3Q', 'review_id': 'VQQjTT7ZyttCD3S2Pkug2w', 'text': u"This review is long over-due for me. I've been to this BWW so many times since I moved here that I've lost count. I usually try to go during Happy hour/Tuesdays to fully enjoy myself. \n\nStarting off with appetizers they have a good variety to choose from (Mozzarella sticks/Chips & Salsa/Onion Rings etc) for only $3 during happy hour as well as $3-5 for Imported & Domestic draft beers. Traditional Wings on Tuesdays they charge 60\xa2 Per wing.\n\n\nBar - (Can't have wings without a cold one) For beer selections, they have a great variety of beers to choose from. From Stella Artois to Angry Orchard and some good ol' Samuel Adams. \n\nAny Variation of BBQ (Sweet/Hot/Honey/Chipotle/Korean BBQ) - I really find the BBQ flavors here to be really bland and lackluster, they really don't impress compared to other places such as wingstop where the BBQ is savory and just overall delicious, definitely won't be ordering them any time soon\n\nHot Wings (Mild/Medium/Hot/Buffalo) - As far as wings go, these are the ones you HAVE to order, From my experiences in Vegas every sauce that i've tried so far is either too salty, hot, bland, sweet, or vinegary. The sauce should be tangy with a nice vinegar hit, taste rich of butter, and of course have heat BWW hits this perfectly and I couldn't be more pleased.\n\nThe main problem that I've had with Buffalo wild wings is just inconsistency in every aspect. The service is either out of this world or straight up awful. As for the wings they could have the perfect amount of sauce and great taste, drowned in sauce and ruin your meal, or they could have no sauce at all and leave you disappointed. \n\nBut as long as they keep Happy hour and Tuesday specials, i will be coming back as much as I can!", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2015-06-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'azYY2ldWopiBi_xrDDE1tg', 'review_id': 'PvhOyeqezIlLFVLhyO_Esw', 'text': 'This review is simply to recognize amazing service PERIOD that I\'m sure would match a dine in service.  We just moved to the area and apparently a nail caused a flat tire which brought us parked next to this location.  \n\nWhile my husband was changing out the tire a crew member came out with a cold bottle of water and said something like "I can see you\'re having a bad day..here you go!" when asked what his name was he introduced himself as Jeff, the manager. \n\nIf the manager is as stand up as this with non patrons, imagine the service you get when you visit this BWW!! :)\n\nWe will definitely be stopping in soon!  Thanks so much Jeff!', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2015-06-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'uOEW24dAy87r-Jth0avb4Q', 'review_id': 'n89waaSD39cJr9NGqM6DpQ', 'text': "First off let me say:: Nicholas was an outstanding server!! We usually go to the location on Hualapai and decided to try this new location on Durango... Way better service plus quality of food.. Everyone was very friendly and attentive.. Wings were not drenched in sauce & crispy how we requested.. Other location doesn't  bother to reply to request: just bring out whatever way..Lunch menu is perfect for two people to share.. Happy hour is great but noticed lunch is just the same! This location rocks & worth the drive! Bloody Mary & draft beer had an ok price for lunch ... 5 STARS", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2015-06-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'YWOuTMXTB1OrScg5CRUU4A', 'review_id': '4KGeMx4ayQ08n0mElWpYmQ', 'text': 'Fun place to watch games. It is usually fairly clean, seems like the staff stays on top of keeping it tidy. The staff are always very attentive and friendly. Usually pretty busy even on late nights. Love the twisted margarita.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2015-06-21', 'type': 'review'}
{'votes': {'funny': 6, 'useful': 8, 'cool': 7}, 'user_id': 'QhVMRycaxLqK7KL81dxFJQ', 'review_id': 'rrUxhU0XQOovppq2lM5jUQ', 'text': "Oh gawd whenever I think about BWW's I cringe at the awful customer service I'm about to receive at the bar, no matter the location (9 times out of 10, service is awful). I also have to brace myself for freezing cold temperatures inside. Bring a jacket if you're always cold like me! For this particular visit, me and my husband met another couple at the bar. They were holding seats for us so we were able to right walk up and sit at the bar.\n\nI have never eaten a wing in my life, or at least not that I can remember. I've been a vegetarian for over 11 years and I don't plan on eating any wings in the future either! With that being said, dining at BWW's is a happy medium for me and my dude. Why? Because they have a token black bean burger for me, along with lots of other vegetarian options like flat breads, quesadillas, and your usual neutral appetizers while he gets his wings. Both parties are content! \n\nSCREAMIN' NACHO BURGER ($9.95?): I always order this with the black bean burger when I come to Buffalo Wild Wings. They used to have a black bean wrap but it's no longer on the menu. Fries are hit and miss. They're usually stingy with the fries. 3.5/5 \n\nSERVICE: Our waiter virtually ignored us. It was difficult to get his attention to order food and ask for refills even though he was standing directly in front of us at the bar. The other couple wanted to order a dessert but gave up because service was so slow. \n\nVIBE: There was a sports game on but I wasn't paying attention. It was loud inside and pretty busy. \n\nWorth a Return Visit?\nProbably not at this location since it's so far away from where we live. There are 3 other BWW's in much closer proximity, so it doesn't make sense to make the trek out here. Also, this location doesn't stand out at all. I'd rather get crappy service close to home.\n\nYELP 100 CHALLENGE 2015: #139", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2015-06-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HkIcA8-SpK2e7hhjxQapKQ', 'review_id': '7UfLwRXMzLjsAX45QSRrvw', 'text': "Can't go wrong with Buffalo Wild Wings. Great place to have a beer and kick your feet under and watch any game. Rob was great. He wasn't even my waiter but he checked on us multiple times! Great customer service. Hands down a great place.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2015-06-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Xl_loUz9L56waDpwSRyiWA', 'review_id': 'wRVZuUh3gR01fLOhC0wZNw', 'text': 'Awesome service and friendly atmosphere. The BWW on the strip we always have to wait as they are always busy. This location is busy but not as bad. Food and drinks along with the servers are awesome.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2015-07-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'b3RN5vf_T_59kJgf2x9kZQ', 'review_id': 'wMCnFzDATZ5NNOlZtMnt5g', 'text': 'Coming back in for another boneless Thursday. Started off with the Irish wedges which we really liked last. This time they were made better and really layered with the cheese and not just heaped on top which was better than last time, the only downside was last time we had onion dip and this time we had a honey bbq type thing. Definitely ask for onion dip because it makes it WAY better. Lemon pepper wings were good but the Parmesan garlic seem to always be covered in sauce. Either way it was good food and the service was good. Also all the tvs keep kids of all ages entertained which is always nice. \nOverall we keep coming back because the service and the food are consistent and good.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2015-08-06', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 1}, 'user_id': '9jGGzFLYjygi_WrJpv3IWQ', 'review_id': 'VwnC-Yo0PSpKBIVJ09DjCQ', 'text': "Today was not a good day for this BWW. Final update: After the 55 minute wait, I was informed the order I placed didn't reach the kitchen until I got there. This is in spite of my initial call to the restaurant to make sure it was confirmed. The manager (A.J)never spoke to me, even after my return visit because they'd forgotten my wings. Cashier (Cheryl?)did her best to apologize but she's hardly the one at fault. Very disappointing. 2 hours of failure.\n\nWaited an extra 40 minutes so far for my online order to be complete. Offered drinks by the cashier during the wait but manager hasn't spoken to me once. Slight disappointment on an otherwise solid streak of service.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 1, 'date': '2015-08-06', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'im2fgTOCgePbnqVda7HQEw', 'review_id': 'xm4KOypTdKUmXs4C4DZtyA', 'text': 'This is mostly concerning the drink comping policy for gamblers.  I was at the bar playing video poker and a girl sits next to me, puts in $20, and orders a drink. She was playing for a while and was up an additional $20 when she ordered a second drink. \n\nThe bartender proceeds to explain that since she only put in $20 she can\'t comp another drink. The girl politely protests and explains that she has been playing and intends to play more. I backed the girl up and stated that she had been playing the whole time. The bartender, with a look of frustration on her face, reiterates and further explains that comping is not based on your play but how much you initially put in... 1 drink per $20. \n\nThe girl who was gambling asked if she can cash out and put 20 dollars of her winnings back in to get another drink. The bartender says no. This goes back and forth for a bit. I almost felt a little embarrassed for the bartender. She looked as if she would have preferred to just give the girl another drink but also said that the managers really keep an eye on them! Yeah, you wouldn\'t want to give a gambler a drink that costs you about a buck! Good Managing!\n\nThe whole idea of giving gamblers free drinks is to keep them playing, keep them pushing those buttons... especially if they\'re winning! You want them to put it back, right?  Duh!  \n \nAs I was leaving I noticed the girl was now up over $100. I can only hope she cashed out and didn\'t give it back.\n\nI had a similar situation 2 months ago at the BWW on LV Blvd only I wasn\'t informed of the comping policy as I ordered my 2nd and 3rd beer. I cash out 20 bucks ahead and the bartender brings me a bill for $15 for those beers. I think the real policy at BWW is "If you are losing they will comp you, if you are winning they try and get some of the money back by charging you."\n\nSally Smith, the CEO of BWW, who made 3.9 million in 2014, was recently quoted as saying that BWW would be raising beer prices yet again. Uhhh! Geez!\n\nOverpriced Beer and Wings and a tight-ass comping policy for players...Too Corporate! I think it\'s time to find a new place. Fortunately, there\'s a bar on every corner in Vegas!', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 2, 'date': '2015-08-08', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 2, 'cool': 1}, 'user_id': 'dLEeAXeP_y_TTfdTrA3ziQ', 'review_id': 'YxJ2gr6tn0tuVc9OzatgtQ', 'text': u"The food is ok, nothing special. The service is inconsistent, and the manager is useless.  If you find yourself at this location against your better judgment ask for Katrina. If you like your wings on the crispy side, you'll have to ask for this as they tend to come slightly undercooked (i.e., soft skinned). I forgot to ask, so I was slightly disappointed with my wings.  The best flavors of wing sauces are the Jamin Jalape\xf1o and Spicy Garlic.\n\nI have attempted to eat at this location twice before. Yesterday, I managed to stay without leaving before I was served. Even so, I experienced the same problem at the hostess stand as I had two times previously.  There seems to exist a fundamental problem with the manner in which guests are handled when they enter this BBW location.  Unlike most BBW locations that seem to have a half-dozen teenage girls/boys at the front podium, this location tends to have one or two. Everyone else seems to be hiding in the back - I guess. If the hostess is in the middle of taking a take-out order, you could wait for a very long time without so much as a greeting. I consider waiting without a greeting or acknowledgement to be problematic after about 4-5 minutes because it only takes a second to tell a guest you'll be right with them.\n\nSince my friend selected the location with a strong desire to have wings and a cold beer, I agreed to give the place another try. Thankfully, our server Katrina saved the day. She was very pleasant, attentive, and accommodating.  Although the food did not meet with my quality standards, the service and my cold Angry Orchard ciders on tap did. Couple this with some great company, and the venue worked out to my liking.\n\nIronically, the poor greeting turned into a rather red carpet exit when two staff members sent us off with a pleasant good-bye and grabbed the door for both of us on the way out. Upon quickly comparing my greeting, it felt a little surreal. Although I am not looking for a red carpet entrance, guest should be welcomed and feel like a valued guest when they enter.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2015-08-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'WdzFfqEoVWqh8bp9mkzPfA', 'review_id': 'VOKagroCix7GiQEpgOvp5g', 'text': "Thursday nights they have 65 cents boneless wings. You'll have to order a minimum of four. I still love the Asian zing flavor the best. \n\nMini corn dogs- 4 stars. Who doesn't love a corn Dog? A deal for $3 during HH. \n\nONION RINGS- 3.5 stars. They were good. Can't complain for $3. \n\nChocolate fudge cake- 2 stars. I'm demoting this cake from a higher rating. It wasn't as good as I remember. \n\nI still like this place a lot. Their HH from 10pm-5am or so is pretty rad.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2015-08-12', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'Gs0wl_38F2o-yvigVVgd1g', 'review_id': 'zeUNAqhtvAroFV2Zki3ZRw', 'text': 'I was looking for a certain football game and I called ahead twice to make sure that they would be showing the game. They assured me that they would. So I show up with a party of 5, order 3 beers and 2 sodas and ask for my game on a tv close to us. After 20 minutes of no drinks and no game I finally get the waitresses attention. She said she was sorry with the bad service and went to get the manager about the game while she gets the drinks. The manager was extremely non helpful and said "well it looks like we don\'t get that game" and walks away, even with me telling him that I called ahead twice. We all ended up just walking out disgusted with the terrible service. AVOID THIS BWW LOCATION AT ALL COSTS!!!', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 1, 'date': '2015-08-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MHvl5eB5aIN0Rs1QdLLbCA', 'review_id': 'pr44sUQCrcmSgGCNoWSaKw', 'text': 'Great food, excellent customer service here. Come here for all your football, baseball, and family fun nights. Highly recommend this restaurant!', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2015-08-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-iEwUutRc4pfoa_Y2gAJtA', 'review_id': 'QPqLBZbcwsoRpKlRBqYgMA', 'text': 'My family and I eat here often....we enjoy their selection of wing flavors and the service is always excellent...it also fun to play the interactive trivia games, which we wind up playing for hours.\n             They have new flavors every couple months from the BWW sauce labs, which are always fun to try.  Very friendly people in a family friendly atmosphere... Definately one of our favorite restaurants.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2015-08-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'NAKRG18BfHXpi_Pqa5taHg', 'review_id': 'nnjHXfhDI76BmHDFQmKSow', 'text': 'I am at Buffalo Wild Wings, on a boneless wing night. The food is ok, but the service here is horrible!!! My party of 2 and I have the worst server ever in the history of servers. He told us 2 times that he was to busy to take are order, then ran off. We never saw him again until the check came. Then when the food runner brought out are food she forgot half of are order. Then they forgot the celery and carrots. I will never eat at this Buffalo Wild Wings again! And neither should you!', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 1, 'date': '2015-08-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': '6C48aTBstzdRttNSo_6iqQ', 'review_id': '8WDJA22pY7oAb9vr97qV0g', 'text': "I've been going here since 2011 since its less than 0.6 miles from my place before. Its open 24/7, after 11pm(or midnight?)you have to press the buzzer to get in. Place is big enough. Bar area is huge too,understandly. Clean and organized. This place is almost always packed, day or night. TV everywhere! Kids are not forgotten here,they have games to play with. Never had a problem with any servers. They are very attentive and some of them has good tips on fantasy draft lol. \nI like the wings here better than hooters. If only BWW will add clam chowder to their menu, that'll be awesome! \nI love the new dry rubs, less messier. Please add mango habanero dry rubs \nWill always keep coming back.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2015-08-22', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 1}, 'user_id': 'HSNNRgOH1W9Ob1iURWfVvQ', 'review_id': 'FjFoB980WlFx2fh9pmAKCQ', 'text': 'Food is always great here, but I just had my worst experiense here on my bday that I got out and just left. First, I called if they have happy hour before I headed there, a lady reply and said yes come on in. I arrived with my wife was seated by a male server and I asked again if they have happy hour, and was answered yes. Finally time to order, was told there has no happy hour available. \nThis is the worst way to lure your customer into your business. The worst part was when I tell the manager, he shrugged and kept watching his football game and not give a damn. Well he did offer the first 2 drinks @ happy hour price and that was it. Instead of instructing his employees about the happy hour instructions, he kept on watching his football game.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 1, 'date': '2015-08-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'x1t6CI-PUuvk0p-wVF1j3A', 'review_id': 'fJh8pdCdzcQfum8KklTNJQ', 'text': 'Happy hour and Tuesday night wing specials are hard to beat. Tablets are fun to use for trivia when going out with friends. My favorite is a mix of the mango habanero and honey BBQ sauces, "dirty" style.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 4, 'date': '2015-08-25', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 2, 'cool': 1}, 'user_id': 'I1cjbc0sG5hnrSPupPRhCQ', 'review_id': 'MaUCaG60Sk7sLPcr0_OOsg', 'text': "When I pass this place I just want to sigh a lot louder than necessary. It has so much potential.  Wings, beer, fun..\n\nBut still, I can never seem to receive an order of food that isn't cold.  I don't know what it is but I always get wings that can barely be considered warm. I don't understand how the servers here aren't visibly ashamed to serve stuff like this. \n\nLast night I got an order of spicy garlic and wild flavored boneless wings that had the consistency of soft cardboard when they got to me.  The place was busy so I know it wasn't that I was being served old food. It's a miracle how bad they made my order. They had decent quality chicken, awesome sauce, an industrial kitchen, and still managed to mess up.  The temperature of the wings was unacceptable, and there was almost no sauce on them: cool and dry.  \n\nThis location has a better draft beer selection than some I've been to and my drinks came out tall and cold, so the one star this place gets is because of the good enough beer. \n\nProbably won't be back unless I'm meeting friends for happy hour, and then I'll probably eat before I show up.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 1, 'date': '2015-08-28', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'WI-lLOXRKvbFZmrOVF5WOQ', 'review_id': 'OD4BIRfh94RVF6N57RCOOQ', 'text': "Your service sucks almost as much as my asshole after blazing wings. Please, I understand you are all busy but is it really that hard to bring out a basket of fries on a timely manner? Also what's with 4 fucking girls at the front table? Is this Bdubs or fucking jury duty..smh", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 1, 'date': '2015-09-01', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'SQAVsk4vPC3WhzzK5SQUoA', 'review_id': '7nKZt-H-0rULgCcJ6ZvcQQ', 'text': 'We should not be waiting for food for an hour. Other locations are not this bad. Not coming back anytime soon.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 1, 'date': '2015-09-01', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'JVz0m9OcBVLIgf1Ur17jkA', 'review_id': 'rySL82afs8jSPu04QqB83w', 'text': 'Always get the best service here at lunch time.  Katrina and Christina are my favorites.  The food is always really good .', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2015-09-03', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '1vqe1hN3-SYq0FRwiR4E7g', 'review_id': 'kBglfkyInkyjIKkRaPGPbA', 'text': 'We ordered veggie burgers, fries, onion rings, other fried foods. We explained several times we were vegetarians. We later learned that they use beef fat to fry their food.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 1, 'date': '2015-09-03', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'PrLjLHNifuj-rAz5Idbn5w', 'review_id': 'CLwGB2zPrcUNPu6UlJczWA', 'text': "Today I had the worst experience I placed my Order at 8:42pm the girl that took my order stated your FOOD should be ready in 15min .when I got to the restaurant it was 9:10pm my food was not ready I had to wait another 20min . 20 min passed and finally one lady put out the food in the counter it set there another 5 min so I didn't get my food until around 9:35pm I've always come to this bww but last couple times I placed my orders for pick I had the worst WORST COSTUMER SERVICE ever they need to train their front staff better or idk but I don't think I'll come back and I've been coming to this BwW for like 4yrs + N I LOVE THEIR  WINGS  the food is great but staff needs to have sense of urgency!!!!!!!!!", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 1, 'date': '2015-09-11', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 1}, 'user_id': 'HwVvBbnaN9NbQmmfnIe4jw', 'review_id': 'oR8rUzDdbvDYlgiMjYU-Aw', 'text': "The absolute worst service ever! I begin to place a to go order with JENNIFER who doesn't want to communicate with anyone else that it's to go or where it is, so I'm just sitting at the bar for about 20 minutes until I ask for my food. By then the food is cold and no one says anything about it. Neither do I, except for the fact that I will never be back. It's just kinda silly. That no communication is had amongst this place and that I had to pay for cold food. How would you feel if you had to pay for cold food? That you SPECIFICALLY ordered Togo? Weird right?", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 1, 'date': '2015-09-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'wb4aiSNwClTz8OjgtAk4Rg', 'review_id': '8_bPwrmu4pA6ntIHfUVmIA', 'text': 'I came in and ordered a To-Go order. The girl working did not let me know about the 70 cent Thursday wing special and charged me the regular price. I asked a different girl who was my cashier was the special on Tuesday or Thursday, and she said oh it\'s today. I said "really the other girl didn\'t tell me." So she asked if I wanted a manager for a refund, I said yes It was a refund for like $3 and change but it\'s not the price it\'s the principal. When the manager Aj, came over he hardly looked up at me he just went straight to the computer. I understand that they are busy but a greeting would be nice I finally smiled and said Thanks after he refunded me. Then when my food was ready I checked and it was just the appetizer, I was still waiting on my wings for like 10 minutes so I asked them to check on them. They also asked my name 3 different times. Get it together Bww.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 2, 'date': '2015-09-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Hqx9iTpsRXcQWbc3_BFhOg', 'review_id': 'aSpXD68o9eIsfgNa23Mrkw', 'text': "Excellent experience!  Stephenie was awesome ! I came n for a beer n togo food ..she got me in and out with such a great attitude. ..that's wat customer service is all about..I'll definitely be back on a wed to c stephanie:)", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2015-09-30', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 1}, 'user_id': '657EcnHIBYj_DIzy1CpQ2Q', 'review_id': 'qcAtD7-dAiSYE6lSyNksAQ', 'text': "BWW had the best wings ever... I always get Asian zing and habanero mango. The food it selfs deserves 5 stars but the customer service is HORRIBLE. This place never fails the give me such horrible service. I would never suggest any one to eat here... I would say do TAKE OUT, customer service wouldn't be as bad... The foods really good but the waitress with all the condescending tones and bad attitude who shows how miserable they are at work makes my overall opinion not worth it to come... So now I only do a quick take out", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 1, 'date': '2015-10-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'J0oGUORX2Gaq3NLEJ3xudA', 'review_id': 'bgrywXXzz_deI_5LurNANQ', 'text': u'Wings, Beer, Sports, good people, need I say more?  This place is fantastic.  The ambiance and electricity during games is second to none.  Great Happy hour specials from 10pm-6am with $3 beers and $4 apps.\n\nI\'ve been here a few times in the past, once to a funny/horrible story.  Because everything was handled with such professionalism and grace I\'ll tell you about it.  \n\nIt was approximately a month ago I ordered some boneless Sweet BBQ wings.  In case you\'ve never entered a BWW in your life, Sweet BBQ ranks number 1 out of 28 sauces.  28 being hotter then the sun!  After my first wing my eyes started to tear up.  My server assured me the wings were correct and I continued eating.  After 3 wings I literally broke into a sweat, and told him something was wrong.\n\nThe manager came over and took the food back.  When he returned with my new freshly made sweet BBQ he said aloud, "Those must have been in the frier with the Jalape\xf1o wings."  He apologized profusely and comped my meal.  Everything was handled professionally and with grace.\n\nTonight I came back to say hello and Shane remembered my face.  It\'s great to come back to an establishment where people remember you.  See you again soon BWW!', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2015-10-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'at4Y79XQjuxaXo96abeWxw', 'review_id': 'zX_RzvMQVMnoTmh29M2hwA', 'text': 'I come here a lot with the guys and we usually sit at the bar.  On Wednesdays I come  here for dinner with my son.  This Buffalo Wild Wings tends to have way better service than most others in Vegas.  Especially a waiter in the regular dining area named Denny.  This guy is always super busy but manages to stay patient and even remembers regular customers food/drinks.  I appreciate that especially when we only see him once a week or every other week.   And as usual we love the food and beer selections...', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2015-10-07', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': '7CIZwg_b_JgMlxwugxaTtw', 'review_id': 'tvL-aF6173TRvubeHLSGGA', 'text': "I've always liked Buffalo Wild Wings!!!\nBut the service at this one is horrible. We were here on 10-7-2015.  We left", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 1, 'date': '2015-10-07', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'YrcIXkM8xKOgyV-1HAjIxg', 'review_id': 'YZ0vhCjqvB1PDTnbNNAaoQ', 'text': "I've been to other BWWs and the wings tasted great. This time the food was super bland. I couldn't taste the Honey BBQ off the wings at all. Maybe it was just because it was football sunday...", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 2, 'date': '2015-10-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-lvxz6LFjbetFdj_RrkOuw', 'review_id': 'hXL48TmIOR57Jd7zMfdSOg', 'text': "If you're crazy for wings like I am then this place is the right place for you!! They have really good variety of flavors, their fries are delicious & so is their ranch and their other sauces.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2015-11-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XYKkZhmhagRdH1qS0cL4Og', 'review_id': 'b7FTSWU8KLb97whqDKhaww', 'text': 'If your server does not give you the happy hour menu and a drink ticket for the beer you ordered and you are at  this location for football before halftime; you must ask her for the happy hour menu and for your beer tickets for the half time drawing that they have.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2015-11-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IDBrS_tGJtJYFxPBYfTb1g', 'review_id': 'f0fi0ceXVs6K0qRFoA8kAg', 'text': "Best Buffalo Wild Wings in Las Vegas. They do service right with speed and quality unlike the other Buffalo Wild Wings in town. Staff are super friendly during all my visits. Don't visit those other mediocre locations when you can be at the best one having a good time.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 5, 'date': '2015-11-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Lzq0NzyzUfqdtkLoAE7_XA', 'review_id': 'EiTyNpUXUeEeuzOyLLnBFw', 'text': 'Decent wings, decent beer, decent apps.  \n\nPlace is loud as hell and the service can be spotty. Pretty typical for a wings place regardless of which one you go to. \n\nThe venue is geared towards sports on all the televisions and they are loud.  Too loud in my opinion but I am in the minority it would seem.', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2015-11-15', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'O9BvEINWm6Sbw8twDaZo8Q', 'review_id': 'ljqaLQspgTXcwQKVVSvC8g', 'text': 'I loved this place, good service and everything. I came here with my family and they changed the menu. They took out almost everything I liked! The great sliders and the chicken sandwich. Those were one of the only reasons I came here. Now it is worthless...', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 2, 'date': '2015-11-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'k_8grDo4ENy4CEBYKqGTXA', 'review_id': '7PMwq258I-3svda68311yQ', 'text': "waitress brought water then never came back for our order. we asked another waiter then waited more. he was rude asking me to speak up louder. shameful carrot sticks.lackluster service. subpar chicken. won't be coming back to this location", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 1, 'date': '2015-12-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'oLGgWdqtrmYk1NUz8iGsKg', 'review_id': 'sS10MmmeCtbgecxMb44Ymw', 'text': 'Came in for some good ol\' all American wings & French fries just to have the servers fight in front of us about them neither wanting to take our order,followed by server "brian" spilling a whole cup of water on myself.Service was incredibly slow and rude..', 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 1, 'date': '2015-12-18', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 2, 'cool': 2}, 'user_id': 'f1PGbLk574nkfzFsdsG91A', 'review_id': '4QTSTCLkwHyLOcgKtG7xnw', 'text': "Same ol Buffalo Wild Wings as anywhere else, so nothing too amazing.\n\nThe place is clean, floors are clean and staff are friendly. Food came out quickly and our server was very attentive. This place reminds me of kind of like an upscale bar food place as they sell pretzels, nachos, and lots of finger foods. \n\nThere are TV's all over the place, 2 claw machines and another game machine. All in all, I'm sure I'll be back again soon.", 'business_id': '-K22CWorrReIV_kgLa6dmQ', 'stars': 3, 'date': '2015-12-24', 'type': 'review'}
