{'votes': {'funny': 3, 'useful': 0, 'cool': 1}, 'user_id': 'HCe0iIIHyEPNNcw67JC2Yg', 'review_id': 'tw2DX6RQWgToMJYiqn_QTQ', 'text': 'Grand Opening to the public Today!!! Monday April 21st, 2014. \n\nThis is a great family restaurant located in Summerlin. Food quality and service is top notch. They offer a complete Breakfast AND Lunch menu that should be able to satisfy any taste. This is the fifth Egg Works here in Las Vegas operated by the same owners as The Egg & I.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-04-21', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 0}, 'user_id': 'its2D1yA7x7IoXKFhc89nA', 'review_id': 'NzEkIO-5l1V0o8lK4xMEMw', 'text': 'What a great addition to Summerlin!  Egg Works is a Las Vegas staple for breakfast / lunch.  As a loyal customer I was invited by the staff from the Flamingo location for "Training Days". I am a loyal customer who eats there a few times a week. Their banana nut muffins and hot sauces are to die for.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-04-21', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': 'aYzA3OgsAN3f3WJPucYCAQ', 'review_id': 'KNXG43YQRwYCEoTzCdQNQA', 'text': 'Very bright and cheerful decor. Staff was very friendly and attentive. Pricing was far and the noise level was average.  There are TVs on every wall. The food was very tasty and we definitely will be back.  They have a big meeting room for parties or meetings.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2014-04-23', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 9, 'cool': 7}, 'user_id': 'xQpO4Jfi-Np3HLmJrQAe0Q', 'review_id': 'vPHJCDKtr6woStIppga9zA', 'text': 'The 5th Egg Works location has opened up in Summerlin in the Trails, off of Village Center Drive and Town Center.  The location of the former Maru Korean BBQ restaurant, the site has been transformed into one with ample seating.  I arrived this Saturday morning around 10:30am expecting to wait since the parking lot was packed.  However, my friend was already seated, which was a good thing since we were both starving.  Our waitress, Nohemi, was very friendly and attentive.  As with the other Egg Works restaurants, their menu comes in newspaper format and you\'ll find the same crepes, omelets, pancakes, waffles, and scrambles.  I was craving pancakes, but also just wanted eggs and bacon, but that simple combo is not available, for some odd reason.  I ended up ordering the Blueberry and Cashew pancake short stack, which is three smaller pancakes (you can also get one huge pancake instead of the short stack), a side of turkey bacon (3 strips), and a side of 2 egg whites.  My friend got the huevos rancheros, which came with breakfast potatoes.  Our food came out in a timely manner considering the place was packed and it\'s brand new.  For a "short stack," the pancakes were bigger than I expected them to be so I ended up eating only half of them.  Blueberry and cashews together sounded interesting, but I didn\'t love it; I would probably order a different kind the next time around.  I don\'t remember what the side order of eggs cost, but the turkey bacon was $3.50.  My meal came to about $14, which is more than I like to spend for what I had, so I don\'t think I\'ll be coming here too often.  However, this place is definitely going to give the neighboring restaurants that have been serving the breakfast crowd here a run for their money.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 3, 'date': '2014-04-26', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 2, 'cool': 2}, 'user_id': 'doNamOIq4WZnaTtlfh9HLg', 'review_id': 'VC16jjaVdtlGuplSSFkkdw', 'text': 'This will now probably be my go to breakfast place in the area. I have been to other locations so I knew I would like the food. My top 5 items in order are \n\n1. Country Fried Steak\n2. Pork Chop\n3. Country Fried Steak\n4. breakfast burrito\n5. Country fried steak\n\nThey also have pretty decent waffles/pancakes if that is your thing.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-04-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'y8OFFi5x8JvqpHBmoupMwQ', 'review_id': 'z65v7DAi8kgO371xARHrwA', 'text': "FYI, my husband and I had breakfast there this morning.  In case you're interested, we want you to know why we will NOT be returning.  We found the tables & chairs very uncomfortable.  The tables are so small that when the meal comes, you have to do a lot of juggling around to make room for the rest of the stuff that you already have on the tables.  A few more inches would have been a much better design plus the chairs are very uncomfortable.  The place has no soundproofing and is very, very loud.  It reminded us of a cafeteria much like a school.  We kept thinking we were in a factory--not a pleasant atmosphere at all.  We feel it is disgusting that whoever designed this place all they had in mind was how many people we can fit no matter how uncomfortable they may be.  \n\nAtmosphere and surroundings are just as important to us as the food when we dine at a restaurant.  Even though the food was good and the staff was very attentive, which did please us, I noticed on our receipt, it did not have a website to let you know where you could comment on your visit.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 2, 'date': '2014-04-27', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': 'Lo4auWwU5mV87pDkuozu4A', 'review_id': 'wBvvwNsroJnktK3oq27JGQ', 'text': "Another awesome Egg Works location - they finally opened one in Summerlin!\n\nIf you are a fan of Egg Works (and who isn't?) this may be their nicest restaurant.  They have the same great food and service as their other sites.  The restaurant is HUGE and they have plenty of room between tables - this made it ideal to park my large stroller and enjoy a family meal.\n\nThis Egg Works location has a liquor license - and they have a few adult coffees that look tasty and are very reasonably priced.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-04-29', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 5, 'cool': 2}, 'user_id': '7yomvbvjbkWEHsKdf_GjtA', 'review_id': 'j5YNEQLHwLuaO3ZUGQwZrg', 'text': 'I was really excited when i learned that an egg works was opening up around the corner from my house.Unfortunately upon going there it\'s safe to say that i\'m highly disappointed. I understand that the restaurant has just recently opened but i cant say that i\'m impressed. The service was slow! I know that during the time of our trip their main customers were the elderly but COME ON! After being seated it took about 20 min before someone came around to take our order. We had to resort to flipping the unhappy egg. \n\nFor those of you who don\'t know, Egg works and Egg and I both use the "run forest run" system. They have happy eggs for those who don\'t need assistance that flip over and reveal an unhappy egg which means you need assistance. \n\nThe food wasn\'t that great either. I had the waffle which was pretty routine, nothing really great or bad to say about it. My girlfriend got the one of the crepes and when i tried it it wasn\'t that bad. I did drown it in hot sauce but still... it was OK. The worst part of our meal was one of the tostadas. The lettuce used in the tostada was still wet and that caused, what should be a crispy and delicious shell, to become soggy and mushy. The taco meat was over sauced and  that caused the lettuce to wilt as well. Overall the dish was really bad. They were able to take it off of our bill since we only took a few bites from it.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 2, 'date': '2014-04-30', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 5, 'cool': 2}, 'user_id': 'U3ZrcMb-_ygQFFXjYRYDfQ', 'review_id': 'QC75tkX3E6eftqqTI3I9AA', 'text': 'Disappointing experience. Worst service of all the Egg Works in the valley.\n\nServer was unfamiliar with the menu, and my order was incorrect; manager did not seem to care.  She just told me that our server was new. No kidding.... No concessions were offered, other than a muffin that I did not want.  THREE people tried to clear my plate WHILE I WAS STILL EATING. Just shocked that a new restaurant in an established chain could have such poor service.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 1, 'date': '2014-05-03', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': '3ObuKAWPPr_LAoPOvIXBvQ', 'review_id': 'ukfDyDbQ4eLNZdH7Cjz8bA', 'text': 'Excellent food. Consistent with other Egg Works locations. Great service. Our server Amanda was awesome.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-05-03', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': 'fMrn3yANh32vbVDCSpVXMA', 'review_id': 'FSPaU04ua1HxC4WE0geMew', 'text': 'So glad to see the new location!  Love the food, Amanda is awesome and are her frying pan earings!  Beautiful inside and the service is excellent!!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-05-03', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': '8ay3X_nuH4kpuyLlK0JdIw', 'review_id': 'Fgk_yVn64BbvDn1n5CQn4g', 'text': 'Love this place.  Food is great.   Amanda was awesome!  The omlettes are better here than other z omlette themed restaurants.   The banana nut muffin is a must have (ignore the calorie count, you deserve it)', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-05-03', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': 'lLmaNwbw9AzhkT6DfZ5OtA', 'review_id': 'pgyIzW5qsbYOhyUynWrgJw', 'text': "I have one suggestion, we sat outside and it was breezy or should I say windy and the paper from the straws and jelly packs, creamer all the condiments were blowing around and if there were little trash can, little bucket, maybe a flowerpot we could put the trash in and help you keep it neat outside I think that would be very helpful. Again I'll be back the food was great and the service was outstanding.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-05-03', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': 'zR_zoqh1EX9fw1SroYQw7A', 'review_id': '8UkNc4v5CLzNpWHfSPt1Bg', 'text': 'We had the best service here. And the food is no joke either. However, if you come here you MUST ask for the BEST server ever!!  Amanda!  The attention to detail, and making sure that ever need was met was beyond expectation. We have now made this out regular weekend destination, if not twice a weekend.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-05-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5JHHO1U2zYi3CXr9Qdje2A', 'review_id': 'UwqVq6Q3RdFKjStACfw-9w', 'text': "Food was exceptional but the service was even better, everyone was so friendly and helpful. Our waitress was the best I've had in a long time, Amanda was friendly, service oriented and made us feel at home.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2014-05-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tBbPfGYXiW37Ki06BiaTWQ', 'review_id': 'EKcs-gokVpHa1uAZgdob7A', 'text': 'Great food and Super service..With a Super server.. Ask for Ashley Silva! She made the experience awesome...! Thanks Ashley', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-05-04', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 0}, 'user_id': 'WMECHD2cxF-uAjRiW9Hgpg', 'review_id': 'xqkVKcQRa1t1z_CY4EZxZw', 'text': "Treated my mom to a wonderful Mother's Day brunch here!  The food and service was great!  I ordered the works omelette.  Delicious!  It's a little crowded, but hey, when you've got nice food and service then it's gonna happen!  5-stars!", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-05-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PWR0NWRo2K_Ml4IiFT5XRQ', 'review_id': '0agV2yc935_xMY8HhMkg1g', 'text': "Local to the immediate area, great breakfast lunch spot. Fast service, reasonable prices, large selection-though mostly breakfast items. Service was friendly. When it's crowded, it's quite loud and the seating isn't really comfortable but does the job. A few booths would be nice! Overall, good enough for me to return & would recommend to other locals.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2014-05-21', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 2, 'cool': 1}, 'user_id': 'bJsoQkED9k9kxXm7cccqBg', 'review_id': '4vIWbXs-aPBQSs1nv4FauA', 'text': "The corned beef hash wasn't from a can which is always nice.  They also used red potatoes instead of russett which is unusal and awesome for corned beef hash.  The fruit was high quality. And the pancakes were super tastey. I wasn't a huge fan of the seasoning on the home style taters but they were cooked properly so us just a preferance. \n\nI was happy with th service. Nothing above and beyond, but nothing negative to say either. \n\nThe establishment was clean and their batfooms were above average.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2014-05-30', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': 'Uuc2a5MaliVALJkhZtSGHw', 'review_id': 'rrq97zNkdLKv_nHgr7uRRA', 'text': 'Wonderful food and great service! I will definitely be back with my family! The wait is reasonable and the qualify of food is fantastic!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-06-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': 'ufPgCuKBhZtSdKsLCsLJug', 'review_id': 'vbsmsWuySk2t4dp5KLuq9A', 'text': 'From the yelling in the kitchen to the mediocre food --- The distinguishing characteristic to me was how this place could have the worst parts of a greasy spoon breakfast joint without any of the homey food quality.  It is a crowded and trendy version of Perkins or Dennys.  Well below even IHOP.  I see its a chain, some might be better, but I kinda doubt it.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 2, 'date': '2014-06-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'cbTYP9PzAtUwu1DRdvBnWg', 'review_id': 'JJRxsXpn6mHcNiqK30Tpfw', 'text': 'Went for Fathers Day brunch.   Despite a crowded restaurant, we had excellent service.  Joshua was our server and he was great!   Food was good and came out quickly.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-06-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5YzzYS23DamDac81x6bmcA', 'review_id': 'K3M1QxEhzidkhKRWGRtb3A', 'text': 'This is the second time we have been to this new location for breakfast. Both times it has been excellent!!! We love the veggie Benedict. :-) Amanda was our server both times and she is super sweet and friendly.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-06-25', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': 'x6sCDDoV8T2OY9jDmLm5BA', 'review_id': '6deVlTCRrXBjK-dXBUuKeQ', 'text': 'Egg Works is the Las Vegas Local spot for breakfast. We recently started going to the new location on Village Center Drive and have been very happy. The food is flavorful, and prepared the way you ask for it. \nOne server in particular stands out, her name is Amanda. She is always pleasant, and seems to be enjoying her job. She is attentive and made a great breakfast even better.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-06-25', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': 'K5wYcOeR6JWo_y9Gx36CTQ', 'review_id': '6GKVjhmvq8JTd7lUXNvwcg', 'text': "We come in from Los Angeles pretty regularly to visit my parents.  My dad said there is a great new place in the neighborhood. He brought us to EggWorks.  Let me tell you... It was eggcellent!! AMANDA WAS AMAZING (ask for her, she is the only Amanda there.) \n\nI had the Huevos Rancheros with a side of avocado.  It was perfectly cooked and the tomatillo salsa mixed with the house salsa is incredible.  Neither are overly hot, yet have a great flavor.  My girlfriend had the Key Largo crepe.  Besides being massive it was tasty. I had a bite and couldn't agree more.  Finally, my father is a very particular orderer. They executed the order perfectly, he was very happy with his meal.  We all tried the banana nut muffins and they are the epitome if happiness.  Everyone should have them at least once.  \n\nFinally, the service is really out of this world. Amanda joked around with us and made the eating experience a real treat.  All food was brought out promptly and hot.  I highly recommend this restaurant for anyone in the area.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-06-27', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': 's6XdTPot-8GYWucQZluONg', 'review_id': 'osp9DATyZ51joG-L4i1RQQ', 'text': 'OHHH MYYY SWEET BABY JESUS!! First time here was amazing! Our waitress Amanda was the bomb! Made us feel like family and helped with any questions we had! The food.... Pretty sure this is what they serve in heaven! Jesus him self eats the traditional Benny every morning! The muffins... I will be coming back just for the muffins! Will be back... Tomorrow!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-06-28', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 0, 'cool': 0}, 'user_id': '3zNj0Sv5Cx-pnhX3LdjxAw', 'review_id': 'rbCU1_Ei9iNxmqDaPupT1Q', 'text': u"My fianc\xe9 and I just moved to Vegas and this is our new spot!! We've been here 2 months and have been here at least 6 times! Granted, breakfast food is our favorite and we are those people that make breakfast for dinner, but this is the perfect hangover spot when you don't feel like cooking yourself ;) The food's amazing (and better than anything I can cook anyway) but even better is the service-ask for Amanda! Just make sure you go before 2pm cause they close at 3.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-06-28', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'eD5g6Lk9MctOqfqC0WQR1Q', 'review_id': 'bHqfTK3YSsTKT0QCsgbaZw', 'text': 'Amanda made us feel really welcome and our meal was just as enjoyable too. We really loved the banana nut muffins as sides to your wonderful breakfast meals especially the island favorite.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-06-30', 'type': 'review'}
{'votes': {'funny': 24, 'useful': 33, 'cool': 28}, 'user_id': '2HmHgW3hRYvXYFmQyQtLuw', 'review_id': '2roIrPE9CVBnlc45bA1IEQ', 'text': 'I was excited to try this place since the nearby IHOP is terrible and I\'m not a fan of the name changing, yet same menu at GriddleCakes (supposed to be ran together I didn\'t goof!). Too bad I wasn\'t so thrilled about this place either, but it for sure is better than the 2 breakfast spots I previously mentioned. I came in on a Sunday so naturally it was packed inside. I was with a yelper friend and we were still seated right away even though they were busy. There is a fair amount of tables and tables with half booths inside, but the table we were sat at shouldn\'t be there. I was practically sitting in the kitchen! Menus were brought to us right away and our server was nice. I just didn\'t like waiting f-o-r-e-v-e-r to get some cream for my coffee. I asked our server for it and she said she\'d be right back. I watched her (since the machine they use to enter orders and the kitchen was right near me) enter in orders and tend other tables including the one customer crazy enough to eat out on the patio on such a hot day, but still I had no cream for my coffee. They have this thing on the table where if you are in need of something you can flip this "egg" to black when you are doing fine and flip it to yellow if you need something. The yelper I was with flipped the egg to yellow and someone quickly came over and got me some cream. I had already enjoyed 2 cups of coffee before I finally scored some. I thought the cup of coffee was steep being priced at $2.75, but damn that was good coffee! The coffee was the best thing I had during my meal. I like that they bring a carafe to your table so you can keep refilling your cup at your own leisure. Most of my rating goes to the coffee! \n\nPriced at $10.75 I ordered a "Bacon & Sliced Avocado Omelette" that came with a side of "Works Potatoes" and a "Banana Nut Muffin" that I have heard many good things about. The muffin came out first and it was hot, fresh and moist, but where was the banana flavor? I tasted no banana. It just tasted like a warm muffin with a hint of sweetness. Nothing special. The works potatoes were good and seasoned nicely, but they tasted exactly like fries. I prefer more of a hash brown type of potato with my breakfast personally not fries. The omelette was just okay. I can\'t believe I\'m about to say this, but there was actually too much bacon in it! Yes, I just said that! It was just too much bacon and not enough egg. The amount of cheese and avocado (it had huge chunks of ripe and delicious avocado!) was very fair. The omelette just wasn\'t fluffy enough though and when you have grown up eating them at the Omelette House on W Charleston like I have, you know what a perfect, good omelette is supposed to taste like and I just didn\'t find it here. The coffee being so good, I just might someday come back and give their french toast a try, but with my single breakfast totaling $13.50 before tax and tip and not being fully satisfied with it, I can\'t see coming back often or anytime soon.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 3, 'date': '2014-07-02', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': 'PTY5DM38QqeqbKSyfb9lww', 'review_id': 'y7RHqp2b6dnHcmGqueH_HA', 'text': "First time here I ordered take out for lunch. This is just a few minutes from my office.\nI ordered the chicken salad with apple and walnuts. It came with a choice of sides, \nI selected the fries. While a little pricey for lunch, well worth it.\nThe chicken salad was delicious. I liked the apples and walnuts added into it.\nThe French fries were crisp and seasoned perfectly with salt and pepper. Had a little kick to them. Aside from Nathan's fries this would be my second best. It also came with a pickle spear. \nWent the other day for lunch to dine in with a coworker. We were seated right away.\nOur server Rosemary was right there, which was great as we only had an hour.\nShe had our order out in minutes, and gave me extra pickle spears with my chicken salad sandwich this time, as I have to watch the carbs I eat. My friend had the \nsame sandwich and loved it.\nWe were in and out in forty minutes. Can't beat that kind of service. \nWe will be back to enjoy the food and the service.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-07-04', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'Bf_3lZAWvB3rclxGRuXpbA', 'review_id': 'XBNyewDEV3R_BruUNqZY1Q', 'text': "The breakfast was very good. The eggs were cooked right which is sometimes difficult with 'over medium' eggs. The service was great, the waitress was very attentive. The food came in a timely manner and the order was correct, which seems to be a problem for me normally at breakfast places.  I would definitely eat here again.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2014-07-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Z0e50zAZ7VhLyop4G8MLCQ', 'review_id': 'DJoEokCwrMtBbNyHuX3TTw', 'text': 'This new location took over another restaurant so it slide right into this cute little spot. Patio is so nice and perfect. Wait staff is always above par. Such great food at a reasonable price. Island breakfast with out having to go downtown. A locals must!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-07-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '-3kLmioDGUc1eOsWEufKOQ', 'review_id': 'LlecYjlIp2LIN3WPHUNBGQ', 'text': "Best breakfast in town. Specials are available and patio is dog friendly. I usually get a breakfast burrito with egg whites, you can make anything egg whites, and tell them no oil if you'd like. Buckwheat pancakes are also something to write home about for sure. Give it a try you won't be sorry!", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-07-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9ukU-Q3-rnRtLR7DpkmFUA', 'review_id': '3u1u7zc7EaDipsdeA_i9Og', 'text': "Love this place!  This is a new location so we weren't sure how good the service and food would be. Turned out to be just as good as the others. No more driving to the Flamongo location for us. Food was great and the service is prompt and friendly!  Food is delicious!  Love the breakfast burritos!!  Recommend the Sunrise Mountain too!", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-07-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'igbBV7pMw57uA_OCHWqZag', 'review_id': 'Rn1tCDirQ624Vwhbhpbqbg', 'text': 'Great Breakfast . They make an excellent waffle , I dare say so far one of the best I have had in Vegas. Reasonably priced and very accomodating..', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-07-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'c0C3Qhb-qCTpkcVX-IyeAQ', 'review_id': 'sS61jxv4JcTuen05wwlm5Q', 'text': "Eating lunch at EggWorks is always a good food experience, if you're looking for outstanding food at a good price, then EggWorks is always dependable. Today, a co-worker and I ate there and Amanda really made the experience memorable. She was attentive, friendly and provided outstanding customer service.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-07-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'K9z5hHUxCboLT6e15V6cfg', 'review_id': 'v7jQP4aD3ubj7m8FwA3anQ', 'text': 'Excellent food and the service received from Amanda was awesome! Will definitely be back again.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-07-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'RN6Vs8Rki8Y--Xv5aA_cIg', 'review_id': 'IHJ6QJlSkusXoUSE7DHvOg', 'text': 'Four stars for the food and swiftness of delivery.  Amanda made it a five-star meal!  Threatening to "go Gordon Ramsey" (jokingly) on the kitchen staff was a classic.  The near loss of a star was mostly due to the unimaginative potatoes.  It seems all they do is overcook them a little then throw a little too much salt on them.  Onions?  Peppers?  Spices?  Give me SOMETHING to work with here chef.  The corned beef hash, however, was the bomb!  Toast or banana nut muffin?  Really?  You have to ask?  BANANA NUT MUFFIN, of course!   Yum!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-07-25', 'type': 'review'}
{'votes': {'funny': 6, 'useful': 9, 'cool': 10}, 'user_id': 'Iu3Jo9ROp2IWC9FwtWOaUQ', 'review_id': 'XL7Z6ZJ8IRtkdagVOGnCvQ', 'text': 'I tried this location for the first time earlier this week and I was very pleased.  The restaurant is a large space and I found myself sitting at the counter in the back of the rooms.\n\nI like counter seating for breakfast because you have the chance to watch the staff do their things and you have a glimpse into the kitchen.\n\nAfter looking over the extensive menu, I opted for the Sundance Special, a vegetarian omelette made with mushrooms, spinach, artichoke, with Swiss cheese folded in all in a 4 egg omelette.  It was topped by diced fresh tomatoes and feta cheese.  I had my choice of potato but I opted for some sliced tomatoes instead.  Instead of toast, I got the banana nut muffin.\n\nBreakfast was very good and it was also a lot to eat.  Service was outstanding.  There was only one other person at the counter.  Your coffee is poured for you the first time and they leave a thermos of coffee for you.  It was great because I could drink as quickly as I wanted and refill without waiting.  The staff was very pleasant and I left with a good impression of this new place.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 3, 'date': '2014-07-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Pn3nh3T3qAvPe25cf2EG9w', 'review_id': 'Gc6Jmr5YihmD4vJThdSqmw', 'text': 'best breakfast is Summerlin! Employees are upbeat and super friendly, food is great and prices perfectly reasonable. We lovvvvve the fried potatoes!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-07-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'h-7ZRVlwoHpVQhldyEUMvw', 'review_id': 'BLKJoIjWXz3x3LSHOFfdBg', 'text': 'Lisa was a wonderful server! Attentive,  full of energy, efficient and made us feel at home!! Definitely a raise for her!!;)', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-07-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4Rv7m16FeA0U7cqaX8fPzg', 'review_id': 'glhgNyT4dCRZZvwYbabBmA', 'text': "Was visiting my aunt, uncle and cousin for a weekend and we came here for a late lunch.  We don't have one of these in San Diego, CA but it seems similar to The Broken Yolk: open for breakfast and lunch, lots of egg options, good quality food.  My family comes here often because it is in their neighborhood and from what they said no other restaurant has really lasted because it isn't high traffic outside work hours.\n\nI got the greek scramble with no chicken; it was egg-cellent!! Good combination of artichoke hearts, mushrooms, spinach and feta.  The potatoes were okay, not a fan of the seasoning but still good. Fun place to come; everyone was really friendly. We came later in the day so it wasn't very busy which was nice.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-07-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'ocDBWFloOx93IAYEGlri9Q', 'review_id': 'vGG3igppeYukU-detmHu2w', 'text': 'This is great place for kids. ! The banana muffin is wonderful . Amanda is very nice an provided great service. The breakfast burrito is awesome! They fresh fruit is excellent ! \n\nHave Amanda as your wait staff wonderful lady!!!!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-07-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bMpF5OPrf916Y0Gu13VIMg', 'review_id': 'c3yYJAwMb-9xK_q8jPOsuw', 'text': 'Summerlin location. 1st time here.  Super busy Sunday morning crowd but seated quickly and very attentive service! Bandito scramble is the best!! Spicy and very fresh with lotsa good jalapenos.  A+++', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-08-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cNJnDmcwnEGrye91_CRuPw', 'review_id': 'rBbzVDkB5SZDe-hWf5HQyw', 'text': "California crepe is a filing breakfast, that comes with delicious potatoes and your choice of side. It does have quite a lot of cheese which I'm not a fan of, next time I'm going to minus the cheese. Service is on point, like the egg flipping sign concept.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-08-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xFAF5g8yCppZun8MR66bUw', 'review_id': '22oDa7lDS0TJwjHP_N6_Vg', 'text': "Visiting Vegas and this place was amazing! Excellent menu choices and service was quick and friendly. Breakfasts are large enough to share! Amanda was our server and was fantastic too. Can't wait to go back.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-08-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FQouioOvcVwtDB9A7MKZow', 'review_id': 'KTM9A_cFmYsHtxRBaxO7Ww', 'text': 'Food was delicious! Our server, Amanda, was awesome. She gave great suggestions and was attentive. She is also super sweet. Definitely come here for good food and service!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-08-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'SMHzgYpn2s_EA5rdldd3dw', 'review_id': 'y1FW-46fPAN9vQOL1JP93g', 'text': "For some reason, our GPS unit and 2 cell phones couldn't find this place?  If you are from out of town like we were, good luck.  Ended up giving the restaurant a call in order to find it.  It's located inside a business center, blending in with the other buildings.  After developing an appetite after driving in circles, we finally found the place.\n\nArrived in the later part of the day.  So we were lucky to be seated right away and were the last to leave.  I have to agree that the banana muffins are so good.  Pounded that muffin in seconds.  All the food was good, somewhat on the pricey side for breakfast food.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2014-08-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZdFOvAdct1nOD7W9Sn98xA', 'review_id': 'qci1hwv76gizb4Y9EmJJEQ', 'text': 'The food is always fantastic.  Today I had the banana bread french toast, so good. But my all time favorite is the prime rib benny.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-08-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'nmqimnNPNKtdzAmXfpU2TQ', 'review_id': 'jmT8o72oHS-XKjaYFfFftg', 'text': 'This restaurant does have delicious food, but what\'s up with people bringing their dogs to eat with them on the patio ?  I personally find this offensive.  After we began to eat, dogs started to come in with their owners and we found that shortly we were surrounded by  two large dogs behind us and a small dog across from us. The flies were horrible ( flies do Love dogs) We quickly finished our meal then went to complain to the manager . All she said was  " well everyone seems to LIKE bringing their dogs "  Really ? What kind of answer is that ?  We went on to give reasons why this is NOT acceptable .....dogs bring flies, someone might be allergic to dogs, a small child might get bit, two dogs might fight , etc.  AND, why do residents of our community THINK it\'s OK ?  Don\'t they ever consider anyone else but themselves.? It\'s sad really to think our society is becoming so self centered !', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 1, 'date': '2014-08-31', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'u6MRS-PUM7CKQSWFKkOUZw', 'review_id': 'H-RVjL1vA8w_ZHhXmLNXqw', 'text': 'Love love love this Egg Works.  So nice that they have a special area where people with Dogs can sit. (outside)  Those who don\'t like dogs can sit inside in the air conditioning. My dog however is a service dog and can go either place, but I\'m happy for the patio as some people, even though she is a service animal get upset when she is "anywhere" they are. FYI, Service Animals do not have to wear vests or any kind of ID, so you never know when a dog near you is actually a service animal, although the "handlers/owners" do have to carry a handlers ID. Some management ask to see it, some don\'t, but I always have mine in clear view.  This being said:\n\nEgg Works is Amazing.  Everything I have ever ordered there has been perfect and very delicious. The prices are comparable to other breakfast places in the area.  I can\'t wait to go back.\n\nThe location is somewhat hard to find, but there is an IHop and a Starbucks within eyesight of the patio.  So I guess it gets lots of traffic?   This location used  to be an awesome Korean Restaurant.  Don\'t know what happened to it, but we ate there all the time. \n\nI highly recommend this Egg Works, and if you don\'t like dogs...sit inside. :-)', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-08-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'Lx6PvAZYTePi09RWQJDinA', 'review_id': '3-sYNPCpHIv0LDnX04dEng', 'text': 'Breakfast is my favorite meal. Egg Works is my place of choice to enjoy this. Love the service and great energy the staff has at this location. Our favorite server Amanda makes for a more enjoyable experience at a already great restaurant.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2014-09-06', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'hUQsgFAiZMeXseHIxOJOHQ', 'review_id': 'Tllvzfgo7Yh4Zmu4yyv3cw', 'text': "Best breakfast place and conveniently located near home!\n\nI love breakfast food, hate mornings, so I always end up enjoying it at night. Today was different since I actually woke up early enough on my day off to enjoy some eggs and coffee!!! My beau and I ordered: \n\n- spinach Benny \n- corned beef hash\n- coffee \n- banana nut muffin\n\nThe spinach Benny is two poached eggs on top of Canadian bacon, spinach, and old English muffins covered in hollandaise sauce with a side of country potatoes. This was super tasty and the hollandaise was perfect and not too salty. The country potatoes were also deliciously golden crispy and perfectly seasoned. Mmm...\nCorned beef hash was served with a side of potatoes as well, but my beau ordered a side of rice to mix the hash with. It makes a great combo. The hash was good, I just wish there was more meat!!! \nThe banana nut muffins are always popular here, so it's no exception for me!! They're always nicely warm and sweet and perfect when you spread some butter on it. Gives it a nice balance of sweet and salty!! Pairs well with their coffee, and it's actually really good coffee. \n\nThis will always be my favorite breakfast spot and it's reasonably priced too. Portions are generous (although I always finish my plate) and the staff is always friendly and attentive! I'll definitely wake up early for this place...  Well, let's see how comfy my bed is that day... :)", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-09-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'wgBGcjTkiSe5M5EDIT0nBg', 'review_id': '2Ha3VL7NFcTGZ44NcmpxBQ', 'text': "This is our 2nd time eating here and I haven't been disappointed yet.. The food the atmosphere and the staff are so nice!! If it wasn't so far we would definitely brunch here more often..", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-09-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'k5Wno6mtT01pLQbuaonSJA', 'review_id': 'VmyfZNPJX4V4ZCAJOc7Kfw', 'text': "Came here for breakfast recently, I was really hoping for a delicious breakfast but I was very disappointed. \nWe ordered our food griddles and waffles and both came out within minutes which was surprisingly fast. The potatoes on the bottom of my skillet were soggy and the waffles were soggy. Everything even the muffin tasted microwaved. Lattes and cappuccinos are from a coffee machine and not made by hand. I'm disappointed and will never return", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 1, 'date': '2014-09-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'H2p03t57P7exEL8sCMnIRQ', 'review_id': 'yE9rBYyFwAWtVg7pYj5htg', 'text': "Amanda was my server and was very polite, fast, and on top of things! The seasoned potatoes with anything is where it's at.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-09-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'u70RWlua6k90LqDeDfSccg', 'review_id': 'aHZztrYMsKlcc01_XRAadA', 'text': 'Amanda, our waitress was amazing. She was very friendly and helpful!! Loved the banana bread French toast so yummy!!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-10-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'L-M3Fphz_f1L48uqwNyoJQ', 'review_id': 'ItcGpueJqjHCWx9BQgV-ZA', 'text': 'Great service awesome food and our hostess Amanda was amazing definitely our new breakfast spot', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2014-10-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PHOB4DNdhdjsQdx97aH1LQ', 'review_id': 'iezlXKOhwPJ7-SxISxuZuQ', 'text': "We were in the neighborhood and decided to stop and grab some grub.  It was our first time there and we loved the atmosphere and on the tables there are happy cards and unhappy cards. Every restaurant should have this!  If it's your fist time there, you get a free muffin and it was delicious.  The food was good but they need to offer a military discount. We only had to flip the card once because they kept forgetting to bring our refills after we asked, but other than that it was a home-like feel and good cooking. Also the location in Summerlin is a very good location and a very beautiful area.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2014-10-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '9ukU-Q3-rnRtLR7DpkmFUA', 'review_id': 'mpjOj2ygqfG5Mk81om0IhQ', 'text': 'As always the food was great and the service superb.  The banana muffins never disappoint.  Stepped outside my box and went for "The Works" skillet and was very pleased!!  Highly recommend this place if you\'re in the area.  Heck....Even if you\'re not it\'s worth the drive.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-10-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_6TN-QuAnz9jokTy2s9L5Q', 'review_id': 'bvgxhV9SyzUd7HQtr8d7oA', 'text': 'Egg Works in Summerlin is a wonderful find.  The staff is always friendly, we never have to wait long, and the food is great.  My family loves the Works potatoes, and I love that I can substitute fruit when I am being "good."  And the fruit is fabulous - a large slice of each: three kinds of melon, plus pineapple, orange, and grapefruit.  I love breakfast here!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-10-19', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 5, 'cool': 4}, 'user_id': '5lq4LkrviYgQ4LJNsBYHcA', 'review_id': 'atKM6m7GQWO27CFLJwy6IQ', 'text': 'Items Selected:\n2 Buttermilk Biscuits\nHam, Egg, and Cheese Stuffed French Toast with Strawberry Jam and hash browns\nCandied Walnut Buttermilk Pancakes (seasonal special)\n\nWith household chores needing attention it was largely a matter of location combined with a buy-one-get-one coupon that led me to Summerlin\'s relatively new Eggworks on Saturday, and having visited sister restaurant "Egg & I" nearly a year ago I\'m happy to say that its fifth spin-off replicates the formula well, a very competent breakfast served amidst friendly confines fit for any age.  Obviously not the sort of place looking to reinvent the wheel, but rather a locals-only kind of spot where nearly all the patrons present during my early morning meal were \'regulars,\' it was with nothing but smiles that I was greeted at the hostess podium at 6:45 and offered a seat at the kitchen-side bar or a table I opted for the later, a small two-top amidst spacious confines already loaded with condiments, menus, and utensils as College Gameday played on televisions all around.  Never shy to over-order, even as my waitress informed me that two entrees was "a lot," it was mere moments after seating that I made my selections and starting with two doughy, $3.49 biscuits finding slight salvation in butter plus honey I quickly realized I should have again ordered the signature banana bread, though things would soon improve, my BOGO coupon yielding a duo of plates nearly overwhelming my small table.  Beginning first with another item dubbed \'signature,\' the stuffed French Toast is offered with an option for bacon, sausage, or ham and doing my best to recreate the Monte Cristo the results were admirable - the fluffy eggs loaded with cheddar and chopped pork beneath slices of vanilla scented, golden bread ready to be gilded with syrup or jam.  Moving next to an item from the seasonal menu, a $9.75 three-stack of pancakes was next in line and topping the fluffy discs with pure-maple syrup brought from home plus a few pats of butter I\'ll be honest when I say these could just be the best buttermilk flapjacks in town, each bite surprisingly light with ample buttermilk tones punctuated by pockets of melting brown sugar and rich caramel with toasty walnuts through and through.\n\nFar larger and brighter than the original Egg & I location with similar smiling service and a 6am opening every day of the week Egg Works Summerlin is a great addition to the neighborhood and with coupons frequently offered in the local mailers serves as a great place for families to enjoy a good breakfast without breaking the bank or succumbing to big chains like Denny\'s or IHOP.  Certainly not a \'destination,\' but a great spot for a leisurely morning while reading the paper, watching gameday, or just sitting on the dog-friendly patio I only wish they advertised specials more prominently, the only indication of those lovely pancakes found on a laminated menu left at the table.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 3, 'date': '2014-10-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZdFOvAdct1nOD7W9Sn98xA', 'review_id': 'EN2Bg2EfRCpkbVvkyk8-mg', 'text': 'Always fast fresh hot food. Eat here like once a week. Never any issues or concerns. Great staff and service very quick and effective. Would recommend to anyone looking for a grwat breakfast.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2014-10-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'BeIGAcknzQTJgGSg8Anjbw', 'review_id': '3euSLqng6mdx15yC_xVgYw', 'text': "Two words: Spinach Benny. A huge helping of eggs benedict with plenty of spinach on top. I had to take the second helping home because it was so much. Good potatoes too. Our waitress was super friendly and fast. From the looks of the menu, there's nothing bad you could possibly choose (breakfast or lunch) which is why it was full on a Sunday morning. Reasonable prices too for the amount of food you get. They have a nice patio which we didn't take advantage of since it was drizzling but I bet it would be perfect on a nice sunny Vegas day.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2014-11-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '72XkC7NdqkJqqGTpKN6fEA', 'review_id': 'p7V-tl4eg9uCfBK1e2ttZg', 'text': "Works Veggie Benny was delicious! Loved their special Works potatoes, like little potato poppers. The plate had so much, I couldn't eat it all!\n\nThe hostess and server were very kind and quick to seat as well as take our orders. \n\nThe tacky decorations and menu can go though. If it's made of cheap newspaper, you would think they would throw them away. Good for you for recylcing but its unsanitary to reuse that.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2014-11-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'MvpzXtzpkWbm_2vTpEVZTQ', 'review_id': 'JlGd8zK2sX-Y75XYNgr2mg', 'text': 'My husband and I decided to try Egg Works after some fasting blood work, and it was quite possibly one of the worst breakfasts we have ever had due to the poor food quality. I couldn\'t have been more hungry, but both of our meals were flavorless.  My omelet had a strange burnt oil flavor, though nothing seemed burned.  Apparently, the restaurant uses a liquid butter alternative (translation:  margarine and soybean oil mix) instead of real butter;  this is all I can imagine caused the strange chemical taste on an otherwise uneventful menu choice. There was no real cream for your coffee unless you asked for it (instead they serve a chemical non-dairy creamer), and we were told (when inquired about ingredients) that the potatoes "come from a bag" and the waitress couldn\'t really tell us what was in the seasoning.  I opted for a side of fruit instead.  The food tasted very processed, and gone seem to be the days when "The Egg and I" (1st restaurant) used to serve "homemade" breakfasts that you actually had to wait for--because they were cooking them--to be served. The speed with which the meals were served at Egg Works also indicated how truly processed these meals are. We ate little, and couldn\'t stomach taking the food home, though it was offered.  I noticed that tables on both sides of us were also leaving much of their meals.  When we left and saw the U.S. food delivery truck at the back of the restaurant, our suspicions on poor food quality were further confirmed. \n\nItems ordered: \nCoffee\nHash and eggs\nVegetable omelet w/fruit side\n\nWe cannot recommend Egg Works based on our experience.  At least consumers need to be aware that this is not "homemade" food, nor is it healthy.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 1, 'date': '2014-11-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yTuSAUr7KKvDgjpaJDdllg', 'review_id': 'vHhgU3ASwF7LkeJoiHxY0g', 'text': 'Amanda was amazing. I would definitely be back due to her exceptional customer service. I had the country benny... YUM!!! Quick service, convenient location, delicious offerings, and fast seating. \n\nLooking for service with a smile? Stop by and look for Amanda!!!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-11-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yK3OGJW_-pDMyu9R28U0hg', 'review_id': '6bXLBUh0_95vCDhKmUO27g', 'text': 'I hope they improve the quality of their food... the omelette was greasy and had the hard edges. Toast was burnt. I think they rely too much on their potatoes the potatoes are excellent they need to concentrate on the other important parts of the meal.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 1, 'date': '2014-11-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'AHcqfo5dPZDEw4hDXuKUgw', 'review_id': '5u3lqh0EAXjcnSziWMbIUg', 'text': 'Food was good. They do the standard breakfast menu well with some tex-mex dishes thrown in. \n\nI had the "Island Favorite" which was hawaiian inspired, but for the price point it left much to the imagination when the dish arrived. Two slices of Spam, two eggs, and a scoop of rice. Where\'s the rest?\n\nI\'d go back for the service though. My server Amanda P rocked it! Attentive, but doesn\'t hover over like some buzzard. \n\nGonna give this place another shot. Also trying anything NOT Hawaiian inspired. But I\'m requesting to be sat in Amanda\'s section.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2014-11-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'yK3OGJW_-pDMyu9R28U0hg', 'review_id': 'qBpgLW_PAuWaPbvtJpt5CA', 'text': 'Wow !!!!\nI shared my experience with management and was surprised at how fast they got back to me. They are addressing the situation and I am happy to say I am so satisfied with the customer service. \nThis company really cares about their customers!!!\nThank you Daniela.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-11-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Zuqri2nyntU1bzfDaFU_fw', 'review_id': '5lb5eiCQgHsTNvLkEtK_WA', 'text': "The service here is always 5 stars for sure. The food is a solid 3.5.\nAverage out to a 4.\n\nThis is a perfect place to bring a gaggle for some comfort food.\nNot fancy, not pretentious, just good ol' diner food.\n\nService, more than food keeps me coming back. Always a smiling staff, prompt to the table, drinks and food there really quickly. And never an issue.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2014-11-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pC9AKY1yEVtGBUDm3UzBDQ', 'review_id': 'WnzVsde0dJQ0yJDc2JjeYg', 'text': 'After a poor service performance last night @ another eatery, this morning was a home run with our server, Amanda!  She was spot on with EVERYTHING...the food was delivered super quick..she anticipated our needs before asking, and had a delightful personality!! Well played, Egg Works, hold onto Amanda..she is definately an asset to your business!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-11-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1PQKn-OmH2OIlzzSxuLvrA', 'review_id': 'xjyEDecIp9irxdoaC6NvmQ', 'text': 'Omg breakfast was amazing!!!! Truly love this place everyone was very nice and out waitress Amanda was over the top! If you come here ask for Amanda.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-11-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XJ_mpUF4lp7cNnbJkpnSXQ', 'review_id': 'gsqAivlcvLKscZ5sm83VXQ', 'text': "Went here for breakfast and as the reviews state the food was very good and the service was also excellent.  I Like the Omlette House on Charleston for Corned Beef Hash, but the service, atmosphere, and food makes this now my first choice.  Can't compare the cornbeef hash as I have not had it at Egg Works, but my Chile Omlette was excellent.  \n\nWon't disappoint.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-11-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'M8gsaPx6eTohrPBDS-kSIQ', 'review_id': '-Z1c35D3OfhI-jQ1_0JaDw', 'text': u"Oh yes - yes and yes. Come for the banana walnut muffin (even if you don't think you'd like that) and stay for probably anything else. Maybe a 4 egg omelette or scramble or somesuch? Really, just wading through the menu is almost enough entertainment by itself. It just boils down to the simple question: What do you want?!\n\nI almost got several other things, but took a little coaching from our very capable server and opted for the Crazy Chicken Omelette. There's guac and mushrooms and sliced chicken breast inside, with jack cheese on top. I went easy on the cheese, asked and got a side of jalape\xf1os, and was in heaven. Very satisfying and not too heavy. I asked for the sour cream on the side; no problem. And with many of the entrees, like this one, you're guaranteed to get the seasoned potatoes -- which may seem a little too perfectly symmetrical to fully trust, but dang, they're good. Not too spicy nor salty, but still with a pleasant kick.\n\nThis location is plenty big, but doesn't feel like a barn. You may wait a minute or two for a table - but generally, it's looks like they're very accommodating and will make things work pretty quickly. The kids menu is crazy reasonable, and for the grown-ups, it's not bad, either. Lots to try, lots to enjoy (the pancakes look great; and the taste from one of our's Denver was outstanding). Really, I think you'd be cool with just about anything here. Even the coffee is above expectations -- it's fresh with a good simple flavor.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2014-11-30', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'jKklxita0rnw4flsAvC-YA', 'review_id': 'SpT7geSwSqW2AnKEF6bvsA', 'text': 'First things first: Amanda was an exceptional server. Very funny and engaging, she made us feel welcome immediately. \nFor this reason alone, I will be back. I haven\'t ordered yet, and will continue this review after I eat :)\n\nAnnnd, I ate. It was really yummy. I had the country benny and at first I was thinking "theres no way ill finish this.." \nFast forward about 5 mins, im looking down at a completely clean plate....yep. Im not ashamed. Youll probably do the same thing.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-11-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'h3lwhProUtOV7hu4i-32Sw', 'review_id': '1V3xG15OdilHtk-oalUhvg', 'text': "Our random 'pajama party' Sunday breakfast was better than expected, begining at the door; our awesome server, Amanda,  recognized that we too were awesome when we came in PJ's, slippers and all.  She scooped us up, sat us in her section, tolerated my excessive pickiness and delivered us delicious breakfast perfection.   We thoroughly enjoyed her humor, bright personality, and clever ways. Such a delight to have such sparkling service early in the a.m.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-11-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 4, 'cool': 1}, 'user_id': 'M-O0tasOl0SGiUsxdO5cZw', 'review_id': '_-kR2DfIbz5fPcnZmyg26Q', 'text': 'Stopped in for breakfast after training at 24.  What I like about Egg Works is the food and service is always consistent.  Servers always check on you, never have to request refills, etc.   They never seem to mind menu request modifications if you are trying to keep it healthy.  I also appreciate a dog friendly patio.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-11-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': '-nLjtmcUaJXUPTricNUlZA', 'review_id': 'YEDBxNUaHVp7HxQkxHhBTg', 'text': "This place is awesome! We got to sit outside on the patio area which was just so pretty and peaceful. The food was so good and the portions are huge!  I ordered the veggie benny and my boyfriend had the chile relleno, no complaints! Would recommend to anyone, this is such a great breakfast spot. Also, their menu is huge! Even with some lunch items as well. There's something for everyone here", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-12-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'yC4rTQWnCGXo0V94yJH3PA', 'review_id': '5Wu6aLa0JX7kpRGXcG-RGQ', 'text': 'Heck yeah, this place is surprisingly good! Been here 6 times and each time they hit the dishes spot on.  Good service and a clean place.  This should be the death of IHOP up the street.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-12-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yC4rTQWnCGXo0V94yJH3PA', 'review_id': 'mQ0ok2eoWRNAzeZy91vlYw', 'text': 'This place should be a training ground for customer service.  The entire staff is dialed in on getting orders out, refilling drinks, and staying on top of', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-12-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hd_XYxMec487Bq_ux1J3ZQ', 'review_id': 'lpahmBixIp5TjUCkMMN4cA', 'text': "Great food, superb service, very clean environment, friendly atmosphere, super clean Decor & restrooms. Nohemi was a great attentive server, major props to this place, it's nice to travel and have a good breakfast place with no or minimal wait. A must try.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-12-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cz0bFKStHguSBlkwVEidew', 'review_id': 'h8NAiwJaXNNZIIvJ9fjEhA', 'text': "Really great food and good value for money. Tv's for sports fans and lots of seating. I cleaned the plate. Great muffins too and the breakfast potatoes were some of the best I ever had dir to flavor.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2014-12-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'aYzA3OgsAN3f3WJPucYCAQ', 'review_id': 'X9ddEVqzUy_KmslPWg8X5w', 'text': 'Tried the new bread bowl. Tasty but the stew  could have been warmer. \nEnjoyed the omelette. \nService is always attentive and solid.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2015-01-07', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'e3y2nSRPE7WPRder2zk9pQ', 'review_id': 'ZU5Ic7lUqSxHjWozZRY92Q', 'text': 'Even though there are a few of them, don\'t think of this place as a "Chain".  The staff is very friendly and welcoming, the food is fresh and delish.\n\nHad an omelet and wow was it good.  Asked for some customization on it and it was not a challenge.  NO ISSUES!!!!  Wow.\n\nThe pricing is not high, but the quality is.  The only challenge was having to wait a bit for a table, but I guess that is a good thing for them.\n\nWe will be back', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-01-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'Q65_TojZFs_1oZT-1Cg8dA', 'review_id': 'KB4-ZfRopDrZpE3BQZ8yHg', 'text': "Where do I even begin. Egg works became my new favorite breakfast spot, over the course of one morning! The food is delicious. I ordered scrambled eggs with potatoes and bacon and their potatoes are beyond words! So delicious! However, the best part of our experience was our waitress Thai. She was so friendly and knowledgable and made our experience memorable, to say the least. We we're visiting from out of town, so she let us try the banana muffins and those things are HEAVENLY! Make sure you try them, they are unlike any other muffins you've ever tasted. So overall, I will return to egg works again. The staff is amazing, food is delicious and prices are fair! And give Thai a raise! ;)", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-01-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'g0Euolgs3t-NxmOd_L4oIQ', 'review_id': 'LMODG9ZD-8DaVQ_FOf-VwA', 'text': 'Just went here for breakfast. Amanda was our server and she was fantastic! Great food. Highly recommend.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-01-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'OVG5ZxZP6IfVb2msr6I9vg', 'review_id': 'Ur1u7dpUtxogNF9ouGPR2Q', 'text': 'Best breakfast eatery in town!\nThe SERVICE is AWESOME and the food is equally as great! My husband and I always have a great time and enjoy coming here for breakfast. We are able to bring our dog and enjoy the food and service.  This is a place where they  know your name and you are not just another "customer". For example, I had lost my keys and the manager Danielle, helped me look for them outside and inside. She acted like they were her keys and she would not stop until she found them...talk about amazing customer service and  genuineness! Tess is another manager that got involved in the searching and they both found my key which was stuck in a booth.  They had to take the booth apart to get to it...I am sure they had more important things to do but they ended up finding my key and saving the day!  This is a yummy place to eat whether you are in the mood for some breakfast or lunch...they got it all!!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-01-31', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'v_u2ai-jicfG1eXJYj4qzw', 'review_id': 'E_wNYhwCVtoun5MeDOUHew', 'text': 'One of the best breakfast places in Las Vegas!! Multiple locations!!! All the staff are great!!! Just had the moco loco because of having it in Hawaii! Awesome!!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-02-05', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'Lx6PvAZYTePi09RWQJDinA', 'review_id': 'F2g1vmE5_ezNRbILE45G-g', 'text': 'Love the food and the service !!! You know what they say? Breakfast is the most important meal of the day and Amanda serves it up that way ...', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-02-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7qlJTqXnK_gkq8wpy22p7g', 'review_id': 'CyxZ5Rieuuyq-GEwqdapyA', 'text': 'Amanda was groovy!!  Love this place. Service was fantastic. Food was great!! Always a winner.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-02-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KeYfiWux3--gPaF9b4O1nw', 'review_id': 'zyqCwHxpkhQGLo6DevkzhA', 'text': 'Great food and Amanda gave us great service! Made for an excellent breakfast and morning!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-02-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'huUt_iG2ZYof6cTfLrTaJw', 'review_id': 'aIkRGBu2QVg-2B5mgrJQGg', 'text': 'Great food, great experience. Arianna our server was great. No complaints. Thank you!!!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-02-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LDdHm8CDs-6vSqgQ6bWFBA', 'review_id': 'pOGr1fkBsXD4ckgeJ0XgBw', 'text': 'Great food, great service from Amanda! She was very awesome :) Very fast service and friendly staff.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-02-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZCbk4MjFLfEaYRKc9zjpBQ', 'review_id': 'P5RFhFKimAFtQQDNr33dQA', 'text': "Killer place to get your grind on, the staff ( Tess & Amanda) and service is always on pointe. Everything I tried on the menu exceeded my expectations. So, if you're hungry, go to Egg Works and ask for Tess or Amanda.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-02-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5ht0IK9jrWQh9bU6bAK7yA', 'review_id': 'v6IDxk7O4xTHtXdphx8AFg', 'text': 'This was our first time in an Egg Works. We gave our name to wait for a table but a very  friendly waitress came up and offered us space at the counter, our preference anyway! Amanda took our coffee and water order before we even sat down so we were very promptly served. We got a "surprise" for being first time customers, the food was good and portions were huge. But, this review is less for the restaurant, more to acknowledge that Amanda to Egg Works is what Flo is to Progressive car insurance commercials. AMANDA made the experience of just another Sunday breakfast so friendly and enjoyable I am actually writing a review about it on Yelp. Nicely done young lady! Do you want to come work for us?', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-02-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 't-OcZN6cZnoMXFTMvdlNgw', 'review_id': 'V7ksGqLIC6tJu8-ZTXkxUA', 'text': 'The food delicious and my server Nicole was amazing!!!!. Friendly and attentive.  Will totally be back for more.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-02-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'X4gpFGy2uZyuLmZiIMfWlA', 'review_id': 'KCVulZOw4ogEkISoA79pYw', 'text': "I loved the food! Nicole was also very friendly and gave us awesome service! Definitely stopping back again when I'm in town!", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-02-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Pf_z4TfLcOSKjN9wmgPlmA', 'review_id': 'rF3D3a1aZlkK1JHfk3iqgQ', 'text': 'I was visiting from NYC and my boyfriend and I had Nicole as our waitress and she was just so delightful and attentive. Not to mention beautiful inside and out. The food was great ha but the service was just so enjoyable. Keep up the good work Nicole! Hope to see you next time were back! Love the menus too, so cute!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-02-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xSf6DrYIy8QbD8Yky3FvBg', 'review_id': 'SBz9wfEF2WBhGnJs4hhP-w', 'text': 'Nicole is an exceptional server! Not only is she a beautiful sight but she is the funniest person ever to serve my eggs. I find myself coming back at least once a week just to sit in her presence and be entertained!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-02-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JXJIfrR68SEgpIK9CPj7Bg', 'review_id': 'ZdnMrwAcxzQPfPXW7MEanA', 'text': "I came in for breakfast twice so far. Each experience is better and better and I've had the same server both times. She is very fast, friendly, and knowledge - always asking how things are, if I need additional items, but is not pushy. I'm not sure if her name is Casey or Lisa but she was great and I recommend this place. If you come in, make sure you request her - she's great!", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-02-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'NQG-8Tx4U8Ooj8H0eonTaw', 'review_id': 'JI0G_pv9ufehx24oXElueg', 'text': "Don't Do it! I'll start by saying that I'm pretty easy to please when I'm starving. That being said, the food was mediocre at best. \n\nI received spoiled OJ, my man got rancid water in a dirty cup. Water!  The server was very accommodating and replaced my spoiled juice with coffee and my mate' s nasty water with bottled. So far, so good, handled it well and didnt charge us for these, so i greatly appreciate their service. \n\nThe food, however, was not awesome. I ordered the Greek scramble and what i got was a grey, unappetizing mess loaded with some sort of pressed chicken thing. It was slimey, salty and I didnt love it. My man got mushy, NOT homemade corned beef hash which was also unimpressive. With enough hot sauce, the meal was tolerable. Best part was the side of fruit. Like I said, dont do it.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 1, 'date': '2015-02-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'sNHc6FqKckyEl9v-_ZUCaw', 'review_id': 'GSlkrhtDiEYM_ffKGjgpIQ', 'text': 'We ate at Egg Works this morning. I\'ve been going to this restaurant since I moved to Vegas 6 years ago. It is AWESOME. I have literally NEVER had a bad meal or bad service at this place. Today, for the first time, I decided to try something other than "The Classic" (eggs, meat, potatoes, toast), or an omelette. I tried The Islander - eggs over medium, spam, and sticky rice. This dish was incredible. Simple, and yet soooo satisfying. Easily one of my favorite restaurants.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-02-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'MgrLUBi7gsdRJzcTVNlLEQ', 'review_id': '8pSBog1HfLsR002B-EgS_w', 'text': "I had the Mimosas with my Egg White omelet. Everything was just exquisite from the sheik deco to the friendly staff and service. Food was top notch and the best of all I was able to bring my English Mastiff on the the patio while I enjoyed my meal. Make sure to ask for Nicole. She served me with precision and speed, also super friendly and not bad to look at ( Heyyyyy oh) Overall I rate 5/5 best breakfast experience I'll ever have.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-02-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ng00F3HOArOvj50D6gC2Bw', 'review_id': 'qwC0sWbZOFexJKpk7BpRKQ', 'text': 'Great food, our server  Veronica greeted us with a smile was quick to get our order in and out to us.  Keep checking on us throughout the meal.  Highly professional treated us more like family than a customer', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-02-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jqdKHbHtaZrv7NjN6Go7dA', 'review_id': 'QcREldAbCa2W3ZX8AAqPSg', 'text': 'I love this place! Amanda always has a smile on her face she is the reason I come back every weekend!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-02-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'AB9O0hAztuoH1H0SlJwJJg', 'review_id': 'O3QOAsbJVY_eA5NyTgip8g', 'text': 'Delicious!!! Arianna was a wonderful server and very attentive:) we will definitely return!!!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-02-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5hpvZSCQ3SpGBkOWgHXFTQ', 'review_id': 'qf8BUtobTtNJJYpriaIl_w', 'text': 'Whenever I am in Vegas I make sure to get over to egg works! Regardless how hungover I am! And I must say that the last few times Nicole has been my server and she is excellent. She really makes sure we are doing great', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-02-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'z4qQnegSZodzg9_s09Hlxg', 'review_id': 'BhF8AKi4NIL4K1liuazImA', 'text': 'Let me start with the service. Veronica was awesome!!! Very polite and pleasant with our party of 5. She had a lot of patience with my kids and they loved her. I always order the Chile Relleno Omelette which is great if you like your breakfast with a kick of spice. This time was no different. All of us love the banana nut muffin, highly recommended! It comes warm just out of the oven. I will definitively keep coming back with my family and ask for Veronica!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-02-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '419Ot6q6amMB3VEDZKqceA', 'review_id': 'C8_FxrKc1zB6mw_nRvUEWA', 'text': 'Veronica P was an excellent waiter, the service she provided was top of de the line, very courteous and helpful with the recommendations she gave us. We went for breakfast and her suggestion was delicious also she brought banana nut muffins for the kids and they love them. We had a nice time and were very satisfy with her service. I will recommend this place to anyone in a heartbeat.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-02-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VfxQtJzk0thVGoIjlXEW_w', 'review_id': 'GoASN24uZSVYyM_xp0Ni4Q', 'text': 'If your looking for a good breakfast and good service you may want to try dining in at Egg Works. Just shopping around on Groupon one day and ran across them. Tried them one weekend and really enjoyed them. Decided to return the following weekend. And would you know our server ( Veronica1) remembered us with a warm welcome. Keep up the good work!! See you soon Veronica 1!!!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2015-02-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-ZZSL37iyZUl4c2Ec2ahRQ', 'review_id': 'fCgEcgIMOYEUhpcYBy0YMA', 'text': "It's Egg Works. It's solidly done breakfast food served in gigantic portions. It's good food, but not terribly inventive. I'm giving this Egg Works four stars for the outdoor patio. It's in the perfect spot for eating breakfast outside. It's sunny, but not direct sunlight and there isn't too much road noise. It totally makes this spot better than all others.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2015-02-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4Ub1-gKv1kRDkVsWzVPoAw', 'review_id': '8MzwN9iKlMDpuAi8v8Tr1Q', 'text': "Convenient and attractive decor.  Good service.  \n\nOJ isn't fresh squeezed.  What kind of self-respecting bfast joint serves OJ out of a bottle?\n\nCorn beef hash was salty, stringy, and runny.\n\nI was disappointed.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 3, 'date': '2015-02-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'W3JfjpMFw3Es2teAxABC9g', 'review_id': 'nTfWFO2nqZiThkRno4_Oag', 'text': "Came here recently and I have to say it was great! One of my favorite places to eat now thanks to Nicole for telling us to come here while we're in town. Service was amazing of course but the food wow! It's tasty!\n\nHad the fruit plate which was refreshing and comes with coffee and a juice, toast or muffin and cottage cheese or strawberry yogurt. \nThey've also got Bloody Mary's or mimosas! Try this place if you can, great local spot! Thanks Nicole!", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-02-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'AOfruJ9ipf_ussCTA5CzzQ', 'review_id': 'hSWPqB7a8OKXWRZlzOiBaw', 'text': "The service was great! Everyone was friendly. Food was good, large portions, we had the heart stopper skillet. The atmosphere was wonderful there is so much space you don't feel like you are right next to others! Live it! Check out was fast too! Wonderful experience!", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-02-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Udk15qNom0NIe0xZcPrNVA', 'review_id': 'hBoZmzNW9fG5rBhnTHRGkg', 'text': "Came here after a hike at RedRock and it was a fantastic experience! I had my dog with me and I loved the fact that they have a dog friendly patio. The weather was perfect and our server was friendly and efficient. The food was delicious! My friend and I ordered pancakes and the country benny. We shared both and everything was amazing. The staff was phenomenal and even brought out water for my dog. I'll definitely will be visiting again.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-02-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'koUdK73gkzg3l6zWmfCp2w', 'review_id': '55Hsrpd9tcp-BOUvPMgXWA', 'text': 'Amanda was an exceptional server, friendly and professional. She should go to Disneyland!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-02-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'x6A95fLEsYJnwHl4GenN5Q', 'review_id': 'oY4g-Uu1KXAnnXeV2SMf-g', 'text': 'We love Egg Works... Consistent, high quality food. Our server, Nicole, was polite and sexy.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-02-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'GAwHvxUzP0YFz9R5XsCL6Q', 'review_id': 'WFqybNmJMErBvzxeJYSQ6Q', 'text': "A beautiful, sunny, sunday afternoon and a Cincinnati omelet washed back with a mimosa. It's my day off dream and I'm living it. You better believe with the dog friendly patio outside that my pup will be my next brunch date. Sorry roommie,  I'll bring a doggie bag home ;)", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-03-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'g1a4OLgGSWMLOGEwcsb3fQ', 'review_id': '7kQLIMwx9wmzoG-VB_AKjg', 'text': "This is a great place for breakfast with the family! Friendly staff, good Midwest style food, clean bathrooms, and the country decor makes you forget you're in a Las Vegas suburb. \n\nMy son loves the pancakes that looks like Mickey Mouse with a piece of bacon for a smile!", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-03-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_hYma3WOjue2igSsPjOHJQ', 'review_id': 'XbXdTJQJkMl1mDPRcV1Hcw', 'text': 'I wish I knew what everybody likes about this place.  Second time was as bad as the first time.  But it will likely be my last time.  The food is mediocre and the service is way below par.  I waited a good ten minutes before a waitress came by to tell me she would be right back to take my order.  5 minutes later she came by.  Coffee cup was filthy.  The overall experience was just lousy.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 2, 'date': '2015-04-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7zNxOnQhjAReF_QIAKePyg', 'review_id': '2xLDxRw8rH-s1sUKfRDaqw', 'text': "Wanted to try something other than the chain breakfast restaurants that are around the city and I've heard a lot of great things about this place. Our waiter was very friendly and attentive. The prices are reasonable and the portions are big! We didn't wait too long for our meals to arrive. Will come back again for sure!", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-04-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hFDqaODHbp6xdMyttYBlAw', 'review_id': 'kPB0yViFgRdpD6NF_OVoYA', 'text': "Always great food and the best customer service. I'm so happy they opened up down the street from where I live. My husband and I go there almost once a week. Keep up the good work guys!", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-04-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'ZotIWP8HhOp8e9HNkY7dpA', 'review_id': '0RdabDcgDFoJQLlkKLdLjw', 'text': "This place is delish! Original hardy breakfasts with lots of flavor.  Different options for different taste buds. If it weren't extremely noisy and can sometimes get really busy this place would be a regular spot for our family weekend breakfast place.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2015-04-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'cL8ruZoK8CnF0aIxEq61ig', 'review_id': 'RwASZ01t8PmQAgOs157TNQ', 'text': 'Stopped by on Sunday for breakfast and the food and service was outstanding!  I had the sunrise mountain and hubby had the philly benny. Both were delicious and arrived quickly to the table.  From the hostess to the server, to the employee helping us check out everyone was welcoming and friendly.  I will be back for sure.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-04-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'E65gJ4Yi9vR0aXEWI8sZ0g', 'review_id': 'vLD_EpCpQ3Lwd60S5KTEvw', 'text': 'Everything was great! My Apple cinnamon pancakes were very tasty. My server(Veronica) was very professional, attentive and friendly. I will definitely return to this location.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-04-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'D0S8gdQoyBk0pKrfu53n7Q', 'review_id': '-dvvaoZvp1mGx5t5p9DhXA', 'text': 'Good place for brunch. The service was excellent and the food was flavorful. They also had a groupon!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-05-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'J5eB1B-tokXBc30T5D617g', 'review_id': 'pPXzNdXkeGkF4SIp8GbMkQ', 'text': 'Love the food and service! Try the breakfast Potatoe skins! They are not on the menu but if you order them and they have the potatoes they will make them for you!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-05-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'D737et0QdkTKPInV_BLyXw', 'review_id': 'jXgzKwfVW2AIR8xsjSbH7A', 'text': "I would give the location 5 stars but the guy at the front desk who seats you and takes your checks is a real crappy person. Talk about needing to learn customer service. YIKES if management reads this please either train him or get rid of him! \n\nThe server was excellent and my food was wonderful. I love how many options they have for food and will go back. Also, unless you totally love multigrain pancakes, don't order those. They were nasty. However the waitress made it right and got buttermilk instead.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2015-05-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '30RpUN22ZyG-Yhz76zJuCw', 'review_id': 'gcHZEDpLVd6vqDMduo9aXA', 'text': "Food was EGG-ceptional. Got the stuffed french toast with mimosas. Food and service were EGG-CELLAnt. Lol. I'd definitely reccomend.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2015-05-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 1}, 'user_id': 'frdkBvmaFvDYQCi50wvnuA', 'review_id': 'O4xXebViwIWI897rFAo2QA', 'text': 'Best place for breakfast in Vegas. I was just in town for four days and we ate here twice. Service is amazing and food is fantastic! \nWe had our toddler with us and they were more than accommodating on getting food out for her quickly. We will be back on our next visit!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-05-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'whsDfjnw6q20joGZLwdkwg', 'review_id': '48zi9tITuiC6smVb5xIohA', 'text': "Nice place but . . , I ordered the two fried eggs and potatoes.  Basic stuff, but the potatoes almost seemed deep fried and were way over spiced.  The spice dominated the entire breakfast it was so strong.  The egg was not cooked properly.  I asked for whites cooked, yoke runny, but both the yoke and whites were runny.  Charged an extra $1.75 for about 15 blue berries in son's pancake, which seemed excessive.   My wife was with me and liked her omelet, which looked good.    Coffee was good and pot was left at table which is nice.  I like the location.  We sat inside and it was not too loud.  No wait.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 2, 'date': '2015-05-18', 'type': 'review'}
{'votes': {'funny': 7, 'useful': 9, 'cool': 8}, 'user_id': 'orxwdyuvc5jxZBypYpWVDg', 'review_id': 'ebaMwQLVAkb4UqgFSuXmBw', 'text': '1st time here this morning and enjoyed breakfast. \n\nGreeted by a friendly guy, and after he asked how our morning was, I did the PC thing and replied with the same...how are you today type question, he replied "EGGSelent!"  I thought that was corny, but funny!\n\nOutdoor patio dining available or sit inside the large open square restaurant.\n\nAll of their omelettes contain 4 eggs, whereas most places contain 3 eggs. \n\nDiced potatoes, freshly baked banana nut bread, and sour dough toast all accompanied my veggie omelette and I loved it all. Very delicious, good sized portions, served quickly and reasonably priced!\n\nOrange juice is not fresh squeezed, it is out of a container. When we asked for a large oj, our server replied oj is only offered in a small size for $3.50. She suggested taking two smalls and pouring into one large glass. But no price cut available. In other words, a large would be two smalls at $7 bucks, no thanks! Why not just offer a large oj to begin with?! This place has been open for quite a while now and this type of "new restaurant quirk" should\'ve been resolved man months ago.\n\nI wanted coffee, but saw no raw sugar on the table. So before ordering, I asked if they had raw sugar and the server said "no, but we are going to get it as part of our inventory as we receive daily requests."  Again, this place has been open for quite a while now and this type of "new restaurant quirk" should\'ve been resolved man months ago.\n\nOur server was very friendly, knowledgeable about the entire menu and offered "EGGSelent" suggestions from the menu which serves every breakfast food imaginable.\n\nSame ownership as the W. Sahara location called Egg & I that opened in the late 1980s. They explained with Egg Works at a few locations in Las Vegas. \n\nIf you\'re in the Summerlin area and want a really good breakfast, eat here! Located across from Starbucks and 24 Hour Fitness, next to the Summerlin Library, near major cross streets of Town Center Drive and Summerlin Pkwy.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2015-05-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bojdwD6tEUIun7pzIFASow', 'review_id': 'f7-he8sU8_9UkxzIvF4_Og', 'text': "We have good experience from this morning \nThe food was good but service was slow  .\nBut overall it's was nice breakfast.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2015-05-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'YEMjxmls-gjSyUC0d3uCTQ', 'review_id': 'bdSIpRNvC_5TG4DwO5Xv2Q', 'text': "The best place to have breakfast!! The staff is always friendly here. They try to seat you right away and all the waiters we have are nice and respectful. They have a patio and people can take their dogs, if you're waking your dogs and want to grab something to eat. They also have TVs so you can see the local channels and watch some football wile you eat. The manager there is always checking to see if everything is ok and if we need something she gets it right away.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-05-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_oZExq82b7ZOIZCFQxN9GA', 'review_id': 'GWhaaLStbI4WfIpfuxlySA', 'text': 'The super moist banana nut muffin keeps me coming back every single time! I crave it! Their skillets are amazing too. Outside seating is nice on cool days. We always get friendly service which is on the top of my list anywhere I go!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mkpOyuau0Gtt9SDX23vKcw', 'review_id': '3pXMFRwC_Q-Z9ZK-MHk7Xw', 'text': "This place is awesome! Always great service, food comes out fast, and it's delicious. I recommend the Santa Cruz Breakfast Burrito.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'v0108qZkMcNm_BB7hvV2ng', 'review_id': '4HxYwIq6XGPS81chwFo9Dg', 'text': "The atmosphere here is cute. The food was good. I ordered an avocado and bacon omelette. They did not skimp on the avocado or bacon. I normally judge  a good breakfast on the eggs. They weren't saturated in oil like most omelettes I've tried.\nEveryone we encountered here was friendly & attended to us like we were the only ones here. I'll be back again.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-05-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'g__weWYckVrexBUXOXPxCw', 'review_id': 'rj6C0_qSV4QOp1amtCA79w', 'text': 'The staff is always friendly and the food is always good!  My husband and I walk our dog here most weekends  for a relaxing brunch on the patio.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-05-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Cnn5-NSp_ZfVm7orxw6lSQ', 'review_id': 'z2FoTEGFecl2E-DxDX1zVA', 'text': 'The omelet was ok but the coffee was weak and terrible. The potatoes were a frozen square product that were pathetic. Any breakfast place that really cares would peel real potatoes like a good diner but not this place.THis place doesnt know quality.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 2, 'date': '2015-06-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-fE5_gLIqszyZrMmfUXhwg', 'review_id': 'JIB-EO1vXrOzlH-Sh5T3iA', 'text': "Although our server was mostly absent. Our food was great! They have a beautiful patio area. The coffee was fresh. We had  shirt wait just because we asked for patio seating. Nevertheless we had a great experience and we'll be back!", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 3, 'date': '2015-06-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ry80TkTFSnPGqTkDdgt9uw', 'review_id': 'Qkn3E0g10rcEoPPvCWL3Ww', 'text': 'I have two kinds of breakfasts I like when I eat out: the first is usually with visitors who want a unique experience and are usually still drunk when they wake up so we will hit one of the delicious options on The Strip. The other breakfast option is my more frequent trip down the street to a comfortable friendly place like Egg Works. I don\'t look for anything fancy and it is the ambience and service that brings me back regularly. This is most definitely the case with Egg Works. The greeting is always welcoming but the severs take everything to another level and make you feel more like you are visiting friends than dining out.\nI\'m an early bird so I can usually anticipate a seat outside on the patio where I am often doted on by the friendliest staff you could hope for. I am not an adventurous breakfast eater and usually stick to the basics, which are consistently fresh and well prepared. If there is anything to truly rave about though it is the captivating personalities of the staff. Las Vegas is a town where you should expect good service and this vibe certainly infuses Egg Works. Not only is the wait staff friendly, efficient and hospitable, the extra bit of personality offered up just brings the whole experience to another level and starts my day off with a great positive vibe. If you ever want to practice overtipping, this is the place to do it since the servers make you feel so welcome and appreciated.I have even developed my own "server crush" and always ask if the lovely Nicole can, you know, "butter my bread."', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2015-06-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lpxa2IbOGlj61A_ss09J4g', 'review_id': '1fzOkZL2SXBNUQp8X6Ezvw', 'text': 'Kristine was an amazing server she was friendly, prompt who explained the menu and gave wonderful suggestions!  I really enjoyed the decor and the food was delicious!!  Enjoyable morning!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-06-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LY5xRMMPsdgt2pLdhuEw7g', 'review_id': 'US8jxYgy9H0irM-AO6j9AQ', 'text': "We had breakfast at Eggworks for the first time and I have to say it was delicious and an overall great experience. The restaurant was clean and spacious with lots of tables. The servers were polite and very helpful since the menu was huge. \nI had the chili relleno omelet, with seasoned potatoes and English Muffin, very good. \nRita had the Holi Moco, an awesome take on Loco Moco, also delicious. \nAs I mentioned the menu had many choices, which means we'll be back.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2015-06-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '8kPYlFYDt2FlfSm98GrHpw', 'review_id': '86qMwW6TB75yfMpAQIdJlw', 'text': 'This place is awesome!!! Service was amazing!!! Food hit the spot! Shout out to our server Patrick and the Manger Trevor!!! The banana nut muffin was amazing least with 3 loafs!!!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-06-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '05OZ7GOJfsHirf8R6ZJcWw', 'review_id': 'eyQ8f3r8ItiH04l0mzy9pg', 'text': "We have lived here for almost a year and just had the opportunity to visit today. YUM! Being a transplant from Ohio, I was shocked to see Cincinnati Chili on their menu!  It was good and definitely not as watery (from not draining the spaghetti) as what I was used to from Skyline. And just the right amount of cheese - a TON of it!  My daughter had the kids chicken tenders with fries... their fries are DELISH and seasoned.  Vanessa was our friendly and attentive server.  I'm so glad we stopped!  The only down?  Vanessa said that they didn't have a dessert menu :(", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-06-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9IM8zmHTazMZdTrDHMvNGw', 'review_id': 'Vb78O5SucfDVxokycW1QRQ', 'text': 'Excellent breakfast. Fresh squeezed orange juice. Vanessa was very friendly and excellent service.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-07-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 't_-zY4tStYR2XEvBoErTIg', 'review_id': 'M4iUgz4kSBbB30626-Ey0w', 'text': 'Took awhile to get drinks but once they did, he felt bad and gave us another muffin. Yumm on the artichoke omlet.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2015-07-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GnQmWUxpH3Vp3upfndh-bw', 'review_id': 'XhqETgNoSzZVkivOUHnyFg', 'text': 'Went here for breakfast this morning with my grandma and the food came out very fast and it was very good. The staff was very nice as well.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-07-06', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 1, 'cool': 0}, 'user_id': 'ON3Ezqb_siCmvyLh5K4nWg', 'review_id': 'Ji8McWI2c6JobBzHmVLa1g', 'text': 'Just want to say that you still need to do something about your WATER at your restaurants.   It taste horrible ... On the other hand, some of the best servers around and friendliest ... Even Nicole ...', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-07-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ym1QF4kq7VG4uzsSk8aJow', 'review_id': 'sme5U0A_Y3D5foas-nnrog', 'text': "Thank you Arianna for the excellent service on our stop at Egg Works today!   I had a BLT with fresh fruit.  The  BLT was piled  high with bacon,  lettuce and tomato.  My  husband is on a special diet and had to make several changes to brad's scramble which was no problem for Arianna!  it was delicious &prepared correctly. The banana nut muffin which is  homemade is not to be missed. We will  be back soon.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-07-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5UGZ1myD3tgNEihsY7zuKA', 'review_id': 'LHgLWgJEn5AhbyWG_1F-sw', 'text': 'The country fried steak skillet was perfect hangover food! The banana muffins are amazing', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2015-07-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TRSKA-N6myp1Vau6ol4xYg', 'review_id': '_JXtwADPXkDjPlBeA9Beeg', 'text': 'Thank you Lisa C for being our server. You are one of the outstanding waitress to us. Thank you.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-07-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'N1UM1yL6zfpmrggKWKvYOA', 'review_id': 'GXn03t-Y2fo_JcGSAzwT0A', 'text': 'Ariana- Awesome server.....We have had breakfast at this location 3 times and Ariana has given us the best service each time! Kudos to Ariana!!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-07-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'USJcV707LoNi7H1YCTLjpA', 'review_id': 'FAFYKDg3upqMZTKkEtiIzA', 'text': "Been coming here for a while and every time it's amazing! Love all the employees here but Lisa T. Is always so sweet and gives excellent service. If you come ask to be seated in her section. Also 30% off for EMT/AEMTS", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-07-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GCCsJ2yb9FGKmxpv0A07QQ', 'review_id': 'UigQmjgXcEyyRuD9SHLDiw', 'text': 'Jayna was our server for a big group of 9 people . She was very helpful and attentive .The food speaks for itself, but her service was impeccable . I will be back again for sure!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-07-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Fh71bgswPsWVUzdrS5UJrg', 'review_id': '_bxHJkGDyAkqrsaTXzlnrA', 'text': "We recently discovered Egg Works. It's our new Saturday morning tradition. Great menu variety, serving size and taste. Love the Diablo potatoes. Lisa C was extremely helpful and friendly. Food arrived in less than 5 minutes. We will see you again next week!", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-07-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'X2K-qyRj_sF8w1RKLXXwlg', 'review_id': 'xDuwCepR5AcfKMBtOZiwtg', 'text': "Hey Lisa C.  You were a very good server. We eat here all the time. One of our favorite breakfast joints. I don't think you are supposed to require 5 stars or solicit reviews. Yelp rules are created so your establishment can not skew the ratings. It is supposed to be spontaneous on the customers part.   I did participate because everything was 5 star today, but all credibility of ratings comes into question when you hold a contest.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-07-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oDtB0FXccPVhnug6Os48Eg', 'review_id': 'PUbDxuL0xHsTNC7Dsw4myw', 'text': "Outstanding breakfast! Portions are huge- 4 egg omlette fair warning!  I am a biscuits and gravy snob and found their version excellent coffee was very good and I wisely got a half order works skillet. Don't go to a chain restaurant when this is right here!", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-07-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'J5hlkGoZafUKxXK3XL_gQw', 'review_id': 'QOYzEYX2LHXs5w_hDU2MDA', 'text': 'Breakfast was delicious and Veronica was a great server.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-07-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9DRj10divwNJYg3Ljz1dnQ', 'review_id': 'R4SjV3zoIQ_LytDM3PKijg', 'text': 'I really enjoyed the great song selection (hoobastank just to name one) and even better egg themed dishes. Oh, and the menus that were like news papers was a perfect substitute for a common place and at times borish menu seen at other "hot spots". It was very avant-garde and new age. You could even say it was eggcellent. Server was Lisa C. and provided wonderful service!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-07-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZqCjQO6ZfWBKCAlUdRjoDQ', 'review_id': 'bEP8XlL9VF318h57__YGuA', 'text': "I had been wanting to check out Egg Works since moving to Vegas six weeks ago. Finally stopped by this morning. I was seated immediately and was eagerly given assistance by my waitress. I am disabled and needed a little assistance in transferring from scooter to chair. I ordered coffee, veggie omelette with a side bacon. Coffee was served hot and fresh with a pot of coffee left at the table. The omelette was just okay but the bacon was tasteless and had a stiff, rubbery texture. Oh well. I'm sure it's just one of those things that doesn't happen often. I will come again just to see if the breakfast served me next time is any better. My bill came to $15.00. My waitress' name was Lisa, if memory serves me. Very likable, courteous and competent.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 3, 'date': '2015-07-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 't5dKPXegbqNBwgz682lgQw', 'review_id': 'g-P9JOGzZ49tQdBg1-WYuw', 'text': "I know, I know....I've said many a time that I'm not a breakfast person, but hey, sometimes you have to give in. So, my wonderful meal was a half order of the Greek scramble (Swiss cheese, mushrooms, spinach, artichoke, chicken, and topped with a bit of feta. Yummm.\n\nFriending my scramble was sourdough toast with apple jelly, perfectly crisped, unseasoned breakfast potatoes (yeah, not a fan of seasoning on my spuds), fruit, and a sunrise.\n\nService is always great and Nicole a peach for putting up with a bunch of punchy Gravers after a 10 hour shift. Today was perfect for breakfast on the patio.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2015-07-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XOtMDbDIugHJypk7MfjcbA', 'review_id': '5n6wVnZtnYpN1qxAlvXnfg', 'text': 'Patrick was an amazing server. We had the sun dance omelet and I am so stuffed I can hardly breath this is their version of bottom of the creek omelet and simply the bomb. My favorite part of this local chain is the coffee pot on the table.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-08-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'keoFWxA9v47gtJagZoV1xQ', 'review_id': 'bX45wDvOWLb7dEn4_HiGrw', 'text': 'Great food great service no complaints my always go to breakfast place.the chilly burger is great', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-08-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Z6jpckDcoo3KdT_AEUNsag', 'review_id': 'zxtYDUPxW2BzzRMoAq3NLw', 'text': 'Kelli was awesome!!! Food came about perfect and absolutely delicious. I usually get the Chile Relleno Omelet or the Country Fried Steak Skillet. Mike got the Corned Beef Hash which was also really good! Wen I checked in on Yelp I got a free muffin, which was great! All the staff here is super friendly and helpful when it comes to needing anything at all! \n\nWe will definitely be coming back!!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-08-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7LGi9nRdzkeFrFSkk0E3-A', 'review_id': 'din4bqk9p6xxNipYjoNL3A', 'text': 'We are from out of town and decided to come here for breakfast and boy am I glad I did, Nicole was an amazing server and made us feel like family here, and the food was phenomenal,  highly recommend this place, thanks Nicole!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-08-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JBI9lH93vt2XQoCCsRiSqQ', 'review_id': 'K20bAACPb0uewV7sOMihrA', 'text': 'Awesome breakfast and I was immediately seated.  Best American breakfast food here than anywhere in the country.  I always make a stop when traveling through Las Vegas. \n\nBig thank you to Nicole for being my server and being a blast!  (Your going to Disney Land!)', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-08-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hU6IXLzNmo8VLZikY91p-g', 'review_id': 'SaD_gq7KEEPUszFsbdRjuw', 'text': "The banana nut muffins are homemade and wonderful. Not much gets me to rate a place, but when I try how delicious these muffins are and they say they'll throw another in if I rate it, then I had to pull out my phone right then and there. Best muffins I've ever had! (And I'm not just saying that)", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-08-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_odE2O7jZBIXeFSftRO09g', 'review_id': '6VCQWD4jVYg1TxLwv5NUPQ', 'text': "I got the spinach eggs Benedict and it was SO good. Best breakfast I've had since moving to vegas. The fruit was fresh and the service was great. You can sit outside and the outside area is pet friendly.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-08-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'UaLlvUf9Sup3918oIDGHoA', 'review_id': 'sTGxHIvH9MH_LoQ3Ej7w_w', 'text': 'breakfast time before the pool!!! cant go wrong with egg works!! we got a killer waitress nicole shes blasted with tatts, super friendly and out going not everyone with tattoos are scary!! \n\ngreat service and food, the food came out quick and we got seated fast too.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-08-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 1}, 'user_id': '5KKfjhTffI-rcYesbSxoxA', 'review_id': '9jYkahkf75x6JXYPrb4Iwg', 'text': 'Looking for a good eggs benedict the high reviews for this restaurant led me wildly astray.\n\nThe service was attentive... I even liked the "egg signals" for when you need something. However. the food was horrible. The worst eggs benedict I can remember. The hollandaise space was lacking in flavor and since it was served in a deep dish filled with the sauce it turned the english muffins into a soggy mess. The canadian bacon was obviously cut rate ham. All in all a lackluster preparation with poor quality ingredients.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 1, 'date': '2015-08-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fkQvV7Ej_E7BgMKwlzkzbw', 'review_id': 'EwfS9nKe7x902T4NF8GVjw', 'text': 'Patrick was a great waiter! Food was delicious as always :) definitely coming back! Will recommend to ALL my friends, colleagues, and even minor acquaintances!!!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-08-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jZgdIPhkFV9xS29vfmoeTg', 'review_id': 'p0l-mZzrkFTQ0Wtw70B9fw', 'text': 'Egg works does it again!  Just got back, my family goes here every couple of weeks.  Food is always amazing, Lisa C was our server again she always does an amazing job.  Love this place!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-08-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pbAUGL4GfSxYzJXE_FZG0Q', 'review_id': 'TBE67iSsXkjDBDP78vwh2w', 'text': 'Our server John was great! And the food was terrific! On our next visit from Los Angeles we will definitely return!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-08-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_L9fgrTst8Ubxc7Mcaljaw', 'review_id': 'NcwVipRB-UPQqyIawgoM-A', 'text': 'Great little place very home feel atmosphere excellent service big portions and great food', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-08-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'B6WkDiV948ZqjtWjCTWspg', 'review_id': 'SfDRay7CZ2RrqcduVFFeEg', 'text': 'Always love coming to Egg Works! Lisa C. Is a top rate server. Her attentiveness and anticipation makes the experience great.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-08-28', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': 'X3_Ad68ZQsWYuConemU0Xw', 'review_id': 'KGrSXVyiU4tFXLmo-A8TaA', 'text': "Wow!!! These people must not know what good food is because this place sucks..and the service was horrible,.this place is completely over rated..if you want to eat a great breakfast try EATS downtown..as for this i'd rather go to ihop", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 1, 'date': '2015-08-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'G9zdiNU7hfrjcjcFyidkwA', 'review_id': 'TkAlwFiP2wxrPGdeZUl-CQ', 'text': 'Our waitress Vanessa was so awesome! She remembered my husband and i from a previous trip in, which shows she truly cares about her customers! Definitely will be requesting her next time. Having a waitress who is genuine and friendly plus gets our order correct and follows through with service is an A+ in my eyes! Thank you Vanessa!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-08-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '5JHsx0XsyWyHrnfxczhdZQ', 'review_id': 'zsDstRqpKXiPq6kblw2-fw', 'text': 'I think we were expecting too much from Egg Works. The coffee was superb, though. Waitress confused me when she asked if I wanted any special creamer... "uhhh, what?"  ...but they\'ve got the flavored International Delight stuff hiding in the back. She was cool and left a carafe at the table because obviously I give out the I want a lot of coffee vibe. \n\nThe food though, meh. Portions are huge, lumberjacks could eat here! I had eggs Benedict and found the Hollandaise quite salty. I think it\'s a Las Vegas thing to put olives on top for decoration, nay to that. Boyfriend had "stuffed French toast" and we both assumed it would be a more decadent, dessert like dish than a basic egg/sausage scramble French toast sandwich. Oh well. That\'s what you get for assuming. They don\'t do hash browns here, rather they have their own sort of country style potatoes. Now these were WELL seasoned, another friend of ours doesn\'t like to eat at Egg Works because of this. However, we found the potatoes to be the best part of the meal (besides the coffee) We both at half and took the rest home, potatoes heat up nicely in a skillet as leftovers.\n\nTidbits: There\'s a neat electric train running around the top of the foyer where you pay. A lot of outdoor seating it appears, but seem to be understaffed and these sections were closed off. Happy/sad egg sign at each table to fetch a server for attention, brilliant idea.\n\nForgot to use our Yelp check-in offer for a free muffin :(', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 2, 'date': '2015-09-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'o0I2iml3BN5klBV4UBE9jg', 'review_id': 'VkHEnsTbBifpRCB3-Ij7sw', 'text': "Really love egg works!!  Today I had the balsamic glazed chicken salad...it was awesome!!  Service was excellent throughout with the very capable Lisa C taking care of us.  Can't wait for cooler weather so we can be back out on their gorgeous patio!  Snag a groupon before you go that makes it even nicer!!", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2015-09-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'T0eCT9pLkMc_FDve_hQ1Zg', 'review_id': 'AbCgcbXXsY7m34MHni7KDQ', 'text': 'Arianna was our server and she was a bit busy yet kept coming to ask us how everything was, her service was great. The food was amazing as well I will definitely come back. They had a busy lunch hour yet I managed to order, eat and get out and still had 15 mins before going back to work. That right there is great service if you ask me.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-09-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1fLrn5_XuvQl43h3byJvBw', 'review_id': 's559TygBLYXreDWJwyuHrQ', 'text': "Nothing too exciting.. I've been to the other locations and the waiters or waitresses are usually on point. When I came to this one, I felt rushed. We weren't ready to order yet and they kept asking if we were ready. Probably 4-5 times. Towards to end I wasn't even done with my plate yet and the waiter already asked if I was done. The food was good, But the service was ok.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 3, 'date': '2015-09-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'd5mtwNq99KLHOo1iyfjTLg', 'review_id': 'WgdbIznzblQfM5T9_aZhtg', 'text': 'I went to this location and it was really good. The staff is very attentive and friendly. It can get busy at times, but that is expected! I will be visiting this location again in the near future. The waffle breakfast options are awesome!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2015-09-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oNkcbqrR02IjMjR7ilv1GA', 'review_id': 'isdmh4n27JkV2LHxfhl0vg', 'text': 'Arianna is awesome! She was very friendly and her service was impeccable. The food was also excellent as usual. 5 stars in all regards.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-09-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lpYevFpeXYvABHkgyzdNiw', 'review_id': 'vPH9aSZLiNOhXjVci0NzCQ', 'text': 'Five stars for Vanessa. She deserves a trip to Disneyland! She was very friendly and kind.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-09-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'imE6vf-kV0BU8MfH7MkLmQ', 'review_id': '_EBpldBDd16yh-3Mtq3q3Q', 'text': 'Good food,not as good as it used to be. My favorite is the egg stuffed French toast and the mashed potato omelette.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 3, 'date': '2015-09-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '67vLTjm5PcU_--PDoNpOxQ', 'review_id': 'aVIkVxN1zB2tqfkrgysTdQ', 'text': 'Food was really good! The service as well ! Had the bacon avocado omelette and it was delicious! Great portions and fast . Menu was really big with a huge selection to satisfy everyone .', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-09-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DFBkWYt9IDVdWtn-jFmowQ', 'review_id': 'mIQQepyUkqDXQKdOIh0jtw', 'text': 'Delicious food and great service. Lisa T was our waitress and she did a great job, very friendly and nice person. Definitely going back!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-09-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JkLvuGO5l1eA0TatmCpFRw', 'review_id': 'l3eW5mojreJO1wi2thdEaw', 'text': 'Nice location, plenty of food and an toy electric train up above to distract the little kids. Good service and food quality is always satisfying.  Used to be a dead corner for this area, but now a bustling area, thanks Egg Works.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-09-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qpAj3s-J8y3I9ZMpMDxQKw', 'review_id': 'NxsBmzw7BUuXWs7YHLYDgg', 'text': '- What I loved about this place ...Excellent customer service \nCollege football games were playing\nPet friendly \nWorks Veggie Egg Benedict was great. \n\n- the blackened chicken sandwich was ok. We will for sure dine at Eggs Work again.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2015-10-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WOuZIlDqgo7GxEI8xIXRiw', 'review_id': 'Ukp09BUPt14M497cpJErNg', 'text': "Really good food in the breakfast-y type realm.  Service is quick and friendly, especially at the counter, and the only hang up is when there is a line to pay on the way out.  I love that they give you a carafe when you order coffee so that you can refill on your time.  I honestly can't think of anything more to say except that I've been here twice now and will be back again.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2015-10-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '84o3A1R7kmLsGh1NtkHUyQ', 'review_id': 'OgfdCzkekzhdDhQCvZbIbw', 'text': "It was good the wait wasn't very long. Staff is friendly, nothing exceptional. The only thing was my Benny was so soggy :/ \nOther than that it was ok.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 3, 'date': '2015-10-11', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 4, 'cool': 4}, 'user_id': 'XKpt8Iqx2crVZvrdhuzJYg', 'review_id': '36aLYiAWlvbMwM7qe7Mksg', 'text': 'Yep! Still my favorite place for breakfast.  This local franchise consistently delivers a great meal no matter which location you visit.  This was my first time to this location in Summerlin.  I think I prefer this location to the others simply because it was quiet an calm. \n\nOur server was very sweet and efficient.  Our food was delivered to our 6 top very quickly.  One of my absolute favorite items on the menu is the habla Diabla potatoes. I can never make a visit without munching on an order. \n\nAnother great feature about this location is the pet friendly patio with a great view of Town Center drive. How exciting it is watching people navigate through the traffic circle.  Not as thrilling as watching a Russian dash cam video clip but close enough.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-10-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'v5IN-oADModRxyjo60k6mg', 'review_id': '-g52K_KXI9NSEU-PZsMxOg', 'text': 'Tried Egg Works.  Banana muffin "appetizer " was a great way to start the day! Then we followed it up with a skillet that was made huge to share!  Ready to go take on the day! Our server Kelli was AWESOME!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2015-10-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'bU6QpOr3Kr1-nNgno7k4Zg', 'review_id': 'L0pVkCY6ovAGcPdT3yIaXA', 'text': 'Egg works is always great, we had the loco moco and absolutely devoured it. And of course the banana nut muffins were on point. Josh was our server and he was great, attentive and friendly. \n     We come here all the time and will continue to do so. Breakfast... The most important meal of the day, get it at egg works.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-10-23', 'type': 'review'}
{'votes': {'funny': 6, 'useful': 4, 'cool': 3}, 'user_id': 'EhcZKrQJIS226xdm_qJ71w', 'review_id': 'tgs_ZZkBGMcWXIH7kACq8A', 'text': "Great place for a hearty breakfast!  3 1/2 stars...nearly a 4!\n\nThis Egg Works is in the middle of blink-at-the-roundabout and you'll miss it part of Summerlin!  It's like a needle in a haystack!  But finding this popular breakfast locale was worth it!\n\nCame here with the fam on a Sunday of all days and even in the upper boonies the place was crowded.  Like super crowded!  But thankfully even though many of us had to wait outside, it didn't take Egg Works more than 15 minutes to seat us.  And we got a lovely table on the outside Richie Rich Summerlin air!  Ahhhhhh....breathe in the wealth!  And the occasional fumes of Ferrari's passing by.\n\nIt's easy to see why this Egg Works is so busy.  It's basically the only one in this part of town.  Plus it caters heavily to the breakfast/brunch crowd.  Plus, apparently folks actually like the food!  It's got a lot going for it.\n\nUpon being seated we were promptly helped by the wait staff.  Our order:\n\nME\n-Original Breakfast Burrito ($9.95) - Flour tortilla stuffed with 4 eggs, diced bacon, bell peppers, Habla Diablo seasoned potatoes, cheddar & jack cheese.  Waiter also suggested I add avocado in my burrito (a $2.50 upcharge!!).  Comes with a side of more Habla Diablo seasoned potatoes & Habla Diablo salsa.\n\nWIFEY\n-Santa Cruz Skillet ($10.99) - bottoms layer of Habla Diablo seasoned potatoes, topped with seasoned chicken breast, chorizo, green chilies, onions, and home made Santa Cruz sauce (whatever it really is I don't know).  Topped with a dollop of sour cream, melted cheese & 2 eggs over easy.  Also comes with your choice of toast of banana nut muffin (she chose muffin).\n\nKID\n-Waffle Works ($9.80) - waffle served with 2 eggs any style (over easy), with choice of ham, bacon, or sausage.\n\nPlus with check in on Yelp we got a complimentary banana nut muffin to try!\n\nFood was good but it did take a bit of extra time to come out possibly because we were either on the outside patio or because it was just slammed at Egg Works that day.  \n\nMy breakfast burrito was definitely hearty, it was huge with the addition of that expensive avocado!  I was only able to eat half, I had to take the other half home for later.  Flavors in the burrito were yummy, fresh scrambled eggs, good quality bacon bits, fresh veggies, spicy potatoes, and more than enough cheese throughout.  Topped with some of their Habla Diablo salsa & house hot sauces this breakfast burrito was pretty top notch!  The side of extra Habla Diablo potatoes are really tasty, seasoned with a nice kick & cooked crunchy on the outside but still fluffy on the inside.  \n\nWifey liked her Santa Cruz skillet very much.  Chicken was grilled but not dry, chorizo & that Santa Cruz sauce gave the dish some extra flavor and a punch of heat.  All that with egg yolk running down?  Oh yeah, yum city baby!  \n\nKid thought the Waffle Works plate was OK.  It really wasn't anything special to write home about, pretty par for the course.  The waffle was a bit cold, and tasted like a basic waffle to her.  It was just alright, but they forgot butter!  So her first bite or 2 were dry.  Bacon & eggs weren't anything special, just bacon & eggs.\n\nWe were a bit disappointed with our banana nut muffins though.  I thought they would be brought warm to our table but they were cold.  They could have used a pat of butter as well since they were on the dry side.  So the muffin was somewhat forgettable.\n\nOne thing that may bother the value-conscious is the prices here at Egg Works.  For breakfast they be on the high side!  To get a decent meal will cost you near $10 per not including any drinks.  And if you upgrade your burrito like I did with avocado, it will set you back over  $12 not including tax!  But keep an eye out on Groupon, they do promotions for this place often.\n\nWith the varied menu at the Egg Works we'll probably be back again.  They do Hawaiian type food here too, get a Loco Moco or some SPAM & Portuguese sausage for breakfast!\n\nWe'll be back!  If we don't get lost in a roundabout first.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 3, 'date': '2015-10-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yC4rTQWnCGXo0V94yJH3PA', 'review_id': 'FflfE2nWqNBkAzlHHkdjaw', 'text': 'Nicole rocks!  But one thing to consider would be having the little train make a stop at Starbucks to get coffee.  We need stronger coffee here. Just a suggestion.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-10-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5VIcEkgGsjLfm5MaYN4eAQ', 'review_id': 'cMQcpBWhtRKt7wr835jJ7w', 'text': "First time while in Vegas trying this place and this will be the place for when I move out there to go for breakfast! Totally with the wait! And their banana muffins they are so good as well! I haven't been to the one in Saint Louis but will definitely go back to this one the service was great and the food was very well prepared.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2015-11-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yMFGR95BtMWSQTc6ce7uuQ', 'review_id': 'I2Bk84V-0IPq4UJJWcdS9Q', 'text': "Thaynara has been our server many times at the Village center location.  She's a great server,  very attentive,  quick and friendly.  I love seeing everyone work together by the bar as well.  She is an awesome server and we'll definitely be back!  Thanks Thaynara!!", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-11-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vjXde2Qm8GqX9cS9mteefA', 'review_id': 'sY8h96f2zIkwJMQvmH3UXw', 'text': 'Maryann was our server... She was the best!  So friendly and up beat.  She was very nice to us and since it was our first time there we got yummy Muffins.  I got the iced tea and Maryann gave me a full pitcher on the table. Restaurants never do that! The food was delicious and at good prices. I have leftovers for a dinner tonight.  Thanks again Maryann for a great lunch!  Five stars all the way!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-11-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '9v22Hof1cICEkLK0Ls3g0Q', 'review_id': '1UfSAw7x4_f8B4Atfw2rhg', 'text': 'Needed a high protein love carb option and Nicole hooked it up. 3 pigs with no cheese. Great customer service.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2015-11-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rYa-cqXLAlSXQ0qyurSJfw', 'review_id': 'Wbwi0Eyi8bWlTEEd88tjYw', 'text': 'Nohemi was an awesome waitress. She was very personable and funny. This place is super cute, great food, and great service.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-11-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cWF-H8A3ROFJ8asqnZ5iow', 'review_id': 'Idp2qvwJV-AKrPdLKrf8pQ', 'text': 'This place is amazing!! The food and the service are top notch. You will not be disappointed.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-11-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'Mhlo8hKUnTbk2zTREqGgMA', 'review_id': 'KjbuH7kVZx5t1Cv_t7aKtA', 'text': 'One of my favorite breakfast places. I like the Veggi Benny. Check in and get a free banana nut muffin.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-11-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_JVkJtFSU1oQucsKUpczpw', 'review_id': 'RVKoxMzD_bwjKX7EkhryDg', 'text': 'Nohemi was great, attentive and friendly. The Spinach Benny was delicious. Great food, great atmosphere.  Highly recommended.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-11-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'uuCCRj9qpJw5YCqFAEUM5g', 'review_id': 'hIxhPVJ37LklhIVncZxDug', 'text': 'Great customer service & great food! My nephew enjoyed the train they had rolling around the building , great vibes', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-11-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'etHf6vNPciivN2179oSBwQ', 'review_id': 'OsufpoxSAr8pHWsqwnkI3A', 'text': "Pro Tip: No matter how your customer orders his eggs, unless he specifically orders raw eggs, HE PROBABLY DOESN'T WANT RAW EGGS. The customer should not have to specify this.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 2, 'date': '2015-11-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Gocl-el5ML67HQ44ZUtc2A', 'review_id': '_f8KJjC5DioL1lNbqHhBtA', 'text': 'I come here often and I forget to write my review.  This is the breakfast place to be.  VERONICA is my waitress today today and she is awesome.  She recommended the Chilli Rellenos Omelette.  It looks delicious.  I love the spice because it hurts so good.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-11-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '96uYsX4GLqqHdKz-Xuc4Vw', 'review_id': 'ZmcJmD5dR4zshDiY2sxhaA', 'text': "Got brunch with the boyfriend today and we had a wonderful meal at egg works located in the trails. We had a very attentive and kind server named Curtis. He took out order very quickly and got our food out within minutes! We also enjoyed our mimosas very much :) I recommend trying the mimosas here because of the large cups they come in! You definitely get your money's worth! Awesome meal.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-11-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3VlzGnE3XMPDKX7EBHwj9g', 'review_id': 'ZTxt466EpnpYrIROWWig1g', 'text': "Curtis has to be the best server I've had at this restaurant, if not the best one I've ever had. Super nice and cool, he's courteous and quick with his customer service. There wasn't a time where I was sitting there waiting for someone to come by because he was always walking around checking up on every table. My girlfriend and I sat down at a table for two and Curtis was nice enough to push another table together to give us more room knowing these 2 person tables aren't the biggest, he then took our drink orders and food orders. And within a minute he had our drinks and literally another minute passed and out food was already out. I've never had food come out that quick unless I was at a fast food restaurant. Seriously the best server I've had. If you can ask for a certain server when you come here I would choose him, I ensure you you won't be disappointed.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-11-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '2j1Wam4U4QbIdn1Cou-HUQ', 'review_id': '65u_ILFxx7L6xcG_vrujYw', 'text': 'Always awesome food, excellent service, and so happy to have a Summerlin location now!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-11-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3CHnbZSJle7KnfTvC8i8Sw', 'review_id': 'I0r1Kxn-KRZX4BiruGq1jA', 'text': 'Curtis was an awesome waiter!! The food was served quickly and he was attentive to our every need! The potatos are DELICIOUS!! I will certainly be back here!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-11-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IlVP2CHI0NMkuEi76TynTQ', 'review_id': 'nyfaBGqeuMTJNRIz0U4REA', 'text': 'Great breakfast spot. Rarely a wait. The service is wonderful and the breakfast is all American yummy!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-11-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'v0108qZkMcNm_BB7hvV2ng', 'review_id': 'sx6hVKAcCDBUU8xGrvmBVA', 'text': 'Had the Chile Relleno Omelete with the sauce on the side. It was amazing as was the service by John.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-11-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kY46ecd-TXnyLPYjADVVCA', 'review_id': 'lF7n0gPug1CjQzW8gtt-eA', 'text': "There's so many delicious items on the menu, it's always hard to decide what to order - but no matter what you get, it's always been delicious. And our waiter Patrick was super friendly and made the experience even more enjoyable. Thanks Patrick!", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-11-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0VGaEEt99FpSbYI6S9Cjxw', 'review_id': '302kkM4v9GF9S7Yu-x6YPQ', 'text': 'Tried this place for the 1st time today and it was awesome!!! Curtis was our waiter and he was fabulous, service on point. Food was very tasty and I was made to feel very welcomed and never once did I have to ask for a refill on my drink. Omelets 5 star, muffins super yum, biscuits & gravy was just ok thou. Over all great place will come back.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2015-11-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lpgokAK9sP_RwL3KrUSkAA', 'review_id': 'RjlhOBavs385NATRKgeiMw', 'text': 'The food was to die for! Curtis- our waiter treated us with impeccable service and very knowledgable when it came to the menu. The eye candy was definitely a plus! Will be returning :)', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-11-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KwNE6g-_EPCcXJ3TT29h0A', 'review_id': 'hRBnbQwAviBlxmyreTdAgw', 'text': 'This place was delicious! Everything was on point! The service was great! Curtis- offered impeccable service and very knowledgeable when it came to the menu. First timer here but will definitely be back! :)', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-11-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uFdWgGsuhWYvr3AA4CZizA', 'review_id': 'vcxUrXTkZ8zRv1ew9H2veQ', 'text': 'Super service from Curtis at the Summerlin Egg Works! Family friendly restaurant with prompt & friendly service all around. The Country Benny is our favorite for the grown ups and the mouse pancake for the kiddos. Will make this a regular breakfast stop for sure.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-11-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'W_dPXfQnK6EUITgN9kZi6g', 'review_id': 'RYdUW6QNJJNb1O4U7rkedQ', 'text': 'Curtis was f***ing awesome! Supreme cuddler of my taste buds. Utmost chivalrous to my culinary wants and needs and most of all, a curator of all that is amazing! \nHope life awards you greatly just like you awarded us with superior kindness and service.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-11-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'I95DpQeHxSUAB6x61xCFPw', 'review_id': 'KRdCW_xTRO4N0o74OIR39g', 'text': 'Nice atmosphere, no rushing and very friendly and efficient staff. Menu has many choices incl vegetarian, and Hollandaise on the side (if you dont want your food drowned in it)', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-11-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Q2vLrbvqilnA7lGg3P_iIQ', 'review_id': 'sxwc_AYCzAUGVAPuf2Rrqg', 'text': "This is mine and my boyfriend's regular breakfast place. We've had Curtis as our waiter several times and have never been disappointed. Although he wears a Colts jersey and I'm from Chicago and I haven't forgotten the events of 2007, Curtis is a stand up guy!", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-11-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4zswyTPhlFG6rfZKiWjv0w', 'review_id': 'kMXTle-sM688Izxin8WSyw', 'text': 'Curtis was super friendly and is a great server! Food was great and delicious coffee. Thank you Curtis!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-11-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'j9FFRIvY368ulo_RHbNt_g', 'review_id': 'yv3URy5wRX1L1q2Z5zTfOg', 'text': 'Great Food!  Great service from Curtis.  Always a good experience.   Bloody Mary and breakfast, how can you go wrong.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-11-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wUuN6KrNfKVS7UyUdkvnPQ', 'review_id': 'JtueXIQ33xgdj6u8vsv_Eg', 'text': 'If you want to have an awesome dining experience ask for Curtis Oglesbee. He was absolutely the best!! Food was great too!!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-11-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SwNW0FGoDz7SKHmnmBV_Fg', 'review_id': 'YYe8o6a0oagYGdIwzB24QA', 'text': 'Friendly staff (Veronica is great!) and wonderful food with ample servings!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-11-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8kV-IYtbvuNzcpcBF2Swpg', 'review_id': '192UPpt8RKOaTDdk5FXNBg', 'text': 'Great food and great service always at this location.  Never a long wait even during peak hours. ....Thank you Curtis !!!!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-12-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Kzb6owyvQP-MKie4zTsM8A', 'review_id': 'UatmV8nApCK6nEri_H_Brg', 'text': "I came here for brunch and everything was fantastic. The chicken enchilada omelette was mouth-watering and the service was top-notch. Patrick, our server, was great and brought out a few slices of banana for my baby nephew. The Habla Diablo verde hot sauce on the tables was super tasty too. Everything was very affordable, especially considering the portion sizes. We'll be back when in Vegas!", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-12-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Gocl-el5ML67HQ44ZUtc2A', 'review_id': 'qYDrWnxpxiSEGCdnQJ2SWw', 'text': 'Came here and was served by the lovely VERONICA again.  She gave me another great recomendation: Santa Cruz skillet. Seasoned chicken breast, chorizo,  green chilies, onions, sauce, and sour creme.\n\nDelicious.\n\n5 out 5 stars', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-12-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'z_8Flx8CsQeSAvd34DLOMA', 'review_id': 'q9NUKepCIaiS0ISAQ-F9Vg', 'text': '1st time here and I love it! Fast and efficient service, good food too! Nice place to have coffee and enjoy the morning! I got the veggie Benny and it was delicious!!! I will be back 4 sure', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-12-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'etHf6vNPciivN2179oSBwQ', 'review_id': 'JpeJXBAqhsD6MSPCy_WyvQ', 'text': 'Gave them a second try. The Moco Loco was fantastic, and this service was first rate as well.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-12-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'G7KgrbPdid0xC8oms7c1eA', 'review_id': '3PsX9IIwscEMSeCgBlS6WA', 'text': 'Love this place. I always get the Egg Skillet. I love thier coffe. Their breakfast potatoes are amazing. Curtis was very helpful', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-12-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oT6bsDNiyzUlILO58_yrHw', 'review_id': 'vZlh-WRPcugZMUsn88IT8w', 'text': "Always delicious and John has super customer service! Always feel like part of the family here! I went to an old favorite  the five way chile. It's so delicious! I like the cincy chile but the works is my favorite! See you next time Egg Works!", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-12-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'csM4zsMRFfDJcAH22Bm1hQ', 'review_id': 'tkoIGzZLicbQ7lEZpx0hpw', 'text': 'We had breakfast this morning and it was delicious as always. Our server Curtis was very courteous :)', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-12-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'a033ob7SETE6UqW10RLgng', 'review_id': '7zVEegnkDRvd3wEnTumbDw', 'text': 'Our favorite weekend place!! Food is always good  & service is excellent! Especially today, we had CURTIS, as our server!  Fast & Friendly!  Thank you Curtis! Seebyou', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-12-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-8OPZkxaJ8Lq-1Rj8vsgDA', 'review_id': 'VNwZV-bTSo4GFK9AUEK9iw', 'text': "The food and service are fantastic! We come here every weekend and have never received bad food or bad service. All of the employees are very accommodating and helpful. Our server Curtis was very pleasant and had a great attitude. I'd recommend this place to anyone looking for a great dining experience in a great area. They even have a dog friendly patio the we bring our dogs to in the warmer weather.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-12-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ed-etdtj3EqRaR8lZ8TQig', 'review_id': 'SAvBDXSD69A-3p3muDe-gg', 'text': 'Went on a Saturday morning with my family.  I love that I could order a great burger while the others had traditional breakfasts!  Even though it was fairly busy, our server, Curtis was really attentive and took care of our requests quickly and with a great attitude.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-12-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'M_cDcw2jR4r3k6Q830c43g', 'review_id': 'Gyvg5QLewlfIF-Rk8wQzMg', 'text': 'eggs dont really do much work here cause they dont have hands.....you know what does work though? CURTIS our server, dude is like a human dynamo of smiles, help, and delicious foodstuffs. this place is the bomb.the works potatoes are pretty much the business, and this place serves loco moco and cincy chili...........bruh!  oh did i mention you  can bring your dog to eat on the patio? yea you heard me, get scruffy some fricken freeeench toast. curtis you are the man we will be back soon.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-12-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lgENn9Opmbal4x72sUze5w', 'review_id': '5Fpm2e9EqNwAdPG_kOboEA', 'text': 'Our favorite breakfast spot. Our server John was amazing!! The Bandido Scramble is delicious and we LOVE the mimosas!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-12-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UwMTqyPbXjBCUXqZHeFRPg', 'review_id': 'qYpwweCvvmUBOJXYnoqotw', 'text': 'We love the hash brown patties and our server Veronica. The electric train that goes around the ceiling is cool too.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2015-12-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Fep8SuoM8gIqWXqp4vP30A', 'review_id': 'XF0BfbErwhcwyJ092chPLA', 'text': 'Thanks Curtis for such speedy service with a smile! The meal was fantastic. We come every week because of the talented staff and great food. Merry Christmas!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-12-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ScCO9VxKe61R6oh3DbFMfA', 'review_id': 'tUGw1_2W_eQNnaf1Y8VDow', 'text': 'Curtis was very "Curteous". As usual, food was great and I had a great time with my amazing daughter.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-12-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Gocl-el5ML67HQ44ZUtc2A', 'review_id': 'Ed_rRdt_jrLb0w6CvAi_PA', 'text': 'Today, our server Thaynara.  She recommended the skillet, THE WORKS.  Delicious.  She is very charming and attentive to our requests.  My cup was never empty with such great service.  The works was flavorful and filling.  I will be returning.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-12-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2MfOxr17iC_jRqERBUQNAg', 'review_id': 'DxwzcIJynHD7gJV2uQZ07A', 'text': 'Egg Works is difficult to rate. There\'s a lot to like here, but, at the end of the day, does the food taste good? Meh, I\'ve experienced better.\n\nThe service has always been amazing. Thanks to the Egg card, I never have to wave anyone down. Just flip it and someone will be along.\nWhen you order coffee, it\'s $2.75. I find this to be pretty expensive. However, they bring you a whole carafe.\nThey don\'t do said cubed fruit if you want an alternative to potatoes. Just freshly sliced, tasty fruit. \nPortions are huge, and the hot sauce is so good I  bought it.\nThe omelettes are huge, and made from high quality ingredients.\nWaitresses  have NO problem customizing your order within an inch of it\'s life.\n\nUnfortunately, the food is bland. I love the potatoes, and the fruit.. But biscuits and gravy are a little off, the biscuit being too airy, and the gravy just missing something. The omelettes, no matter which one I get, never seem to have any flavor. Good ingredients, but they don\'t season it. To be honest, Baby Stacks is far better.\nAlso, I\'m not too excited about the whole "Send your server to disneyland with a high review"  thing. I think that\'s leading to this place being way over hyped.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 2, 'date': '2015-12-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Evtao6dbEOOgKAdFY9yXnw', 'review_id': 'YWr02F2kc8M4OOi6ZEGTkw', 'text': 'John was a great waiter! He needs to try my famous avocado and toast! He kept the mimosas flowing and that We love', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2015-12-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Z0M9w94AeNofSiUlDLQvvQ', 'review_id': 'H6MHD3mjy_K5YqD_SOAG7g', 'text': 'John was my waiter and was so awesome. He recommended the Crazy Chicken and it was the bomb!! Mimosas are to die for. Thanks John great time.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-12-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lgENn9Opmbal4x72sUze5w', 'review_id': '7TbRFpyNzyxgbJ_-VX7uUw', 'text': "Our favorite breakfast spot. Our server John was amazing!! The Bandido Scramble is delicious and we LOVE the mimosas! \n\nBack again!! We love this place!! And we love our server John so much that we came back and requested him! He's awesome!!", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-12-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lwcnENmfN07ZNwEAfI2Ynw', 'review_id': 'u2QV-irjNGAOi66bpFPq_g', 'text': "Hosts have no clue what they're doing! Promise less and over deliver! If it looks like a 10 minute wait, offer 15. Be honest with patrons!!! Seat fairly, push tables together if you must!!! Maybe some more training, or put a manager there.....", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 1, 'date': '2015-12-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cY4DgAtcHI7r1aG1pwMldg', 'review_id': '6ndRx7G8uFaTOodV9LW3FA', 'text': "JOHN was our server. We ordered Prime Rib Bene and The Works Eggcrepe. JOHN didn't believe that I would be able to finish The Works egg crepe. Proved him wrong when he came back to give us the check!\n\nAll kidding aside, the service and the food was great and this is only our 2nd time eating here. We'll definitely come back soon!", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-12-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zyE3Dex4Jf9etey99R4D0g', 'review_id': '109bmildhhS5NkM5SmO2ow', 'text': 'Awesome biscuits and gravy. The bran muffin is a hit. Excellent service with Curtis as a standout. Excellent start of the work day or relaxing weekend.', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-12-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_oZExq82b7ZOIZCFQxN9GA', 'review_id': 'sBPIKfhqXY-FMKyo1auVHQ', 'text': "John was awesome today, great, knowledgeable, friendly service and had the best suggestions! He brought everything we asked for and didn't forget anything. Will be back and hopefully we can sit in his section again.", 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-12-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Yf8WTQ3vVNAzbxGb-Tt0Qg', 'review_id': 'DBHLn5p7pe2QtudhrZK5-Q', 'text': 'Love the breakfast here!  My favorite thing to get here is the loco moco!  I have had it many places and the gravy usually kills it but here it is the absolute best!  Service was great!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-12-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'FKOcIu_mK2rqLyWm5MqCkQ', 'review_id': 'KrQFc1nXZq68PgaAPBeWeA', 'text': 'This place rocks! My party of five had a wonderful time dining at this restaurant. For a party of 5, we were seated pretty quickly on a Sunday morning. I like the idea of having menus in newspaper form: old-school, yet creative.\n\nI had a chicken enchilada omelette with potatoes and it was absolutely delicious. The addition of salsa and tortilla strips in the omelette were a great addition and added some great texture. The potatoes were seasoned nicely and had a good flavor to them; not much of a "kick," but enough flavor to make them something special.\n\nThis place is not too loud, but don\'t expect any silence; what can you expect from a place that is packed? A great place to have a meal for breakfast or brunch. Too bad this place closes before dinner!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 4, 'date': '2015-12-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LhYiNE5ubeu_FwO8WcavxQ', 'review_id': 'nDANht0HBkqzt5HvX5cRZw', 'text': 'Came by after seeing high ratings, and boy did this place deliver.\nOur server CURTIS was amazing with a charming smile and the food was fantastic and fast.\nI ordered The Works omelette with a side of the seasoned potatoes and it was on point. I also had a small stack of the butterscotch chip pancakes, which were delicious and fluffy.\n5/5 would come back again!', 'business_id': 'aTwYIgWQUfoa2HobcjodTw', 'stars': 5, 'date': '2015-12-24', 'type': 'review'}
