{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'DJIwm4UCnM-SOxXbARjPsQ', 'review_id': 'ZoE_FK7_77zGaN41oL0VVQ', 'text': 'In my quest to try all the restaurants on 7th Street near my house, I decided to check out Pizza Heaven. Pizza Heaven is another one of those hole-in-the-wall eateries that you hear about via word-of-mouth. Oh sure, I can sit here and spout out multi-hyphenated phrases all day, but in the end, Pizza Heaven is a great little place to get a slice or two.\n\nYou can do just that. Their menu offers pizza by the slice. Or if you\'re in a mood to share, you can order a whole conventional pie. Each slice is individually baked, so you should allay those fears of eating something that\'s been sitting under a heat lamp for who-knows-how-long. They come out of the oven piping hot and delicious. The ongoing daily special is Two Cheese Slices and a fountain drink for $4.00. Toppings are 50 cents extra, per slice, which is still not a bad deal if you want to add pepperoni and still not break the bank.\n\nI first heard about Pizza Heaven when some of my coworkers, during their several-times-a-week (I\'m trying to stop with the hyphenates, honestly) ritual of ordering take out, started to pass a menu around. Now, I may not be accustomed to traditional Italian calzones, but something that caught me off guard was the fact that the calzone came with ricotta cheese as opposed to mozzarella. On recent visits, I\'ve specified mozzarella be used rather than their default of ricotta. Other items ordered by my colleagues included Angel Bread Sticks, Meatball Parmigiana Stuffed Sandwich and the Insalata Caprese. There wasn\'t one item that they delivered that didn\'t look good. The menu also offers a whole wheat crust option and you can order your pizza with soy cheese if you feel the need. Other items on the menu I have yet to try include various pasta dishes, chicken wings (your choice of Mild, Medium, Hot or the painful-sounding "Suicide" variety) and desserts which include Cheesecake and Tiramisu.\n\nI had actually eaten Pizza Heaven\'s dishes several times before actually setting foot in the restaurant thanks to their quick delivery service to my place of business. When I ultimately made it there in the flesh, the first thing I noticed was how clean it was inside. The menu touts that Channel 3 News gave them the distinction of  "Cleanest Kitchen in the Valley". I would have to agree that if the kitchen looks anything like the rest of the interior, then they keep things in excellent and sanitary condition. The restaurant has also been awarded New Times "Best of Phoenix" award and although I haven\'t tried too many other local pizza places, I would have to agree that the award was well-deserved.\n\nFor those of you who don\'t want to pull yourself away from the comfort of your couch and your precious XBox, you can have your food delivered for a minimum of a $15 order. Whether or not the driver will be gracious enough to feed it to you so you won\'t have to pause your gameplay is entirely at his or her discretion, and I\'m sure will require a larger tip.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2007-01-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': '4_YfcfHkCem1onJFkItxjA', 'review_id': 'yp6oqAbvfF_lp2aV6Xfl8g', 'text': "Now, I can think of several places in town that serve amazing pizza - La Grande, and Pizzeria Bianco come immediately to mind.  But Pizza Heaven gets 4 stars for other reasons.  It's cheap, tasty no-frills kind of pizza , with something for everyone.  \n\nThe pizza itself is thin crust with a nice crispy, yet doughy taste.  The ham, cheese (very good cheese, btw) and mushrooms I had on pizza tasted fresh and the toppings were generous.  \n\nSomething that sets it apart is the wide variety of toppings and the restaurant's perceived desire to offer something for everyone.  The menu includes more than 20 veggie toppings, lowfat cheese and soy cheese upon request - something you don't find much of at a pizza joint - much less the fancy pizza palaces of Phoenix!  \n\nThe decor inside is very simple - chairs and tables - no booths.  They had the basketball game on TV in the background, and even have a live band on Friday and Saturday night - not sure on the type of music.  Give them a call to find out.   They serve the normal selection of pizza, pasta, subs and salads and even have a limited offering of beer and wine for the tipplers out there...\n\nBTW: The location is new - having relocated up the road to bigger digs (now at 5150 N 7th St. betw. Camelback and Missouri).", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2007-03-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'TrG08JZdZD1WjC1QLfId8Q', 'review_id': 'BqtlV_TaxQOhEc7ZajlK-w', 'text': "Pizza heaven first caught my eye at it's original location, on the corner of Highland and 7th st.  The building was old, fairly cramped and didn't have much to offer in aesthetic. However, as I could very nearly hit it with a baseball from my condo, I had to at least give it a shot.\n\n I was not disappointed. \n\nThe pizza, wings, pasta and sandwiches are all excellent, and every employee I have encountered has been very friendly. The restaurant has now moved up 7th street to a new location that is more representative of the quality of the food and service. A great place to grab a quick slice for lunch, or a full pie and a beer (or six) in the evenings. A flyer in the restaurant claims they have live music on the weekends, although I haven't yet witnessed this.  \n\nOverall, great quality and variety. Pepperoni, mushroom, pepperocini on wheat crust FTW!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2007-08-27', 'type': 'review'}
{'votes': {'funny': 6, 'useful': 4, 'cool': 2}, 'user_id': 'A_O8wZOsMTPwyeYA4-Rsow', 'review_id': 'WoQNr4aMTPEIj9_hOBnT_Q', 'text': "Pizza is like sex.  Even bad pizza isn't half bad.\n\nWell my first girlfriend and this place have proven that old age adage NOT to be true.\n\nZero, and I mean ZERO flavor in this pizza.  I'm all about the sauce and this sauce has the distinct flavor of water.  And where in the heck do you find flavorless Pepperoni?  Where ever you do, that's where these guys shop!\n\nYikes!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 1, 'date': '2008-02-07', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 1}, 'user_id': 'RMX11FC48KZTYIeExtGUCw', 'review_id': '3AOT5M-XGSpnP0OeoqsyaA', 'text': "I just had to chime in with Dave to balance out the ratings on this place. It was some of the boringest (is that a word), blandest pizza ever. I've had better frozen pizzas.\n\nNot only that, the one time I ate there, the dining room was cold as the Grinch's heart, and there was a REALLY-LOUD-TALKING lady there, whose voice boomed throughout the entire establishment.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 1, 'date': '2008-02-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'N7lSh49zQ13sG3Jpa9E6cw', 'review_id': 'dVr_OH78U-w5Sweg_6xK0g', 'text': "We heard about this place from some friends when we showed up to their place, and there it was- Heaven in a box. \n\nWe had it delivered again last night, and it was still damn good. \n\nThe chicken alfredo pizza is amazing. It has just the right amount of everything- moist chicken, alfredo sauce, spinach, parmesan- and nothing is overwhelming or too rich. \n\nThe Queen Margherita was a hit too- basil, tomatoes and buffalo mozzarella- wow. I could have eaten the entire pie myself. \n\nThe prices are on par with what you'd expect to pay at Z Pizza, and it's worth it. The crust isn't greasy at all- it's perfect. \n\nThey have other things- sandwiches and salads, etc. but I haven't ventured beyond the pizza section of the menu yet. \n\nThey do deliver, but sadly for me I live two blocks south of the cut off point. Boo hoo.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2008-05-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 4}, 'user_id': 'CAlxnkAuqNetlUmWtCQ_eQ', 'review_id': 's8w6DRIeVgTvG3CWZDseTA', 'text': 'I have only had the pizza delivery from here, but damn, was it good.\nNot cheap, over $40 to feed four us, but well worth it.\nIt was hot, it tasted fresh, the ingredients were great.\nWe had the chicken alfredo pizza, which I was skeptical of. Alfredo has a tendency to be rich and over used. But it was a perfect balance. Absolutely wonderful.\nThe Queen Margherita pizza was awesome also. Again the ingredients were fresh and flavorful and the cheese was awesome (they use buffalo mozzarella).\nI say pizza is like sex. And this place is one helluva orgasm.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2008-05-31', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 4, 'cool': 1}, 'user_id': 'SKiS7vpxynSwHaRMGzg53Q', 'review_id': 'TQxou8F5muT8Uk7NoQcMcA', 'text': "This place has the worst fuckin service period!. The only reason I continue to eat there is because the food is bangin!!!.. This is the only place I know of where the delivery driver answers the phone,takes your order and then asks for a tip before the food has even been delivered, that's rude in my book. I will probably end up with a lugii in my food when they read this post. I have eaten in the actual restraunt too and have too admit the service there was also shitty. The only reason I have to put this negative review up so hopefully they will fix their problems, I am pretty sure anyone who has ordered food from here has had a simular experiance as my family. Food is good though and I would rate the food a 10 out of 10. If  you read this post pizza heaven please don't spit in my food next time I order.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 1, 'date': '2008-07-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'F9HbpJhKDPRz8qGLqPX-8Q', 'review_id': 'fY7M4uKobfx0PwXreKZQQw', 'text': 'Terrible! Wings tasted like they were all made at the beginning of the day, then reheated when sold. Pizza was below average. \n\nWasted $22', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 1, 'date': '2008-07-13', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 2, 'cool': 2}, 'user_id': 'C6IOtaaYdLIT5fWd7ZYIuA', 'review_id': 'z_uXoGeBT3fNjkJwTgE4Nw', 'text': 'it is a really cool place. Good Pizza but nothing crazy. Great for a quick lunch. \n\nJust watch out they only take debit if it is over $5. The lunch special is not over $5. DUH... raise the price to $5 stuuupid. Also if you want a cup togo ... $0.25 more. They are rude and to the point but in a Ny kinda way. \n\nThey do serve Mt Dew and have WIFI for free. (the code is 1234567891, incase you live near here lol)', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 3, 'date': '2008-11-13', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 2}, 'user_id': '6gaUsuUzNnRLXtMQVdxX5g', 'review_id': 'jseMdomG5iwFKBdX81CSbQ', 'text': 'I worked in Pizzerias for years. I am ALWAYS on the hunt for decent pizza wherever I go. I have traveled extensively and am a big fan of "New York Style" pizza and even better, Northern Italian and "Neapolitan" style pizza.\nSo I like to think that I know pizza.\nThere are certain things that can make or break a pizza: Sauce being the biggest. Followed closely by cheese and dough. And then the freshness and variety of ingredients. Of course if you are a diner, the atmosphere and service and also make or destroy a meal.\nI don\'t give 5 stars lightly!\n\nSauce: the dude that slammed the sauce here must be out of his mind. PH\'s sauce has the perfect "marinara" flavor with just the right amount of "zing". One of the best anywhere.\n\nDough: Brick-oven baked to a prefect golden brown...not too crisp, not too doughy...and clearly fresh. We tried the whole wheat as well. Nice flavor...\n\nCheese: We tried both the regular and soy cheeses in the many times we have eaten there. I always order the soy cheese now for health reasons. But even the regular mozzerella is not just some "lets-get-the-lowest-priced-mozz-we-can-find-cheese". You know what I am talking about: more grease and no milkfat. The cheese they are using may not be the best from Italy, but it is certainly a flavorful "creamy" mozz.\n\nIngredients: Pizza heaven does not lack fresh ingredients. They make their own sausage (my fav). While the pepperoni isn\'t the best I have ever had, it is certainly flavorful and not too greasy. I often like a pizza with a load of toppings... The Works! (With anchovies of course) But I typically try to eat healthy. So it is usually a White pizza on whole wheat crust with fresh spinach, tomatoes, red onion and artichoke hearts.\n\nI have watched this family-owned restaurant grow from a whole in the wall to a service restaurant with live entertainment, WiFi, and fast delivery. I can\'t get it delivered any more, but still enjoy dining in. I have never experienced "bad" service. But I would imagine any restaurant is going to have some of that now and again. I have always been treated well, with a smile, and gotten fast hot food. This is no suit-and-tie establishment. But for a great pizza, some great wings with a coupla beers, you can\'t miss. Been eating here for over ten years.\n\nA true winning "bistro".', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2008-12-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'AzGhWXjSNPYaoeUT5W11-A', 'review_id': 'kVMuQCD0O0Hi0QuYTGQraw', 'text': "Now let me preface this review by saying I am an East Coast gal with over 30 yrs experience in eating the BEST Pizza & I absolutely love the crust (hand tossed of course) @ Pizza Heaven. I was walking back from the Christmas light show and saw the PH sign in Neon Orange calling me into this place.  Right Choice. Since then I have been there weekly and sometimes twice a week.   The crust is crunchy and the cheese is delicately melting throughout.  I always get mine with pepperoni but when ever I spot someone else pizza looking a smelling divine (pardon the pun Heavenly) I change the order to find that I now have another favorite  Ranch Chicken Pizza. Who would have thought cheddar cheese would taste that good on pizza. TRY IT!!!!  One thing, service is different in the day time, counter lady is very helpful in knowing the menu there & that's a plus and when I come during the evening, the sit and be waited on service is not so terrific.The boys tend to sit at the counter and surf the phones and talk with the kitchen staff and forget about the tables. I'd rather come during the day or take out to get better service.\nWish they had a full bar to sit at that would be fun and an outside venue too.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2009-01-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 5, 'cool': 6}, 'user_id': 'C6IOtaaYdLIT5fWd7ZYIuA', 'review_id': 'TuChPGbTkYGnpoSp5CsouQ', 'text': 'Sometimes places redeem themselves.... \nHere is a note I received the other day. \n\n"Thanks to you... \nFYI \nPizza Heaven changed this promptly and do not charge for cups and take cc for anything now." \n\nWay to go guys!', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2009-01-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'AzGhWXjSNPYaoeUT5W11-A', 'review_id': 'XlhsiYoQZj1kEmf6G8I7eg', 'text': "Now that I have been going out a little more since moving to Phx, I have found other restaurants that I feel very at home in. This has been on of my favorites.......till now.............  I usually come during the day time to avoid the   candle light atmosphere. I bring my lap top (WIFI free) but I came in  tonight and found the music so annoying. If only they would get real musicians that sound good while dining instead of the young kid who is ALWAYS there, Don't they ever change their songs.  Pizza still good but anything else is boring like the music. Boring shouldn't be LOUD. I found Cibos and will stick with them for now", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 2, 'date': '2009-03-27', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': '6gaUsuUzNnRLXtMQVdxX5g', 'review_id': 'KPVW4N7x1BP8YJ3ZNLomAA', 'text': 'Wow...for Liza K to give the food an outstanding review only to drop it 2 two stars because the live music interfered with her internet browsing is...bizarre. (They only play on Fri and Sat nights...) Hey, the music isn\'t Top 40 radio play. But when I go there for the food, its nice to have "life\'s backdrop", (which I thoroughly enjoy, BTW) going on. And if I stop by for WiFi, which I have on occasion, I mean, really, PUT HEADPHONES ON IF IT BOTHERS YOU. lol Whats even better, if you think you can do better, liza, they always invite folks to jam with them. Overall, its a fun, family environment not intended to be a \'library\', as the Ricky C put it.\nAs a loyal customer for many years, I will miss this place when I move (Including Eric & Jimmy Lee play those oldie hits). I stand by my last review...best pizza anywhere around. Great atmosphere (yep, even the music)', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2009-04-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '9naiHrcKCUe_YFXyStyL6g', 'review_id': 'ydRKCDuyxlCb2FXMHYFGGQ', 'text': "Good pizza, lousy service!  I have been buying take out pizza from Pizza Heaven for some time now (even back  when  they were on 7th and about Highland).  So I  decided to dine in once.  What a  mistake.  We sat for over 30 minutes and no  service.  The place wasn't that  busy but apparently business  is so good they don't have to wait on customers.  If you want take out, then I recommend  it, but for dining in, forget it.  Hence the two star rating.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 2, 'date': '2009-04-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'FGZkbk4G9lUfBrT4BlsyGg', 'review_id': '4fZCWU7ayi_Zv4zHTwVSWg', 'text': "OK, I think I'm more than a fan of this place! \nA girl I had dated introduced me to, and I have been hooked ever since. Its something in the sauce, try it! So good- and also, some nights they have a band and all the time its free Wi-Fi", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2009-05-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'hHimxg0RrR4--yOwj0mOGg', 'review_id': 'CwOz38nQKV417x6vLMqrlg', 'text': "Good pizza, not the best I've ever had.  It's cheap; you can get 2 cheese slices & a drink for $4. $0.50 per topping per slice.  Friendly staff, but the service is a little bit slow.  My friend had to wait 47 min for his pizza last Tuesday, but usually it's not that bad.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2009-05-31', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 2}, 'user_id': 'N1koTSTyiLCD8zH0rHSh4w', 'review_id': 'hC4tqU_UaAuKVyBDGBSEHA', 'text': 'oh yeah they updated the soy cheese used to a vegan version and it is super tasty! Get some tonight, Vegans Unite!', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2009-06-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': 'Bwo_j9OGpZN60T5HxKOTeA', 'review_id': '_BrKOgsi2jJZLu7XWNCbhg', 'text': "The quality of food here is fantastic. Very good value for the price. They are happy to customize anything for you, especially the pizza. There are vegetarian options. Good salads and sandwiches. Tasty pasta dishes. Free wifi. They sometimes have live entertainment that not everyone appreciates (psst, the musician is the owner's son) - if that's you, just order takeout. The pizza here is better than anywhere else in a 5 mile radius.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2009-06-27', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 2, 'cool': 1}, 'user_id': 'nc3cqVN0UuB3m50-CcMftw', 'review_id': '2s5qgI_aiUlCRrgszx2tgg', 'text': "I moved to Phx in July 2001, having only visited once during December with friends from Ohio/Michigan. When it came time to escape Ohio, initially with a very good friend who wanted to move to Tucson to acclimate us to city life (I was raised in a village of 500+- people, including the rural setting of my parents) and within five years move to Phoenix, just so we didn't suffer culture shock. Remember, I'd only been in Phx for 3 days up to that point in my life, with neither friend nor family binding me to Arizona. However, he decided the week before our departure date that he wasn't ready to move so far away from family. I, however, had turned in my month's notice to both my full-time job as a journalist and part-time job at Wal-Mart (don't judge me! The employee discount was worth it) so had to make a decision: Tucson or Phoenix. It was during the final minutes, literally, that I mapped out my trip to Phoenix. See, my dad's a truck driver and I have some of his ability to navigate through cities and states using this amazing invention called an atlas. Thanks to Grandma O'Neill, I had such a magical device in my possession, and wrote out in a matter of minutes the best route to drive my Kia Sportage and U-haul trailer from Northwest Ohio to Central Arizona, avoiding toll roads and steep inclines. Unfortunately, I had to drive through the panhandle of Texas, where I almost decided I'd had enough and was going to return to Ohio. But, I drove on. And on, and on... \n\nWhat this has to do with Pizza Heaven is simply background information. After 2.5 days of driving and sleeping in a truck stop one night, I was ready to settle in and have a filling meal. A pizza, actually. And something that would inaugurate my coming to a new home: Mexican Pizza. Refried bean and cheese and green onions...it's a shame I couldn't find it on their menu after returning a year later. But, PH managed to offer specialty pizzas that filled that void (almost :( ) and has been a stand-by for several events at a friend's house. [My friend's house is outside their delivery range and we gladly pay the extra fee, which says a lot.] \n\nAlthough I've only eaten inside the restaurant twice, and must agree that service tended to be on the slower side, this did allow our groups to mingle more and enjoy the pizza and wine at our leisure. \n\nThanks for the memories, Pizza Heaven. You've remained solid in my heart since the day I drove into town and stayed at the only hotel on the only street I could recall in this wonderful City. I ;hearts& PHX.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2009-06-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'eMFD4FA8NVAlUAeBl4EVNw', 'review_id': 'tsw_0e1knb8Y4MFAdt36eA', 'text': "I love this place! Great pizza at a great price! This place is clean and for the price can't be beat! Is this place Pizza Blanco? No, but for the location, price and value...well...Delicious!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2009-08-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-yZJr73bAoPtlpHUL7JBzg', 'review_id': 'AJCgadBcF5J9JD9d1SvrVA', 'text': 'The Pizza Bianca with ricotta is worth 5 stars all by itself. I read some bad reviews by other Yelpers about this restaurant and I guess you must have gotten the wrong thing on the wrong day. I love this place.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2009-12-09', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 2, 'cool': 2}, 'user_id': 'l81ILmOhky5bG7o4r3rkhQ', 'review_id': 'k1iEjQYakeWi9QXMjrG55w', 'text': "Judging by some of these reviews, I believe that anything four or five stars was done by someone who went from domino's to this.\n\nI've been to this place several times... it's family owned, it's clean, but pizza heaven it is not.\n\nTheir pizza is good and nothing more.  I liked it, but it wasn't out of this world, I had the Pizza Bianca and it does not deserve 5 stars. It's OK. that's it.\n\nI really don't understand how places like this on yelp get such high reviews, but I have a theory:\n\nPeople who do not venture out beyond their safe zone develop a relative reality.\n\nLet's just say this about Pizza Heaven:\nThere wasn't anything bad about the place.  They have music sometimes, but it's a duo fronted by the owner's son.  They're so-so, just like the pizza, no wrong notes, but I won't be buying their album soon.\n\nI wouldn't come here unless I was invited by someone, in which I would still come, but I can think of 20 pizza places that are better than this and many of those 20 are cheaper.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 2, 'date': '2009-12-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '7_UE_JYM6dXUb_kGeUMRBQ', 'review_id': 'CHSW_yLU2SaQPCFzRLQyYw', 'text': "My fiance and I ended up here after having no luck with finding an open pizza place for an early dinner. \nAlthough this is a little place, quite cramped, with loads of tables and chairs, the staff was extremely friendly and the server was sharp as a tack, and super attentive. \nWe had a simple pepperoni pizza and a Greek salad and we were both quite impressed. The pizza came out of the kitchen hot. The crust was thin, chewy and crispy on the edges. \nI really like this place because it's a no-frills pizza place that uses fresh ingredients. I also like it because it's family-owned and operated...so tired of huge chain places, you know?\nI grabbed a magnet (which boasts delivery service, heck yes!) and a to-go menu on my way out the door. We'll surely be back.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2010-01-18', 'type': 'review'}
{'votes': {'funny': 11, 'useful': 9, 'cool': 9}, 'user_id': 'MWt24-6bfv_OHLKhwMQ0Tw', 'review_id': 'sU6CHiGFIK0Fo_zjTWy5qA', 'text': 'When I get excited, I squeal like the little child that I am. Another childlike quality I posses is the overwhelming love and affection for pizza, so you can only imagine the complete and utter detestation that I felt when I learned I had food allergies to gluten, eggs, and dairy. \n\nMy poor little baby heart just broke. That is, until I learned that Pizza Heaven, appropriately named, was placed on this planet, in this very city, right down the road from my home, just for people like me. \n\nGluten Free Dough. Vegan Cheese. Abundant Toppings. Yeah - I squealed. I ate the shit out of that pizza. I even loved it on day two. And day three. And if Pizza Heaven doesn\'t watch out, I\'m going to be back again every night for the next week. \n\nThe place is uber cute. The staff is friendly. The location is great. The parking is accommodating. They have "regular" food (pizza, subs, pasta, etc). And they serve booze. \n\nThank you for catering to us pain-in-the-ass children that were put on the planet to make everyone\'s life difficult!', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2010-01-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0VptqMr6enVCnqRjVYs4NQ', 'review_id': 'SB3HzmP8hkUmBDOr2AB8PA', 'text': 'I have been wanting to try out Pizza Heaven since I heard about it around 6 months ago. If your Vegan, getting a decent pie is tough, tougher if you are in Phoenix, tougher still if you reside in......mmmm...let\'s say Mississippi.\n\nWe are planning a move to CenPho and trying to try out our new hood before we actually get there so it\'s exciting to try some new places, hoping you will find your new favorite "spot". Unfortunately on my first pass, Pizza Heaven only gets 3 stars.\n\nWe did take-out and the person taking the order was friendly and nice enough but it took him 3-4 times to get the order correct. We just wanted 3 veggies on one half, a different 3 veggies on the other half. Somehow they couldn\'t do that or it would have been more(which I really don\'t understand, yes it\'s a different vegetable but it\'s only a half order....anyway) so we only got two and some breadsticks and marinara. \n\nThe place seems cool enough, good location, cozy atmosphere inside - next time we will definitely dine in. We got our pizza promptly and headed home. The large(14") pizza was $18.50, I\'m no whining cheapo but that\'s certainly not cheap, average maybe, but not cheap. \n\nVegan cheese is a bit tough to master(Daiya is the best and at more pizza places now). I think this is either Teese or Cheezly which are both decent but the problem was it was barely melted at all. The temp needs to be high enough and maybe I just got one that had a bad spot in the oven, we had to throw it in the oven and broil the top for a few minutes before eating which is kind of ridiculous but whatever, no biggie.\n\nThe pizza was good, seemed fresh, nothing extraordinary but decent. The breadsticks and marinara were excellent.\n\nKudos needs to be given for a pizza place in Phoenix that offers a vegan pie, as well as gluten free crust options. Most owners would scoff at the idea so I commend them as they are one of the few.\n\nI will try this place again and dine in next time, maybe they will grab a star back from me.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 3, 'date': '2010-01-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qMCT8OblN3finTvXcba-oA', 'review_id': 'MvO6SMdvpWkRJOuDSj24yg', 'text': 'You know that smell a plate gets that hasn\'t been washed properly after you eat eggs or chicken? That\'s what Pizza Heaven\'s wings taste like. Not to mention they were chewy almost as if the wings had been reheated in a microwave and then "fresh" sauce was poured on top. I asked to please have my wings remade and it was the same thing over again. The waitress mentioned that their wings are baked and that might be reason for the consistency of the meat and the smell. Oh, ok, stupid me. That explains it. I give the place 2 stars for an ok cheese pizza.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 2, 'date': '2010-04-09', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': '1PWFPOmqvLx3sGKuuKQr9Q', 'review_id': '7F2k6BaG4mGs2qGl1ZI24g', 'text': "This place is very tasty and the service is always friendly.  The prices aren't bad, either.\n\nThe downside is that the owner's son fancies himself a musician, so if you go there on the wrong night, you're treated to some pretty middling live music.  It's nice that they are supportive of him, but sometimes I just want to eat pizza and have a conversation with my friends.  If the band is playing or setting up, you might wanna consider getting your pizza to go.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2010-05-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'FTp6A1hWvdINhk-7lZRsTw', 'review_id': 'obzNrp_sgPaG4gzXIS5TIg', 'text': "I have been coming here for three years and I have yet to find a better pizza joint in town.  My family and I come every Friday night to hear the live music-eric and jimmy are awesome!  For all you haters, maybe you'd better stick with Little Ceasar's because you clearly don't appreciate good pizza!  I've had almost everything on the menu and have never been disappointed.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2010-07-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_GVAV2LjUWEs9fGjslex_A', 'review_id': 'LQ8eZ84Tl4qyGHY2_D3Vhw', 'text': 'We had their cheese pizza and wings, it was pretty good. The best thing about the pizza was the crust. The wings were nothing special.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 3, 'date': '2010-07-26', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 4, 'cool': 3}, 'user_id': '0dgQa81w5it1PMpGpC_L0A', 'review_id': 'lw8fdvX4Yzp5lxSvV4zNvQ', 'text': "Not bad!  The fam and I went out for dinner tonight, and the Husband was happy to discover that Pizza Heaven not only has gluten-free pizza, but wings and pasta too!  A gluten-free trifecta!\n\nIt is great to have so many options, and the pizza and honey-hot wings were fairly tasty... but it wasn't anything extraordinary.  Just a basic casual pizza spot, where you won't be terribly embarrassed if your 4-year-old throws a temper tantrum.  Umm.. not that that happened to us, or anything... \n\nThe highest point was the service.  Our server was incredibly attentive and took great care of us.  Thanks!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 3, 'date': '2010-08-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '7brf9WC0Gr_7bUBXEHs9FA', 'review_id': '_sjd87iuaO9IXHkxXmqVwQ', 'text': 'I had the day off of work last Monday so decided to celebrate with some pizza.  I had never been to Pizza Heaven before, but pass it every day on 7th Street on my way home from work.  The atmosphere is warm and inviting with true ambience (rare in the strip mall Phoenix culture).  Orders are placed in the front and a number is provided to you.  I have to say that the guy taking the order was helpful and courteous.  I had some questions and he answered them with a smile - not an attitude!\n\nI ended up sharing a Greek style salad (it had artichokes and a red vinegar/oil olive dressing = Greek style).  The portion was generous and the salad as delicious.  The main course was an extra large thick crust pizza.   It was cooked perfectly and the sauce was simple, yet tasty.\n\nPizza Heaven is suitable for adults and children alike.  \n\nI will be back.................!', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2010-11-03', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 3, 'cool': 1}, 'user_id': '0VptqMr6enVCnqRjVYs4NQ', 'review_id': '0uDbvJaCdzryXzaxaWhUYg', 'text': 'I wish this update was for a bump up to 4 stars, unfortunately it is not. If I had written this Friday night and they didn\'t offer good vegan options it could have easily been a 1 star review.\n\nThe funny part of this saga is I had completely forgotten about my prior review which had to do with Pizza Heaven figuring out orders with different toppings, charges, etc. \n\nRecently I have been complaining about how expensive Z pizza has been getting, Pizza Heaven\'s location is closer and I thought would be cheaper so here goes; round two.\n\nThe order: 3 topping large pizza with vegan cheese, on their menu listed for $17.50. When I arrived to pick up the pie I was told " That will be $27.?? " What?!?! "No, I just had a 3 topping pizza, just one...nothing else".\n\nThis is where the discussion began on how they charge for toppings, apparently their policy is to rip people off? I think we all learned in the 4th grade (ok maybe not) if you put 3 toppings on one half and 3 toppings on the second half you have used the same amount of toppings for the pie - the toppings may be different yes, but the net amount of toppings used (and might I add purchased by the establishment) is still the same. Since my girlfriend can\'t stand onions, and I hate those little black olives we each had our own side of 3 toppings each BUT...get this....were charged for 6 toppings! Recap: no more toppings were used total on the pizza but because they were all different apparently they have made it a policy to charge for 6 toppings. The vegan cheese was also an extra $2 but not listed on their menu online (or at the restaurant). \n\nThey ended up comping me for one topping and I didn\'t throw too much of a fight because I knew I would not be coming back anytime soon. Once I got home and tried the pizza it did nothing more then seal the deal. It wasn\'t the worse pizza but it was mediocre at best.\n\nI don\'t feel great about writing this review, I really want to love and support independent businesses in Phoenix but when they have crazy policies like this and I have to spend $27+ to get a large mediocre pizza I need to draw the line somewhere. Phoenix has very few vegan pizza options but right now it seems like the corporate giants win again - I can get a large surfboard vegan pizza at Whole Foods, with any 3 toppings on any half, which tastes great for $15.99; no hassles.\n\nLastly I would like to comment that the girl working the cashier was very friendly and very courteous even though I was displaying clear signs of being utterly appalled. Even when I left she was still very friendly, it\'s safe to say she saved this from being a one star review, kudos to you.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 2, 'date': '2010-11-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DfxzHI4TjGTUuFELonH5wA', 'review_id': 'PNeS9xG0-_ANsTCmcWiMCQ', 'text': "An old friend introduced Pizza Heaven to me about 5 1/2 years ago and now i live in the neighborhood, which is a bit dangerous!  I love this pizza and my all time favorite is the Pizza Bianca,  then next would be the Queen Margherita.  I have had many white pizzas with this place making the best and you can get it with ricotta when requested.  \n\nTheir pizza slice deals are tasty and filling.  The chicken wings are good but I prefer them much more crispy than how they serve them, but the sauce is quite good.  I have not tried any other items from the menu because I just can't get past needing the delicious taste of the Pizza Bianca.\n\nSquisito!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2010-11-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vNuUJWn6lyMbDhp7OegBLQ', 'review_id': 'DNewgt-7tRGa4-fuWRLqTQ', 'text': 'I found Pizza Heaven while trying to find a pizza that would be conducive for my date who was lactose intolerant. Pizza Heaven was a good pick for the date it has a great atmosphere and good food. There was live music which was fun. my only drawback is that the prices seemed a little high. \nNot that I blame them, b/c everyone makes mistakes, but they did end up bringing out the wrong pizza, making my date sick. To there credit they tried to do what they could to make the situation right. I guess I would have expected a comped meal where we only comped our appetizer and brought our correct pizza. \nI would recommend Pizza Heaven especially for vegans or the lactose intolerant just make sure that have your order right :)', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2010-12-01', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'iwyDK_AZd-Wjs0JIG56rcw', 'review_id': 'IQ1eSggNpKEGQN7-CNhPbA', 'text': 'I am personally moved to write this review because I am passionate about telling the TRUTH:  This restaurant "Pizza Heaven" was given the perfect name for it\'s contribution.  Not only do they serve the Best pizza with crust that has the "crispy chewy-ness" that one can only Dream of, but there is a most delightful, amiable young entertainer and he plays a whole cache of great songs through many decades of music mostly by heart.  Erick Hasbun is ALWAYS sweet and considerate and loves to do any request that can be satisfied to the gamut of customers.  Come to "Pizza Heaven" if you Truly intend to be delighted by their tranquil atmosphere, their evident loving passion for their craft, and for the BEST pizza that you can have outside of Italy!  Have a good time and bring no less than joy to this beautiful place!  (I am a vegan, and for all vegetarians/vegans out there, please note that they also have the most "cheese-like" cheese I have had since I had my last real cheese pizza!)\n\nWarm Regards,\nChristof Catlin', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2010-12-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UvuCdg-4pDQB9IzVs5Iz6Q', 'review_id': '2A8KRSP8vCzn3GlxZFVP8Q', 'text': "I ABSOLUTELY LOVE THIS PLACE!  If you want a GREAT PIZZA in a WARM, QUAINT environment then this is the place for you.  One of the first things I noticed at Pizza Heaven was that it is family run.  It was such a pleasure to see the whole family chipping in to make such a great place, down to the son of the owner playing music for all to enjoy!  I came to Pizza Heaven specifically to try their VEGAN pizza.  I have had Vegan Cheese before and I was a little apprehensive to try it, but to my amazement it was AMAZING!  This was the first time since I have been vegan that I have had a pizza that actually tasted like a traditional pizza.  I was blown away!  The next day while I was in town I did go to Z Pizza and tried their Vegan Cheese.  Though I did also enjoy Z Pizza's establishment, hands down PIZZA HEAVEN blew their pizza away!\n\nSincerely,\n\nRick D.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2010-12-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'iwyDK_AZd-Wjs0JIG56rcw', 'review_id': 'XzL-2gXQ6NqKCJEtjL-OPw', 'text': 'Since this review is not appearing on Pizza Heaven\'s Review site I am re-posting it.  This place deserves GREAT REVIEWS!\nI am personally moved to write this review because I am passionate about telling the TRUTH:  This restaurant "Pizza Heaven" was given the perfect name for it\'s contribution.  Not only do they serve the Best pizza with crust that has the "crispy chewy-ness" that one can only Dream of, but there is a most delightful, amiable young entertainer and he plays a whole cache of great songs through many decades of music mostly by heart.  Erick Hasbun is ALWAYS sweet and considerate and loves to do any request that can be satisfied to the gamut of customers.  Come to "Pizza Heaven" if you Truly intend to be delighted by their tranquil atmosphere, their evident loving passion for their craft, and for the BEST pizza that you can have outside of Italy!  Have a good time and bring no less than joy to this beautiful place!  (I am a vegan, and for all vegetarians/vegans out there, please note that they also have the most "cheese-like" cheese I have had since I had my last real cheese pizza!)\n\nWarm Regards,\nChristof Catlin', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2010-12-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'wSiZa_6c4VX_WMjmRLzblg', 'review_id': 'QKzTxopWO3tC96wXX_nUWA', 'text': 'My brother had the Chipotle Chicken Pasta and I am going back for that myself soon. I stuck to basic pizza. Great lunch deal. 2 slices of pizza and a drink for $4.00. They even have gluten free options available, which is great for GF people. I want to try the Chipotle Shrimp Pasta too.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2010-12-29', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 7, 'cool': 5}, 'user_id': '0VptqMr6enVCnqRjVYs4NQ', 'review_id': 'qIRYgsjBm1ZHxgsOBkeNJw', 'text': "My last review was hard to swallow, it wasn't something that I particularly liked doing. Having said that, I am proud to say I can't possibly give Pizza Heaven anything less then 5 stars now. This is why:\n\nTwo days after posting my last review, I was contacted through Yelp by the owner. She had even found my phone number and email address and contacted me there as well, after I didn't respond promptly she tried me again......it was evident she wanted to make things right and talk about my experience at Pizza Heaven. Over the next two weeks we discussed the issue and she apologized more then once and explained what had happened. We talked a bit about the compromises and challenges to running your own business and I found out all about where she sourced her Vegan cheese from, how to order other items Vegan at the restaurant, and about a new vegan sausage she was trying. Suffice to say that the owner cares immensely about her business and her customers. If all owners cared this much we might have a real dining dilemma (does Yelp exist in a society if every place warrants 5 stars??).\n\nI am happy to say that the owner made things right to my satisfaction (and then some) and I am also eager to let veg heads know about the new Vegan sausage - its pretty damn good. I have gotten two pies since my last review (sausage and green pepper) and they have been much better.\n\nI am glad that Pizza Heaven is now back on my pizza rotation. I am even more thrilled that we have owners like we have at Pizza Heaven here in Phoenix.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2011-01-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'C9fX6CDs-EuJg-9BPC--XQ', 'review_id': '5wJWBeY6zllgTfL_KcWHFw', 'text': 'The owner, Patricia, is very "hands-on."   This is the sort of place where the staff try to get to know everyone.  She comes around asking if things are all right.  Pizza Heaven is not a chain.  Everything is made fresh, and customer satisfaction is guaranteed.  I like that the restaurant offers a loyalty program -- when you have your card punched it results in eventually getting a free meal.  That is, 2 slices and a soda, normally $4.00.   P. S.  Great place to bring a date.  Live entertainment, too. -- Posted by Scott N.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2011-01-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'F6QsMoJdvtohlbnST-fDyQ', 'review_id': 'qaJqMrBGNaHTj-gtW2gXIw', 'text': 'I really love this restaurant! The food is always very good. I have been there many times and tried many different things.  At night it can be semi romantic.They dim the lights and they have live music. The wings are very good, as well as the meals and pizza. The coffee is never hot for some reason.  That would be about the only thing i could find wrong. They used to be a small little dive restaurant and have now moved several years ago to the location they are now. Food has always been good though. Sometimes dives are the best! It is family owned and run so  i think that is why they take such pride in the place. A very good thing. They have their own parking lot but, not many spaces on a busy  night. Great place for a meal at any time.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2011-02-22', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 2}, 'user_id': '1PWFPOmqvLx3sGKuuKQr9Q', 'review_id': 'IMqXMNQ8Mo7UrEafQDyv5g', 'text': "I just need to update this with some new things I've found to like about Pizza Heaven.  First of all: the vegan cheese they have here is delicious.  I didn't know they had it and was stuck getting lousy Z Pizza when I was eating with my vegan or lactose-intolerant friends.  Not only does it get the job done, it gets the job done well enough that no one, not even me, misses the real cheese.\n\nSecond:  Not only is Pizza Heaven is open on Sundays, it's open until 10 PM on Sundays.  All those pizza restaurants that think that no one really NEEDS pizza on a Sunday can suck it.  Sometimes no other food will do.  And luckily for Phoenicians, they have an excellent family-owned option when that Sunday craving hits.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2011-02-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '-GNcVLtPu1QlJ07cMRe4zw', 'review_id': 'qhL1l-3nfOQ90zG44MUHgw', 'text': "The pizzas are good, but nothing special. However, the calzones, especially in their wheat crust, are the best ones I've ever eaten.  Those things are amazing!  Try them with either meatballs or their home made sausage.  These babies are huge and really, really good.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2011-03-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uZyzPG8Gkjwld9fHpPBd1g', 'review_id': 'wRLpqUIoTWsF1r2L6OxStQ', 'text': 'I had a little piece of \'Heaven\'!!! Pizza Heaven that is!! I drive by this place every single day, thinking...hmmmm, I need to try this place. With it being on 7th St, the cars go by so fast, its hard for me to slow down my car to check it out. So, today I stopped on it. (Please note there is limited parking) So I walk in, pleasantly surprised to see a really nice establishment. Nice waiting area for To Go orders with 2 high top tables and a lunch counter. The menu is displayed really largely above the entrance to the dining room, so easy to read. They have take away menus to look at too. The guy at the counter was really pleasant as well. Now on to the food!\n\nThere was so much to choose from, including homemade lasagna, pizza, pasta, ravioli, sandwichs etc.  Very appealing menu options, I could hardly decide! Please note, they have gluten free and wheat options for crust and vegan and organic items too!! Great for ANYONE!\nI decided on the meal deal: 1 slice of pizza (1 topping), side salad, and 1 pop (or soda as AZ people say). All for $5.50 ($6.01 total) Great deal. So it only took around 5 mins and my order was ready. The pizza looked great! Not greasy and it had quality cheese and toppings and a good size slice! I got the mushroom as my topping (so good). The crust was crisp and delish. And the side salad was a nice healthy size as well. It has carrots, tomatoes, carrots, and cabbage slices on it. And the dressing, I chose was ranch. In fact, the dressing was that "restaurant ranch" that only true ranch dressing lovers will truely understand. :o) Great flavor  (not a glue-type quality like some places serve)\n\nOverall, great staff, nice setting, and good food! I will definitely not just drive by this place anymore, I will stop in more often!! :o)', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2011-05-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LesgRhVudEX_JNhV4CbCqA', 'review_id': 'YDQtV8IPScXq9Lqf6zsWVw', 'text': 'Eatable but nothing special . Pizza was ok .', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 3, 'date': '2011-05-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nXFteEd3o2Fi7opr3M4ZFw', 'review_id': '8GGO7GvsVRemB3w8Hic9BQ', 'text': "Let me start by saying my husband and I drive all the way from far East Mesa to eat here as often as we can, which isn't as much as we want to since I don't live in Central Phx anymore :( We've gotten to know the owner Patricia and her son Erick since we go there on either Friday or Saturday night to hear the live music and eat the yummy food. The Baked Ziti is my favorite and my husband loves the Calzone. We both love the pizza and the baked wings as well.  I'm drooling as I type this. \n\nOur love of this place does not stop at the food though. We actually had Erick Hasbun, the owners son play at our wedding and had the food catered from there as well. They brought it all the way to Gilbert and it was amazing! Erick is an awesome singer and guitar player and we couldn't be happier with how the food turned out. Everyone loved it! The Spinach Chicken Alfredo (I think thats what it was) was something we had at the wedding that I had never tried and it was amazing too! That pan was eaten up first! That was a hit!\n\nI will end this by saying Thank You Pizza Heaven for always being worth the drive! Can't wait until we can make it down there again very soon!\n\nThanks!\nKathy and Bob Vidican", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2011-06-07', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'Cp-PV8rsypbO-xBrQ6KmQg', 'review_id': 'GqTGcB60GjQv9IoI6uaoMQ', 'text': "I love that Phoenix is a pizza mecca... people don't realize that our little melting pot is rife with premiere pizza joints. This is one of those places... You could chuck a rock from the front door and break the glass of one or two other pizza places, but you wouldn't be able to find anything else within walking distance worth eating.... \n\nThe kid behind the counter was really nice and the slice I had was delicious... spicy pepperonis and tasty crust. My only gripe would be that it tasted a bit re-heated, but those of you familiar with pizza by the slice joints will probably enjoy that. I can't expect them to cook an entire fresh pizza for me just to eat one slice... especially in the mid-afternoon. \n\nThe place was clean and the bathroom was pretty nice. I'll be back.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2011-06-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TitYPZtCxlog6HM743LobQ', 'review_id': '0LSBIcq_er1P3CjSTQ11ww', 'text': "This pizza joint is one of the best in town!! We have been eating there for over a year and haven't gone wrong yet with our favorites. The wings are cooked perfectly with the meat falling off the bone with great options for homemade sauce. the hand tossed pizza is mouthwatering and our creation is always cooked to perfection --Canadian Bacon, Ricotta Cheese, Mushrooms, and Meatballs!!! AWESOME! The service is always quick and friendly and the delivery is fast and the pizza is HOT!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2011-07-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'nbofxFWHORebBHh10OgYLA', 'review_id': 'Bze5ljxyUkiD1RzMxCl8kA', 'text': "OMG SO IT WAS HAPPY HOUR and I was meeting a hungry friend at the bar who wanted to EAT PIZZA. I hastily scoured yelp for a decent place to grab a pizza in Central Phoenix, and Pizza Heaven jumped OUT at me!! Better yet, there was a 50% off any Pizza coupon in The Entertainment Book!! WOO! I was greeted by a stylish and friendly staff, pizza was ready within 20 minutes of my phone call, and WOW!! Such a great pie!! Fresh basil in the sauce!! A mix of nice cheeses! Great pepperoni!!! Exquisite crust!!! I CAN'T WAIT TO EAT MOAR.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2011-09-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mKAjaoumV6-MZFUTP0Eznw', 'review_id': '7hVHduzf-8Q0WL3Wb4xzBA', 'text': 'My neighbor brought one home for us to celebrate my belated birthday - Queen Margherita pizza was very good;  a basic pie with quality ingredients that shine through.  Well done.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2011-10-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'Ec4bUR0GF8wGVxnJkwV31A', 'review_id': 'ryH068tSWVD9VrS-mmJL7g', 'text': 'Needed a late dinner (after 8) fix and this place is right down the street.  Had a coupon from the entertainment book that was about to expire so we thought we would give it a try.  I used to eat at Pizza Heaven when it was further south along 7th St and always had a good meal.\nI called in and order for the works pizza and picked it up a short 20 minutes later, starving.  The pizza was ready when I got there and the counter girl was friendly.  These guys know how to make a pie!  Very tasty and an abundance of toppings.  Getting ready to have some for lunch!  \nI think my girlfriend and I will be eating there with more frequency in the future and trying some of the other menu items.  I can walk there from my house, they have live music every Friday and they serve beer and wine!  And for those who might be interested, the offer vegan cheese and gluten free crust.  Not for me though.  I want the real stuff and Pizza Heaven can definitely provide that.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2011-10-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'a6Z4Crg4sPkyvdcS07G7dg', 'review_id': 'zIm1GfAAEFfjANOTb-dpIw', 'text': 'Hubby and I have been here a few times for date night and with kids for dinner after work.  We love this place, pizza is excellent and the atmosphere is very relaxing. They have a young guy singing, I believe he is the owners son. He is verrrry talented and I really enjoy listening to him sing. Nothing worse than listening to someone sing and you know they have no talent, but this is not the case with him. When we come to Pizza Heaven its always a treat for us. Good food and entertainment for sure.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2011-11-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'N7T6hOunTPxLk2AiWrQEmg', 'review_id': 'Jc6VPHd7lI3uDOALBsMuTg', 'text': 'I personally was not overly excited about the pizza, but my girlfriend and I also split an order of some crazy spicy chicken pasta - it was absolutely awesome.  THAT ITEM was a 5-star meal.  Also, the Tira Misu was straight out of a box, still half frozen.  It was GOOD, but I wouldnt pay $5 for a store-bought Tira Misu slice again...', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 3, 'date': '2011-12-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'efUcLl2QBUm4cjQ4lgf5Tg', 'review_id': 'bzouylA_PuhuTD-34otCRA', 'text': 'I love that this place has a variety of vegan options. The calzone with soy cheese and soy sausage is delicious! The vegan pizza delight is also tasty. The owner and staff are great too. My only complaint is how much more the vegan calzone is compared to the regular ones.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2012-02-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'Rt9buf_pvzCN9gH-g_eFvA', 'review_id': 'JLhB3YxN7TRVbH7e2C9TMg', 'text': 'DELICIOUS vegan pizza here! They use follow your heart cheese and gardein crumbles. The hand tossed crust is really good. And they have fat tire beer. Our waitress was really nice too!\nWe ordered a handtossed vegan pizza with vegan cheese, vegan sausage, green olives and garlic. SO GOOD!', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2012-02-28', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '1Ri3pmwcT28y_b9hWmlLDg', 'review_id': 'Qo7oAhIvTactkP4vDPyXdg', 'text': "Great place to eat pizza if you are vegan!!  They offer vegan cheese (follow your heart) and vegan sausage (gardein).  Our server was very friendly and told us what products they used.  The pizza was amazing and delicious!  It's awesome that Phoenix has a place were vegetarians and vegans can go and get meat substitutes on a pie!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2012-03-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'FWW4j3wMpgsvTdvZho5gsw', 'review_id': '6v2gJ_ws7EVsE_8DzQM9Lg', 'text': "Good, solid food.  Their pizza is really tasty, and I have a strong love for a good wing...they have.\n\nTheir slice/salad/soda combo is a smoking deal.  Who doesn't love good food at a good bargain.\n\nService has always been courteous and consistent.\n\nLocally owned!!!!!\n\nAnd...they are right across the street from my mechanic.  So I can get good food while I wait.  BONUS!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2012-03-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'dji-3ZSLA33ndPPYT0p7BA', 'review_id': 'SDzewZmK6v3AR-nzjML7ww', 'text': "I kinda don't want to review this place so that we can keep it as nice as it was on Friday. My husband and I got a night to ourselves so we tried this place out. It was delicious. But other than that, the service was wonderful, the live music was so cool, and the crowd was chill. Strange that everyone else in the restaurant opted to sit far from the music. We chose to be right by the band and it was the best decision ever. This place is great, it will definitely become a regular for us. We can't wait to take the kids!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2012-04-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'AHrK4xiaoZ9iuu2bUQqUiQ', 'review_id': '5PZD0x6YM2CrLYhFjMu7Vw', 'text': 'allthough the pizza is pretty good  the delivery service is a rip off if you have half and half  its an extra $1.50 even if one half is just pepperoni # $3.00 delivery and then tax on top it makes the pizza pretty dam expensive   so i will not use them anymore', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 1, 'date': '2012-04-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'efUcLl2QBUm4cjQ4lgf5Tg', 'review_id': 'ImXzuciyB2Pe2MgMUAojEw', 'text': "I stopped eating my pizza to write this review. I'm so super bummed to see that PH has changed their vegan cheese from follow your heart to daiya.  Not to knock daiya because honestly it's a decent cheese but not on this type of pizza. I will probably not order again unless they switch back....Please bring back follow your heart!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 3, 'date': '2012-05-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'efUcLl2QBUm4cjQ4lgf5Tg', 'review_id': 'c7LOqOjPU5VlYd-EqmGwuA', 'text': 'Follow Your Heart is back - yay!! And always great communication from the owner - thanks!', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2012-05-24', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 4, 'cool': 2}, 'user_id': 'MfzQr1wAuA-Hj1eNHPqAgA', 'review_id': '2bfQbWdXABIo5X0A4RaTuQ', 'text': 'I LOVE cheesy sausagey carb-laden food.  I also happen to be a vegan. so, Pizza Heaven was in fact HEAVEN for me.\n\nso many vegan options, all clearly marked on the menu.  I had the sausage parm sandwich.  PERFECTION. I started with a salad- salads are not why you eat at Pizza Heaven, but I needed to justify my redic sammie by having something healthy.\n\nthe kids had "traditional" (ie. with cow\'s milk cheese) pizza & were plenty happy.\n\nwait staff are friendly & very vegan savvy.  decor is really 1990s\' Italian, love it.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2012-05-27', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 1}, 'user_id': 'hkktVdBvVDOxQg8oHE-jOA', 'review_id': 'eI3GZwzVfVxdaIbAUxj6hQ', 'text': "I found this place by using Yelp and being a Vegan that hates Daiya cheese this was the place to be. They use follow you heart even though it is more expensive for them to get it. \n\nMe and my non Vegan boyfriend absolutely loved this dining experience. He could not tell that the cheese was a soy cheese, the pizza crust was awesome and the live acoustic music was wonderful.\n\nThe manager/ owner came by our table and many other tables to check and see how we liked the food and asked even if we had suggestions but we didn't ... everything was perfect. I will be back very soon.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2012-06-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mAD_n4LNMimbZPsPkvCJMw', 'review_id': '9b_tHuDyF6PwZ3h0d6pBMw', 'text': 'This place was AWESOME!!!! The whole wheat pizza dough was the best I have ever tasted! You can tell the sauces were made with only the freshest ingredients, including the veggies - they were so fresh! The pizza was not dripping in oil which was a plus! My girls got the soy calzone and we got a veggie pizza. My girls licked their plates clean and so did we! Customer service was wonderful and we only wish they had more of these places in Cali!', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2012-06-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Yb29nRv-CP8wUUIYSuDFww', 'review_id': 'w3ObFgImVgIPBcjyUJljPA', 'text': 'Great place, not a lot of parking.  We ordered a pizza and chicken parm.  It was really good food and the service was great.  We will be visiting this place again!', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2012-07-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'CO880lPXR9SIcbdahzAdOA', 'review_id': 'Wf0vau2jSUkALmAP3ZlJfA', 'text': "This place has amazing vegan pizza.  Really, really amazing vegan pizza with soy cheese and soy sausage.  \n\nI think one of the hardest things about not being able to eat dairy is not being able to eat pizza, so this place is a dream come true for anyone who is dairy-free.  The style of the cheese (melts well), the thickness of the crust (tastes very similar to many East Coast pizzerias), and the subtle taste of sausage (it's made with fennel to give it taste without tasting too meaty) make this piece of pizza a serious slice of heaven.  \n\nThey have gluten-free pizza and the crust is from a local bakery.\n\nIf you happen to have a problem, talk to the owner.  She's very receptive.  Also, she's appreciative of inputs from vegans.  \n\nYum, yum, yum.  Go here.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2012-07-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 2}, 'user_id': '7P9okhRRYG0hz02Fk7tRMw', 'review_id': '_t_Xhqtud9kqCkDAgr_CSw', 'text': "The location is easy to find, right on 7th Street in Phoenix and has off street parking.  \n\nUpon entering we found that there was an area to wait for take out orders and small adjoining dining area that we found dim and cozy.\n\nPizza Heaven not only has Follow Your Heart soy cheese but also vegan sausage.  In addition, if you're looking for gluten free crust they've got you covered. Personally I've never been a fan of sausage so there was no interest for me to try the vegan sausage, but I did go for my trusty stand by of double pineapple.  \n\nThe pizza was truly awesome and it was nice to have a bit of a change having the cheese since it had been so long. Note: from what I could see the smallest pizza I could get was a 12 inch, which is a size my husband and I would usually share.\n\nMy husband went non-vegan calzone that was HUGE and plenty for 2 meals, but he was pretty darn happy with his choice too.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2012-08-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '5j7qmDZTAetaH0yXFnAFyw', 'review_id': 't_qlrX-bmoAIG-OHxaC6fg', 'text': "Random restaurant choice during a workday lunch, which turned out to be a good find!\nHad the lunch specials--a couple of cheese slices and a drink ($4.50, but extra for toppings) and the 1 slice (one topping), salad, and drink ($5.50). Salad was small and fresh--lettuce, tomato, carrots, and even some bacon bits! My slice was with sausage and cooked perfectly--very tasty!\nMy partner in crime had olives and mushrooms, which looked good and there definitely weren't any complaints. \nService was great, although it seemed as though one person (Drew) was the only one there, along with the chef. The atmosphere was smallish but cozy, nice ambiance overall. \nPrices are really reasonable and this place is apparently a great option for vegetarians/vegans.\nWill definitely go back to give the sandwiches a try when we're back in the area! Would definitely be interested in checking out the live music on the weekends.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2012-08-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'ULYG4l-WygRCgSfqjZ4C-A', 'review_id': 'TBxZsZnqFo5hRRmUZFQjJA', 'text': "My vegetarian boyfriend and I love Pizza Heaven's vegan sausage. He thought I had made a mistake when ordering, but I assured him that I hadn't - it really was vegan sausage. The sauce was flavorful and the crust perfectly baked. The dough ball dessert was terrible (can't remember what it was called), so pass on that. But, the pizza was the best we've ever had.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2012-09-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PwGc-ZpLD70ATbNdEi7uOA', 'review_id': 'YLfw3IcoykL4ANluAPKLDA', 'text': "This place was an excellent find! It's a really cozy place, very clean.  The pizza was great and the breadsticks were the best I've had, very affordable too.  I got the soy sausage on our pizza and it was amazing. I have been there twice and received excellent service.  I will definitely be returning and would recommend this place to anyone.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2012-09-30', 'type': 'review'}
{'votes': {'funny': 6, 'useful': 8, 'cool': 8}, 'user_id': 'kffxYQVQsEpF1DVlQlcGCg', 'review_id': '9_Y5NsS4x-Dn0bHsZ4DRLA', 'text': 'I have been to this place many times now over the years. Surprised it has taken me so long to review it. Maybe, I thought I had.\nAnyway. Great location. It used to be more south. It was a cool little hole in the wall back then. Now it is more like a cool little family restaurant. \nThey play live music even on certain days.\nTHe food is good, the atmosphere is not too bad.It is a nice place to go and not too bad on the wallet.\nOn a busy day or night parking can be tight. But,  other wise it is great. Check it out one day when you are on the East side of pghoenix. You just might like it.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2012-10-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'X86LOo0a41VMlt_p0vDv1w', 'review_id': 'S8mk10XHHKmHArB6ikLyhA', 'text': "First time ordering from Pizza Heaven. I picked this place because of the yelp reviews. Perhaps their regular crust pizza is great but this was by far the worst gluten-free pizza I've ever had(no exaggeration). The crust was tasteless and soggy like wet cardboard. I popped it into the oven to see if I could get e crust crispy but no luck. I'm so disappointed.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 1, 'date': '2012-10-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'p5HzeAjc35ZBkOoyX-Gcxw', 'review_id': 'SVlnSiZznQtKRRbC9ANWrQ', 'text': "We went to pizza heaven on a Tuesday evening, with the exception of one person sitting reading a book we were the only people in the restaurant. I wasn't sure if I should be happy or scared that the place was empty.  \n\nOverall the pizza was great. We were simple, cheese and pepperoni. We also ordered wings, half medium and half honey hot BBQ, both were HOT!! \n\nThey don't have milk for kids, if you have kids you know that this is important. They don't have draft beer but they said they were working on getting some. \n\nI would visit this place again.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2012-10-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'ImT20Kp9M5S3SgmejnBsLw', 'review_id': 'Uj1D5RIYTcTcJiL2is12Bg', 'text': "SO much yum.\n\nThey have an all vegan menu. it's delicious. I ordered the vegan baked ziti with soy sausage (Yum! and big! but i would have appreciated more distribution of cheese/sausage thru the pasta instead of just on top)\n\nthe calzone was quite good but i wish i hadn't gotten the broccoli in it.\n\nthe veggieballs (vegan meatballs) are SCRUMPTIOUS. get them. yum.\n\nThe angel bites....(marshmallow consistency fluffed fried dough with sugar on top.) lived up to their name. But they need some sort of fruity sauce or sorbet to accompany them to put them over the top.\n\nin short: don't miss this place especially if you're veg!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2012-11-28', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 4, 'cool': 2}, 'user_id': 'GMkF0yJWwFRVO9kiGOcojQ', 'review_id': 'Kh9kdI2PdnjgnEEG9eFuEQ', 'text': 'I am confused about all the hype. I ordered a large pepperoni pizza (which was on special for 11.99) and 20 wings. My order came out to $34.00.\n\nHoly shit! $1.10 per wing? Are you serious? "Better be some damn good wings", I thought to myself..\n\nHomie on the phone said my delivery would take 30-45 minutes. Ya.. No. Add an hour to that. \n\nPizza and wings finally arrived, and I was fucking starving.. Honestly.. the pizza was bad. I want chewy crust, flavorful sauce, and stretchy cheese. Pizza Heaven offers none of these mandatory pizza components..\n\nThe wings were soggy on the outside, and over cooked on the inside. The meat was tough, and stringy.\n\nWhat a waste of time, and money. Don\'t be fooled by some of the reviews on here.. What I experienced was nothing short of Pizza Hell-', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 1, 'date': '2012-12-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TCeV7-l5eppvrtFk_svEpg', 'review_id': '-UP_TzikDhc-L23LyCxYgg', 'text': 'Delicious pizza, awesome atmosphere. Great service and great food.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2013-01-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'xqsk4LUMt2T9a3GGHQwpug', 'review_id': '5AXT4eCOhtxrjNCROdsmrg', 'text': "We like this place because it is right down the road from our apartment and works well as a meeting place for friends.  The best part is they have both Vegan and Gluten Free options.  This makes it great for when we want to gather with our closest friends who run fall all over the food spectrum.  \n\nThe pizza is good.  I'm from Chicago so I'm picky about my pizza as nothing is ever as good as my home town staple.  But I enjoy this place.  The crust is good, not too dry and airy.  The only thing I don't like is that their thin crust is not a true thin crust in my eyes.  I like crispy thin crust but it is still a good crust.  The pizza was not oily or greasy at all.  We've had pepperoni,  sausage, and ham and pineapple on our pizza.  My boyfriend has had the wings and they smelled good to me and appeared to taste good as he polished them off.\n\nWe've had their pizza dine in and carry out and really have no complaints.  My only other dislike is that the pizza is not as good the next morning.  Yes I judge pizza based on it's taste as cold leftovers.  But, I love cold pizza so this is a huge scoring point for me.\n\nIt's a great little neighborhood spot that we will continue to visit.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2013-01-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 2}, 'user_id': 'm7vtKWpZ9wdEQ95wJxrMrg', 'review_id': 'MlHY2ugvuMA1tExFdZV3DA', 'text': "At last, a restaurant that serves delicious pasta that, upon request, can be made as a gluten-free option! My friend and fellow yelper John M. had a very good dining experience at this restaurant and invited me to have dinner there with him so I can try it out - and I'm glad he did. It's a cozy little bistro with its own parking area - a plus for this part of 7th Avenue. The staff is very friendly and service was quick.  My order, penne al greco (I chose the gluten-free option with brown rice penne), had feta, spinach, calamata olives, sun dried tomatoes, and zucchini; it can only be described as heavenly.  It was truly ambrosia, and I chose beer as my nectar. I'm looking forward to trying more dishes at this restaurant really soon!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2013-01-30', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 1}, 'user_id': 'CkgINQSONmbI9Oh947dHZg', 'review_id': 'T8SBUfqTQL2r2StX1i5ewA', 'text': 'Are you watching your weight but miss real food....well then look no further.\nFOOD-\nI have had the vegan delight pizza, which is super delicious.\nI also have had the spaghetti with veggie balls and the vegan ranch. You cannot tell the difference in the vegan ranch vs. real ranch and it is a fraction of the calories. Go to this place and indulge on anything on the vegan menu, which is vast. My cup of wine runneth over for the clandestine food that tricks my belly into believing it is enjoying a fatty treat, which it is not. You can access the vegan menu by going to their Facebook page rather than their website.\nSERVICE-\nThe owner is kind and helpful and gets really jazzed up about the vegan menu too. \nWAIT TIME-\nAbout 15 to 20 minutes. They are not miracle workers and it is pizza...', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2013-02-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'x-8MXJKa2ScSUS7YjKIOVw', 'review_id': 'ZOUicy0ZwTsDc7Lj0a1jeA', 'text': "The first time I heard about the vegan options it sounded too good to be true... a real Italian restaurant with vegan choices? Well, this place just keeps getting better. I have always loved their vegan calzone and their vegan baked ziti, but recently they actually added a whole separate vegan menu with extra vegan options and the last time I was there the wait staff told me (or rather, they told my omnivore mother, who is much less shy and much more talkative than I am) that the owner was so pleased with how well the vegan menu was doing that they were planning on adding even more options in the near future.\n\nSo far I have had (that I can remember) the vegan calzone, the vegan baked ziti, the veggieballs, the hot veggie sandwich with vegan cheese and the angel bites. If you ask, they will also make you vegan garlic bread, although I don't believe that's actually on the menu yet. All of it is great, although the angel bites could have been a little bit sweeter or more interesting considering that's their only vegan dessert option so far.\n\nAlso, the vegan calzones make for great leftovers, especially if you ask for a little to-go container for the sauce as well so you can dip it. I have done this multiple times.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2013-02-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7nlZJW84Adt6oYn2shnn_g', 'review_id': 'NDdNg70gLPbN08HhlhzEig', 'text': 'The Miko Miko and supreme are good.  ok overall. :-/ Did not like there chipotle sauce.  Not spicy at all, and it tasted watered down.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 3, 'date': '2013-03-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yPOeth2ytk2m2TDtgC1tTQ', 'review_id': '0EalRCaEuzaaDLLmi-yJzQ', 'text': "We went here for the first time last night and absolutely loved it.  I am a vegan but my family is not so it was perfect for all of us to have options.  My vegan veggie sandwich was awesome.  The owner explained all of the vegan options and even gave us some delicious samples to try.  We will defiantly be back.  I can't wait to come back for the buffalo style veggie balls with vegan ranch.  :-)", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2013-03-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '45V7-1r79DEG0HbuaKYIlg', 'review_id': 'U1f1TSXOvnbLOSNhMGxktQ', 'text': "I appreciate the vegan and GF option on the menu. While I can pretty much eat anything across the board, enough of my dining buddies have restrictions that are made far less a hassle with this menu!\n\nI've been in a few times through the years - always happy with the service and pizza.\n\nRecently, we've had them deliver to my office a few times. I'm a fan because if I am (gasp!) not in the mood for pizza, I can get a small salad and breadsticks. \n\nEverything has been fresh, quality and presentation solid - and I am consistently a happy camper!\n\nDefinitely a nice place to have in my work and home area - and so much better than any of the chains!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2013-05-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hKOa6B79sE3WZ8hQZ1I19Q', 'review_id': 'B8NDvQdO9cp0-EAs23dzNA', 'text': "4.3/5 Would have given a higher rating if...\n\nI got the meatball sub and fries which were both excellent. Probably had 6 large meatballs that were moist but not rubbery. The fries looked like they were handmade and very salty which I enjoyed. I rated this place a 4 but would have probably given them a five if:\n\n1 - The food didn't take so long. There was no one in front of me and it took 19 minutes.\n\n2 - If they actually got my order right. Note that I am reviewing the meatball sub, however I ordered the chicken parmesan sub which it clearly read on my receipt. When the kid brought the food to my table I noticed he picked up the receipt, noted the mistake, got nervous and crumpled it up. I would have sent it back but I had limited time on my lunch hour. \n\nOverall I would go back but would allot more time in the event of a mistake.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2013-05-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'B4ZfuMEKH_aHW9fcV5PbpQ', 'review_id': 'A-IWQCdMEjYTlkjFBjg25Q', 'text': 'this place is awesome! I ordered the vegan super veggie delight with soy sausage and it was incredible! I will definitely be going back', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2013-05-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GbwRzhqra-BbE0zOoYAxCw', 'review_id': 'NJ56Fbnd4sY2BlR-7CrsYA', 'text': "Decided to dine in during lunch hours. this place was picked mainly for the fact that they are vegan friendly.  The wings were cooked perfectly and sauce was mild sauce was ok. The Vegan delight pizza was really delicious. The cheese wasn't slimy and greasy like some vegan cheeses. They use Follow your heart cheese and it was very flavorful. topping were spot on. Soy sausage was surprisingly delicious, the taste was very similar to meat sausage. I even enjoyed it and im not vegan my girlfriend is. Service was very attentive and knowledgeable. he was even kind enough to ask the cook what kind of cheese was on the pizza. All in all i give this place two thumbs up and will be dining here again soon!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2013-06-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JKFrRlbjlvvR0fNwVwOuNw', 'review_id': '6QSwitD2p29sSlc2uP2yRA', 'text': 'Love love LOVE this place. Anytime I get a hankering for some pizza this is always my first choice!', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2013-06-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'NvOqcnPhBgVI0Fs7lUzOSA', 'review_id': 'MCJJNSb84m20GOKvtVxDEA', 'text': "I tried this place last year using a discount voucher and I really liked it. Very friendly\nfamily owned restaurant. The decor is really cute..... kind of romantic. Nice first \ndate kind of place. The food is good if I might add. I think everyone needs to try\nthis place and judge for yourself. I really don't think you will be disappointed.\nI have been back several times since and I just noticed another discount voucher\nnotice on Groupon and I am going to nab it right now. I know I probably shouldn't\ndo that since I know I like the restaurant, but I am also a sucker for a good deal\nand good food!!!!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2013-06-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'h4Z9It4iaRUdAc73dewD0Q', 'review_id': 'zpV9vQfeQp0OcOOvSwJZXA', 'text': 'Best vegan pizza ever. The vegan calzone is phenomenal also. Non-Vegan friends love it too.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2013-07-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'hyUC687R-bhV6dy2Vvio1g', 'review_id': '0XcWY8wE86aP0thGIeqH_Q', 'text': 'Came here on Friday to celebrate the birthday boy. We absolutely loved it! Terrific menu and they take pride in their pizza for sure. Salads were good, wings had just the right zip, and dessert was one hundred percent delicious!! Now, I have had MANY slices of new york style cheesecake, but this is hands down the BEST. Owner passes by your table to check on things and live music on weekends is terrific. The musicians even paused from their set to sing happy birthday and present us with free dessert. Cute! Sure made his day :-) Dough is made fresh here, sausage is made fresh here ...and if you have a special request or a diet restriction? No problem, just mention it and you are in good Italian hands.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2013-07-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FLtIvthFtPUlc1204LHAJQ', 'review_id': 'C1Hl98l7ekEgq9_Gmt1lFQ', 'text': "Great atmosphere but not great service. We went on a Friday night, the music was perfect and the lighting was romantic. We ordered a little bit of everything, the caprese salad was good, I liked that you could poor your own amount of balsamic on it...the wings were just ok, pretty messy and our server did not leave us with any extra napkins and I had to eat HOT wings without a drink...I had an empty beer glass and was never offered water. I noticed waters on all of the other tables though. The owner looked at our table several times so I thought she noticed but nothing was done. The pizza was good, but need a little more sauce(i'm a sauce fan). We also tried the sausage lasagna and thought it was delicious.\n\nWe will probably go back again for a nice relaxing dinner but only order a pizza or pasta dish. I would recommend making reservations on a Friday night as after we were seated, the place got very busy. \n\nOverall it's a nice place and worth a try if you've never been or if you are on a vegan/vegetarian diet.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2013-07-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'PwGc-ZpLD70ATbNdEi7uOA', 'review_id': 'vHxL9dHuQUTFfxi2VbRLJg', 'text': "I LOVE this place. I love their vegetarian sausage, it tastes exactly like real sausage. Their pizza is delicious and the crust is perfect.  I always order breadsticks with my meal, they're really good and at a great price.  They use disinfectant when cleaning tables which you rarely ever see at other places. The wait staff is always excellent, always attentive and super friendly. I found Pizza Heaven on Amazon Local and it was an amazing find. I've been here at least ten times.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2013-07-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zuoeE7GdXXlCgr995ImWfQ', 'review_id': 'XPu3WLsoJ93i0-hL6KwyuA', 'text': "Pizza Heaven is the perfect lunch spot. It is such a good deal and very tasty pizza. For around $5 you get a slice of pizza, salad, and drink - and for a small up charge you can get any toppings you want on your single slice. Most places in the area charge way more for pizza of this quality and you can't order just a single slice the way you like it. I'm a fan!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2013-08-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'qHqklkFS4JfKtcJDT1WMaQ', 'review_id': 'SSWnPYg7XPD7GsOD__b3Fw', 'text': 'Had a groupon for this place so thought we would try it out...got the medium buffalo wings and they were perfect..big wings with just the right amount of sauce and kick. \n\nWe ended up getting the Mediterranean pizza on the thick whole wheat crust with chicken added..was really good and huge. \n\nGreat atmosphere and very clean, nice waitstaff .. Another good pizza joint in Central Phoenix.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2013-08-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Bc94u79bFmGaUH3coZhBHQ', 'review_id': 'pKEbhnnzQ-siUD2VZOBUww', 'text': "First, the ambiance is right out of Jersey. Way too dark, fake plants, an impractical bar talking valuable real estate, orange walls -- you get the drift. I prefer to think of it as neighborhood Italian kitsch, but on a crabby day I might be less kind. The food is good, a must in any vegan's rotation. Both the pizza and subs are amazing. They use a superior vegan cheese, and I am not a fan of other fake cheese, especially on Italian cheese-centric dishes, but this stuff is amazing. My complaint is that your only side dish option for the sub is french fries - carbs with carbs; a small salad would be appreciated. Also ask for the additional veggies on the subs, they come with them but don't ask don't get. Prices are reasonable, pay at the register after the meal. Service is attentive, youthful, and helpful. Seems to be caught in between wanting to be a nice sit down restaurant and a pizza by the slice joint, but love it, even in the dark.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2013-08-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'VEG7jnYwo905v4Lnoq37GA', 'review_id': 'yHEZRiQt5oZwePi8Vc1G9Q', 'text': "Everything from the pizza on down to the wings is top notch.  They are very gluten-free friendly (which makes my girl's life a lot easier - and by default, mine also).  It's a quick turnaround and the setting is perfect with a cool little bar.  Great atmosphere, fantastic food.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2013-10-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zXFhRuDKnyQhKwh4voS9vw', 'review_id': 'mRiIqAG4zw-Ph799O5hbLQ', 'text': 'Excellent pizza and great service.  The Mediterranean Pizza and Moscato wine both get 5 stars.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2013-11-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LUnYaKDXGzREWNbqq-sN9w', 'review_id': 'yJoHImH2BlzfaIs6RfXAOw', 'text': 'The best pizza places I have been to. Has a "home" like atmosphere rather then being at chain restaurant. Food is fantastic made to perfection. Service right when you walk in the door until you leave out the door.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2013-11-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uqSLJMoKECmOiwjOrBYoew', 'review_id': '2H1yHOJXDVYByfK2eoAuCQ', 'text': "We were excited to try this local pizza restaurant for dinner and ordered a sausage pizza on whole wheat. It was the most tasteless thing I've ever eaten. Too bad, I wanted to like this place.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 2, 'date': '2013-11-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'CYHX8nnPoqclfWSsl1JWnA', 'review_id': 'laXWnMBQxnoLASnNCGF-eA', 'text': 'I was soooo happy when i open the menu and there was a vegan/vegetarian page. \n\nGood customer service,  good pizza :)\nIts a small place, but great atmosphere! \n\nNo hot sauce nor ranch :(', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2013-12-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BoW4OjqbWimHnna47xa1iw', 'review_id': '_ecMCIm6myJUGDjuNrtJOg', 'text': 'So so food but sweet staff and low prices got the 4th star, waitress was a honey', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2013-12-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2TmYgUCnGmnNiKO8-STKpw', 'review_id': 'GZfbBTnECYi5qaXzM01Wbw', 'text': 'Bland crust. Bland cheese. Bland thin watery sauce. Even the sausage topping was meh. Do not recommend. How so many yelpers can give such glowing reviews... there are much better options .', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 3, 'date': '2013-12-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nsO6AVI0QMBbAvjNs2lyBQ', 'review_id': '-89GoGgNtUZtQwESfXWDaQ', 'text': 'Great atmosphere. Great food. They have vegan menu. Ate the vegan pizza which was  amazingly tasty.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2013-12-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_1jZ-2f2Vlx2aG-eKAAv7A', 'review_id': '3bj97imjbLWlZyr9spv21A', 'text': 'Waitress was available, but had very little attention to detail. Dropped off our salads but no silverware on the tables. Calzones are huge, good value for the price, gluten free beer options are great. \n\nOwner asked us how our meal was going but didn\'t have the heart to tell her the server could use some work. \n\nJust a pet peeve, but I find it strange when bistros and theme restaurants do not play "Italian" music, but rather 90s alternative rock...', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 3, 'date': '2014-01-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zU8tZqjC5YhkWebuREb0RQ', 'review_id': 'FuJHRWNnTdXRcX6Wafzbow', 'text': 'My husband I love the great vegetarian/vegan options at Pizza Heaven.  The food is delicious, and the service is always consistently great!', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2014-01-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'cVpa-0YSvN8WUIWGtqpvZA', 'review_id': 'M6g91jhi7ZHr780MLInO2Q', 'text': u"My fianc\xe9 and are trying to dip our toes in the vegan waters and I found this place while searching for vegan places on groupon. We have an infinite love for pizza as well, so I purchased their $20 for $40 deal. We ordered an extra large vegan delight pizza, Vegan sausage parmigiana hot sandwich (with fries included), angel bites and vegan cheesecake (wasn't on the menu, our waitress recommended it). It was all extremely delicious! The waitress was wonderful and the food was great. I believe the owner or manager was going around and talking with customers and making sure they were having a good time. I would gladly come here again, and would not hesitate to recommend them, I am sure their non vegan items are just as good!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2014-01-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9apsTivFhaVciP0rboK5Vg', 'review_id': 'BsZ99UYR3VGiNsr_Yelx7g', 'text': 'Love the Vegan and Gluten free menu!\n\nLast night I had the Vegan Delight and added some tomatoes...It was really awesome!', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2014-02-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'I2YTXk8pXJdB1rqq-iKNXw', 'review_id': 'rvyehYAXADbri3gzFyYZHQ', 'text': "Ordered take-out from this place so I can't comment on the atmosphere. I honestly was not impressed with the pizza. It's great that it was vegan but the sauce was average and was what mostly covered the pizza rather than vegan cheese or vegan sausage.\n\nI loved the vegan meatballs I ordered as a side though. They were excellent in the marinara sauce\nThat's all I had here. It was okay. Just had to give it a try and see if it was good. I don't  know if I would come here again. I normally like the pizza if the dough is good but I guess it just felt a bit too tough for my liking.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 3, 'date': '2014-02-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'jxXOmNH_Oe24zIa5qi2u1A', 'review_id': '-HcCqBPL6hS4XWWI9IAwIg', 'text': "This is a really adorable, small, mom and pop pizza place. The atmosphere is laid back and friendly, and the space is nice and cozy. They have live music some nights, and you will quickly realize this is a true family-owned restaurant (and these are becoming less and less these days). I haven't had the pizza here but had numerous salads and pasta dishes. I used to live in the neighborhood and Pizza Heaven was one of my go-tos after a tough day at work when I wanted to order takeout and a chianti before going home to change into cozy stretchy pants and eat delicious carbs!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2014-02-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': '6LFN_kU34NZ8zqdcbmnV8w', 'review_id': 'Of9RVOBQJSKhZ1ue7r_v3g', 'text': "Hooray for delicious gluten free and dairy free pizza!! So good you won't believe it. \n\nI was a little worried about the vegan cheese, but the consistency and texture was great. The pizza I had was so so good. I will be back for sure!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2014-03-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': '3gIfcQq5KxAegwCPXc83cQ', 'review_id': 'X7yApvGkZUtXMw_eQb8eyA', 'text': "This may have been some of the best Italian take out I have had in the midtown/downtown Phoenix area in a long time. The husband and I picked up some delicious food here last night. We split a calzone with pepperoni and basil, a side of meatballs, and an order of garlic bread. Total? 18$...whaaaat?!?! Awesome! and it was a ton of food too. The meatballs were really good, soft, but not too soft, and flavorful. The garlic bread was nothing too special, but it was standard. The calzone was very good. They loaded this thing with basil, it wasn't like a little bit here and there, so I appreciated that. Additionally, it had a lot of pepperoni...too much for me, but the husband loved that. They top the calzone with garlic and bake until it's golden brown.... this thing was so delicious and large, we certainly had leftovers. I also found out that this place will deliver all the way out to my house at 15th ave and mcdowell....awesome! This may be my new go to pizza. \n\n\nPS this place is very accommodating, they have vegan and gluten free menus... awesome!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2014-03-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 2}, 'user_id': 'aaHyqSTcpdkismEP0bj0rQ', 'review_id': 'clj9nMg_DXTVGex0GCRLxA', 'text': 'Good spot for cheap pizza and wings. Their lunch specials are the jam. Truly a pizza heaven. ;P', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2014-04-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wCvSVTTpwc4vLSdj_FW9_g', 'review_id': 'VfZ7DC2ud5QSlc3SZKzoxw', 'text': "I love this place but very disappointed they took their best sandwich, the pizza grinder, off the menu.  I guess I won't be going here as much now.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 2, 'date': '2014-04-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'raMSkwLdZ-kFea1fTY_-Ew', 'review_id': 'EnGisJg86sTLyjInUL5bcg', 'text': "I'm in love with their vegan pizza...soy sausage, BBQ sauce, and red onions, oh my! My only complaint is the crust...it's not great...sometimes I think it tastes like cardboard (that's why 4 stars and not 5). The toppings definitely make up for it though. I'm not sure what the crust is missing, but I wish it was better (or maybe not because then I'd be ordering pizza more often!!).\n\nWe have never been there in person--always gotten delivery. The delivery is fast...usually around 45 minutes. Once they forgot my soy sausage and the replacement pizza was here in 20 minutes. Great service!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2014-04-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ujxEf0qldCj1hnlXvqfOmw', 'review_id': 'uHM_stoGtt2UrZ5pnmTy_A', 'text': 'Very fast service.  Our salad was brought out to us almost instantly after placing our order and the pizza followed shortly after.  We had one of there vegan pizzas and it was pretty good.  Our three year old is a pretty picky eater but she liked the cheese pizza.  For the price point, service and quality of food I give it a 5 star.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2014-04-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1nPufzy8IvDMzpX6T54WAw', 'review_id': '-YrH6shGJGrYYBHLxXDbKw', 'text': "This is currently my go to pizza joint for Friday/Saturday night take out when I'm looking for that typical traditional crust style pizza (or in other words, when I'm in the mood to load up on a crapload of carbs).  \n\nAs others have pointed out they also have vegan options and Italian style entrees.\n\nAnyway, talking standard pizza here, the ingredients are quality, service is good (20 minute turn around whenever I take out), price is reasonable, and it tastes delicious.  There's really not much else for me to say. \n\nSimply solid (aka really good!) pizza (and breadsticks).  Definitely much better than your standard big chain pizza places.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2014-04-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'jU8PeynNOUYnba4H8sjLvA', 'review_id': 'MQpt5XDetjANAV_V8R_SWA', 'text': "First time I got it... I was not impressed.  But let me tell you... ordering a pizza with a whole wheat crust instead of the default crust makes a WORLD OF DIFFERENCE!.  The pizza went from tasting identical to Papa John's (with the normal crust).. to taste phenomenal (with the whole wheat crust)!\n\nSo happy I gave this place I second chance!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2014-05-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0XOT9z42wFSiMbNT2aP53g', 'review_id': 'QLK6HgR_LIl8yx5Gojkm6g', 'text': "Great pizza, quick service, friendly staff, good prices,  large portions. We'll definitely be back!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2014-05-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kqoiKdHJCWXXZlf8g05gWg', 'review_id': '_-HKLCcJMx-4UGOS0yg6yQ', 'text': "I rally love this place. Their calzones are huge and amazing and their Caprese salad is wonderful. I've ordered from them many times and eaten in their dining room a few times. It's a family run business that often has live music... Which is actually really good. I used to get more pizza for a little less money and now I get great reasonably priced pizza from a place feel good about patronizing. Order from here (and do your self a favor and try the meatball and sausage calzone)!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2014-05-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 0}, 'user_id': 'u8Nb6ggdUFleRZjuRJRO3A', 'review_id': '0omWMjbaggRUHdlDtCcvGg', 'text': "Fry's Take-N-Bake pizzas are better than these bad boys and only a 1/4 of the cost.\n\nLast night a good buddy of mine and I had just finished up a long year of teaching and we wanted to celebrate by staying in, stuffing our faces with pizza, having a few beers and watching a movie. The beer was good, the movie was terrible, but the pizza might have been even worse! After ordering a single medium Veggie pizza using the EAT 23 online ordering service the pizza arrived about an hour after placing the order (not bad). The pizza + 10% tip was very pricey, $20 for a single medium pizza.\n\nMost of the veggies on the pizza tasted undercooked and were still dripping water as if they were not properly dried out during prep and through the oven bake. As if the pizza wasn't bad enough, to add insult to injury, my friend had made a Fry's pizza for himself that tasted much better than the pizza I had just dropped $20 on.\n\nI will not be returning here anytime soon.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 2, 'date': '2014-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'lMPTQT0jf6-S7AxhMoOZzQ', 'review_id': 'gzNtf4BT9xM2zFj23nZ8lw', 'text': "I had eaten here years ago. My family went again tonight because we had a Groupon. It was actually a great time. The waitress was VERY good- sorry I don't know her name. Shee was on my families refills. \n    The food was good- My husband had a calzone- He loved it. We had mozz sticks, maybe the best ones I've ever had. We had a 20 pc mild chicken wings. They were so far- my favorite milds. I'm picky because I can't take really hot stuff and these wings were tasty and good. Great size chicken too.\nWe had a pizza and it was ok. Not the best, Not even close to the worst. Nothing bad to say. I will go back for the wings:)", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2014-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LHDOSzJYOqTBIoOif8mj2Q', 'review_id': 'UZeAOSvfDHvFiryCL9c3qQ', 'text': 'Awesome Wings. Perfectly cooked, and nice and hot. Pizza was Brick oven cooked and all of their meats and ingredients are fresh made in house. Check it out!', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2014-06-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MUliKalnxiHIBmeRB5d-oQ', 'review_id': 'JwpZ_X3po-TO3_zzeB3OZw', 'text': "I ordered the vegan meatballs and the vegan calzone. The meatballs were fantastic, especially in that super spicy buffalo sauce! However, I was disappointed with the calzone. The cheese was tasteless and the vegetables that I added in had hardly any flavor. It's difficult to find vegan pizza, so I was a bit discouraged to find that the food wasn't up to par with other places I've eaten at. I'd definitely be willing to give it another try, though!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 3, 'date': '2014-06-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'YYaF9IhlqVL0OXOBdTY4WA', 'review_id': 'b0lTNiqoknKwLzxVbyaWvQ', 'text': 'This place is great for vegans, omnivores, anyone! Homey, great service, on the weekend the owner comes by and chats with you and offers samples. Almost everything is homemade, no preservatives, great ingredients.\n\nThe homemade vegan plain cheesecake was amazing. Wow. Would have that again a million times.\n\nThe garlic bread with Follow Your Heart cheese was really, really good.\n\nWe forgot to order the Mediterranean Pizza with whole wheat crust, but it was still good.\n\nThe veggie balls starter is a potato/veggie fritter and very good.\n\nThe prosecco is a good deal.\n\nThe salad was very nice and big.\n\nWill absolutely go back!!!', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2014-06-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BsgXTs_hz4AwgbK0wSIIxw', 'review_id': '7TekDQpVBfBLhYU3zSXpbQ', 'text': "I purchased a voucher from Living Social; $10 for $20 towards food.  I'd gitten a sweet PayPal deal a while back and we enjoyed the pizza so I bought this voucher.  I am so pleased that I did.  We sat in a bck booth (luckily away from the live musician).  We ordered baked ziti and spinach lasagna.   The hubby go a sald yo go with his ziti and I got Reisling with my spinach lasagna.  The dishes came piping hoy and cheesy.   The hubby's ziti was the perfect texture, sauce amoubt and crispy cheese was amazing.  My loaded spinach lasagna was firm, full of spichach and covered in cheese.  I have to say the salad and wine were noyhing spectacular but functional.   The garlic toast was soft and buttery as well.  The service was adequate; perhaps a little slow even though it wasn't super busy.  The biggest complaint the live musician who was a good background music piano player but when he sang it was embarrassing.   He wad not good.  Would have been had he not sung at all.  Otherwise it was a terrific Friday night dinner out.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2014-06-27', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'lf1OwxHhisW1Sxm_aE75Gg', 'review_id': 'XxeYskkVcReh7vR0MLxBjQ', 'text': "We got a groupon and was not impressed. Overall rating 5 out of 10.  Food was ok. Waitress was bothered by us.  It was hot in there.  I did like their pasta alfredo Primavera.   The other thing I didn't like is they only have one bathroom for everyone.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 1, 'date': '2014-07-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Fj0U7VELpjOSC1t9H3B2-Q', 'review_id': '2zhwUASvS8Y__Mjz4NPasg', 'text': 'Very good pizza, great service, hip live music and tasty Vegan options! Family-owned is a plus! Drive the old car as parking is very tight.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2014-07-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'LAX6E8jEAj82R_SH1mwIvQ', 'review_id': 'duj-qasIXAxwKfvE-56F2A', 'text': "Consistently good food at reasonable prices. I'd rate the pizza above average, but not great. Lunch specials are a good value, and they are available if you ask for them all day long. Relaxing atmosphere, as long as it's not crowded. (Note: Lunch specials are no longer offered all day, which lessens the appeal of this restaurant, in my opinion.)", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2014-07-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '0iJJhrUFHNRzgcPIXt7jeA', 'review_id': 'gvTdE6KXEvrFcGP7YYu6XA', 'text': "I am very disappointed to say the least! I ordered on GrubHub for delivery. \n\nI ordered fried zucchini sticks which were pretty good! Except finding an order of mozzarella sticks tossed in with them which was not a good thing considering they were less than satisfactory. \nThe pizza slice I ordered, is probably one of the worst slices I've had in a while! I'm glad I just didn't order a full pizza. \n\nSo the slice of pizza was part of a meal special: slice, wings, and soda. \nNo soda came and the wings were rock hard.\n\n\nSuch a waste of money. I will not be returning.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 2, 'date': '2014-07-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dP0WVIAgnk4KQLqch5Ehkw', 'review_id': 'jflMhn1kO0ZN6Va9Zlrqdg', 'text': "I am speechless!!!!!!\n\nThere are a few things my hubby and I are picky about: Eating out, Pizza and good service!\n\nIt is a cute, quaint little place full of warmth and \nhappiness! Too cheesy? Just like their amazing pizza!\nWe were greeted with friendly faces and you can tell that they loved their jobs! We were immediately seated at a table, I asked our server if we could move to a booth as a family just left and the live music was a tad bit too loud. She quickly cleaned up the booth and let us move! The music was still a bit loud, but it was much more cozier in the corner booth. \n\nWe ordered a pepperoni pizza, mozzarella sticks and baked medium chicken wings. A-H-MAZING. Their marinara is homemade and delicious. Their wing sauce had just the perfect kick and the pizza was absolutely delicious, so ooey and gooey!\n\nOur server was awesome. Sadly I do not remember her name. But she was on top of her game. Very welcoming and personable. She checked in on us a lot but not too much. And she didn't ask how the food was as we took a bite ;) \n\nBy far the best part about this experience was finding out it is family owned and operated. The owner actually checked in on us as well. \n\nIt was a great experience for a great prize. We spent under $40 and found the perfect date night spot!\n I am from Chicago, so I know what good pizza is, and this was fabulous.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2014-07-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'FYn3RH6ylugme8Bspjn8BA', 'review_id': 'jIsk7h-Z0wwVm7qGIhkZzQ', 'text': "I'm in love with this place! It has a hearty vegan menu (and of course non-vegan stuff). Such a treat. The vegan sausage sandwich was delish and the vegan cheesecake was just as good if not better than regular cheesecake. We went on a Friday and the owner's 20 something children were playing a live acoustic set. Such a great vibe this place has. So happy to have found it. Yay!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2014-08-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Dp-eLYwNNROIct-PNXAp5A', 'review_id': 'MxoDESpum4JSj8U3bIccxA', 'text': "Great pizza and quality live music. Two of my family members are vegan and ordered the meatless sausage and meatball sandwiches. I had a bite of both and they were delicious. The owner recommended her original handmade vegan cheesecake. It was excellent. It wasn't on the menu yet so you may have to ask for it.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2014-08-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'f4FRDGDaYMrfxz-0MHF4FQ', 'review_id': 'hK9jCROx85V9GaDDg7QnQQ', 'text': "I have been wanting to try the food at Pizza Heaven since I moved to Phoenix from the East Valley 3 1/2 yrs ago. My first experience was not so good. I called in my order and the lady who answered was a bit rude. My food was supposed to be ready in about a 1/2 hr but that was not the case. One of the guys gave me and my brother-in-law a piece of pizza to sample since we were waiting so long. Apparently there was some confusion about my order being pick up or delivery. An hr after I called in the order, my food magically appeared. It was sitting on top of the oven. I was angry. But when I bit into the vegan delight, all my anger subsided. The BEST vegan sausage and vegan cheese I have ever tasted. \n\nMy husband and I fell in love w the vegan menu and I'm embarrassed to say we went there 4xs in one week. It is that good!!! We picked up the same pizza 2 nights later and then dined in and our waiter was phenomenal. Not like the lady who answers the phones. The vegan starter w veggies and bread was so Delish. I think it was called the Mediterranean Medley. The next time my husband picked up vegan sandwiches and the veggie ball sandwich was out of this world!!! Food is fantastic!!!! Now if they could just give the phone answerer an attitude adjustment, this place would be perfect!!!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2014-08-24', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 0, 'cool': 0}, 'user_id': 'ygZTPe52ZhK9jOBzS8GQ8g', 'review_id': 'MTNXUbFMz83XqiHcP3cSXA', 'text': 'Ordered delivery to a hotel nearby. Estimated delivery time was 45-60 minutes, and I got a phone call from the delivery guy outside at 45 minutes on the dot. Great timing! Pizza was good, meatballs were GREAT.\n\nWe noted in the special instructions "send forks and love". After handing over the goods, the delivery guy then said "uh.. they told me to give you this" and produced a drawing of a heart. Made us laugh, and bumped up the experience to a perfect 5 stars. Thanks Pizza Heaven!', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2014-08-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '6-EJ34hKlpQWQ4u3zAmXlA', 'review_id': 'PXBWFFUPnDVSOrBiizuI6A', 'text': "Once again, extremely delicious with impeccable service. I've been here a couple of times and have always enjoyed the food, service and ombiance. The pastas are excellent. Try the Tequila with lime sauce or Chipotle sauce both with chicken. Treat your taste buds to excitement.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2014-08-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0RmkyM-EnUwYcudcdbgdKg', 'review_id': 'i6dOw0-EaM4CafEH7aVPhA', 'text': "One of my favorite pizza places!! I've only ordered delivery but would dine in if I wasn't so lazy!!! ;) I love the wheat crust option!!! Zucchini sticks are delicious..,and I could go on...!!!!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2014-09-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'MxA_wJOmUJxN1AmELO0RjA', 'review_id': 'vBPP6CLbXsXtnamOXzfVDw', 'text': "Great prices for the the quality of pizza.\n\nWe got wings and the pizza. It was all good. No complaints.\n\nQuick, friendly service. So good.\n\nEverything was good. Like, so good. It's my new fav pizza place thing.\n\nSo good. Like, good.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2014-09-05', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'HestW1GKSkmUs_vpnauE_w', 'review_id': 'NuqLYFtA1UnlJ8oxEiWFNA', 'text': "There's something that screams COMFORT FOOD about this place...italian comfort food. Almost like a home cooked meal by your italian relatives in NY. The prices are very reasonable and the food exceeds that price point. Their meatball app is delicious and tastes very authentic, pizza is delicious as well. The server was also very sweet and attentive.\n\nOverall, great food for a great price.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2014-09-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ly5wJwmzaKJbTT3rW4Wwcg', 'review_id': 'LBFFNTNSwBDoB4IOwjKCDQ', 'text': 'Homemade Italian food. Just like what I remember in Italy. If you want to escape and feel like you are away in Italy for a night, then this is the place. Homemade sausage is too die for.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2014-09-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kHaL_1N5RMLLVF0VliN-9A', 'review_id': 'SAhi9gZIAioVsqe5924RiA', 'text': "For a local joint, it isn't too shabby.  I've ordered delivery twice so far, and both times they've been earlier than they estimate (first time they were a minute early lol, the second like 20 minutes).  They even call to let you know they're on their way, and the drivers are super friendly.  The pizzas are tasty, especially for their price point.  The first time I ordered a cheese/half pepperoni pizza, and it was ok.  Nothing to write home about.  Oddly enough there was one super tiny slice that had no cheese on it lol.  I couldn't explain it.  Second time it was the margarita, which was good.  The wings are big and meaty, and have always had tons of sauce.  Great experience.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2014-09-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'RlAAn9opjQww-rLW_HSXOw', 'review_id': 'FU54XbttSWaEjpGn5A4MvA', 'text': 'I came here on a Saturday night, with a Groupon. It\'s a small establishment with a compact parking lot, and both were jam-packed. Luckily, someone was leaving as I was pulling into the lot, so I was able to grab a spot. (I don\'t know if they have an overflow lot, but they should.) \n\nOnce inside, I quickly observed the "Please Wait to be Seated" sign.  We were asked how many were in our party, after which the hostess/waitress (they seem to be one in the same) scurried off to assess the availability.  As said earlier, it was packed, and there were others also waiting.  I was thinking we\'d have to wait forever and that my starving spirit animal would come bursting out of my abdomen, like in those beef jerky commercials. But we ended up waiting no more than about 5 minutes before we were shown to a booth. (I love booths!)\n\nDESIGNATED VEGAN MENU:\nThere\'s a vegan menu inserted inside of their regular menu.  The waitress said that patrons keep taking them out, so if you want the vegan menu and don\'t see it, just ask for one. \nThe vegan options include appetizers, hot stuffed sandwiches, pasta, calzone, pizzas, and desserts.  It wasn\'t listed on the menu, but they also have a vegan cheesecake, which you can get topped with chocolate syrup or mixed berry sauce. \n\n\nMy order:\nVeggieballs in buffalo hot sauce -  They are described as vegan meatballs, so I\'m thinking faux-beef "meat" balls. I was pleasantly surprised when I cut into one and found actual vegetables: peas, string beans, carrots, & corn. They were positively delicious. A slightly crispy coating covered in a proper buffalo sauce, which had a legit heat level. Excellent dish for only $5.95. Comes w/ vegan ranch and carrot sticks. \n\nVegan Spaghetti with soy sausage, $8.50 - (Beautiful presentation.) The pasta noodles were cooked perfectly al dente. The sauce and the soy sausage were bland, however.  Aside from flavor, I don\'t know what to say that it was lacking. A dash of this? A splash of that? Not sure, but it was a pretty big boring bowl of blah. I kept furiously twirling my fork in the saucy mix, thinking that maybe the flavor was at the bottom somewhere, clicking its heels thrice and trying to get back home, but no luck. If you avoid salt/seasoning (and flavor), as well as meat, then this is your dish. I liked the vegan garlic bread though. \n\n\nDessert-\nVegan cheesecake w/ mixed berry sauce, $6.50 - I never ate cheese before going vegan, but I used to eat cheesecake (weird, I know), so I do have something with which to compare vegan versions. I have had some better-than-real-cheesecake vegan cheesecakes, but this isn\'t one of them. I did not like it. The cheesecake had a weird, grainy, earthy taste to it. And it was like, almost smooth & creamy, (*singing* Ooooh, we\'re 1/2 way theeeere...) but it didn\'t quite make it there.  Silver lining? The crust and mixed berry sauce were both good.\n\nAngel bites, $4.95 - (If you\'ve ever been to France or New Orleans, think beignets, except here, they are vegan.) They cover theirs with cinnamon and powdered sugar, and they offer you one of 3 dipping sauces: agave, chocolate, or caramel. (The caramel is NOT vegan, fyi.) I chose the chocolate. O-M-G. These suitably named bites of awesomeness brought me life. They came out hot, fresh & ready to be devoured. This is one of those treats that you want to eat right away because you know they won\'t taste the same later. But they give you so many! (Which is a great thing!) You can easily share this dessert with 2 or more people.\n\n\nNon vegan:\nMy non-veggie DD got the Mozzarella Sticks as an appetizer, and the Cajun Chicken Alfredo pasta w/ shrimp added. She liked the pasta, but said it was definitely spicy.  \n\n\n\nNice ambience, especially for dates. I don\'t know if they take reservations, but I suggest asking, especially for busy weekend nights.  As busy as they were, the staff was still nice and attentive. The owner was making rounds and asking patrons how their meals were. Cool little bistro. Great for vegans dining with omnivores.  I\'ll go back for more buffalo Veggieballs and Angel Bites.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2014-09-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'n4VZ3h4mw5jfTbloiHHIzw', 'review_id': 'Z-v8ryRK86nV0n8gmleAVg', 'text': "I ordered pizzas to be delivered as a surprise for my long-distance boyfriend and his friends who were visiting him in Phoenix. I live in LA, so I really had no idea where to order from, but this place seemed to have the best options and the most stars on both Yelp and GrubHub. I called at exactly 10:30am when they opened on Saturday morning, and the person on the phone was so awesome and patient with me, not only agreeing to include a personalized note (which I was hesitant to do and he convinced me it was a cute idea), but he let me think about what to write and call back when I finally figured it out. My BF loved the pizza (and the note).  He sent me a pic of the pizzas and they looked absolutely amazing!! This place rocks and I've never had better customer service while ordering takeout.  I'm definitely stopping by next time I visit Phoenix.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2014-10-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '_4lqpCYCqOQzbB6xQGGhrQ', 'review_id': '10QUaLu86X9hxuh_KXcRmA', 'text': "We had this for lunch today.  I had split a Spinach salad with 5 medium wings. I'm a wing person and love good wings; however these were far from great.  They were tiny wings and the sauce was just too watery and not great.  The salad had wilted spinach.  I picked pieces to eat, but threw much of it away.\n\nI wont be back.  \n\nI gave it two stars because a co-worker liked her sandwich.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 2, 'date': '2014-10-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jUIPLS7HbjuOlnuuf555Vg', 'review_id': 'sF3AXmGD8jBBgG_EXRLSGg', 'text': "I love the pizza. It's not the greatest pizza I have ever had. It is, however, the best I have add thus far in Arizona in the 6 years I have lived here.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2014-11-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fHr5szgRRYlDA3RFfUmQ7w', 'review_id': 'HiwsNcanH72s67WfDKbVWw', 'text': 'The food is great! Atmosphere is awesome on Fridays because of live music! Definitely would recommend !', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2014-11-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'E2360zrNp9oPL8g3kx_sag', 'review_id': '05Ifd4HpfOGBfZgHVUacug', 'text': 'I love this place!!! The best pizza in Phoenix! And the meatballs are delicious made just right.  The service is great very personable. I had the chance to meet the owner. She is super sweet and all of her dishes come from her own family recipes... Amazing!', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2014-11-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'R2UiRB8UZaoIxeju4vcWKw', 'review_id': 'xrsnEpcWHTN8jWuCpvIeEQ', 'text': 'Cute spot we found on yelp. Wings were great and crispy and spicy. Pizza was delicious not too thick.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2014-11-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GsBwRuKPReQJ2uJA42aB8w', 'review_id': '_9RnUS81VmZJz-D7OJdyjg', 'text': 'Custom calzone was amazing... Great mozz sticks and chicken wings very good.  Got delivery to a local hotel. Fast fresh and awesome!!   Get a calzone w ricotta mozz parm salami and sausage. Unfknbelievable!!', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2014-12-04', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 0}, 'user_id': 'h7YTokLS1aXCIuN-ipmE-w', 'review_id': 'D3rCT7KSJxAcEX1aOsLndg', 'text': 'Undercooked noodles in the spaghetti.\nThe meatballs in the spaghetti were bland and overcooked.\nThe wings were so small they had practically no meat on them. \nThe side salad came with shriveled greens and cucumbers that look rotten.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 1, 'date': '2014-12-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ll-ILdELsRg-iZ5jSzB1vA', 'review_id': 'DoG7hxHzD2chrO-QbLEkhA', 'text': "Pizza Heaven is like the goldilocks of the Pizza food world. When you're looking for something juuuust right. The food is delicious, and the prices are reasonable.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2014-12-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': '5jODkdonMV0HbIIPik1RuA', 'review_id': 'SC-aF7iOaJ45dkySn81pDA', 'text': "Pizza Heaven has been on my list to try for quite some time now & I honestly haven't gone because I initially thought it would be more on the comfort food side rather than healthy quality food, boy was I wrong.\n\nLast Saturday night after I over worked out myself, my body just needed some... CARBS!!! I decided to finally give Pizza Heaven a try. I was hesitant at first & I asked the waitress too many questions. My diet is vegan so I am always used to fresh quality food & as of a couple of months ago, I dropped sugar out of my diet as well. I was hesitant on the vegan cheese, because it stated that it was soy so I wasn't sure if it was non-gmo or if it contained sugar. The waitress was amazing, she brought me out a folder that had all the ingredients of the foods that they use. The vegan cheese brand is Follow Your Heart & it did not have any added sugar nor genetically modified ingredients. I started to be more opened to this menu & decided to order a vegan calzone w/ mushrooms, onions, & spinach. \n\nOh my gosh, DELICIOUS! And, it's also huge so I will have lunch for a few days too. The calzone bread was amazing & it only contained four ingredients, sugar not being one of them. It was topped off with EVOO, not butter, so it was just as vegan as it could be. The sauce was amazing, it complimented the calzone perfectly.\n\nI talked to the owner for quite a bit, who is wonderful. She informed me that her French fries are not fried in the same frier where wings or other meat products are fried. That is beyond amazing because not many restaurants will invest in a separate frier to accommodate to their vegan population, not even big cooperate restaurants, & I know this for a fact. She also uses purified water when she cooks & not tap, she is very passionate about her business & the quality of her ingredients.\n\nI cannot wait to go back. This was exactly what my body needed last Saturday. I really enjoyed my experience & the amazing food.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2014-12-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '147BraSfyIaBO4ltaZVPIQ', 'review_id': 'apQn71jnP4Oz5fwYoUEE7Q', 'text': 'We ate here twice during our stay in Phoenix. I very rarely have pizza...basically like never. This is because of my preference for plant based foods and not many places create a suitable pizza, and those that do use Daiya, which I find disgusting! Well, Pizza Heaven uses Vegan Gourmet. On pizza I don\'t even know if omnivores could tell the difference!\n\nMy son ordered a pepperoni pizza off of the "regular" menu said it was good too. Our 2nd time there we shared a vegan pineapple pizza (light on the "cheese") and we both enjoyed it, just wish there was even more pineapple on it.\n\nPizza Heaven has a separate Vegan menu offering which earns tons of bonus points in my book!\n\nThe staff is super friendly and the restaurant is clean!', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2014-12-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'b9jEHfJTSRyVXn6fuuQtUw', 'review_id': 'GeSEc9JwhwjFs4TwZm_xqg', 'text': 'Great service! David was wonderful and efficient. So kudos to you. Thanks for making my mothers birthday fun. The brownie was good. :) great GLUTEN FREE options-especially dealing with pasta.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2014-12-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'n-2gSytw4x3Q_rbweZnfuQ', 'review_id': 'wWGZSQty9PK6L30f20ppow', 'text': "I like the dimly lit bistro atmosphere of the place, the prices are fair, and the Agave BBQ pizza was pretty good. I see they even do a pretty generous $5 two slices of cheese pizza and a drink special, that intend to do sometime in the not so distant future. My only complaint, and it's worth mentioning, is the wait time. 35 minutes seemed a little long. \nI'll go back for sure. Hopefully that wait isn't an everytime deal.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2015-01-05', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 8, 'cool': 4}, 'user_id': 'wuCszpVPMIMyOCualnZtaw', 'review_id': 'RydHTAH5dGohETPDg6kw0w', 'text': u"Even the name fails to covey what lies inside.\n\nPizza Heaven is the type of place you could drive by and never even notice however, that would be a mistake because Pizza Heaven Bistro  is a great place to grab Italian food at a reasonable  price.\n\nI have been to Pizza Heaven a few times and have never been disappointed. The menu includes a wide variety of pizzas along with a tasty selection of pasta entr\xe9e's.\n\nPizza Heaven Bistro is fairly small however, they have a robust take out business as well as a very busy dine in traffic.  The food and the service are always good. The atmosphere  feels a bit like home. What more could you asked for.  Good food,  good service,  great prices.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2015-01-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'E3RGY08u0-pjCyC5iL1k1g', 'review_id': 'v7Jnr-zMoBoGO4qfIabWRw', 'text': "Placed a carry out order through grub hub. I got the cajun chicken alfredo and bread sticks. The pasta came to my apartment still piping hot. The meal was good but the noodles were all stuck together which made it difficult to eat. Not sure if the sauce was just super thick or the noodles were over cooked. Either way I'd still eat there again.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2015-01-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rqyLbizGe7uXPhgPh1FVbw', 'review_id': 'fr4td31U5FGt5U-mT2svkw', 'text': u"Stopped in to load up on carbs before the Arizona Rock n Roll Marathon since there was a lucrative Groupon available. From the get-go service was a highlight. The owner, Patricia, was very attentive and accommodating since we sat outside and one of the heaters wasn't working. It didn't stop there, though. She and her staff were great, even the in-training waiter that served us. The baked ziti, spaghetti with meatballs, slice of pizza, jalape\xf1o poppers, and angel bites were all perfect for us. The restaurant claims to make everything in-house and the taste of it made it hard to deny. Great local Phoenix spot!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2015-01-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Dp-eLYwNNROIct-PNXAp5A', 'review_id': 'qe02eZfzwYejluEBu-D26A', 'text': 'Excellent food. Vegan dishes and live music on weekends. The staff and owner are always friendly. We love this place.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-01-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2PeotUk0AFuvebc6p_0-zQ', 'review_id': 'TJl2tB40U70C_GNVA4cGRQ', 'text': u"Great for delivery! And being able to order through Yelp makes PH an easy choice for the nights I don't want to cook at home. Have had the Works Pizza, lasagna, meatball sandwich, and jalape\xf1o poppers - all of which are stellar. Reasonable prices for non-chain pizza, Italian dishes, and quick delivery. Pizza Heaven is a weekend staple at my house!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-01-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 3}, 'user_id': 'apxQQRz60yZGvfCW1snQ0w', 'review_id': 'yFKTCj1lUO2J-9nFHjTIlw', 'text': 'Here with one of my best friend Wade, and we decided to try a new spot.... so amazing. Food and service is on point. Totally recommend it.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-01-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ymY2hX6Jifd_SLnA5Weilw', 'review_id': 'qiN2iV64isGPi__eDC-HPQ', 'text': "If you're a wing lover, this is a place you should try!!!!! The suicide sauce is delicious but do is every other sauce. I get these wings all the time just for that amazing wing sauce. I have tried the slices of pizza and wouldn't recommend them unfortunately. There is too much oregano or some green spice that ruins the taste of the pizza, but whatever I still get wings all the time! Amazing!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-01-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pIf58G8tphaK6OL38JRiYA', 'review_id': 'PO_RwrF_2pdtnu9sTlfXsQ', 'text': "what can I say about this place that hasn't already been said.  when I go in. It reminds me of the bistro in the lady and the tramp. I FREAKING LOVE THIS PLACE!!! I will continue to come to this place as long as I live in phoenix.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-01-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 0}, 'user_id': 'ORPv-t8QOY62SmElm8YN7w', 'review_id': '9GzXiOoF9Sk3z2vN6BpyEQ', 'text': "We ordered delivery.  The spaghetti was terrible, it had a weird taste to it! No effort!  The  cheese on the pizza was thick and chewy!  I don't know why this place has 4 stars.  Maybe if you dine in this place delivers 4 star quality food.  Pizza Hell!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 1, 'date': '2015-01-31', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'SCnjME3Mj9iPIM9S2wrloQ', 'review_id': 'pWtrNMV2hmdAUZTB7pNk_Q', 'text': 'I hate to say this in a review, but the only thing that comes to mind when I think about this place is, "I\'ve had better."\n\nThe dough was not too good, not too bad. The toppings, meh. The sauce was decent. Delivery was not fast, but not excessively slow.\n\nIt was definitely an underwhelming experience, but certainly not the worst thing I\'ve ever tasted. I would like to say that the taste and quality do not match the price.\n\nIf the management is paying attention, I would like to suggest that you do something amusing and put bible quotes, or something along those lines, on your pizza boxes since you are \'heavenly\'. Just a marketing thought.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 2, 'date': '2015-02-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'AXqvAfSdnWZUnbaMkVbc9w', 'review_id': 'kejJIwu1FWco0QDacCO31A', 'text': "Today is my 21st birthday and after some unfortunately events, I was on my way out for a nice dinner with myself. First off, their customer service is outstanding! My family lives in California, so my dad called Pizza Heaven and told them he wanted to secretly pay for my dinner. I had no idea so when I go to the restaurant and was served a glass of their house chianti- which I'd recommend highly. I was given great service through out the entire meal and they were so great in making me feel special on my birthday! I did't even mention yet that they have GREAT vegan options! If you are a vegan/vegetarian you know how hard it is to go out to eat, but I was able to get an appetizer, entree and delicious vegan cheesecake dessert without hassle. This place is such a great hidden gem, I would recommend it to anyone!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-03-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'SxZV-iqRoO1ERfrQvKbpkA', 'review_id': 'r6XOqHQxNHE2rKEXihgtIA', 'text': "This place has really delicious pizza. I had a sausage pizza from here last Sunday along with their angel bread sticks with marinara and I could've engulfed the whole thing. Their Hawaiian pizzas are also great, as are their calzones and lasagna. The owner is nice and friendly and this place is always busy, so overall, don't miss out. A great gem in Phoenix.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2015-03-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Fj0U7VELpjOSC1t9H3B2-Q', 'review_id': '46NptTGL9fGZXBmH6_8FWA', 'text': "Still a fan of the pizza but the service Friday evening didn't impress me. They weren't very busy but the service was VERY slow. We were told the patio heater over the empty table we wanted was not operational, so we had to sit in a booth indoors, only to see the heater working just fine for another party on our way out of the restaurant. The live music was nice but lots of breaks for the singer, as she would do 1 or 2 songs and disappear for a bit and come back :20 later and do another few. Not impressed this visit.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 3, 'date': '2015-03-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'r7d9Dy6dMzMJoZ6MB8s1TQ', 'review_id': 'D2N8NMaxoQDNTxdpSlgiew', 'text': 'We went in with a $40 Groupon, and ordered up the Mediterranean mix, as an appetizer, and a Greek Pizza, and a plain cheese calzone, along with a couple of beers.\n\nIt was all so good, but impossible to finish, so...\n\nWe had delicious leftovers the next day.  I thought the staff was friendly, and even though we were there too early for dinner, everything was great!!', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-03-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MBhvsi8dJTHuaKn4v98XRw', 'review_id': 'lnLo3XI3viheQzA33NLzjQ', 'text': 'I only do take out so all that matters to me is a kind person at the register and a high quality pizza at a fair price. Pizza Heaven exceeds in every area. I am not sure how they get such a wonderful staff, but it never fails that they go the extra mile in the smallest ways. If pizza is not ready when I arrive, they offer a free drink. If I order a group of items that are on special they charge me less without me asking. They are just genuinely good people and it is for real. It is the kind of deep rooted pursuit of perfection that I have rarely encountered but always admire. Well done and appropriately named.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2015-03-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'jRtdO03kWbReasB_vBlTsQ', 'review_id': 'sHqwFhrZIuz1F4rFghuMkw', 'text': "Went here with 11 of my friends on an early Saturday night. They had plenty of room to accommodate us all... they only messed up 1 order, considering our group size that wasn't too bad. \nI got the hand tossed pizza... I think I would have preferred the thin crust. I was told they had NY style pizza but to me the standard hand tossed crust was too thick to be called NY style. NY style needs to fold easily and you need to give it a minute in its folded state to drip out the excess grease. The folding action was challenging and not nearly as greasy as I expected... I have to say that I still very much enjoyed my pizza. The sauce had a nice spice and the cheese was gooey.\nI think I'll have to try it again with the thin crust and perhaps my 4-star will go to 5-star. Others ordered entrees from the menu and everyone was quiet when eating (always a good sign of good food when you're too busy eating to talk).", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2015-04-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'GZkbhScWunfZH21GNoD9Ww', 'review_id': 'DAhtlxvkb6GJkJeyKvh_Zg', 'text': 'I hope the pizza is better then the wait! We were told it would take about 15minutes for our order to be complete. It took them 50 minutes to complete our order. We then approached them about taking so long, they did not want to accommodate and finally said they would give us 50% off the next time we come. Well we are not sure if we will be returning. The wait was too long! Praying the food is good ..fingers crossed!', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 2, 'date': '2015-04-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GlTmxGZGMrBAcw0iwy3NdQ', 'review_id': 'Ikhf6aLKGIgefhpNHFzFcA', 'text': "I didn't die, but I have been to heaven... pizza heaven that is. \nThe parking on a Friday evening at 7 was hellish. \n\n\nThe decor was nicer than I expected in the dining room, cozy and romantic and there was live music.\n\nThe pizza was thick and doughy, more along the lines of a dominos style pizza then a fancy authentic italian pizza.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2015-04-27', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 5, 'cool': 2}, 'user_id': 'WrP60_4xzolbZ4J0jteLJA', 'review_id': 'YFMnbGiXV-DHmAiZUiQDaQ', 'text': 'I had been wanting to try Pizza Heaven for a while now and it was a huge let down!\n\nFood was decent but not great. I didn\'t even get everything I ordered. When I asked our server about it, his response was "I\'ll take what you didn\'t get off the check."  Ya think?  \n\nService was horrible. I had to help myself to their back area for a to-go box and then had to ask for the check at the register up front because our server disappeared. The place was empty!  Here is a tip server, when you don\'t have anyone eating in your restaurant, you should go above and beyond taking care of customers who are.  \n\nI won\'t be back! Too many other fantastic independent restaurants in this city to waste my time at Pizza Heaven again!', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 1, 'date': '2015-04-27', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'MlujGFDctg_hOPiDqb-2ig', 'review_id': '-QhCdW7_YJB-3Z0Y9ei1XA', 'text': "Patricia, the owner, contacted me the same the same day about my ordering difficulties.  It appears to have been an issue with a phone outage and Patricia wasn't contact by Yelp about it.  So I guess I need to give Yelp a 1 star review!!\n\nPatricia has made me an offer for a free entree for my troubles and due to this I will change my review to 3 stars.  Once I order from the Bistro I will change the review again based on what looks like really good food.\n\nThank you, Patricia, for your prompt and friendly response!!!\n\nReceived my order today and it was DELICIOUS.  I love the chicken on the salad, very flavorful and moist!!!\n\nThanks again to Patricia and I will definitely be ordering again soon.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-05-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'qZ4Qml5Ex-ufZ699DTvNyQ', 'review_id': 'peKkUARZ4mH74rGYdqtoYA', 'text': "Overall less than expected experience for our first time here.  To keep things simple I have listed some information below:\n\nPros - \n\n1) nice staff that was friendly and consistently apologized for the negatives that will be described below\n2) food was hot and seemed fresh and in general was okay in my opinion\n3) prices seemed reasonable and in line with the area\n\nNegatives - \n\n1) very long wait for our food\n2)  we ordered two children's spaghetti and meatball dishes and requested that this come out as soon as possible and they ended up coming out within minutes of our pizza, which I would expect could have been prepared faster than a pizza\n3) we ordered some chicken wings that were completely forgotten\n\nIn summary, the less than expected experience for a locally owned business was disappointing but hopefully it was an outlier night for them (although I won't know as I don't plan to return)", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 3, 'date': '2015-05-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'orqBjz-TCSHn7nLnoWio_Q', 'review_id': 'yNWb7VNOaWxwnAxXtK5OsQ', 'text': "Ok...this place I really really liked. My husband had the jalapeno poppers and Hawaiian pizza and I had the spaghetti with meatballs. Portions are hearty. Was it the BEST pizza and spaghetti, no but it was pretty good. Our server was super sweet and the guy bussing tables was friendly as well. We'd definitely go back.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2015-05-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'apdkvAEuNlpcVdki8nz0yQ', 'review_id': 'v3-RjJKJc26vgyr9Q2dAww', 'text': 'I\'ve tried Pizza Heaven three times (Takeout with family, lunch eat-in with co-workers & lunch eat-in with in  laws) and each time I\'ve not been disappointed.\n\nQuick Summary: Large portion sizes, affordable, flavorful, courteous service.\n\nThe services: Each time we have received courteous service at the counter. There is really no waiter during lunch hours, and I\'m not familiar with their dinner service, so I can\'t speak to this. You walk in, order at the counter, get your drinks, and find a table to sit. Once the food is ready, it is brought to your table along with plates & forks. \n\nThe wait time: Medium to Long. Depending on what you order, it can be on the long side. The longest we waited was 30 minutes to get 2 veggie and 2 meatball hot stuffed sandwiches, and 1 pizza (which we requested upon ordering to have it packed as \'to go\'). If you are in a hurry or have a larger group, I suggest calling ahead and placing your order for eat-in.\n\nThe food: Dedicated Vegan Menu? Yes, please. Large portion Sizes? Absolutely. Tasty, flavorful comfort food? Right on target. This place was a hit with both my carnivore family members and co-workers, and my vegan preferences! Portion sizes are in fact very large, the hot stuffed sandwiches can easily feed 2 people, and if you order the calzone make sure you are going to share! \n\nVegan Menu: High ratings to the vegan veggieballs - they are flavorful and full of veggies! I was expecting them to have a consistency of seitan or soy, but that is not the case (as alluded to by the name...). Must try in their hot stuffed sandwich. \n\nCarnivore Menu: "The Works" pizza has an admirable # of toppings - these slices are packed with cheese, meat, and vegetables--definitely a winner. Also make sure to check out their Meatball Parmigiana hot stuffed sandwich - hefty portion of meat, sauce, and cheese - it\'s impressive.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2015-05-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Uw3auX3wJiAiHELuBfeyWQ', 'review_id': 'pAevi3GqeyGnV-pSal-RsA', 'text': "My wife and two kids went to PHB on 5/8/15.  We were in town picking up our son from ASU.  Our first choice was a one hour wait. So we went there and arrived at 9:25 pm, it closed at 10:30.  Our hostess set us down in the main dining room.  There were 6 other tables being used, and two or three had dirty dishes from previous patrons.  \nWe were asked if we wanted something to drink, my kids had sodas, my wife and I had a beer and asked for a glass of water.  The sodas and beers arrived and we asked for the water again.   10 minutes later our waiter arrived and took our order.  We asked for the water again, and he said it would be there shortly. They brought an appetizer to our table, but no water, so we asked again..this time he brought it for us.\nWe waited and waited for our food, and it did not arrive, but the waiter came to see what kind of dressing our son wanted on his salad.  We informed him that he had not ordered a salad. He had our table confused with someone else.  During this time, there was another couple sitting next to us, that was trying to get someones attention to pay their bill.  Finally someone came by.\nOur food arrived at about 10:25.  My lasagna was in a dish, tasted like Mona Lisa's (costco brand) lasagna, that they cut a slice and put into a dish and put it in the broiler.  Everything was totally melted down, the pasta was so over cooked...it was not very good.  The pizza was just basic pizza.\nAbout 10:45 our bill arrived.  BEFORE THAT NO ONE CAME BY TO SEE HOW OUR FOOD WAS OR IF WE NEEDED ANYTHING ELSE..\nWe put our credit card on top of the folder visible to anyone walking by.  OH YEAH, when our food arrived we were the only ones left in the restaurant, and they started cleaning the place up.  knocking dishes and glasses all around us, then they started to mop the place with some foul smelling cleanser, which is probably OK as long as no one is there eating or digesting their food.\nWe waited about five minutes for someone to pick up our bill, finally we just got up and paid it and left.  Terrible service...Food, just ok..nothing special...We should have stayed at Oregano's down the street.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 2, 'date': '2015-05-15', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'aUtyiipxP4wX2KjHfrZroA', 'review_id': 'WM3a5vFL2Y_McfUNvHu9EQ', 'text': 'We bought a Groupon and it was well worth it. Our waiter, River was very attentive without being overbearing. The pizza was delicious. We got "the works" which was loaded with yummy stuff. We also got the cheese bread which was literally garlic bread with mozzarella slapped on top. It was surprisingly good for how basic it was. \n\nThe decor of this restaurant is super basic. Nothing special. The inside was very dark.. looked like a basement. There was no live music when we went so we sat outside.\n\nI will return!', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2015-05-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'TMi4vbN2k_B7nJANlsfB1Q', 'review_id': 'HdhXOr_UaoCq3K71SUSMAg', 'text': "ATTN ALL GLUTEN FREE AND/ OR VEGAN CONSUMERS: eat here and you won't be sorry. Best gluten free pizza I have tried to date so it to is well worth the price. My friend got a vegan pizza and was very happy with it as well. Plus gluten free pasta, gluten free Alfredo sauce made in house as well as vegan and gluten free cheesecake also made in house. This place really is heaven.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-05-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kAxuYNHdoLjeUI4wiSuFqg', 'review_id': 'fN9HgKguNgbt-n_2IgRu7g', 'text': 'Great pizza. Wings are good the breadsticks are super great.     Service is quick and really nice people their.  The owner is funny', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2015-05-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BuGP5PnTfT79zZwpuydiYw', 'review_id': 'bKEE8tI4iBZSgQW_HhgaFQ', 'text': "I happened upon this place by chance and what a find!!! The pizza is the best i've ever had and their homemade sausage melts in your mouth!! The staff is friendly and attentive. Ms, Pizza Heaven frequents the place everyday to make certain everything is to her high standards... And make sure you're there on Friday night to listen to the live music. Fantastic!!!!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-05-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': 'ot0gikH2lW0PVxzCemrX7w', 'review_id': 'EeHsOT2zYOcwwrJDIvPbYw', 'text': 'Food was over 2 hours late, was told food would take 45-60mins but was a 3 hour wait. No manager to avaliable to speak with. Employees forgot to place order and all the could do was say sorry. Talk to several employees and no one seem to know what was going on. Worst experience ordering pizza.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 1, 'date': '2015-05-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4hiU30iSTzEQeRQeSewQXA', 'review_id': 'QAUu0tRec0WvgeRzH1alFQ', 'text': 'Highly dissatisfied with the food here. Read what seemed be many good reviews and was craving pizza (I eat gluten free, not by choice it makes me ill). There was nothing special about the gf pizza, the mozzarella cheese was barely past melted. I also ordered the Cajun Chicken Pasta which was #1 way hotter than it needed to be (only took a few bites) and was brought to my table with 2 pieces of garlic bread (shoved into the pasta an sauce) which makes me wonder if the kitchen staff know anything about gluten sensitivity, even though the website seems to boast about their gluten free and vegan options. The waiter was polite and did remove the pasta from my bill which I greatly appreciate! My brother and his wife had the Chicken Parmesean which was NOT homemade. The chicken was more of a chicken patty or chicken nugget type of texture! The frys and the wings were also noticeably from a bag. Anyway, if I could give negative stars I would, I would never recommend this restaurant to anyone.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 1, 'date': '2015-05-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PRT4P6XlwTu3gyzoix3cxg', 'review_id': 'MgiPlab6lhG2nZfKbyhXwg', 'text': "Used EAT24 take out. Great pizza. Wings are good.  We'll worth it. I will be using them over the hut in the future", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-05-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oudPM2brB_6RkqXGDE5sBQ', 'review_id': '6WDERlBhHq_Og8ITx8MaLA', 'text': 'love love love this place! Thank Goodness for their Vegan menu!', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-05-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'pU1V70xPSmN9TPXOjj7QlQ', 'review_id': 'hHURUzSYX-3bq1Q_rsOGog', 'text': "LOVE this place. I'm vegan and finding a non-vegan place that accomodates vegans so well is difficult but this place makes it a breeze. Not only do they have vegan options, they have a full vegan menu that accompanies their standard menu. This place is an awesome go-to regardless of dietary preferences, but don't knock the veg options. I've had other guests stop and ask what I'm eating because it looks so good, only to find out I've got the vegan option! I definitely recommend the stuffed sandwiches. They're HUGE (I always have enough to save half for later) and only end up costing about $7-8. Plus, Pizza Heaven offers both cheesecake and angel bites (fried dough with chocolate sauce or agave), which are delicious and vegan.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-05-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'Db0_XyAIqcP4wAwcc9L5bA', 'review_id': 'ASX11_5MmPBwLbHX7n2rPw', 'text': "It was our first time here. I came with my family and we ordered wings and the spicy chipotle pizza. The wings were good, but the pizza was amazing!!!! We also ordered a brownie a la mode. It was okay. The brownie wasn't warm and it wasn't too much ice cream. If the brownie was better, I would have gave it 5 stars.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2015-05-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'aiFdY34Arl6L28AkIfyHEA', 'review_id': '8D_FH82LsjxWVVQVMwZi3Q', 'text': 'My server, River, was very polite and attended to my every need. He suggested the baked ziti with extra ricotta, and it was delectable! I highly suggest stopping by this restaurant, it is authentic and original.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-05-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'RUPoY_iHX1_4rTdHI02z6A', 'review_id': '_RNgMYFrJ6go3Y_Xf0unJA', 'text': "I love Pizza Heaven! Been here to eat the restaurant a few times and had delivery once. I'm obsessed with their wings! Weird, I know, since it's a pizza place. Everyone who works here has always been amazing, and they always have a Groupon. I definitely recommend checking them out.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-06-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GbIOcX1SYaf1ibeeNu8lRQ', 'review_id': '66v_ILGsEBnZQY0C27XfrQ', 'text': "Great pizza place! We've been going here for years and I recommend the Bianca pizza with ricotta. The staff is very accommodating and the atmosphere is comfortable. Whether dining in or ordering to go it always good.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2015-06-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2FTfW3_8fUlWwU6PebXLxA', 'review_id': 'fJSwLQ6gSmk_71fRmhdLtQ', 'text': 'Great food. Quaint and personable atmosphere. Tequila lime chicken was delicious. Alex was a fantastic server !', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-06-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'I6LUBiAYZeK7Yn2aU0-2WQ', 'review_id': 'vXwvY4SbXZ2ZVb_t9uRjeg', 'text': 'We usually get pizza delivery, but tonight decided to dine-in at Pizza Heaven Bistro.  We were pleasantly surprised to have live music during our visit as well as an extremely attentive waiter.  Service was very quick and the owner even stopped by our table twice to see how we were doing.  The pizza was excellent as always, and my husband liked the wings so much that he ate the whole plateful by himself.  We finished off with the brownie ala mode, which was devoured in a short time.  Overall, the quick service, excellent staff, great food and affordable prices will bring us back again!', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-06-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pXivt2brlgrRJCMgLIM0Ew', 'review_id': '2Bw5EZZFFc5iTaZ2wHd5xg', 'text': "This is my favorite restaurant to eat in. I've been a patron for several years and have never had a bad meal or bad service. On more than one occasion, the owner has come to my table sits down and asks you how is everything. I've never had a complaint. The food is top notch (Tequila Lime Chicken Pasta) is my favorite dish. I come there at least once a week to get the 2 slice pizza special to go and have it for my lunch. Great Food, Great atmosphere, and great staff.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-06-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'X7MLxfHVv_VzrVmlXV5PFg', 'review_id': 'iJjiY5biodNk99MBKsKmNw', 'text': "Had a great meal, the Carnivori is a delicious meaty pizza and is my new favorite.  This is a very nice little place that I'll drive across town to enjoy again.  Had never been here before and only found it because we searched for pizza near the Rhythm Room.  I live in Gilbert but I'm def coming back.  The owner came and talked with us for a bit and she's passionate about all her home made food.  Thanks Patricia!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-06-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'h7-lk_BmctsFjcO79G7jWg', 'review_id': 'QPjVIPvrpPmniS7L6so04A', 'text': "I ordered through Eat24 and while the delivery was pretty fast, i was not in heaven with the food.  I ordered the 4 piece wings, spaghetti & meatballs, and Vegetarian Vegan pizza.  The wings were small and overcooked and the bbq sauce was a very dark color that alos looked burned; not very tasty.   Secondly, the spaghetti & meatballs was bland - I had to add my own salt, and the meatballs tasted like they were frozen and not handmade, they were watery on the inside.   Lastly, the Vegan pizza was horrific! I didn't even finish one slice!  The sauce was bland, the dough was tasteless and the slices could barely be pulled apart.  The veggies ontop didn't have muchtaste either and I definitely bit into something bitter.   They threw old wilted basil all over it and it wasn't even fresh green basil - it was gray.  And anyone that know anything about cooking knows once basil loses its color and then gets cooked it will taste bitter.  I feel like I wasted the $30+ that I spent on the meal.  Will not be ordering from here again.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 1, 'date': '2015-06-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HmFebzzJAbxq5iJwi_qpXw', 'review_id': 'e0rN7AKFfY3a5h119O-83A', 'text': 'Amazing wings and very good pizza! Pizza Heaven takes customer service very seriously. Service staffer is always extremely friendly and regularly making certain patrons are satisfied. Our experience here is always a good one. Nice touch having musicians play for patrons.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2015-06-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'D_LdfeQvxfHZZKPTFciNEA', 'review_id': 'j76mypc9cmDm3F3nm62s5w', 'text': "What a great place to get a vegan pizza in Phoenix. Try the Agave BBQ pizza. Soy sausage, pineapple and BBQ sauce. Don't forget the vegan meatballs tossed in buffalo hot sauce. It ain't a hippie joint so meat eaters won't care.\nIt could get a 5 star if the beer tap was colder and had a few more options. Think traditional Italian place that for some reason has awesome vegan pizza.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2015-06-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'NW-hIYgZmG_IvhR82BVWHg', 'review_id': 'P39Y3VTNS-pTDmravepMSA', 'text': 'My brother lives in Phoenix and being a bargain hunter got a Groupon.\n\nVery pleasant experience, really cute establishment with a great vibe.  Food was delicious and LOTS of it, I had ziti and thought it was great, we got wings, I did not have any but the guests said they were great.  Pizza was very good\n\nIf I am in the area again will certainly go again', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-06-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pXOnVxk5X0V3cQVXWFbbkg', 'review_id': 'JI0Tgk5vy7UdRpHqn4zb3g', 'text': 'The service was good and the staff was great.  We will definitely be back. The food is great to.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2015-06-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IM3vZEvGw2wLajLj0ShqlQ', 'review_id': 'yJGCq3jLJ_OFhYh35vs6Nw', 'text': "I love this place. It was actually my 1st job I  had when I was 16 Years old. Food is amazing and coming from someone who worked there, there\nFood is legitimately FRESH, they actually make there sauces from  scratch like they advertise. It's family owned , and the owner Patty prides herself on great did in a great environment. Overall this place is amazing! It will always be a hidden gem that I'm very happy I came across.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-06-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'mX3qMBnEhOJ6R80vfjQMYg', 'review_id': 'JEy26Arw0e8fPwxjktenNg', 'text': "I had been wanting to try this restaurant for quite some time, seeing as though they have options for vegetarians like me. We get there and there are only about six people in the restaurant. Our waiter is attentive at first but things slowly grew worse and worse. This was one of the worst experiences I've ever had at a restaurant. I ordered the veggieball parmigiana , now here's the tricky part apparently. All I asked for was actual cheese and not vegan cheese. I wanted the  whole sandwich to be meat free and just have non vegan cheese. Simple enough right? Wrong, I thought the server's head was about to pop off. He simply could not grasp this simple order, the sandwich comes with a side so I ordered the salad. So time goes on and he brings out my order, ya not so much. He brings out veggieballs I will give him that, but it's an appetizer not the sandwich I ordered. So he takes it back and brings out my salad. Then he proceeds to bring out my actual sandwich with a side of fries. I didn't ask for fries I asked for the salad side. So now I'll be charged for a salad and fries. I'm with my boyfriend, who is not a vegetarian, and the server says that his order will be out in thirty seconds. TEN minutes go by and my food is getting cold because I would like to eat at the same time as my boyfriend. The server finally comes over and says it's going to be a little while because they made two veggie sandwiches. Why did they do this?! My boyfriend ordered a sausage sandwich! So now that's two food orders they have to throw out because the server is incompetent. Enough was enough. I gulped down my wine and asked for the check. I paid for my salad and my wine because that's all I ate. Nothing was comped and I spent ten bucks on a wilted salad and a glass of wine. Grossly inadequate and unacceptable. It wasn't a busy night and I was not being unreasonable. I will never be back here again.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 1, 'date': '2015-06-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'J4Qt4JknIcQBoYO721Wvjw', 'review_id': '-mtNGzurqfU1aHBJYDU6Pg', 'text': 'Excellent variety, great food - will definitely order again...', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2015-06-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JQcQwdCizzEjfkXlf1Mhkw', 'review_id': '8x58uEFL16WJSHvzGf_f6A', 'text': u"OK. I have to say I was a bit skeptical of a restaurant that uses Groupon to get business.  In my experience, that hasn't served me well.  Today it did. \n\nOur server,  River, sat us at a table that we reserved and although we didn't need the reservation,  they saved us the table anyway.  The menu looked great with a wide variety of choices to please me and my picky kids. River suggested the hot agave BBQ wings and everyone loved them. I'm a vegetarian and they made my mouth water. And that says a lot.\n\nBut.the.pizza. Oh my. The pizza. I haven't had pizza like that in a long time.  Plentiful toppings. Quality ingredients.  It was cooked perfectly.  Seriously.  The best pizza I've had since Waterfront Pizza in Port Townsend, Washington. \n\nThe cheesecake made the whole trip worth it.\n\nThe service was great. The place is pretty small and would have a hard time with a large crowd as the dining room might seat 50 people at capacity.  But the intimacy made it perfect for a family or a date night.\n\nOh and the jalape\xf1o poppers were yummy too! Good job Pizza Heaven.  Ask for River too. He knows that menu in and out and will help make great suggestions.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-06-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bzquoPtrCfR5W_FEDEQz2A', 'review_id': 'cOHUMrnBmRP8F2B_k9LGCw', 'text': "This place is great! The amount of food for the price is amazing and I love that they have a few vegan options. The vegan pizza is great, the vegan sandwiches are great, but I have yet to try the pasta. I am sure I won't be let down. The owner is very sweet and made it a point to reach out to all of the people who were dining in the restaurant to ensure their experience was nothing less than amazing.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-06-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3u5hz-agE5qh-3o2sx0JIg', 'review_id': 'SvCg4xVLhPDLn_jDIJbi4Q', 'text': 'The Miko Miko Hawaiian pizza and mozzarella sticks were good, the servers both River and Alex was very attentive. We will return!', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 3, 'date': '2015-06-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'Pqt_YcXdtNdil5lWfiPJrw', 'review_id': 'aEI3xekAolNWVEjYOwY_rA', 'text': 'Best vegan pizza place in Az!!I will be back Everything was good from A to Z.and I just love how next door they have unami serving vegan ice cream shake and all kind of goodies!! this is worth the drive and it will definitely be our spot when friend wants to eat pizza because they have both option vegan and non-vegan option they know what they are doing.5/5 for sure!:) go and try it you wont be disappointed!!!', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-07-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QWGMPfziKYc992h7EHb25Q', 'review_id': '6_YOHSIeel4kC_41arY0qg', 'text': "The pizza is delicious! Great spot to pick up lunch close to downtown. Sometimes they are a little understaffed and don't have enough people attending to customers dining in but there's no complaints about the food!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2015-07-14', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 4, 'cool': 0}, 'user_id': 'cc-NjTz637u7EtFd83dn_w', 'review_id': '4WJdK8YZRl4y7gwQKndbfQ', 'text': 'Ohhhhh\n\nI visited this establishment for a take out pizza experience. I did call a head. I walked in to an environment that was not well lit. I waited at the counter... No one was around. I waited some more... No one was around. Finally a kid comes out and asks what I need. I tell him, he gives me my order and then I pay and then I leave. The staff seems unfriendly and the establishment felt uninviting. \n\nThis is not pizza or any edible form of what any Italian would call pizza. No passion, no care, no zest for or importance placed on quality of ingredients. \nReally? I cannot be the lone wolf that tastes how bad this is? Lack of quality. \n\nI am sorry to be so harsh but it just gets annoying to see all of these business get away with mediocrity. Sometimes I feel like we need a champ. Someone to step up and fight for the little guy. Well here it is.... "Rocky music playing in the background" \n\nDon\'t go. If you like pizza and respect yourself then do not go. Raise your hands high turn around and walk away. \n\nSorry, not sorry. \n\nThe Sarcastic Truth Villain. \n\nP.S. Check the restaurant inspection report.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 1, 'date': '2015-07-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BxeE5dCZyJOUIRrlvK_xQQ', 'review_id': 'C7GQM4Q7bkvr-Olg1TKrhA', 'text': 'Love this spot! They have the best vegan pizza. I am hooked! My husband had the regular pizza and he really liked his as well!', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-07-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'paAKLZKipRtPgxpiS8kHyg', 'review_id': 'mRMBCD-uYRcIFE0IS8iG4A', 'text': 'Two hand tossed pizza crusts; one vegan, one regular. Both fantastic. What an amazing vegan selection. My dairy intolerant son was in "heaven".  Vegan meatballs were also a big hit.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-07-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'aDKjOHB0dutQmxPupT4Prw', 'review_id': 'tRtLu_YxD_XbMm28t3OpnA', 'text': "I go to Pizza Heaven all the time and every time it is a great place to dine at! The atmosphere can suit multiple occasions. Whether it be a romantic dinner date, a dinner party, or even a family outing. The food is always delicious especially when it comes to the calzones and pizza selections. I am not a vegetarian but I have dabbled in a few of Pizza Heaven's vegan items and I must say that they are pretty delicious. Another great food item at this place is their wings and breadsticks are incredible. When it comes to lunch the meal deals are affordable and filling. Not to mention the portions are Pizza Heaven are amazing. You definitely get more than what you pay for! Also the wait is never too long and the service is always friendly. The owners are always nice enough to always come out and talk to each costumer. I wish Yelp had more than five stars to rate Pizza Heaven!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-07-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qAhm3detB4S8rXVK7wVLMg', 'review_id': 'gAqa0l6WFN7r9zUGv_y3vw', 'text': 'We went here to have dinner with another couple that bought a groupon. The food and the service was very good. We will be going back.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-07-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Gm26pbK5qyuLBh8E5XKVtg', 'review_id': 'BBPy2DFYt7j6RuXEwmF2UA', 'text': "We are always looking for new places to try on Groupon and Living Social and came across this fabulous place a few years back. It's a small family owned business and every dish tastes amazing and fresh! The prices and portions are great and everyone we have brought along with us each time we go is impressed. Looking forward to our next visit!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-08-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kqoiKdHJCWXXZlf8g05gWg', 'review_id': 'VKb4zkPy1VJI1crkZcBKgw', 'text': "We had a Fancy Nancy party for our two year old here. As usual, the food was fantastic. What was even better was their overall attitude and excitement in being part of a bunch of crazies all dressed up in what a 2 year old thinks is fancy attire. They were helpful in every way possible. This is our favorite pizza place for many reasons and we'll keep going back.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-08-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9SEV_ORT3gzUh_aibdhnSA', 'review_id': 'W4YWzWLBANtO68GS1Q85wg', 'text': 'Great place to go! We got 10 piece wings for an appetizer along with 5 breadsticks with a large BBQ chicken pizza. Everything here was exceptional. The space is perfect. A nice cozy place with great food. We paid $30.32 for everything.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2015-08-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'XNUID_eWSQ_7EBl-tbmuTg', 'review_id': 'r1O4FJx3j0-N3yTSAszTiA', 'text': "4th gluten free pizza - do not order this option. \n\nThe crust was burnt, the buffalo mozzarella was melted but not browned and the sausage was swimming betwixt the sauce and cheese.\n\nI've ordered the soy cheese and soy sausage three times - once was it made well.\n\nI'm not a fan of so-called real pizza and I'll bet the traditional pizza there is good.\nBUT\nIf a restaurant charges these higher price for gluten & soy options (of which I'll pay) - you'd better do them at a C level not D-.  4th time is not and nor will be the charm for these options. Do yourself & customers a favor and take them off the menu.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 1, 'date': '2015-08-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'g9d57X8EJlXhrjAlAp4Q6A', 'review_id': 'KX_jiYT6VuYbFAWZprCZmw', 'text': 'We are visiting here from out of town so we were looking for a place to deliver to us and I came across here....\n\nThe sausage lasagna is TERRIFIC! Huge portion, extra cheesy, and plenty of sauce (I hate when places skimp on sauce leaving food dry) ordered a Caesar salad and angel bites also and they were pretty good but the lasagna definitely is the star coming from here! \n\nTheir delivery was pretty quick to!', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2015-08-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ndAnPbSpIVHQ4MtYhSAhHQ', 'review_id': 'uKlk63cm60D1GodU-3JZOA', 'text': "I read great things about this place and their vegan options so I was excited to give this place a try. But I wasn't impressed. The service wasn't that great (slow, uneven and he didn't even bother to open my beer for me). I arrived with 3 other people and we all received our food at different times. And about the food: I can't speak for the entire menu as I've only been there once but the vegan sandwich I ordered was just ok and the fries were terrible (frozen, cheap???). The owner did come over and speak with us and she was very nice and the entertainment was good but I was disappointed when I left as I read such good things about this place. May give them another try though....", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 2, 'date': '2015-09-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fIsLv7GKJ9I0aZFSj6QMGQ', 'review_id': 'af1LuzxbPxumV6ge02j4-w', 'text': 'love this place. top notch. food is delicious, and they deliver! and they have vegan options! and their staff is so kind and sweet! need I say more?', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-09-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'g7xgXF_nAhXRwFZa5gvmcw', 'review_id': 'Umeo01avXNJXjb9N3VrCRQ', 'text': 'This place has always been a a place for good pizza and food and they care about their customers thanks for caring', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2015-09-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': '57aw-F3odSdiv-RF16hAyQ', 'review_id': 'fXVVE3cdkQc1PINnAj9mtw', 'text': "Pizza Heaven is absolutely delicious. My boyfriend insisted I write a review for it since I rave about it so much. I usually order a regular style with variations of veggie and I've never been let down. The flavor a of the sauce and cheese with the freshness of the crust make it beyond delicious and satisfying (very generous proportions). I prefer Pizza Heaven to a lot of the popular pizza joints in metro Phoenix!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-10-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'usa5dNTsgInerSUs4c35Lw', 'review_id': 'SFs55_OQmO0prc5eRWPjvg', 'text': "Sorry I can't help you as far as gluten free goes, but I had the regular pizza, cheese sticks, and wings! Sooooooo good and because the wings are baked they aren't all greasy or dry. They are great and taste way better. Yes a little pricier than the pizza chains, but aren't you sick of those by now? Just try it I really feel like it's worth it.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-10-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ByU5CWr-9gxeCq2sga9D2Q', 'review_id': 'Mh-YOq7VlS7RgOxIKBxDqg', 'text': 'The name Pizza Heaven Bistro is accurate. I walked in with a groupon skeptical about the service and food (as I always am with a groupon) but to my surprise, the service was excellent and the food was delicious and high quality. Angelica was our server and she was so sweet and helpful! The prices are more than reasonable for the authentic food you get. The atmosphere is very cozy and family like and they also have live music in the evening. I will definitely be returning to this Italian joint! Absolutely LOVE!!', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-10-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Nn9E1lKfPgUHNCiaNzvdwQ', 'review_id': 'jytc1DKOEcnfRIyneAPpYQ', 'text': 'Delicious pizza and excellent customer service. Pizza Heaven Bistro catered a large event for me and the quality and friendliness of staff exceeded my expectations. Will definitely be catering from them in the future.', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-10-28', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'wTMsVKuvZYIgVDpHaM8ZSA', 'review_id': 'CAtHPuu94GjCNinMMWl5XQ', 'text': "Thin crust pizza was horrible. Waitress had a big nose ring through her septum...turned my stomach. Can't eat and look at that. She checked our table once. Horrible service. She was friendly, of course.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 2, 'date': '2015-10-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'FTvZGB2L71P_OiIP7fbjsg', 'review_id': 'bHz-pNnq0bLLajGWaeiL4w', 'text': "Came here because I was craving for wings and was not disappointed! Great customer service and wings. I like the honey bbq(I can't remember the exact name). There's also a hot version of it for those who are daring. The wings are big and meaty which was great! The only thing I didn't like was you can't do half and half on an order because the server said the owner doesn't like doing that. However, since it was my first time, I didn't mind paying an extra $1 to get 2 separate orders so I can try the different flavors. I also got fried zucchini as an appetizer and it was deliciously fresh. Be careful to not burn your tongue because everything will be hot and freshly made. I will definitely come back to try the pizzas when I am in the area.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-11-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'utD6Pi48oZb6a08NxkG6jg', 'review_id': 'IpWFDVbTs6XsBNVA_nRVeA', 'text': 'Great service, great food and great prices! David went above and beyond. He was running the entire place taking care of it all, and did it all with a smile!', 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-11-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'F_1GEtBv96frK72z4sJojA', 'review_id': 'TqWO4Js6iHb9yf5Zk-o-Ow', 'text': "I got the sausage lasagna, and I loved every minute of it. The 4 dollar mimosa's were. Pretty good deal too!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-11-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'ZvvxtxeTad9t3ZoxdNYe_g', 'review_id': '79M_d0UMlW8DrHHKwHLJHA', 'text': "Been here far more than the 7 check-ins and am surprised to find I've not made note of how good and how affordable this place is on a consistent basis.  Love the lasagna, whether Bolognese or spinach, chicken or beef (I'm not much on sausage with flavored with anisette  - always hated licorice!), and can speak just as positively of the baked ziti with ricotta and marinara, perfectly spiced Cajun chicken Alfredo, and fettuccine  Alfredo with a perfect, not excessively rich creamy sauce, all currently $8-$9.  I've never even tried the pizzas but my friends have and seem to enjoy them all - and I can attest they look and smell great - and as I'm so hungry right now it's going to be tough to not re-route my trip home for one of those tonight.   Sub sandwiches at $7 or $8 also a pleasure. The ones I've tried include the Meatball Parmigiano, the Heaven's Ham, and I think the Italian Stuffer, well-filled with salami, pepperoni, mozzarella, lettuce, tomato and mayo.  A bonus for the gluten impaired, brown rice pasta available as a substitute on most pasta dishes, at no discernible loss of taste or texture.\n  Service is always friendly if not exactly spot-on.  The young wait staff may not ask if you want wine, dessert, or a refill on your tea or soft drink, but it otherwise so affable and everything so affordable, you can overlook it - and just look forward to that cheesecake or tiramisu on a return visit.   Very good food. Very affordable priced.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 4, 'date': '2015-12-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'aDq8GHq1GsdVBBa8z_r-MQ', 'review_id': '30aYgyOEaHvDa_sNPHSzOQ', 'text': "We specifically came here twice for their vegan options. We had two EXTREMELY different experiences in just 8 short days.\nOn the first outing, wait staff was kind, upbeat, helpful and more than willing to satisfy our needs. (Didn't catch the name, but he was tall, darker complexioned and had a great attitude/smile) The food was cooked beautifully, very flavorful. No problems. Let's go again, we thought!\nUpon returning, originally happy with what we had experienced just 7 days prior, our moods fell flat as the waitress (blonde, facial piercing) was rude, distant, and WALKED AWAY while I was still talking. Who does that? I was not speaking quietly, either. She was very dismissive and never returned a response or even a smile while giving her a thank you, multiple times.\nFood came out too quickly because crust did not have the same consistency as our crust last time, and wasn't as flavorful. \nOne bad waitress can ruin a little business like this one. Word spreads. Fortunately, we are optimistic enough to give Pizza Heaven another try, assuming that our table isn't matched with blondie again. Learn manners, you're in the food business!", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 3, 'date': '2015-12-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'OwvitNZz1z8MWN7FNpYcpQ', 'review_id': 'W8hTXfXzBkegGyhu7Kh69g', 'text': "Have ate at the restaurant a few times, which the food was good but service was slow and not very friendly. I did enjoy the fact that they had vegan options (since I don't eat meat) so I usually order take out from here, especially their vegan meatballs. However, the last time I was there I found multiple hairs inside my vegan meatballs. I called the restaurant to inform them of what happened and the gentleman I spoke with told me the manager would contact me later, since they were unavailable. Well needless to say it's been about a month and never heard back from them regarding the incident. They lost a customer as a result of the lack of good customer service.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 2, 'date': '2015-12-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'aDq8GHq1GsdVBBa8z_r-MQ', 'review_id': '0nicO0sxlHDaOBy7Iz9ODg', 'text': "I'm writing this followup to rescind my former 3 star review of Pizza Heaven Bistro. Upon receiving a notification from owner Patricia, comping my next meal, my fiance and I went in on 12/22. Unfortunately due to traffic (we drive 40 minutes to this side of town) we got here rather late and had to call in at 9:10pm instead of dining in. We explained the situation to the front desk who called Patricia who was unfortunately not in at this time, and verified our story to her. It really says something about a company who goes the extra mile not only to write an apology letter about unpleasant service, but also give your next meal on the house. Despite having to take out, our meal was still warm once we got all the way to Chandler again, and was absolutely beautiful in flavor and quality. While we were originally disappointed in what must have been a bad night for our server, this night and the owners respect and consideration really blew me away. We are definitely going to be visiting many more times to come, especially because it's hard to find a delicious, classic pizza taste that is vegan, (and it's much better to support local businesses anyway!) Well worth the drive. We are VERY happy. Thank you Patricia for running your company with tact and the utmost speedy customer service.", 'business_id': 'auorqdHiATGZHVd-sd79ZQ', 'stars': 5, 'date': '2015-12-23', 'type': 'review'}
