{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '_R7t0Ettf1bIuN6tZDTjzg', 'review_id': 'ppu0ohyVxE6MCqLmXUfM0g', 'text': "They just opened up over Christmas. Carne Asada Burrito's just OK but the red, green sauce was awesome. Since this was our first time here we tried the puff pasties; pumpkin and apple. WOW! light fresh and tasty. It brought back childhood memories of the Hot Apple Pie at Mc Donald's, you know, when they used real apples. Give this place a try. Great group of workers....friendly and neighborly.\nUpdate 4/15 we are regulars and love the pork burrito with an awesome green sauce.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2014-01-11', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 5, 'cool': 1}, 'user_id': '78SZGso0jVxf6aedF_fEkQ', 'review_id': 'cx7IcAXRlRaDTgUuQm1IPw', 'text': 'When I learned that PHX Burrito House was owned by the same folks that own El Sol Bakery and El Zocalo in Chandler I had to get over there to see if the breakfast burritos were as good. They are. We were frequent customers when we lived in the East Valley. Looking forward to trying the fish tacos at lunch.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-01-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 1}, 'user_id': 'obeCL4RSBKnG_LiO9dvE4A', 'review_id': 'f62daUL3mrHEsCpxWCAdaA', 'text': "First time here but not my first experience with a breakfast burrito. First of all, the place has been cleaned up and and looks clean and nice. Second, the staff is super friendly in a neighborhood shop kind of way. Third, the tortilla was super fresh and the eggs and potato burrito was delicious. It tasted like my mom made it at home. I'll definitely be going back and recommending others too.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-01-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': 'UbHN4QkIJa5exMert5rTyA', 'review_id': 'iLW_ympRauwYRfakOQv5zg', 'text': "Trying to find locally owner shops for lunch when you work odd days and hours isn't easy, with that being said, this place was an amazing find. The place is really clean and inviting. The staff was super friendly and service was good. I had the shrimp burrito and it was AMAZING. My coworkers had breakfast burritos in the middle of the afternoon and lived then. Needless to say, this place was great and is now in the rotation of regular places for lunch.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-02-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'FFMZ6heFLid_kXIpXmpcUw', 'review_id': 'cOGhHmi1gI3n6cI-aqMGEQ', 'text': 'Fresh food! They have awesome veggie burritos! Cute decor! Staff is friendly and accommodating to vegetarians.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-02-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': '7Ki1_Yo8LDIGyCGPQpgFMQ', 'review_id': 'E3ShTvakoWpQAte1CZf7zw', 'text': "I've been driving by PHX Burrito House since it opened, and thought I'd finally stop in after a friend raved about it.  My friend was totally right.  I went on a Saturday afternoon and it wasn't busy at all, so I got to talk with one of the owners a bit.  I learned that they own El Sol and El Zocalo in Chandler.  I'd been to both of those places before and really liked them.  \n\nI got a carne asada burrito.  The meat was prepared properly and had a good flavor to it.  The owner gave me a sample of some of the chips and salsa, which were very good.  My favorite part about the burrito though was the tortilla.  It had a perfect texture and thickness to it.  The owner told me they make them all right there at the restaurant.  \n\nThey had a good selection of breakfast burrito offerings too.  So....I came back the next morning.  I had the bacon breakfast burrito and I can honestly say it's the best I've ever had.  The flavor was tremendous, and again, I just can't get over how good their tortillas are.\n\nGreat place.  Extremely friendly owners.  Fantastic torillas. Check it out.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-02-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '49zOPRrFCHvQOKZ0bRohew', 'review_id': 'vZVXLhJjNWHMcFDEmE1iqw', 'text': "I'm not a vegetarian by any means, but I got the veggie breakfast burrito on Saturday, and it was amazing--especially for $4! Very filling and full of all kinds of vegetables--not just onions and the cheap stuff. I had a red-chile pork burrito here several weeks ago, and it also was perfect. I love this place and can't wait to go back! The staff all are very friendly, too.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-02-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'JSeo22e-wQ9Sc3eXsQTovA', 'review_id': 'LfuSO8MLngE8VWHqXROwLQ', 'text': 'Great local joint albeit a little easy to drive past since it is set back from the street edge.  I thoroughly enjoyed the fish tacos.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-02-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'K7Cjx-ccVIGh_aVGtigHPg', 'review_id': '_7gO3Jg247BtQMxm8Cflkg', 'text': u"Great breakfast burritos! I stopped in here one morning on a whim and ordered the house special breakfast burrito and it was delicious! Very fresh ingredients (potatoes, scrambled eggs, grilled onions and grilled jalape\xf1os-with optional meat for extra $) all cooked very well. I stopped in the next day with my husband and now he's hooked. We've  since tried carne asada, ham, chorizo and veggies in the burrito, all were great.  The restaurant itself is cleaner and seems roomier than when it was Fry Bread House.  Give yourself 10-15 minutes for the order to be prepared; if you are taking to go and  want it faster, call ahead.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-03-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'MlQ8T64p5a3rvjYiPbv4gw', 'review_id': 'E-xLL7zNUj_Tc1OU1Wv1Tg', 'text': 'Great service great food!  This was a nice little find. I had the fish tacos and they were great.  This is a small "hole in the wall" place, but very clean and great service.  I\'ll be back.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-03-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'ZC3fbH5TfCX6zsYb3luiXg', 'review_id': 'm6ODn2XpLcNLS1LNyV5tDw', 'text': 'Already addicted (2nd time here within a week). Tonight I got the Carne asada quesadilla.....it is soooo good. Meat is marinated perfectly. It comes with quac and sour cream. My kid got a bean burrito....didn\'t like it bc he\'s a cry baby and only likes refried.... The owner saw my kid not eating and came over.... He asked if he wanted something else.... Then offered to make refried beans..... He went above and beyond!!! My kid was happy after that and enjoyed his burrito. Yummy beans. I love the decor, really simple with "Loteria" artwork on the walls... Love it! We will definitely be back.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-04-04', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 4, 'cool': 3}, 'user_id': 'V6rhoTCw7S6H8eHwv2M6Vg', 'review_id': 'aDeM5iX0DKAGFw1qPzfKfA', 'text': 'I had a shrimp burrito.  You know what I liked about it?\nIt was simple.  \nNo special sauce.  No fancy take on a classic.  Just some good grilled shrimp with minimal seasoning, fresh lettuce, tomato, and avocado.  Good tortilla too!\nI dig the crazy concoctions and re-imaginings as much as the next gal, but when simple is done right you are reminded how good it is.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2014-04-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tQXwmfUXJM69j3uPhRJg_Q', 'review_id': 'xGvCDoBNmGYz30rY89URGw', 'text': "I've gone twice and had the green chili burrito -- I have dreams about this burrito. My boyfriend has tried the carnitas (which is not shredded) and chicken. He said the chicken was great but wished the carnitas was shredded. This is a going to become a go-to place for us! \n\nCon: I wish the restaurant actually had morning hours so I could get the breakfast burrito for breakfast!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2014-04-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'a_a8y1UhzANfBvD8qHOKIw', 'review_id': 'LcZRskYUwOFTU31tQfLoJQ', 'text': "This is by far the best Mexican food I've ever had in Phoenix. The service was excellent very nice guy owner was there welcomed us personally, helped us order. The food was 10 out of 10 burrito was perfect perfect combination of meat and beans and rice. After eating felt great.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-04-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'MlvmG3x8vLZBnRNvVdRMqg', 'review_id': 'A76kRseqquBKUcNpkXyhcQ', 'text': "This place is great! I can't get over how delicious the tortillas are. Most people think of a burrito and think of all the things that go in it but the secret to a great burrito is the flour tortillas. This place nailed it. Next time you order a burrito stop and smell the great smell of their hand made flour tortillas!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-04-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'riPKVhNlYjIriwI4MptQjQ', 'review_id': 'dx8GMcPJ4ELwrnuuQ1P9Fw', 'text': "Exceptional food. Great flavor, good prices and the cuisine is ' simply' good.  Can't wait to try the grilled fish tacos next time.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2014-04-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '36tSUa5tIAej128_zRnv5Q', 'review_id': 'GAZhmIGiA8Op5xt1t0j_Kw', 'text': "This was amazing. Oddly, it was far down the list on my mobile app, but I'll be forever grateful that I ran mutt search through the full site. There a few food items I've come across in my travels that I'll chase for my life: California figs, Belgian fries and now, Phoenix burritos. Ate the house special breakfast burrito,  awesome filings but the star of the meal was undoubtedly the actual tortilla.  Wow.  Excellent value and well worth the research!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-05-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 3}, 'user_id': 'HestW1GKSkmUs_vpnauE_w', 'review_id': 'Vs1-aytKVMiuZ5-HDvURWw', 'text': "YUM YUM YUM. I picked up a couple of breakfast burritos here last week and was very impressed. The man at the counter was very nice and the place is quaint. The decor is new age Mexican and very cozy. The food is DELICIOUS and the prices are right. \n\nOverall, I'm happy I finally made it to PHX Burrito House. I'll most definitely be back!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2014-05-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rBM8Zi_26ROoi6nTHajfoA', 'review_id': '4bUPfFjQJPYiERB2l5dm7g', 'text': 'My friend had the green Chile burito he said it was really good. I was going to have the same but the green chicken parole got me. It was excellent.  Also the chips are homemade and the salsa tasty.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-05-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'EY-ojNpXTJb2SmAknL4l1w', 'review_id': 'WzVoY_LERK3PjkJqJiJKNQ', 'text': "HOLY MOLY this place is amazing. Loved the fresh salsa and chips. The tortillas were fresh, and the carnitas. OOOOOOO the carnitas!! It's heaven by the mouthful. We tried the carnitas burrito and the fish tacos. Both brilliantly delicious. \n\nWe will be coming back time and time again.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-05-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'GoDjpEPTyUQoQVRwPljIgw', 'review_id': 'UFGBWRiQO1fj8a1ckJzABQ', 'text': "When I read that these owners also own El Zocalo in Chandler, I was super excited to try what they had to offer.   I love that they serve breakfast burritos all day.  We are always looking for a good breakfast burrito, and we found it here.  It has huge chunks of potato, egg, and either bacon, sausage or chorizo.  The salsa they serve here is absolutely transcendent.  I could eat that stuff like soup!  It's spiciness hits you after a few bites and slaps you in the face!  My hubby and I were both sniffing through the whole meal due to the salsa clearing out or sinuses, but neither of us could stop eating it.  The tortillas are just as good as Carolina's, but a little bit thicker, which seems to keep the burritos from tearing as easily.  Next time, I'm ordering the shrimp burrito because it looks like a winner as well!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-05-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'O-Offow2UVaab04Wwv9g-w', 'review_id': 'N3h0n5qRa3tnvs_rfetHbA', 'text': 'Love their fresh tortillas and Mexican food! The restaurant has a cozy, modern interior, and the prices are great. Love the chicken burrito with salsa.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-06-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fDK6cXaPtr7j1kUX0d5n9Q', 'review_id': 'yJkZlTDhS6lH1g7JFnQqMQ', 'text': 'If you are looking for a delicious burrito, go no further! My husband and I are huge fans and eat here weekly.  The carne asada burrito is my go to choice. The ingredients are fresh and the tortillas are made in house. I highly recomend the salsa/chips and horchata, if you are looking for a little something extra. We always get friendly service and the building is well kept and cutely decorated.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-06-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KYJS9gSlgk_OI7FTi-tDNg', 'review_id': 'IjJSIHUWjNdI5qDEURh2JA', 'text': 'Great Food, fresh and tasty!! Not just another Burrito! Family owned and run I really enjoy the experience of Burrito House. My wife and I love it!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2014-06-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'CnoShMUYz1PJpCMRDztJVw', 'review_id': 'TJoIQm21B-f_IK9ATVjsPg', 'text': "Love this place! So far everything I've tried here is amazing. I've tried the shredded beef, chorizo, and shrimp burritos. Such great flavor with every one. Chips and salsa are very tasty as well. One great thing about this place is that everything is so fresh. They have some of the best tortillas! (I tend to be picky when it comes to the them. I hate when burritos taste like they use a Taco Bell tortilla.) The shredded beef is so incredibly flavorful. I notice that at other places it tends to be dry but it's so juicy at PHX Burrito House. I can't wait to try every burrito on the menu.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-07-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_XKBfvm8QWOFJqKo87Ywrg', 'review_id': 'yIk3SqOCk_tYw_smp4yqlA', 'text': 'Hands down the best burrito in AZ. I have been search for years and I finally found the place.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-07-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '5fGpx624YQJrX7tcKv6XeA', 'review_id': 'JWxlWIkNuWqa7j8JoaUTUg', 'text': 'Simply delicious. But what would expect with fresh ingredients. I loved the "Special Import" Pepsi from Mexico. Its been to long since I\'ve had Pepsi from a glass bottle. I will definitely be coming back here and letting everyone know about it.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-07-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'LHDOSzJYOqTBIoOif8mj2Q', 'review_id': 'te96x9urRCkUh2EJwfHS9g', 'text': 'Went with a group of 4 hungry dudes,  and they were all more than satisfied. Steak quesadilla,  pork carnitas and pork with green chili all got five star ratings from the table. Chips and salsa were great as well,  and affordable. 9bucks for a quesadilla and a drink. Great little spot,  clean and compfy,  with friendly guys working. Check it out!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-07-22', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 1}, 'user_id': 'QHdHXy73PHc-XDGP7vvQlg', 'review_id': '82UbJMVajZsbgbqzxk_k6A', 'text': 'Extremely nice people who operate this business, particularly "Dan" who runs the front of the restaurant.\n\nDue to a slight difficulty one day, Dan offered me a free water (due to the heat) and 50% off my next burrito.\n\nThis is great customer service.  I didn\'t even ask or expect this level of compensation.  It simply appeared to be a natural or automatic response to a small customer inconvenience.\n\nThe interior is clean and simple, with ample room for dining.\n\nI have been here a few times now and can safely say that I am a fan.\n\nTheir "special" carne asada burrito is nicely flavored and has a multitude of little, succulent pieces of properly prepared steak.\n\nI also enjoyed the breakfast burrito, which consists of eggs, potatoes, cheese, and choice of meat.\n\nWhile not the best I have ever had, they certainly keep me returning for more.\n\nOverall, PHX Burrito House should be applauded for having outstanding customer service and their ability to make a damn good burrito.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2014-07-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'AHoj5_8_kgn1LPCv87ZGlA', 'review_id': 'bp9uIXFVkdJVxFBStLQJWA', 'text': 'Excellent. The store looks like a small hole in the wall when you come in. The inside is very nice and clean. The bathrooms are clean. \n\nThe menu is on the wall which is neat. It is also on a pamphlet.\n\nAfter ordering I asked for chips and water. The owner brought out a BIG pitcher of ice cold water with ice in it. The salsa he brought out was delicious...and SPICY. The chips were fresh, home made and very crispy. I have not had chips this good in my life. \n\nThe burrito came out shortly after the chips. The burrito was stuffed with meat. The burrito had beans in it also. There is also cheese in the burrito. It was very satisfying. It was even more delicious!! And it was super filling!\n\nI am very happy I chose this establishment and want to come back soon!\n\nThanks for reading', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-07-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3_A0wwsTA02CUSpdj_gSWA', 'review_id': 'uVE-A5kJ3x2OUgPEnVg0Cw', 'text': "Easily the best Mexican food in Phoenix. There literally isn't a bad item on the menu!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-07-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'lmYLk5MgqivrlkU0EVeF9Q', 'review_id': 'Ld9pYPAUQfhPVSFYQov0Sg', 'text': "We got: \n\nChicken burrito\nMeat style burrito but with no meat in it\nShrimp burrito, add black beans and rice\n\nBoth the green and red salsas that came with our order were delicious. Perfectly done.\n\nThe tortillas were out of this world fresh, fluffy, heavenly. I could eat the tortilla plain and be happy. \n\nAll the burritos were delicious, I tasted them all. The shrimp burrito was what I  ate and I couldn't put it down, I inhaled the whole thing. \n\nMexican coke with real sugar in it was the icing on the cake. \n\nWe ordered take out over the phone and they got the order perfect.\n\nI also want to note that although the burritos were very filling, they were not greasy at all, just perfectly cooked like a healthy meal you'd make at home for your family, but they wouldn't know that it's healthy by how amazing they tasted. \n\nWhen I was craving burritos earlier in the day, I had never been to this place before, but they tasted exactly like my imaginary burrito tasted. \n\nI'll definitely be back. The man working in the kitchen was very kind and seems like an awesome  human being.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-07-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'X8hjnv-PSuJ0ASItdwpzqg', 'review_id': 'hztG3FxsK8HCdN2pbycvQw', 'text': 'Great quality ingredients, cheap prices. The veggie mix is awesome. Squash bell peppers and onions all marinated in something delicious!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-08-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5lg0x4sw4t5wmXKM8BhQnA', 'review_id': 'uHPPfAPCCEy2UIZDv9_XuQ', 'text': 'So good.  Talk about skrimps!!! \n\nThe shrimp burrito was delish! This place has a Mexican bingo (Loteria)  feel that will keep you wanting more.  Mmmm\nAlso had some chicken blk bean burrito ... Perfect Saturday delight.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-08-02', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'THr8peJ3dxCXVgPlKjagHA', 'review_id': 'ZpcbaewVG4LiBqlnxw8i6A', 'text': "The restaurant is clean and bright and each time I have been the staff have been more than welcoming. They engage in conversation with you and genuinely seem happy that you came.\n\nI've been three times now, and had different items each time. Everything is great! The fish tacos, the shrimp burrito, the steak tacos, the breakfast tacos, everything! The tortillas had a great texture and flavour. Loved the cartinas!\n\nYou should go check it out!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-08-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'qKqvVFP6PmxlS7-u0xjs3g', 'review_id': 'lBHuvS-QaX3yWa6-737Raw', 'text': "Stopped in for lunch and had a beef with red chili sauce burrito, which was great and flavorful. You need a knife and fork to tackle these burritos, packed full of goodness and fresh ingredients! \n\nI'll be back again to try some more items, staff was friendly and accommodating, parking and dining spaces are a bit slim, but grab your order to go, its all good!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2014-08-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'EORRZw4oIKDzU2zZnIlXPw', 'review_id': 'uGYYgk5es0ZaGCIq63TnCA', 'text': "Awesome joint! I had the carnitas burrito and it did not disappoint. It had a crispy texture to it that was flavorful. I'm not sure if they're suppose to hand out chips and salsa but I had asked if they had a house salsa of some sort, mind you i only wanted the salsa but it seems like the owner brought out chips and salsa, on the house. Which i thought was a nice gesture whether it was a standard or thoughtful of him. Food was delicious.\n\nSo I decided to come back a second time to try out the shrimp burrito and honestly, it was disappointing. Felt like the ingredients lacked something that I cannot wrap my tastebuds around. It tasted good overall, ingredients were fresh but burrito itself left desiring something else. The only saving grace to that burrito was their salsa which was terrific and it added depth to the burrito.  Their food is still tremendous and I will gladly come back.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-08-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': '_zQ-nRDAArkFr4CF08WfDw', 'review_id': 'EWQxMmy2MlwdJ21vrkzNTg', 'text': 'Love California style Mexican food and this place deliveries. Got the carne asada  burrito with the green salsa and was great. Did not have to wait long to get my food. Was lunch time on a Saturday. The only thing that I would like to see on the menu is carne asada fries and I would probably be once a week. Thanks for the great lunch.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-08-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dvZiYJ3bZQ2NFlT16z8KSw', 'review_id': 'mD3eDQ3SqQo9jud3N3e8Rg', 'text': "The meat in the carne asada tacos and pork in the burrito was really good. My friends said it was the best street style tacos and burrito they'd ever had. The bean burro was just ok. Simple atmosphere with Loteria cards on the walls. The service was ok.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2014-08-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'V5Wi3BMzpCcYjgtASqfd_w', 'review_id': '9H_jIa0twlfmp_04DKI4Tg', 'text': 'I really like this place! The shrimp burrito was quite good, it unexpectedly bit me back, but a few swigs of water took care of that. Other people in the party liked theirs. One remark I can recall is that the burritos were filling. The owner (or I think it was) was very accommodating to our special requests, and explained the menu to us newbies. They take great care in preparing their food and I look forward to trying them for breakfast one of these days.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2014-08-31', 'type': 'review'}
{'votes': {'funny': 9, 'useful': 7, 'cool': 5}, 'user_id': 'rjlb-7-JcmM6fR64ZpyTug', 'review_id': '44he1iK5TT26OkhRq_QHHQ', 'text': "Ok, this is the kind of neighborhood place where people care about customer service, and care even more about the food they're making. \n\nCame in on a whim. While I waited for a to-go order, the guy behind the counter generously brought out a little sampler of homemade chips, red chili beef and green chili pork to try. It was so delicious I almost asked my boyfriend if he wanted to order another burrito to split ... then I was like, girl, calm down. No one's going to keep you from coming back.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-09-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BZSM6JL92epbwz-Oj3u8KQ', 'review_id': '36aALP438_QEbLlli5HoxA', 'text': 'Awesome chorizo burrito. Gotta love a place that serves breakfast all day. Stopped in because of the yelp reviews. If I lived closer I would come back because burritos are My favorite food. Too bad :(', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-09-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'CxXk9R0RxDDJvi-gEmrA1w', 'review_id': 'bNzprZZwPhsYlqdZrrGmyA', 'text': 'I love their shrimp quesadilla that has onions and cilantro! Also their breakfast burritos are the best!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-09-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'jlUcQmTge3IgXxdQFHCcRg', 'review_id': 'O3cIDrbw5hgzbpGBaYzwCQ', 'text': "I've grown up being spoiled with burritos from Arizona and Southern California. I like my burritos big, cheap, and a little bit dirty (like the rare type of females that are into me). What Arizona is missing over places like San Diego, though, is a signature burrito. Over there, it's the California burrito. I have yet to find a good Cali burrito out here in Phoenix. However, PHX Burrito House has the next best thing. Their PHX Especial is absolutely delicious. The potatoes are high quality, great in texture, and not overbearing. The grilled onions and jalepenos are nice and crunchy. Spice is low, but they have some good salsa and hot sauce available. The eggs add great flavor without making it too breakfast-y. There's also some cheese, but not too much. The burrito itself is NOT a drippy mess; it actually feels like you are eating something somewhat healthy, as far as burritos go. Don't forget to add carne asada. I crave this thing at least once a week. This should be our Arizona burrito.\n\nThe building itself is small and very clean. The menu is short and simple. The staff that I've encountered is very friendly. There's a parking lot with enough spaces. It's divey in all the right ways for a fast Mexican food place while still being immaculately clean, friendly, not greasy, and extremely tasty. \n\nI guess you could say I highly recommend it for their Arizona burrito alone. Enjoy!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-09-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'uNUmNOoWR87cIBBCfD1ZvA', 'review_id': 'E9WAEAK5cMbJOzrfGpCB7Q', 'text': 'No fuss menu yet still so hard to decide. Went with the grilled chicken burrito. Chicken was delish. Tortilla was soft and fresh. \nService was personal. \nBreakfast burritos are next to taste!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-09-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kk05snSafuIFK0lsxoMNzA', 'review_id': 'd7cjM9KAoenMO6mFSV61UQ', 'text': 'Friendly and clean staff.  Fresh and absolutely delicious burritos.  A hit!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-09-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dsv5iGdK0UILcS7d_7DgYA', 'review_id': 'q9QxQeIslUPvIdPV02q7Hg', 'text': 'My roommate  and I went to the PHX Burrito House for dinner. I ordered the shrimp burrito and it was really good they do NOT skimp on the shrimp at all. The service was great plus the layout and art is really cool! looking forward to trying something else on the menu but it was worth the trip!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2014-09-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'iHCv55JuoIPy-qMF0Sa6TA', 'review_id': 'gh7UsdSGz1l4sHvEt9Nwqw', 'text': "Just Amazing!!\n\nI stumbled upon this place a couple months ago, and it has become a regular stop for me! \n\nTo put it simply, you walk into an immaculately clean restaurant, order from some great people who actually act happy to see you, and get mind bogglingly good food!!\n\nBEST fish tacos I've found in Phoenix!\n\nCarne Asada that's out of this world!\n\nPork and Green Chilis that is absolutely amazing!\n\nReally, the Phoenix Burrito House is just the best on so many levels!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-09-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '3HgE36dPTvtztLI1U6dlcw', 'review_id': 'qBb790Q1SR18IDQMr5WBAQ', 'text': "Can't remember what the chorizo burrito tasted like because the horchata was the best I've ever tasted.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2014-09-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HBuL0GXMaFUpjl7qjGmxww', 'review_id': 'mCjrK4nc5ZQ0DkKkzhw_xg', 'text': "Excellent burritos. They have that homemade taste. I can't believe this place is down the street from my house and passed by it daily and never considered trying it until today.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-09-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dcc7mTHDv0lwej1VqW4sPg', 'review_id': 'QTWA6bYEOu1DhrNxczPhZg', 'text': 'Simply delicious burritos! The tortillas were so fresh and the salsa was so tasty!!! We will definitely be back!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-09-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'w2O7D0h91rizeg4iRbM6NQ', 'review_id': 'xt90MIvk07BP9vd4Sod0Gw', 'text': "This is, by way far, the best breakfast burrito I've eaten. Not at all greasy. Fluffy, crepe like tortilla. Friendly staff. Accommodated my dietary restrictions. Will return again and again!!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-09-25', 'type': 'review'}
{'votes': {'funny': 5, 'useful': 10, 'cool': 2}, 'user_id': 'KYeLSM3MQpirmHukVV5Iow', 'review_id': 'veakej3-O_4rrvr4c_s1sQ', 'text': "If there's one thing I can conclude from eating at the Mexican places that are most highly rated on Yelp, it's that white people have very bad taste for Mexican food. With the endless Mexican food options in Phoenix, it is this place and Santos Lucha Libre that are listed in Phoenix's top 5 restaurants. The latter was terrible, but PHX Burrito House seemed promising. Would this be the most disappointing week yet in my still-young Mexican food tour? \n\nUnfortunately, yes.\n\nPHX Burrito House is situated in the former digs of the also-overrated Fry Bread House. I will admit, the idea of burritos in an old converted house is pretty cool (maybe that's why this place has such rave reviews?). I looked at the menu, and it was sparse. Great! A place like this should have a sparse menu.\n\nThe list of ingredients in the burrito, however, concerned me a little bit. Rice, choice of pinto or black beans, meat, sour cream. Guacamole extra. What? Rice? Really?\n\nI trudged ahead anyways. Got the carne asada burrito with guac. With a bottle of Fanta (no Jarritos?).\n\nAlmost $11.\n\nEverything was just OK. The chips were OK. The burrito was just OK. Sorry, but it's hard to get excited about a burrito where 50% of the mass is rice and 40% is beans. I think there was a piece of actual carne asada in every third bite. Guac was relegated to a little vein near the outside of the burrito. Sour cream was only noticeable when I got to the bottom, where all the liquids inevitably end up.\n\nIt's pretty disappointing when I leave a place with the feeling that I could have gotten a better burrito at Filiberto's.\n\nI've probably said this before, but if you want a sure-fire way to ruin a burrito, put a crap ton of rice in it. It's just filler. Would I eat here if I live in there area? Maybe.. But probably not, there's a Filiberto's across the street, and if I want a bad burrito, I might as well only spend four bucks on it.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 2, 'date': '2014-09-25', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 5, 'cool': 0}, 'user_id': 'OD5nkH4uJDDTJQdmaltDAw', 'review_id': 'abNs5qITZ3_z8rdAr9b5ZQ', 'text': "The place is ok and would probably be good enough for a 3 but this is being done to temper all the 5 star reviews.  If you live within a mile and don't have a car, then this place would be good enough for you to walk to.\n\nWe had their 1) infamous shrimp burrito, 2) carnita tacos, 3) asada tacos, and 4) a chicken burrito.   None had the WOW factor that people were talking about.  Actually, the meats were bordering on tasteless. \n\n I am not Mexican nor am a native Phoenician, but I do love to eat, and have eaten more than my fair share of burritos from a variety of places, from holes in the wall to glorified holes in the wall, so I know what a tasty burrito is.   \n\nThe place is cute and clean and salsas were tasty.   \n\nIf you have never eaten a burrito or taco because you were too scared to drive through a Filiberto's, then this place will provide a safe and boring introduction.  But I would recommend going to Chipotle instead.  \n\nVery disappointed with all the hype.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 2, 'date': '2014-09-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_X1zedRYJt_pf7fosmForA', 'review_id': 'WA3ck3YJAzY7oh4IA8s7QQ', 'text': 'Bomb Burritos & fast, friendly service.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2014-09-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MnTJ6YH1wkUlNYmGN7I1UQ', 'review_id': 'eSR6BMlvR1tFMPfIlN3Glg', 'text': "This place is amazing!  Short and very simple menu, and simple but great tasting food.  Tried the carnitas burrito and it was just perfect.  It has a slight crispiness to it without being over cooked.  The portion is big enough that I almost didn't finished it, but the food this good can't go to waste so I decided to chow it all down.  I really can't comment on what the place looks like inside because I'm so busy and so focused on stuffing my face with food awesomeness.  No doubt that it's probably one of the best Mexican restaurant I've been to.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-09-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6vHyT-HiAIdqXBrBn-c7SQ', 'review_id': 'qiM21p11uklszzwplP_Bcw', 'text': "This place used to be the Indian Fry Bread House. I'm giving it 5 stars based on their pork green chili tacos alone.  The horchata was perfect.  Shrimp and fish tacos were amazing.  Gong back ASAP!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-09-30', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 0}, 'user_id': 'D5J4mKahKvUBJUTWanZwdA', 'review_id': 'PBw7KcXOhqOvMiaRie7v5Q', 'text': "I want to start off saying that the service was very friendly and will probably get us to come back for a second chance. With that said I really wasn't impressed with PHX Burrito House. Now I tried the breakfast burrito with bacon, yeah I'm a real health nut, and was really disappointed with the quality. I did like the tortilla, but I found the eggs tasted like they had been sitting on the griddle for awhile and the bacon was so little I think it was only in one bite. Never a good sign when you have to slather the Cholula sauce all over your meal.  I have had much better around the valley and maybe it was just an off day seeing the reviews, or maybe I just ordered the wrong thing.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 3, 'date': '2014-10-06', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'wuCszpVPMIMyOCualnZtaw', 'review_id': 'sm41aN0dJ9J8g4XGTSpbKQ', 'text': u'Great tasting Burritos ... you won\'t be disappointed.\n\n\nPHX Burrito House is located off the beaten path in the Phoenix area.  I wanted a burrito for lunch and based on my fellow "yelpers" reviews I thought I would give the PHX Burrito House  a try and I was very glad I did. \n\nAll I can say is don\'t judge a book by its cover.  From the outside this burrito joint looks like an old house and if you aren\'t paying attention you will miss it and you don\'t want to miss this place.\n\nService is order at the register, then they bring your entr\xe9e to you. Customer service was really good, friendly and pretty quick. \n\nThere is a very good selection of burritos, tacos, and other popular dishes and all are reasonably priced and they taste great.  PHX Burrito house is not a fast food joint, so you get freshly made burritos that are a really good size and they are made with fresh tortillas that are absolutely delicious. The meat is tender and so flavorful. If your in the area you ha email to try this place you won\'t be dissapointed.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2014-10-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'f5w7GSgZ0vyFun1FA9iw7w', 'review_id': 'YFN1sLCzc_4Y8c_HRlaGcg', 'text': "The green chili burrito with rice, beans, and sour cream stuffed in a perfect tortilla was the best green chili I ever had. I can't wait to try the red chili. Excellent burritos.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-10-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KDnJQgCj3TbO2VcqKxy6Mg', 'review_id': 'nl-CPF0S1O01WMEbiVzOew', 'text': 'I tried a ham breakfast burrito and it was good! My only complaint would be the wait to get the food.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 3, 'date': '2014-10-12', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'pEVf8GRshP9HUkSpizc9LA', 'review_id': 'BGdEHKVWcn1v4BxU3qzPxQ', 'text': 'Yum!  We stopped in this weekend for lunch after reading the rave reviews and were not disappointed.  We grabbed a table out front and brought our furry friend.  We enjoyed the grilled chicken and carne asada burritos.  Both were fresh, flavorful and quite big.  Everything was freshly made and you could tell as there was no oil or grease.  Definitely worth the visit!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2014-10-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6S6eJNy-Jyu5Cn1B0MHztg', 'review_id': 'dNvFfKFKJlrdiTU7GwRgtg', 'text': "I didn't think I was hungry until I got my burrito home from PHX Burrito House. I had one bite, of tortilla only, and I realized I would be eating the whole thing in one sitting. \n\nI ordered a burrito without meat, and added avocado. It tasted amazing- the tortilla was my favorite part, but they really did a great job with having equal parts rice, beans, cheese, sour cream, and avocado throughout. The salsa on the side was a nice addition to the flavor as well. My boyfriend got a chicken burrito and mentioned that the chicken was really tasty- not too greasy or dry. I do wish they had had tortilla chips. It's possible they do, but they weren't listed anywhere on the chalkboard menu that I saw. I didn't look too hard. \n\nEveryone was friendly, the service was quick, and the prices are decent. I have a feeling I'll be coming here for quick lunches and dinners a lot.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2014-10-19', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 0}, 'user_id': 'vPl334misAuMKl8g_b2QVA', 'review_id': 'WNJEq8qtdGKxpscw8Igt6w', 'text': 'This place is NOT FUCKING AROUND. Best mexican food Ive had in phoenix. Got a Carne Asada burrito with pinto beans(NOT RE-FRIED, also have black beans), the softest rices Ive ever had, monterey jack(HAVE TO ASK FOR JUST JACK if you dont want the mix), and onions/cilantro. \n\nIt was absolutely AMAZING, didnt even need to use either of the salsas. That doesnt mean I didnt though. im a huge green salsa fan so I was floored by the tomatillo sauce. Fresh, flavorful, good kick, but not overwhelming. This place was like being back in ventura california  a couple blocks from the ocean at taquiera vallarta, best mexican food I ever had... They also have bottled pepsi and coke, huge selling point for me, albeit the smaller ones at 2.50 a piece. \n\nThe only negative I could see is its on the upper echelon of cheap. It was only 10 bucks with a bottle of pepsi(cheaper with fountain drink), just not fast food cheap is all. But for the price, its worth EVERY PENNY. This isnt like some of these other burrito shop where they charge you 6.50 for a burrito with all that inside but its like the smallest thing ever. I always feel like I fucking asked to add those cause I wanted a big burrito damnit! NOT WITH THIS PLACE. I was full with like a 1/5th left and Im a big guy, like 280 big. I dont worry about my girlish figure in other words. This was more than enough for most people unless you just got done doing something extremely active(ie run a marathon).\n\nI have no doubt everything else on the menu is good. Carne Asada is the gold standard at mexican places for me. If you can cook that, you can cook any other meat well. I was told the chile verde(pork) is even better. I bet seafood(shrimp) is as good, just not a seafood fan. They arent fucking around people, go there tomorrow, you will never be lead astray by a fat guy with 2 hands on his belly. Its the international sign language for someone with a stomach full of amazing food...', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-10-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '67WgAGnJ2N7JDDSoVkAN1A', 'review_id': 'bfS0gJWppJf76eLsYxKULg', 'text': 'Pork with green chilies! Yum, Yum.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-10-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'O0SKAbeSwhmKFClo2OKlVg', 'review_id': '_faTLoF8QPQBvRsiHC4iwg', 'text': "Always good to find a courteous staff and great food. I've eaten here twice and have tried three items. All of them were very good. The Pork Green chile is a great place to start when eating here. The burritos are a good heart size.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-10-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': '1TFQAIHwFnSexIHZNQR_UQ', 'review_id': 'f5mQJLlx-S9s0swBY-fJ5w', 'text': "Tried the Bacon Egg and Potato breakfast burrito with cheese and also the Carne Asada burrito with guac and beans.  Exceptional burritos.  Ate both while watching people exercise in the gym.  Felt like my stomach would burst, but I think the burritos are worth a ruptured organ.  Oh and also a little thing that made me happy with the meal, they asked if I wanted salsa, and actually gave the right quantity of salsa cups.  I sometimes get frustrated with other burrito places that just give you one small cup of salsa, and I'm just like wtf bruh, is this salsa for brushing my teeth or what?  But again, excellent salsa and food at Phx burrito house, I was content with it.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-10-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MJKjFN4xkWGJmdLJmrICqg', 'review_id': 'pIqutbVEx7vr5mCqIWhzyg', 'text': "Hands down the best Mexican food I've had in forever! Service is awesome. Food is phenomenal! Salsa is perfectly hot like I love it. Chips and tortillas are homemade. And because we LOVE this place so much and are here at least twice a week, we are greeted like long lost friends every time we visit. \n\nps) we were told the liquor license was awarded and they are in the final steps of carrying delish Mexican alcoholic beverages in addition to the awesome authentic Coke in the fridge by the counter.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-10-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'O0SKAbeSwhmKFClo2OKlVg', 'review_id': 'af5HpRhH0lNQSNUz_1TOZw', 'text': "Always good to find a courteous staff and great food. I've eaten here twice and have tried three items. All of them were very good. The Pork Green chile is a great place to start when eating here. The burritos are a good heart size.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-10-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '6tfzFII9tObuWweFZJ9_YQ', 'review_id': 'n0lWlXhPCoFh9zogwyAykg', 'text': 'Fresh ingredients, lots of choices and a friendly staff make this a sure bet. Definitely worth a try.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2014-10-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '36atraD20s_3MwuaBsimSw', 'review_id': 'C_px2BW4G0UM_3RH68xIgw', 'text': 'Family owned restaurant with very large and safe parking lot. Inside, very clean, friendly staff, and easy to read chalkboard menu. Menu is very simple yet provides lots of choices. Chips, salsa, and food are brought to the table.  The salsa is the bomb!  Spicy, not to chunky, and compliments the lightly salted chips.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-11-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'aNhBFRNjUFkGhSgndo_aqg', 'review_id': 'UY24-x3pHBZQzRt_D-N3cA', 'text': "Friendly service and great food!  Eaten here several times and it's always terrific.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-11-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'oXnp_Gn9sdL3dJ_nauxfig', 'review_id': 'lc_BRV0iZFIF6lwJZeOE-A', 'text': "Top Notch Mexican food right here! Thanks Yelpers! I went here because of the great reviews. \nI don't even remember the last time I actually ate a burrito. I typically stay away from them because they're a sloppy mess that are difficult to eat, and not very enjoyable. \nI decided to give one a try here. If there was a place to eat one, I guessed it would be a place named: PHX Burrito House. \nI went for a Carnita Burrito with refried beans, and while I waited for it, I enjoyed the BEST tortilla chips I have had in Phoenix, and some of the best I have had in my life. Super fresh and crispy, not greasy, not over-salted. The Salsa was fantastic as well. Little chunky, little spicy, great flavor. I was also treated to a small bowl of the Famous Pork with Green Chiles. Super tender pork with a delicious green salsa.(They also have a burrito with this)\nThe burrito came out and it didn't disappoint! They don't try winning you over with an enormous burrito, they put all of their love into a medium sized perfectly rolled bundle of goodness with a nice firm tortilla. The Carnitas were great, rice was delicious, creamy refried beans. And how does one judge a burrito? Well, I cut it in half and each half held together until it was gone! Most places fall apart after a few bites! \nIts a cruise for me, but a place I will definitely visit when in the area. \nSTOP going to those Chain-o-Berto type places and eat REAL Local Mexican Food instead!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2014-11-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'E4BT5mJ3PVQVW0PAj8nAsQ', 'review_id': 'rA6jsbrdnGvE2VIw1n97IQ', 'text': "My new favorite burrito joint in Phoenix. The tortillas are addictive. My 2 go-to burritos are the bacon breakfast burrito and the green chile pork burrito. This place is a great alternative to the overly greasy gut-bombs you get at the omnipresent ****berto's restaurants that dominate the landscape.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-11-12', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 1, 'cool': 0}, 'user_id': 'tON8wY2UUVdcjgXUqnlhMA', 'review_id': 'cqweDD73CzSMALhkoNFBuA', 'text': "Food was fresh , all of it , but not the best in Phoenix \nTried a crane asada and green chili pork \nI thought green was better \n\n\n\n\n\nIf you are comparing it to Taco Bell then it's the best\n\nWe didn't leave unhappy the service was great", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 3, 'date': '2014-11-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'cL3YBX1wTgyfBdui2Kb0kQ', 'review_id': '81xxm0rlzcNqM1dOPEWw3A', 'text': "Best Burrito I've had in my life!! Literally ate that thing in under 5 minutes...food was great, service was excellent, everyone was so friendly and the place was very clean......definitely coming back soon", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-11-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'e_22s3b6PcC7DBcvqzmDAw', 'review_id': 'itdfCogMja3neO-_Ll8Zug', 'text': 'I\'ve lived in Phoenix pretty much my whole life. I\'ve had quite a few breakfast burritos, from the categories of "I hate my life so much right now and I\'m going to hate it more after this something-bertos awfulness I\'ll eat so I can at least live through this morning," all the way to burritos lovingly homemade with the many fresh ingredients cut up and grilled in front of me.\n\nAll that said: The breakfast burritos here are The Best. If I\'m not out of town, I\'m here at least once a weekend. Doesn\'t matter if it\'s 10am or 3pm, some day that weekend I\'m devouring a breakfast burrito here. The potatoes & eggs are cooked in just the right way and amount that they\'re guaranteed to slay any hunger or hangover you may walk in with. The ham/sausage options are excellent, but my heart will forever be caught in the ages old battle waged between bacon and chorizo (chorizo usually wins). The red salsa just completes the masterpiece.\n\nNot to mention, the managers/owners are kickass. If they know you, they\'ll probably know if you need some water, how much salsa you need, and if you want chips (without even saying it) in the morning(ish). And sometimes they\'ll sit down and chat with you over their own burrito.\n\nI\'ve grabbed tacos here a few times as well, and they\'re also excellent. I can\'t imagine these guys doing anything average.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-11-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'C-X3uXgzHmwFBRn6R7u_xA', 'review_id': 'W09xQDAcNaI0soFdoDBPAQ', 'text': 'Easily one our favorite restaurants in \nPhoenix!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-11-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FxKbPa5PBOrq2CGOFyZAXw', 'review_id': 'ijI-MXKAP6Re4Hdxlc_-eQ', 'text': 'Now serving beer and margaritas!! Menu on the weekends and gotta get the flan!! Stay tuned for happy hour specials!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-11-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'woWYGBKq_YQZtLqll-hH_w', 'review_id': 'wTFcI3oLvrR-EsFNwes0gw', 'text': 'Experienced the 2nd best breakfast burrito of my life at this place! Eggs and potatoes were cooked perfectly and the veggies had a little bit of crisp to them still....not soggy!  Red salsa=perfect.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2014-11-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '54b1C9b-Nea-TJDKNhHtag', 'review_id': 'Zdw35LHSrqFbamGDWaojLg', 'text': "I love this place, they haven't disappointed me yet. The House Special breakfast burrito is the best I've ever had. They're also very friendly.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2014-12-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'jvDes7pQ35Mw6Pg5DvVfxw', 'review_id': '5Rs1I55BmrOgEhsSsc15lg', 'text': 'I had been wanting to try this place for quite some time.  I was very pleasantly surprised.  The burrito was huge and very tasty.  The service was very prompt and everyone was very nice.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-12-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-LdKKCeJ8Zy4Y5cyHXPpUg', 'review_id': 'lfv_CRpcvd4uFN-9Ux7oAQ', 'text': 'We love the burrito house. Owners are great, food is yummy! We eat here at least once a week!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-12-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'P6S4GV2LNW6dQ0ZIUMHSzw', 'review_id': 'sBMr3EDADO43_ArMLhnRvg', 'text': "A co-worker and I were deciding where to go to lunch today. We saw good reviews about this place and decided to give it a try. It were SO good! Among the best I've ever had. I had a breakfast burrito and was really excited they served breakfast burritos all day! My coworker had the shredded beef, which was equally delicious. Service was great and restaurant was clean. Would return again.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-12-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PfioIfEtUoSnTBOqsx65dw', 'review_id': '13-vPEk2cBJIX6k8OCRVZA', 'text': 'Came in here after a long night of drinking one morning and I was extremely impressed. The wait is a little long, but there is an upfront disclaimer that reads "Please be prepared to wait as everything is prepared fresh", yeah I\'m down with that. I got the steak quesadillas and a sausage, egg, and cheese burrito. The steak was marinated with lime and was so delicious I could have eaten three more. As for the burrito, it\'s rare that a place can throw potatoes in and have them be light and fluffy, but these guys pulled it off. \n\nWere it not so far from my house I\'d be in more often, but maybe that\'s a good thing for my waist line. If you\'re in the area give it a try! \n\nPs, it\'s kind of tucked away in the back of a little cluster of buildings, which made it hard to find. And the Yelp pin drop may be off a bit.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-12-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'B3oCDlO3uBUrFQu-xmr6uQ', 'review_id': 'O-ZLq3nfG4fWZU3nR1JFKQ', 'text': "Tucked away inside a charming little house off the hustle and bustle of 7th Avenue is this gem that cooks up some of the best shrimp burritos around. They're refreshingly light, a welcome change after all the sauce-smothered enchilada style and heavy carne asada burros I've been scarfing down on my PHX-Mex tour. \n\nOh, they make a mean carne asada too...", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-12-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'roVNdcyqvsOaMlz8qoastA', 'review_id': 'xb0wafvoUvwzAx_xGgpNYg', 'text': 'My co-worker suggested that i try out this wonderful place. After reading a few reviews i decided on the chorizo. The wait was a bit and the hostess offered me some chips to go. The chips were so fresh it reminded me of when me and my mom used to make them at home. Loved them.....The salsas are spicy to perfection. I will definitely make this a regular place for lunch. .....', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-12-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 0}, 'user_id': 'WMEY7yj5W8dTZC4Kp3G8PA', 'review_id': '1La_lxhZvQJCyikNPEg8YQ', 'text': "Burritos here overrated and expensive. Disappointed especially because it was about nine bucks for a burrito that should be about four dollars. Chipotle burritos are way better and cheaper. I got two different burritos, green chili and pork and carne Asada, both way overpriced. I'm thinking because they got popular on yelp and have a lot of Caucasian customers they will charge more. Well I think their popularity got to their heads. I don't think I'll come back. My burrito was too soggy by the way. Good salsa good chips.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 2, 'date': '2014-12-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '1qlARAsK6FlEtQ8afRaeew', 'review_id': 'FtottcpdFqBVPyWnKVHL8A', 'text': "Tasty burritos on the way back to my apartment? Yes please! I always go with the carnitas burrito because it's made just the way I prefer it: tender, braised pork with a seared/crispy outside. Friendly service and decent prices (~$8 for a fairly sized burrito that fills me up) in addition to a consistently tasty burrito are what keep me coming back for more. And more. And more.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2014-12-28', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': '8AMn6644NmBf96xGO3w6OA', 'review_id': 'BuLqObHzjaCJk8l9QEKrcw', 'text': "Wowzers!  This place is a winner and I can't wait to go back... in fact I think I will be going back tomorrow for lunch!\n\nFirst off, the woman taking orders was sooo friendly and helpful and it was obvious she enjoyed working there.  While i was waiting for my order She told me about the owners and then talked about their most popular dishes and even brought me a sample of their pork green chili.  Holy crap, that was frickin amazing!  Spicy (which I loved) but seriously great flavor!  I want it so badly now!  Sooo friendly and sweet so huge kudos to her!\n\nOk now on to the important part... the food!  Yummy!  Homemade tortillas were very obvious since they tasted amazing and super fresh!  The chips were freaking fantastic and were thick but light and crispy. .. again they were obviously homemade.  My carne asada burrito was good but could use some grilled veggies... my bad but I will ask for them next time.  Without a doubt I will be trying their pork with green chili next time since the sample is still dancing in my taste buds.  Ohh guac was superb too... nothing fancy or over the top like some places attempt to do.  \n\nGreat prices too!!!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-12-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'vE8ChTZh2a5K2s_HYjC9Kw', 'review_id': 'pUHL5QLxXyjIGgNpsvwY7A', 'text': 'Stopped by on my way home from work yesterday on a whim for my first time because I was hungry, and boy did I have a pleasant surprise! The mature blond lady working behind the counter asked if it was my first time there to which I obviously responded "yes". She was extremely friendly and gave me the rundown on what they serve and recommended the green chili pork burrito of which she gave me a small sample. It was delicious! I ordered it and because it was my first time there she threw in a small side of chips and salsa. When I got home and opened the container I was impressed and happy to be greeted with a hot and large burrito that required two hands to pick up. The tortilla was soft but firm. The burrito was filled with the green chili pork and rice(but not too much rice), black beans(pintos and refried are available if thats your preference), cheese and sour cream. The chili had a bright green chili flavor and did have a kick to it but was not too spicy for the average American who likes Mexican food.Everything tasted fresh and their recipe is delicious. It is definitely one of the best burritos I have eaten. I am anxious to try their Carne Asada burrito next!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2014-12-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '03HHh0TGW6ALQb5KKBoG_A', 'review_id': 'esajLUKnr8sIHWidkWkSjA', 'text': "I had the carnitas burrito and Sis had the machaca special. The Machaca was good and tender, but not the best I've tasted. The machaca burrito was jam packed with potatoes and eggs which made it overwhelming. I'm talking Scooby and Shaggy overwhelming. Either share it or order while starving. The carnitas burrito had great flavor but the meat was a little dry. I suppose that's why you receive  the generous servings of salsa. I think this restaurant is very generous with the portions, has wonderful customer service and is has the bang for your buck. I don't mind returning to taste other menu items. There is a lot of potential here.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 3, 'date': '2014-12-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6S6eJNy-Jyu5Cn1B0MHztg', 'review_id': 'Kj3fBb8n3Sqy_mhfXIj9ZA', 'text': "PHX Burrito House has updated its menu to now include not only chips, but quesadillas and new entree items. My one complaint was that there were no chips; now there are chips. This is, hands down, my favorite place to get Mexican food (burritos in particular). I'm telling you, those tortillas are KILER.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-01-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'NduimgV7E-7d4UtoZLmLqQ', 'review_id': 'iT_Fe03azABM7I4ieV8g3A', 'text': 'Quaint, consistent, friendly, "homie"... and those tortillas! The Green Chili burrito hit the spot.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2015-01-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'MRCIGFBboDfQL3JIoDhaMA', 'review_id': '6kKLXFLwZZl_Eo_wckDeiQ', 'text': 'JUST OK. Not sure what all the hype is about. Was so stoked about finally going here. Upon going, I can say I would never recommend or even mention this place to a friend.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 2, 'date': '2015-01-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'ltGN-CuR8Y2-jeDhaZNt8g', 'review_id': 'Bpcvi718biUBkj-AM4ul8A', 'text': 'The carne asada burrito is NOT good. Cheap meat and rice as filler and way overpriced. Chipotle is better. Just up the street is mucho macho taco.. Go there instead or joyride or really anywhere else.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 2, 'date': '2015-01-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': '4DtBamDdmuYGozIHJN9cig', 'review_id': 'qeQcsrhhAHSmnqNopXW3Sw', 'text': "Hungover hipsters hunched hungrily.\n\nThat appears to be the Sunday-morning crowd. I'm really torn on this review, as PHX Burrito House has some huge strengths but also some significant weaknesses.\n\nOn the strengths side: the ingredients are fresh, the tortillas are delicious, the bungalow is minimalist-cute, and there is Negra Modelo. The excellence of the tortillas cannot be overstated -- the tortilla was, if anything, better than the fillings. The salsa verde was also really nice, with a mild kick to it, not just pure veggie-ness.\n\nOn the weaknesses side, those were the second most off-putting carnitas I've ever had. Half the lumps were burnt, and the other half were nothing but fat. It says something positive for the workmanship of the chef that I found this edible at all, but I wouldn't do carnitas here again. I ended up being just as relieved that the burrito runs heavily to rice, as it's quite pleasant rice. I can make better carnitas at home, but I wish my rice was anywhere near as good.\n\nService is incredibly sweet-natured but also very, very leisurely. Do not count on rushing in to pick up a burrito -- the people waiting for to-go orders had fallen into a sullen, slumped stupor, and the whole pace really works better if you're doing a contemplative ramble around the neighborhood, maybe with a book of modern poetry to keep you occupied as you wait.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 3, 'date': '2015-01-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kIlXkC8vg2x9UKALewciKw', 'review_id': 'McRAebOM-WMlXR8Eawa_Bg', 'text': 'Excellent service AND excellent food! We chose this place through yelp because it has such great reviews and the great reviews proved to be correct. The chicken quesadilla with Pico is so good. I would recommend this place in a heart beat!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-01-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'azx8j-0_TjcgFiFHWCH9tw', 'review_id': 'oU2s1JEsY-yBGFs4bLsSDQ', 'text': "Skip all the other Mexican fast food joints and go here!!! I guarantee you the food is a million times better and fresher. Not only that, the staff is super nice and fast. You'll be in and out in no time for the lunch hour rush. Just stop reading and go get your burrito fix here already and thank me later!!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-01-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 1}, 'user_id': '3gIfcQq5KxAegwCPXc83cQ', 'review_id': 'GIuNkERamU_nIoN_Mx-OgA', 'text': "I have been looking forward to trying this new (ish) restaurant for awhile now... so you can imagine my excitement as we entered the cute little place that is the PHX burrito house. I wanted to try a variety of items, so the husband, my dad, and I got a quesadilla, a couple of green chili burritos, guacamole, and a red chili taco... no we didn't try the carne aside, and maybe that was a mistake. I don't really get the hype....the food just wasn't that good. The guacamole was fairly bland. The green chili wasn't spicy and the burrito was overtaken by beans and excess tortilla, dampening any flavor the green chili may have had. Additionally, it wasn't served with any salsa.... and it needed something fresh badly. The red chili taco was a bit spicier, but had an odd smokey flavor that wasn't great. Again, there was no veg on the taco... no cabbage, no peppers, no cilantro....nothing to add any freshness or brightness to the food. I'm not saying the food was bad, but it wasn't great. Maybe we went on an off day, but if this showing was representative of the food here, I can't see myself returning anytime soon.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 3, 'date': '2015-01-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ErqnuSHSXEmoQNPTc3zE8w', 'review_id': 'L21oq_4pnewWmGeI9ReS0Q', 'text': u"Yum! PHX Burrito House is delish! I had the red chile beef tacos, and they were wonderful.  They came in soft, white corn tortillas that tasted freshly made.  My fianc\xe9 had the carne asada burrito,  and he was raving about it (he's a Mexican food snob). We shared an order of chips and salsa too.  Great chips, even better salsa (it has a kick)! Check it out!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-01-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'y3sOyQUiwL_dV38H652dfw', 'review_id': 'FlCQlc9TqAIaiA1ciKHAOA', 'text': "I've been hearing great things about this place and unfortunately, I was underwhelmed. I stopped by on Sunday and ordered 2 burritos to go. I was told it was going to be a 15 minute wait. I don't mind waiting for good food, so I placed my order and waited. My order was brought out to me and I raced home in extreme anticipation. Both burritos were wrong. My bf got chicken, beans, rice, sc, guac, cheese and lettuce. His was missing the guac, sour cream and cheese. I ordered a carne asada with everything. What I received was a carne burrito with only rice and beans. It was bland and some of the carne was gristly. The rice was overdone and the tortillas were made with waaay too much lard. Sorry, first impressions make a big difference to me and I will not be going back.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 2, 'date': '2015-01-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'LSf-AF1UzGV4viB9LgoNjA', 'review_id': 'bt5EH1obDC_5DXBvur1tPw', 'text': "My favorite burritos here are the breakfast burritos with bacon potato and eggs. The one with sausage is decent but I like the bacon one better. It was hot and fresh took about 15 minutes to prep...so expect that! I'd pass on the Carne Asada Burrito to be honest, you can get a better one in Phoenix at other places I'm sure and I compared it to the last one I had in Tempe. \n\nThe owners are friendly, but its kinda pricey, I wish it came with chips. Overall, fat burritos, clean and a cool place to check if in the area!\n\n3 STARS", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 3, 'date': '2015-01-30', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': '70zChgIIHgIj028iVPDmUw', 'review_id': '15TrbN99pftEy6IrD6iZXA', 'text': "YES!  \n\nVery good...exactly what you expected (and needed, even if you didn't know you needed it!)\n\nCute little building just out of site of the street - quaint even.  Shared a shrimp burrito which was full of fresh cabbage and plump yummy shrimp...and a green chili pork burrito that was brimming with pork and beans and cheese.  The tortilla's had a  little crispy edge to them.  Delicious chips and salsa.  Topped off with a Pacifico for each of us.  \n\nDefinitely will be back!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-02-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'B-4_1ATtqCuFlKk1c24b2w', 'review_id': '3rUA9ttTTvdfbkYrjiL_RQ', 'text': 'Margaritas were tasty & AWESOME--Right amount of flavor and punch!! Love that they carry Jarritos which doesn\'t use High Fructose Corn Syrup. CHIPS AND SALSA GOOD. QUESADILLA EXCELLENT! The burrito?--Well That is another story. I ordered the "House Favorite", which comes with eggs, grilled onions, potatoes, and cheese. While the cheese was melted nicely--The eggs were overcooked-- I asked for both pinto and black beans and I only received a small amount of pinto. The potatoes were soft enough but lacked flavor and were pilled in and overpowered all the other ingredients and my burrito didnt taste fresh---I am guessing they don\'t clean their grill regularly because it smelled like "other" ingredients and made my burrito taste "un-fresh" Overall it was one of those DRY burritos. I got through a whole saucer of salsa to make up for the dryness until I said enough is enough. I wouldnt come here for breakfast burritos but YES TO THE MARGARITAS! I honestly like Taquiera Los Yaquis WAY better!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 2, 'date': '2015-02-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mtq8lsgo-h4qkOcyYb-0_A', 'review_id': 'y98orKWvWYzF91_edgb38Q', 'text': "Talk about a diamond in the rough! Doesn't look like much from the outside but the inside is decorated so nicely and the food is fanatic!! The burritos are huge and the meat is so tender. Very nice employees too!  I HIGHLY recommend", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-02-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'mt6wuqFrdQifM49hLkBoIQ', 'review_id': 'QF65yfl1ngEIH7nMW2ZCkg', 'text': "Fresh delicious food. I ordered a salad with carne asada and it was perfect. The people are so nice and the decor is cool. Clean. Altogether great dinner!  I'll come again for sure!!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-02-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'x1iVbNrfN8byNiS8AKGMNg', 'review_id': '0slBUDcXC5vZIwgWpcaXhg', 'text': 'Im a hard guy to please when it comes to food. When they brought my burrito the first thing i could smell was the masa (dough for making tortillas. For you non spanish speaking people) on that tortilla. I dig home made tortillas, so i knew this was gonna be a great burrito. It was. Oh and they serve beer, what more could i ask for ;)', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-02-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'EjhShDgIu8k3jRRqr7K-Rg', 'review_id': '5Pz05zx7A-CTEoD1R1tI7Q', 'text': "Drove past this place a couple of times decided to finally try it out. I'm so glad I did. Cashier was extremely nice gave me and my friends chips and salsa while we waited for our food. They normally charge for them but they gave it to us for free. The food was amazing we all got a different type of burrito and all of us loved our burritos. I highly recommend this place", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-02-11', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'MoSnITh9bOrQPah0nSwuKQ', 'review_id': 'mmI6XKj1eCsaOH4rWIwS4A', 'text': 'Came here on my lunch with my coworker. The burritos are amazing, had half green chile burrito and half  shrimp burrito.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-02-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'MLNXzph9nlCXGiSuv5G5Yg', 'review_id': 'a9OeoYzkkebz-eeN_5RAbg', 'text': "You will get no argument from me that PHX Burrito House has solid food.  My first time here confirmed that much.  That said, two aspects of this place were a little off putting to me.  The prep time, and the portions.  With all the Mexican food spots as well as national goliath Chipotle dotting the valley landscape, you'd better be doing everything right to thrive in this saturated burrito market.  From where I stand, this place will have an uphill battle.\n\nA solid overall Yelp rating was what brought me here on my way home from work on a Thursday afternoon.  Its a cute spot right in the heart of the Melrose neighborhood.  I believe Fry Bread House used to be here once upon a time.  There's seating both inside and out, but only for probably about 25-30 at most. I got here around 4pm and the place was pretty dead so I figured I'd grab a few of their items super quick and be on my way.  Not so much.  \n\nI ordered their Shrimp Burrito (which includes chips and salsa on the side) and a plain quesadilla to go.  Total cost was $14.  I sat up front thinking they'd be able to get my food done super quick (since there was only one other person in the restaurant).  5 minutes.  10 minutes.  Finally, just over 15 minutes later they had my food ready to go.  The woman up front was plenty friendly, though didn't seem apologetic about the wait.  I guess this is the normal prep time?  I can only imagine what the wait would be like when its busy.\n\nAlright the food.  When I opened up the bag of goodies, the portions weren't what I expected.  For comparison, I would say the burrito I got here is probably about 2/3rds the size of what you'd normally get at Chipotle.  The quesadilla and even the bag of chips they included were also smaller than what a Chipotle would offer by comparison.  That said, the shrimp burrito I got was awesome.  The texture of the tortilla was perfect.  It had plenty of shrimp, avocado, cabbage, pico de gallo, and a surprisingly potent hot sauce.  Very satisfying.  The quesadilla as well as the chips and salsa were also quite good too, though I've certainly had better elsewhere.\n\nSo I guess in summary, 4 stars for the food itself, but 2 stars for the rest of the experience.  I'd probably come back if asked, but I would never go the take out route here again.  I suppose their sole focus might be just on those who choose to dine in, rather than those who want to grab and go.  They have other offerings including tacos, some baked pastries and even a decent Mexican beer selection that would probably make this a cool place to hang out with friends.  But for the same price, you can probably get better bang for your burrito buck at Chipotle and other valley Mexican establishments.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 3, 'date': '2015-02-19', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'aUj817L2OBGRAB7ajsUr8A', 'review_id': 'TZl2ch3JV_49UnrJzytPzw', 'text': "Amazing shrimp burrito. Everything in it was so fresh. They didn't hold back on the shrimp there's was shrimp on every bite. The place is nice and very clean. The variety of salsas are good. This is definitely a fit burrito.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-02-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'qAVoK90eeWGeUswbvDxjZg', 'review_id': 'hEHlajCu5z-QM-gY3MBOCw', 'text': 'well technically its not a house, its a restaurant. if you can get past this issue, the burritos taste very good', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-02-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': 'q1qg_ghDl2NHUj7MGfX-2Q', 'review_id': '2kK7y1JmJ4E5x37QN9Agqg', 'text': 'Had to give PHX Burrito House a shot since there\'s a lot of good hype about it. Gave it a whirl yesterday and I have to say it\'s actually really really good. I got the carne asada burrito with guacamole. Yeah, it was bomb. Those flour tortillas were nice and chewy, just how I like em. Loved the "Loteria" decor as well. I\'ll be coming to this place more often for some burritos. Next I\'ll have to try the tacos!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2015-02-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': 'TeISGh_FbPggps4_5s_pRg', 'review_id': '0F6PwVgbUyrmYIqIDdjK-g', 'text': "I haven't been here in a month or so but it was even better than I remembered. I ordered the chicken burrito this time & it was delicious. The best burritos in town! The staff is always friendly, the place is always clean & they play great music. If you haven't been here yet you need to make it a point to visit. You will not be dissapointed.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-03-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'pI8_qiRoAAi_rLhNHh6-Rw', 'review_id': 'SaRZxIylrUABcQ-5KiKJ-A', 'text': 'Delicious thin flour tortilla. Carne asada can be more marinated. Green chili pork chunks were tender. Pretty tasty, but not overwhelming.\n\nMy friend the veggie quesadilla was better than most and lemonada was good .\n\nTamarino and jaimica beverage was interesting... Sweet/sour. \n\nStaff was very friendly. Gave us complementary chips and salsa.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 3, 'date': '2015-03-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JQIMRGgnmbtH8EOOD5FKTA', 'review_id': 'XdeQHnx2pDJFdLVRf8DsIg', 'text': 'Love the burritos, but love the service better! the lady at the front makes you feel welcome, even 10 minutes before closing. This is the only burrito joint I crave anymore. The freshest salsa too!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2015-03-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'f3P6uNwSiNhxh3EADSx_bQ', 'review_id': 'TEn6mAuke4rhcqRo6r2I3Q', 'text': "Best taco salad in town!  Staff/owners are super friendly.  Their ingredients are so fresh and the prices are great.  We eat here regularly since we live nearby and never have been let down.  I'd like to see more gluten free options ...but that taco salad is so good, I'm happy to eat it over and over.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-03-10', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': '5BsFyMdtoHuo7i1cDJJ1iA', 'review_id': 'y4wDDi_HHIWvdynfymayDg', 'text': "I've driven by plenty of times and decided to try it for lunch today with my mom. The place with clean and the girl who took my order was very pleasant. We ordered take out but while waiting I did see the chips they serve and they are made fresh which I thought was great. Nice to know they are not made hours prior sitting in some warmer.\n\nI ordered the pork carnitas burrito and my mom ordered the pork green chile. I have to admit that my burrito had some over cooked chunks of pork which made it a bit dry. Not a deal breaker for me. I just had to throw some salsa on it. I took a couple of bites of my mom's pork green chile and I really liked that. The green chile wasn't overpowering and gave it just the right amount of flavor. The beans and rice they add to the burritos was good.\n\nI would definitely go back but probably wouldn't order the carnitas again. I would love to try the shrimp burrito.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2015-03-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'R7Gxv5jkjLoRT5xqN7sJwg', 'review_id': 'z2sV9xuG9FAF4uGykI3cUg', 'text': "Inexpensive, friendly, good food. I love their breakfast burritos- the bacon is always nice and crispy and the eggs taste fresh. The tortillas are delicious, and I'm not usually a fan of bread-y foods. The employees genuinely pay attention and start recognizing people after just a couple visits! A+!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-03-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'eEbglHXpdqkxpnjOQRZ4pg', 'review_id': 'brN5crKEvJH31WwUwYOe9Q', 'text': "Great food and great service! Absolutely love this place. I didn't realize there was seating available, next time we plan to eat there. It's a cozy environment and the owners really know how to treat there customers!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-03-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'nM6l7FdZjmqueGUQHX22Qg', 'review_id': 'Ljh4Yb_SrvMjj9cYvYcmOQ', 'text': 'The Shrimp Quesadilla is my favorite. Always nice, friendly staff that greets me when I stop in.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2015-03-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IBioXrM8hTrIrNWu0vPccg', 'review_id': 'hFHFx-q8Ckvb4UOZzoqcAA', 'text': "Found this place on Yelp as it was close to my hotel and some Mexican sounded good. Reviews were good, so I set off into 96 degree weather and walked over. Would have been hard to fine if I hadn't had directions, but the food was great and the staff were extremely friendly and helpful. I had the carnitas burrito which was fresh and amazing. Their homemade hot sauce was superb as well. Highly recommend!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-03-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'y0kTrVVLQBIyPEH2lNCK4g', 'review_id': 'zBvJdXvdr95i5eeuihaERw', 'text': 'Simple order at the counter mexican affair. The tortillas are fresh and homemade! The chips ate also fresh and homemade... The salsa is fantastic... Next time i will order a chicken quesadilla. Really like this small family owned place!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-03-28', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': 'WIlZcdhW3trjeljwHoVC3w', 'review_id': 'ByNCbXMDG_MhLtR0q5rvWg', 'text': 'First things I look for when visiting a place are the cleanliness and hospitality. They had both. I liked the owner a lot. He is down-to-earth and genuine. Before my family and I finished our delicious food, he invited me out to shoot hoops (basketball). I might get too fat frequenting this place before I can confidently take him up on the offer. The food is that good and will have you returning in no time. Thank you for great dining!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-03-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0Hr9Hp5S3W1RJcXltDXp-Q', 'review_id': 'IMkdqSTX93f44xLoVGZxsQ', 'text': "Small family owned spot with friendly service and truly fantastic burritos. Just put some pico de gallo in there for me and I won't go anywhere else!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2015-04-01', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 0}, 'user_id': 'T3rEFiOVLUy4w8d92SsWKQ', 'review_id': 'HXZ8iY549Bt3XVvVghb4fg', 'text': "I'd give a 10 if I could. Super clean place, great food, great service, great owner and staff, fair prices, felt as if I was enjoying food at a friends home, much better than a chain restaurant...keep doing what you're doing and you'll go far...I'll be back with friends!!!\nJ", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-04-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8ZchNx1nHZMXe1WpVTbDcw', 'review_id': '376j0u7L8Q0dGVOQPvXUqQ', 'text': "This is by far one of the best place in Phoenix to get a great burrito. The place is an old house with a small dining area inside for those warm Phoenix days but has seating outside for those perfect nights. When it's comes to their burritos they are amazing. I've tried them all and I have to recommend the pork in been chile. It's one of my favorites. I haven't tried their breakfast yet but it's next up. Service is quick and they have great customer service.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-04-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'BsgXTs_hz4AwgbK0wSIIxw', 'review_id': 'b_TI6pvQT3g_uTgXbi50BA', 'text': 'Excellent burrito in a funky local spot in the Melrose district.  The beans were terrific and the burrito was very big.  The service is friendly and fast even though we went during a festival and it was packed!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2015-04-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kk05snSafuIFK0lsxoMNzA', 'review_id': 'on8yAcRRvZ9PVB8RiYzhfA', 'text': "Just when I thought it couldn't get any better: the carne asada burrito is the best burrito I have ever eaten. This place has the perfect formula and consistent quaility. They are just really good people running the place too.  I argue Best Burrito in Phoenix hands down!!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-04-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'YDD5PEMiM3kjbCucOmaSlQ', 'review_id': 'WLGZff3lFbxMaO9fExBQ5w', 'text': 'Best carna asada burrito! Homemade tortillas, super nice owners. Love this place. I typically go there 2-4 times a month and will go the extra few miles to eat at a local restaurant over similar chain restaurants.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-04-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'v_FcGIEhMvzboVy9MPnbnQ', 'review_id': 'nHJdEyjpGRcrBwTJHo0x-Q', 'text': "Great food.  Fair price. Home cooked food.\n\nI tried the chicken, pork, and steak. They're all excellent.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-04-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ovaovvsxV96TUKJhar3P0w', 'review_id': 'EXbIX9MgyY3lCcBb4_EM3Q', 'text': 'I love this place :-) \n\nYummy burritos with wonderful service. The attentive staff makes sure you are enjoying your meal.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-04-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'UEpSOjGDN34Y4Lq0FPq2PA', 'review_id': 'B1JaiUeZfF-yE36tH0HcOg', 'text': "Dine in order:\nGrilled Chicken Burrito w/ guacamole added & a Mexican bottled Coke; total $10.01\n\nCame in to a slow Tuesday evening, only one other table was being occupied. Not only was this place dead but it had no good atmosphere at all. From the young man taking the orders to one of the owners present. One could at least add some low volume music so you avoid hearing the awkward silence. This is not to say they had bad customer service just no soul / passion in the restaurant \n\nThe chicken burrito was good but sadly the overpowering of refried beans made my burrito sloppy & unwrap-able. At the end it was a soggy mess. As for the chicken I was able to take out and actually taste it was juicy and flavorful. Tortilla was a tad bit thin but didn't bother me cause I'm not particular to thick or think flour tortillas.\n\nFor what you're purchasing this place gets a 4 out of 5 stars & for the ambiance of the restaurant I give them a 2 star rating. Overall it's a 3 out of 5. My recommendation, take your food to go", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 3, 'date': '2015-04-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CcAOwq8DA6wln2ofA2RFxw', 'review_id': 'OYHQW8tGJ1WlA-GPPDW3uA', 'text': 'Heard about this place the other day and had to try it out. Solid burrito spot that has a variety of burrito specials. It is a very small dining area so get there just before or just after lunch to find a spot to sit. I had the Carna Asada burrito and a quasadilla. The food was made fresh and was very good. One of those spots that you have to order at the counter and get served after you sit. Customer service was good for the type of place it is. I would go back when in the area and feel like a burrito.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 3, 'date': '2015-04-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jS9joWWQE1m8BspueyiI1Q', 'review_id': 'c5HcT6hODdciyqatlY0rGw', 'text': 'Found this place on yelp.   Holy cow.  The food is outstanding!   Coming back again before I leave town.   Gem find!  No frills. Great food and service', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-04-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HONuRfmMtPLEtwtw9g_d-A', 'review_id': 'roP4i3r5MXg8OswOSUU4yA', 'text': 'Carne Asada burrito!!!!! They get a little busy from time to time but the food is worth the minimal wait!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-04-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HNTYaFBpGe1ywY2_VOHFwQ', 'review_id': 'z-VbRhb5VnKpPb9dc6q0OQ', 'text': 'Burritos awesome, tacos yummy, portions perfect...service very friendly and great hometown feel!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-04-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MTzioVtP2QNNgpaZEp-oHg', 'review_id': 'WavynxGt8je3b6IUUf5lhQ', 'text': 'I tried the breakfast chorizo burrito and it was really good. However, I had a 30 minute wait... not so good.  They did give me free chips and salsa while I waited and apologized for long wait.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 3, 'date': '2015-04-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '_Rc76BS9YW7UW7fu8nQDzg', 'review_id': 'L7vSSXzm4SsEPeCeDvcfsQ', 'text': "I've driven by this place a number of times and finally stopped in to try it and it was delicious! I ordered the shrimp burrito and a Mexican coke for about $11. The burrito was great; shrimp was cooked perfectly, not overdone, very fresh guacamole and cabbage. I was with my boyfriend and a friend and they gave us a bowl of salsa with our order but no chips... Very weird but we decided to order some chips to actually enjoy the salsa which cost another $3. Marketing tactic? Maybe, and if so, it's working. The salsa was fresh, not too spicy, and really tasty. I'll definitely be coming back!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-04-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '9fezgFawZ9fUkwikm2wxWw', 'review_id': 'K9Gx9Inn2f-rR0LrPQfYaw', 'text': 'This was my first trip to the Phoenix Burrito House based on an article in the AZ Republic. I ordered the green chili pork burrito. It was outstanding; great flavor, fresh, and just the right size.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-04-29', 'type': 'review'}
{'votes': {'funny': 5, 'useful': 10, 'cool': 5}, 'user_id': 'jdeNI5TTTuM6mj3HTgstRA', 'review_id': 'B-37TG4Lf-vv-gOouU9K5w', 'text': "Good Mexican food for people who like mediocre Mexican food. \n\nThis place smells so freaking good! Like, for once, I've stumbled in a place that was both hip AND authentic AND tastes great. It's small and humble, with prices on par with Chipotle, so I expect something great. \n\nI went with a green chili (pork) burrito with black beans. I can say that while the beans & rice are good, the main attraction falls flat. It's not spicy. It's barely flavorful! what a letdown. I found myself dousing it with the green habanero sauce featured at the table. \n\nOh yeah, don't expect any sort of complimentary salsa bar. Salsa (and chips) will cost you a bit extra, and if you're going to shell out the $3, you might as well just drop the same amount for a better burrito + chips + salsa combo at a place like La Santisima...or even Qdoba. This is me dropping stars because of superior, accessible places in the same area at the same price point. \n\nAt the end, I washed it all down with a freshly-made horchata...but halfway through, I was dealing with coarse granules of sugar! Gross! \n\nI'm in no hurry to come back.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 2, 'date': '2015-04-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ZILMwi3ArauA3atxBF67ng', 'review_id': '6SAaf8o7AJHKjqXR4Dq-DQ', 'text': "This is a great place to have a burrito... probably some of the best in town ,\nand it's nice to encourage local businesses too!!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-04-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '3sCr4XdVpizDwasSDN3zBA', 'review_id': 'k_owWF4ylG9lGFarCIoDJQ', 'text': 'Went on Cinco de Mayo to get food and it was sure yummy. My quesadilla was stuffed with chicken and they brought be salsa, sour cream, and quac.\n\nThe atmosphere and people were also great!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2015-05-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'QyY2_Iue_XCFY7xSOdsIcA', 'review_id': 'EU8ojjebCCzBDYsnZuxXWQ', 'text': 'Yum! So delicious... Debbie is too kind and it is obvious that the owners of this restaurant have put their hearts into all the recipes.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-05-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'UIMKt77f2T19-NDgbVJXyA', 'review_id': 'R0411euq2KZUxF5h7TGA2A', 'text': "This place is the best! I've been coming here for 3 months and have never been disappointed.  The food is great and the service can't be beat. It might take a few minuets to get your food, that's only because it's made fresh to order.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-05-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'C31KL6t23C04bnNdEvzp5A', 'review_id': '6BQZOkuJpYpsMzCYaI_a2w', 'text': 'Straightforward solid Mexican food in a clean place served by a very nice staff that cares about customers and their food at a good price. Great housemade salsa, guacamole and chips and a delicious burrito.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-05-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bl69-2c_Amf4SGqoAmANig', 'review_id': 'AV3AMj4yJXPVYJJ2xKBMfw', 'text': 'Alright forget los betos , forget chipotle, forget most of the burrito shops which are step above fast food. Phx burrito is the place to go for a great burrito the house special is on point, but my favorite the chicken burrito just makes the mouth water. So the burritos come with rice , your choice of beans , your choice of meat , along with the other usual stuff sour cream and so on but they do not skip on anything . This is the spot to go. Also a big thing I love about the place are the people that work there, funny folk which remember your name, now that might be that I have been there to much which in that case I may have an addiction but trust me give it a try.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-05-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'vLHyshouNGRdRy2kgwfV7w', 'review_id': 'q_oTd7e0h0SKN2Y4tTUOcA', 'text': "Simple ingredients, but done soooo deliciously well! The friendly staff is a major plus as well. Can't wait to go back!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-05-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'k70661DGl6azJ_2G5GqBfQ', 'review_id': 'BVaR90D7AaztiC4dslql2Q', 'text': 'Delicious, authentic tortillas and flavorful salsa. Always willing to accommodate my vegetarian burrito whims! Excellent service is icing on the cake.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-05-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '1Tv0-_hr3gZMmfImspn2OQ', 'review_id': 'ryTL6Puc5b8K4vxsI1T17A', 'text': 'I love this place. The shrimp burrito is so delicious and fresh, their horchata is my favorite in the city and the guy behind counter (owner?) is always so so friendly with a big smile. Definitely one of my favorite spots in phx', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-05-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': '66oDhsKSB_eSrhCKiERDow', 'review_id': 'ha61Xrfprb-1OUSUTdkbhQ', 'text': "They were pretty quiet for dinner.  The positive to this is that I got excellent attention/service and my food came out super fast.  The counter girl was exceptionally nice, offering me tiny samples of a few of the meat choices.  The green chile pork was HOT, while the beef in red chile and shredded beef were mild.\n\nOrdered the two beef enchilada special.  Their red sauce is really good, not overly tomato-y or oily, with a nice spice level (I could taste the garlic).\n\nThe salt level for a forkful of enchilada and rice was perfect.  The cheese was really great (I loved how salty it was).  It actually tasted better as I continued to eat it.\n\nThe rice was plain, fluffy, and well-cooked.\n\nI'll be back to check out their chorizo breakfast burrito.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-05-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'qQlNQvzwwgTfhBs1QqQ4Ww', 'review_id': 'GxI5EWxknHv9gtAY0D9YEg', 'text': 'Wow!!! The fish tacos were outrageously delicious! So much flavor, and the perfect amount of spice. The shrimp burrito was also delicious, and the horchata tasted homemade. We got a warm welcome when we arrived and found they had a great selection of beer. I wish we were locals because we would definitely become regulars!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-06-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'jQE4Rz0TMQBtiscqAlh2tg', 'review_id': 'wvGh3VWDUFpyprLXODaIag', 'text': "This place is delicious! Personally I think there burritos are way better than chipotle's and friendly staff, highly recommend If your in the Phoenix area.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2015-06-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'EW8EEZMLRCU1UGH6qYoD7Q', 'review_id': 'jUp03FmAiAdXRR9jc_XAgA', 'text': 'This place is clean authentic and delicious!  I ordered their shredded beef burrito and it came out delicious! And their homemade sauce is to die for! This will be a new hotspot!!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-06-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 3}, 'user_id': 'RE1US16mPJELxgrW7UTnXw', 'review_id': 'RoYi2ZcEIjhU_tmEvE-QXg', 'text': 'Hooray for PHX Burrito House! Yes, there are a ton of great options for Mexican food in the Valley, and if you find yourself in the Melrose area looking for some hometown Mexican fare, then PHX Burrito House is the place for you. \n\nOn my last visit I went with their carne asada burrito -  savory chunks of nicely-marinated and seasoned beef with all the fixings wrapped in warm tortilla. I also added some chips and salsa. Great flavors that hit the spot. After settling for just so-so Mexican food as of late, I was happy that I came.\n\nStaff (owner?) was beyond friendly. Wonderful service all in all.\n\nEasy parking, freshly-made flour tortillas and salsas and GREAT hometown service make PHX Burrito House the place for me!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2015-06-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '4Q2zYC2GLYUPnNahLqjZZQ', 'review_id': 'HPh8ho0UiXv1CksX029GtA', 'text': "I had the chicken burrito- very tasty with the perfect amount of sour cream and a good deal of meat.  Tortilla was a little undercooked but I was happy to know it was fresh!  Hubs had carne asada burrito and he liked it a lot.  Very flavorful meat but not tender enough for me.... Salsa had a good kick and the chips were good but not warm.  We'll definitely eat here again!  The service was really incredible.  The woman treated us like we were there every night for dinner.  She was incredibly attentive to everyone in there and was commenting on people's new hair styles and everything.  You could tell she knows the regulars and that was so refreshing... It's the kind of service you expect in melrose and being that the place hasn't been there forever it was great to see it!!   Big I could rate on service alone I would give 5 stars... But for a burrito place I'd say it was not incredible not worthy of revisiting.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 3, 'date': '2015-06-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'AUJrvBB2OzD-vtgbFUtTqQ', 'review_id': 'BpG0UoeYF_4kkcmJo1VWZw', 'text': 'We were craving a breakfast burrito and this was the right place!  Great food, great service, super friendly staff.  This was our first time here and we will definitely be back.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-06-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'y_Gk24o81E6OCyrrsdm2Kw', 'review_id': 'niHUy_-C56qhkgigsZ7hGg', 'text': 'We eat here all the time!!! We love their carne asada  burrito!! Also very nice people and excellent customer service! A must go!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-06-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ziRzfP-VYwxllU6Xeo763A', 'review_id': 'ix1FnlGK_bnh4Lalx8-pEQ', 'text': "Burrito House offers a very casual dining experience with a fairly simple menu, which is great. I ordered a Carne Asada burrito with everything. It was good, but could have been better if 'every thing' included more than just rice, beans, carne, sour cream and a little salsa. It was a little bit plain for my tastes and the salsa wasn't hot enough, but the tortillas they use are great. The food didn't really live up to the hype of a 4.5 star burrito joint though and the price was slightly higher than a great hole-in-the-wall type Mexican place.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 3, 'date': '2015-06-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Q_4youStRjmK5fdZNb3JSg', 'review_id': 'ZKvVOFE_cHD7TFacpWMWRA', 'text': 'Just stopped in for tacos, which were good.  Will stop again to try a burrito since it is the burrito house!! Very nice gal at the counter.  Quiet and parking right in front is nice.  \nHorchata is made in house according to the cashier, so expect rice bits in yours! A little on the sweet side for me though.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 3, 'date': '2015-06-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'nm_rKzjW6km-Wom1Bu1cKw', 'review_id': 'huciFPCF14rdk-0PlC6TOw', 'text': "Carnitas burrito is kinda bland. The fresh salsa was thin with not alot of flavor. The agua fresca was good but you get more ice than agua. It's an average place, specially since the city has so many options. \nGave 3 starts because of the good decor and beats the he'll out of filiberto's", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 3, 'date': '2015-06-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': 'J3ihZoXdMhzLzIV0yhdgGQ', 'review_id': '0Ckbyo_7ArfJbd2gY_r5Pw', 'text': "This is a wonderful place for a weeknight dinner treat!  Everything my partner and I have tried has been fresh and delicious. My personal favorites: red chili burrito, the enchiladas (when available), and their guacamole. Try them! You won't be disappointed.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-06-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4V5XUmR3kdcWExfriUJJiw', 'review_id': '0ZwQA-5qN3rkjhnTt8yfIA', 'text': "Unremarkable and expensive. $20 for 2 fish tacos that tasted like carp and a carne asada burrito that was mostly rice and beans.  Went here for a work lunch. No one liked the food. Maybe it was an off day, but we won't be back to find out. Add in service that lost one order and I don't know how this place stays in business.  Also, this place no longer offers free chips and salsa. That's an extra $4!\n\nNot sure how this restaurant got their high ranking???  Mexican places are a dime a dozen out here.  This one isn't worthy of its (current) rank.  Look elsewhere for much better fare.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 2, 'date': '2015-06-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'ujAA_Xyw3PajosaM7H5qsw', 'review_id': 'TK-0pfhHorvwZK0YhDe2fQ', 'text': "I ordered the carne asada burrito and chicken quesadilla. It's really good! The burrito is really chunky! YUM! I'll definitely go back!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-06-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1nPufzy8IvDMzpX6T54WAw', 'review_id': 'xyOlzbocRY0RN4-VQ-pd1g', 'text': "I'm all about their red chile burrito.  Green chile and carne asada were pretty damn good too but there's something about the red chile mixed with the gooey cheese, rice, beans, meat, sour cream that hits the spot.  It essentially feels like mexican (or whatever...mexican-american..) comfort food.\n\nPrices are good (comparable to chipotle/qdoba's of the world) but the flavors are not the same at all (burrito house is better...).  They do a good job mixing the burritos here too. No one bite of only plain white rice, one bite just beans, etc. Only complaint is it needs to be even spicier!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-06-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'HdQegnLvIqg3T77yhMO_ww', 'review_id': 'IJDvlc_b9um867a2IfUVhQ', 'text': 'Excellent burrito place! All of the food tasted home made and fresh. I ordered the green chile burrito and a side of chips and salsa. Everything was delicious! The outside looked a little sketchy at night, but inside everyone was friendly and welcoming. I would definitely eat there again!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-06-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'oWt5n9B7dY65EtoNqnWoYA', 'review_id': 'z9Z_oxVGOgHYja4jDqSoqg', 'text': 'So good!  Not greasy and I could not finish the green chili burrito, carnitas were crispy yumzilla!  Salsa had great flavor and chips were fresh and crispy.  Will definitely go back.  Oh and horchata was refreshing', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-07-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'oudPM2brB_6RkqXGDE5sBQ', 'review_id': 'Gj57Ov1l-yxxg_dMVYFK4w', 'text': 'great place to go for a burrito!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-07-07', 'type': 'review'}
{'votes': {'funny': 12, 'useful': 16, 'cool': 9}, 'user_id': 'Wh5pL_iTBOj3R4W7cJWEkw', 'review_id': 'pXRe4r13oTpHkVohH20l5g', 'text': "I had high hopes for this place after seeing the reviews but it disappointed and I won't be going back. \n\nThe chips were thick and stale. The salsa lacked flavor. The Guac was literally just mashed avocado  with a few pieces of cilantro. My carne asada burrito was a rice burrito. It was so overfilled with rice that I couldn't taste anything else. My coworkers fish tacos tasted of pure fried oil. So gross. \n\nThe food took FOREVER to come out. We were all done eating and one of my coworkers hadn't even received his food yet. \n\nThis place was bad all around and the food say heavy.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 2, 'date': '2015-07-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'Dpi50FrVtvy8Sh7TVbwetg', 'review_id': 'd1vZd_fD5cBtOzR-pn7dPw', 'text': "Had three carni tacos. They were very good. For the price it doesn't get much better. They did a good job on the menu design as well.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2015-07-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'YXQT7Bd8w4ZRjxgkIFsgjg', 'review_id': 'YVH6sNqA2L57pinrrz8TOA', 'text': "I had the sausage breakfast burrito, with all the fixings. This is hands down the best breakfast burrito I have EVER had, and don't start me on the tortilla, that was equally just as amazing! And to top it off the homemade hot sauce was divine. I have never had a breakfast burrito that has tasted so fresh, and didn't leave me feeling like I just ate a bunch of grease!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-07-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'hXsivHFknMfuxoEdCTOrIw', 'review_id': '3MDXgirHCkye5rB7b3L_zQ', 'text': "My husband and I ate here today for the first time and we loved it! We enjoyed a shrimp burrito and fish tacos both were delicious! The homemade salsa was some of the best we've ever had and the tortillas were thin and flavorful. The pricing was also great, we will absolutely visit again.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-07-19', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': 'UtNu9aGabHDAZL_LnJqm3A', 'review_id': 'ktC_u7W_qTTW86QphCCeNA', 'text': 'Amazing burrito, chips and salsa.\nService was super !!  \nMy Margarita was on point.  Will definitely be be back soon!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-07-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'gI4K9HiRGqsWRnpQ5x5F-A', 'review_id': 'vb2ORQREoBM-mJo7RUsu7w', 'text': 'PHX Burrito has what many others fail to achieve. Fresh ingredients and FLAVOR! Its an attractive spot and my burrito and horchata were delicious. Their homemade salsa nailed what a good salsa should do in complimenting a burrito. You should try it!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-07-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'iINYvzlmNWOViq5Ls5SS9A', 'review_id': 'jg_OJbvWLYQaq_GUwe2H6Q', 'text': '**IMPROVEMENT NEEDED**\nBy curiosity as to what replaced The Fry Bread House, I stumbled across this place. I was very optimistic and excited to try. The restaurant is very hip and inviting and the owners are extremely nice people! I ordered the green chili pork burrito (in which I read came with rice, beans, cheese, and sour cream inside) so I\'m thinking it\'s going to be "sort of" like Chipotles. We waited 20-25mins and nothing came out, while others got their food. I finally asked the owner if they forgot my order and he brought it out in less than 3 mins and apologized for forgetting. Yet no biggy for me since I\'m a very understanding and patient person. However, the burrito was a decent size but the ratio of ingredients were WAY off, it should have been called a rice and bean burrito with green sauce because I couldn\'t find more than two small pieces of pork. So in other words, the green chili pork (which is the star of the show) was replaced by rice and beans. Now don\'t get me wrong, the food was tasty and fresh, and they did give complimentary chips and salsa which were delicious but they have a few things to improve on before I give this place a second chance.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 2, 'date': '2015-08-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'Fb-sJWrxI_VuCBjATC99MQ', 'review_id': '_ZA3mjl9RLHYpu0ATvpXCA', 'text': "The green chili burrito is soooo good. It's a nice little joint to get your burrito fix.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-08-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VHyDt3GLoXSSgrNtRwh3hg', 'review_id': '3GDaB51YT6OVSm3uHW46WA', 'text': "Great food - i usually go for their carne asada burrito. Its usually on point (love their tortillas) but wish they would mix ingredients a bit more as I end up with bites of only guac or only meat. Staff is super friendly but any hint of it getting busy and the food will take forever to come out. Despite their few flaws it's a great spot.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2015-08-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'Z05fLO8I6bE9K6R7mODZdA', 'review_id': 'Z_Qqvmenpb9O9F9wDDEd3w', 'text': "Best burritos in this part of town! I loved the green chile pork and the breakfast burritos are to die for -. they're very friendly and give great service.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-08-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_X66u3pzc5urUPBjpO6Cdg', 'review_id': 'uKEmwQxCEOtE070fRJjn0g', 'text': "Great food, great people. Best green chile burrito I've had in the valley! Stop in now!!!!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-08-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '0_0axwhDmQTaE2C_d9ciQQ', 'review_id': 'CagILeD6HH_l2VX1ixz4xQ', 'text': "Today was my first time here and I wasn't impressed. First, waiting to get our order took longer than expected. Then the food came and it wasn't what I was expecting. I ordered the Shrimp burrito and it was all tortilla/cabbage. Sad, I wanted to like this place.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 2, 'date': '2015-08-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'jH4DSPVxzFioYaZQ4syKZw', 'review_id': 'pJXdVm7TecSCaTrJWoSEFg', 'text': 'Ordered the Veggie burrito for something new and was not disappointed! The flavour was excellent and the salsa/hot sauce that was provided was also nice. Have had the green chili pork and red chiliv beef before and those were excellent as well. Staff is very friendly and accommodating. Portion size is very generous and the homemade chips are great! Highly recommended!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-09-06', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '3aMN-mb762DpZCt-xTc_4g', 'review_id': '-oN2AUXcfjkQyQOjIiRVnw', 'text': 'Amazing burritos! We have been at least 4 times and really enjoyed their food- the burritos are amazing and the quality of meats is excellent! Highly recommended!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2015-09-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': 'lVCJRUd2aZXNQ5AlWf4-lQ', 'review_id': 'sxqGEuefSRxdsH3Z4bv9Aw', 'text': "As soon as I walked in I was Greeted nicely. The decor and music was Latin and cute made me feel welcomed and at home. They have delicious Mexican wedding cookies in the front like my Tia makes. The horchata was very good! I got the grilled chicken burrito . It comes with rice I had black beans but you do have a choice of the beans you can choose. Sour cream and I added guacamole. The tortillas are hand made thats the best part. Sad to say when I bit into my burrito when I got home it was the most salty burrito ever! Everything else in it was delicious but the chicken was 2 salty that I could not finish it. The salsa was good and chips were okay. Although the owner did tell me if I did not like it he would buy it for me and give me my money back. But I did take it to go otherwise I feel like he would of had my food redone this is the only reason why I am giving this place 2 stars. I am not sure if I will return right now. If the chicken wasn't salty I would of rated this place to 4.5 stars", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 2, 'date': '2015-09-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'tsq5QB-dk0KJjwA6l-FsXA', 'review_id': 'pvna0ROQScDBeySyC2H92Q', 'text': 'Stopped by for lunch on a Friday. They certainly weren\'t packed but there were a lot of tables (3 out of 5 seated, 4 open) waiting for their food. I ordered a shrimp burrito to go ($8.50). It had shrimp, cabbage, pico, lemon juice, hot sauce, and avocado. I couldn\'t find the avocado and hardly any pico (see pic). Shrimps were good and I\'m glad they threw in some additional hot sauces (and chips due to the wait) to help out the flavor on the burrito. \n\nI\'d say their issue is turning food. If they were full, you\'d be waiting 20 minutes for a three minute "Chipotle" type burrito. Lady behind the counter was very nice. Worth the try if you\'re in the neighborhood.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 3, 'date': '2015-09-11', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'leiMAYiNCXtvTPE0W6m69g', 'review_id': 'T0P9kk0IFJpee-PkxQ2BOQ', 'text': "This was the first restaurant I visited in Phoenix (on a recommendation of friends), and I was not disappointed! I had one of the best burritos I have ever had, and have been back multiple times! The pork and green chili burrito is amazing, the horchata is delicious, and the margaritas are on-point (especially during happy hour)! The food is delicious and affordable, and homemade! You can't go wrong!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-09-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'H4Sw61lYDDMGc0kGMcsPCw', 'review_id': 'RhCZhVtEkXNl3L3qODLHhw', 'text': 'I rode my bike to PHX taco house on a sunny Saturday morning. It\'s located north of Indian school off 7th ave. I entered the establishment and noticed a pretty young Mexican girl working the counter.  I asked for a chorizo breakfast burrito, and she replied "would you like cheese?"  I declined. She got me a cup of water and I paid $5.96. I put the 4 pennies in the tip jar. I sat at a table and waited for my burrito. I got my burrito, which came with a fresh salsa. The man who brought me the food grabbed me a spoon and napkin too. Now to the burrito. The tortilla was nice and soft, the whole burrito was very warm. I took a bite; wow, I thought. It was delicious. I ate the whole thing in a matter of minutes. The salsa was just the right amount of spice and accompanied the burrito perfectly. Once I was done, I put my empty water cup, basket, and salsa bowl on the counter and headed toward the door. "Thank you! Have a great day!" Said the man and girl in unison. I got back on my bike and took off down the street toward home.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-09-19', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'yTEjihoKjVRBVAbXeyK4Qg', 'review_id': 'rwIS_y3s1ABmOhm9hn3ekA', 'text': "$5 for chips and awful salsa - No\nThe carne asada was bland\nHot sauce on the table was buffalo wing sauce, like... seriously\nDon't plan on coming back.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 2, 'date': '2015-09-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'GhBlW6v3i6RjO2eflhmqAw', 'review_id': 'oHd1syfV00g6-eKl2T93pA', 'text': 'Phoenix Burrito house has the best burrito I have had in Arizona. On top of the food, their customer service is great with engaging in conversation as well as making sure customers are satisfied!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-09-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'YS0ky7pnp07khJj7CFRJIw', 'review_id': 'oZ_eLKki5FnOT4OkKWqE0Q', 'text': 'I live a few minutes away and am horrified I only just found out about this place!!! The food is outstanding, my usual has been a Carne Asada Burrito with all the usual inside (pinto beans, rice, sour cream, cheese) the meat is flavorful!! Yesterday I tried the Pork in Green Chile Burrito...hold me down it was fantastic!!! The prices are super reasonable, the place is incredibly clean and I am greeted like family, really....the coolest people I have come across!!! I love this place and make it there for take-out more than once a week.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-09-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '3SMK97v7Evoksbjo4b3TBQ', 'review_id': 'Pp70ZV_AFc9aBMx9E-JTLQ', 'text': 'Fast friendly service. Really good carnitas burrito, they do put rice in the burritos but you can get it without. I usually as for easy rice but I like it. The house breakfast burrito is a must have for the mornings.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-09-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jUP4i0sdKV9BTnU4S9b0Vw', 'review_id': 'Y9S83Y4xaxYC6zf10GqRjg', 'text': 'My issue with this place is that when you are supposed to open at 10 am please be on time.  I have been there multiple times at 10am and the place is closed.  Signs are posted open at 10am!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 3, 'date': '2015-09-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '5seXO9Jbtu6ypkLP04F0Ow', 'review_id': '16on1OzCcEOD6XNCTsIYhg', 'text': "I come here at least once a week! These burritos are amazing. The flour tortillas are made daily by a local tortilla maker and they're the best way to wrap up all the ingredients inside (though I would probably order a stack of tortillas to go if I could). I get the red chile beef burrito every time with refried beans, rice, cheese, sour cream and guac. The chunks of beef are tender and the sauce makes the burrito gooey and amazing. This is comfort food...Best burritos in Phoenix. A must try!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-09-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'QKYoJjXeR8hIgmV3tPL-bQ', 'review_id': 'UXbWAk1E2cr7Ki33_ilhwg', 'text': "I would've given a five but the service was ehh and they didn't have horchata TBH :/ but the food was dank", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2015-09-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'sv1yyjza7t9E3GO7rURJEw', 'review_id': '1ERya1NypXqn7rpb-906kw', 'text': 'One of the best burritos I have ever had.  One thing that really stood out to me was that the rice was properly cooked and seasoned, which you do not find to often.  There are always some hard pieces due to being stale or being under cooked.  I got the grilled chicken burrito with black beans.  Everything came together very nicely and it has a unique flavor.  The only complaint I could see people having is that their salsa is really nothing special.  So if you ordered chips and salsa that might be a problem.  I did not find this to be a problem however since the burrito was flavorful enough that I did not need to drench it in salsa like I do at some other places.  Cool unique little dining area too and the employes were all very friendly.  I love places like this with simple menus, that do not do a whole lot, but what they do, they do very well.  I will be back often.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-09-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'w7yGkXLhEJdF1VxTsV49RQ', 'review_id': 'IsD2Flzv9bpwIedZaB3LrA', 'text': "Definitely one of the best burritos that I have had in a long time.  We had the carne asada burrito and a cheese quesadilla and it was perfection!  I can't wait to come back and try more items on the menu.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-09-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oUGmoziFCwNi2oUHB54SGg', 'review_id': 'Q8-2bHKYIkwpcbQDrMxizQ', 'text': "Love this place. Best burritos in this part of town in my opinion. Everything tastes fresh and the owner Dan is very friendly. The food is not greasy and the meats are of good quality so it isn't a cheap gut buster like all the 'ericos in town - but still well priced and very good.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-10-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'hKOa6B79sE3WZ8hQZ1I19Q', 'review_id': 'VbeaqOrn6gNyAzSJt1erpw', 'text': 'So disappointing... Got the chicken burrito, they forgot to include the cheese and sour cream. Burrito was smaller than Chipotle for $7 and leaked from a tear in the bottom. Meat lacked flavor and pinto beans were soggy. And I waited 20 minutes to get my food. So disappointing', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 1, 'date': '2015-10-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3tcuZ2OhlP0Xgnrc9oTnSA', 'review_id': 'RFCPC_PXxJ1X4D7UcaNaIQ', 'text': 'The Service and  the Food. I love this place. My mom never finishes anything and she ate up lol. Must try!', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-10-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ujxEf0qldCj1hnlXvqfOmw', 'review_id': '8OeCMZ-FhyztBDwu29XDWw', 'text': "I have visited this place twice and both times the food was awesome.  I was amazed at how good the flour tortilla was on my burrito.  The owner brought our food out and talked to us for a few minutes. The staff is friendly, food is good and I am supporting a local small business which is all +'s in my book.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-10-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qFExIyGyqZvkelauTi77Ag', 'review_id': 'fvvph66ImVDLyFGAcbY-xw', 'text': "Yum. I had the pork and green chile burrito. It was the best burrito I can remember having.  The pork was tender and lean, and the whole thing had so much flavor. The tortilla was fresh and homemade and delicious. It was so good I didn't bother adding any salsa, and I usually add a ton of salsa to a burrito. I can't wait to go back!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-10-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'o4-nmPntgc7Y1MmEtQ5MDA', 'review_id': 'OCfbAgeXPbeI-hKDv29ZrQ', 'text': 'Picked up dinner a few nights ago and still talking about the awesome burritos we had. This place is never disappoints.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-10-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'Qv44Dco-pb5JYc4Fwn1uJQ', 'review_id': 'iCLbBvXztAXda-raq2KARg', 'text': "Just saying the EPIC burrito is where it's at. Ham, bacon, egg, cheese, potatoes, and refried beans. Try it and I promise your mind will be blown!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-10-16', 'type': 'review'}
{'votes': {'funny': 8, 'useful': 8, 'cool': 5}, 'user_id': 'AYGHNy8gPxl2Q-etTT3hZw', 'review_id': 'tF1JhcpPXnWPNVhYsG5hxg', 'text': "Inexcusable slow takeout service, time and time again. \n\nIt is insane that it could take 40 minutes to get a burrito and quesadilla. Keep in mind all three times I was there it was 7:30pm or later, and was slow. There is a serious kitchen issue at this place. 2/3 times the food was very good so I tried to overlook how gotdamned slow the place is, but tonight was slow and poor quality- and like my boys Hall & Oates- I can't go for that. \n\nIf the owners don't invest a little time and attention to this place- soon it will be known as the place that used to be phx burrito house. Pull it together and do it quickly. I want them to succeed but life is too short for a 40 minute burrito.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 1, 'date': '2015-10-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 5, 'cool': 1}, 'user_id': 'IPu2iHwmJLBLmuGafnPo2A', 'review_id': 'Ly6w9BCn3J9oPN9g-L-thg', 'text': "I'm writing this review from the standpoint of someone who thinks Chipoltle is overrated when it comes to big,tasty burritos, because PHX Burrito House takes the cake.\n\nI seriously don't know why any Phoenician would ever ever ever set foot in a Chipoltle when they could go here. One, it's local. Two, it has the same options as Chipoltle (rice/beans/meat/etc) and is ten MILLION times more delicious. The carne asada falls apart in your mouth and is seasoned very well. The carnitas are amazing, and one burrito was seriously the size of my face. When I dined in, I got complimentary chips and salsa and they were delicious.\n\nService is probably the only difference when comparing to Chipoltle. PHX Burrito House cooks up your food and brings it out to you, thus meaning it takes a little bit longer, but it's fresher. The wait can easily be avoided by calling ahead and placing a to-go order if you're in a lunch rush. \n\nSo next time you're craving a giant, meaty (or beany or veggie) burrito, skip the national chain and go to PHX Burrito House. You will not be disappointed.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-10-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'bj5TdLRYNf0HWONVu2AHOA', 'review_id': '_l090vqfE4rTrpsuAaWQGw', 'text': "We decided to check this place out while in town. The wait time for our order took longer than expected for 2 burritos and a Chorizo plate. I guess that only makes you even hungrier! Once the food arrived, I wasn't disappointed but I wasn't impressed either.  This place is alright. Will give them a try again when I return to Phoenix.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 3, 'date': '2015-11-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'FALdReC9yf4uZighZaCVgQ', 'review_id': 'xu5ED_tiGSYwK8bsT6dJvA', 'text': "Entirely different experience than June's meal with my family at this restaurant.  We were the only people seated in the restaurant and it was clear the take out customers who arrived after our order was placed took priority.  I regretted adding gratuity on prior to receiving our order.  \nAfter what seemed like a long wait for a two burritos, I bit into my shrimp burrito only to taste the cabbage and hot sauce.  The shrimp were fairly well distributed further down but the guacamole was isolated to one bite somewhere around the middle. The tortilla itself was one of the best I've had but who was constructing the burritos last night??\nMy horchata was just meh.  Mostly ice and the guy had to be reminded to bring it all.\nI like the location close to our home and the fact that it is a small family restaurant.  It is clean with nice decor and a good menu but with so many other options in the area, after last night, I doubt I'll be back.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 2, 'date': '2015-11-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VN4-wRLcsB0de5CEPBklfg', 'review_id': 'Fgm2URjpnM2yZANvtmgANw', 'text': u"Happened on to this place because one of our favorite breakfast burrito places closed.  Omgoodness,  fabulous smothered green chile breakfast burrito!  The people are awesome.  Definitely,  a new favorite! ! The ingredients are very fresh,  the place is clean.  I loved that they used fresh jalape\xf1os . Just can't say enough about this little diamond in the rough. Love it.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-11-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '1ECmVfLRHq-Dzym4LKLzhw', 'review_id': 'v3d-tGr492gnb0koFxQJEA', 'text': 'Best burritos ever! Really fresh, authentic ingredients and great tasting food. Their breakfast burritos are top notch, as well as their green chili. Super friendly staff and really clean as well.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-11-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '-8gRkiYaVm3zfoQ4pcg75w', 'review_id': '806Q95NesaNJdHe37FTXYg', 'text': 'First visit and I really like this place. They made my meal to order. I just said I want a plate with rice beans and meat and they had no problem with that even though they are a burrito taco joint. The red salsa is very good. My meal was fresh and delicious. The service was good. If you are in the area you should stop at the Burrito House. Come eat here.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2015-11-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Y0akN63Ihkwx8vMuwchAdQ', 'review_id': 'daROdT_DMZb-zGdwJn4WKA', 'text': "I can't actually comment on the food. I would rate the service as lousy. I waited 20+ minutes for a burrito i had already paid for. I got tired of waiting so I left. There were only two people in front of me and they each ordered a burrito to go. They left in 5-8 minutes so I thought mine should be read pretty soon. I waited another 10-12 minutes. Food never materialized so I split. Maybe I'm  just used to Chipotle", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 1, 'date': '2015-11-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nyCSuoLW3QXTG-whGDnNNg', 'review_id': 'oN8uxY3FNWgeGk7h3m6Ruw', 'text': "Great burritos! I love the pork in green chili burrito! Staff is friendly. Takes a little time to get the food. But it's worth it!!! Great atmosphere and drink selection.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-11-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'O6ZIPEB4xOAuLr33iJRr3Q', 'review_id': 'lPOrZ82ecaUr1fTT1kATvw', 'text': 'Breakfast burritos all day! Would like to have double corn tortillas for the tacos though. They just fall apart with one tortilla, but still great food cooked to order.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 4, 'date': '2015-12-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'lPrPvEaQYEzS30Fzgra37A', 'review_id': '7-Zj-_VzaLveMHy8fYPufw', 'text': "Awesome place! Great chips & salsa, awesome carne asada & carnitas, can't wait to go back! A true diamond in the rough, clean, nice interior with very friendly staff. They even have Coke-A-Cola in a bottle!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-12-10', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'fjJ9tgJNhDR_l3_4t5fz2Q', 'review_id': 'lWyBhKwsQTTZu0HKykZTvQ', 'text': "Want an awesome breakfast burrito? Come here. \n\nEveryone was really nice and the service was quick. The girl at the front assumed we were new and then offered us chips and salsa for free!\n\nEverything tasted super fresh, baked right in the back. From the chips and salsa to our massive burritos, it certainly didn't disappoint. This place is worth coming to if you're desiring a burrito or simply some great food. \nThanks for being local & fresh!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-12-19', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'a6GByL7bnLxOzSB8fxMGPA', 'review_id': 'CKbpvBAuYy4oZ0-VlQIlSA', 'text': "My dad and I stopped in for breakfast this morning. We ordered two chorizo burritos and I must say this has to be some of the best I've eaten in a while. From the customer service to the food I would defiantly be back again. The women at the cash register was kind enough to bring us samples of the green and red chili. I would defiantly be back for both!", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-12-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cdj97DnZoVqBXpvslt-vmQ', 'review_id': 'xBCaatM3Qn0LE9B3CzlQaA', 'text': u"The prices are reasonable and the food is delicious. I had the Carne asda burro with  guacamole and it was absolute deliciousness. My fianc\xe9 had the fish tacos and he enjoyed them as well. We'll definitely be back another time. I'd love to try the shrimp burro.", 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-12-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'X3F5mkTSICC1hUBkZmXMZw', 'review_id': 'kKS__eCIa9F5oYaRHkUwYw', 'text': 'Love this place for lunch!  Well worth the wait for a fresh meal.', 'business_id': 'C90nLkXxPxv_1y7cL4a_7Q', 'stars': 5, 'date': '2015-12-24', 'type': 'review'}
