{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mhFx_-3VCd_4yPz3yy1z1w', 'review_id': 'ftzryUIV_Fq1BgrcYoZv3g', 'text': "Finally, a great breakfast place where they don't serve coffee flavored water - but actually have reputable, delicious coffee.  Great patio & bar.  Hash browns are hands down the best in town, eggs benedict was perfect, can't wait to go back!!!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-08-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'GWNiKokTjh_WjQqjidkLMg', 'review_id': 'OoQ8id4Yu5FAv4dDhA3LRg', 'text': "Went on opening day and thoroughly enjoyed the experience. Our waiter had a few kinks with the ordering system and they didn't have all of their menu items available but I'm not going to nitpick.\n\nThe place was decorated very nicely with a clean modern look. The patio area also looked good but I don't think it was in use yet. It was very spacious inside and the tables were not cluttered like in many other restaurants to seat as many as possible. \n\nThe menu has lots of great sounding options and they have a good variety of freshly squeezed juices. The food was incredible! I ordered 2 eggs with sausage links and my girlfriend went with the breakfast quesadilla. We were definitely not let down with the food. They have nicely seasoned hashbrowns which were outstanding! The pancakes were also amazing! Portions are huge and prices are reasonable. I will certainly be coming back.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-08-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'El2b3KmAkFpa6Opyq3qTKQ', 'review_id': 'rR3kgbyBVznKB32OqxaNhQ', 'text': "Brand new breakfast place with eggcellent selections and great food. They are from Chicago and brought all their skills to Scottsdale. Do yourself a favor and give it a try. You won't regret it!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-08-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'mhFx_-3VCd_4yPz3yy1z1w', 'review_id': 'w678b-TeD9ieu5lJiSUUKA', 'text': "Have been 2 times since they opened, the place is delicious.  Eggs benedict was perfect, hash browns are still hands down the best in town, fresh squeezed orange juice was like liquid gold, coffee is Lavazza - good stuff, not the watery junk most places have.  I had to ask the guy next to me what he was eating... chorizo maple french toast, CAN'T WAIT to go back & try that, looked so so good.  They also have chocolate covered bacon.  SO excited about this place", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-08-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LVCIPVaf8-EpDzPW20k-5g', 'review_id': 'Xuw6YXiRdc_BkassucJEUg', 'text': 'Just had lunch. Our first time here. Come hungry because the portions are very generous! Lunch for me was the camelback panini which came with excellent fries and an unexpected treat of a bowl of their freshly made soup! My wife had blueberry filled pancakes (4 large) which she said were very good. She brought two home. Other then a few start up training things which we really did not notice I would say this place is a home run for the owners. Great service, great food, great staff and reasonably priced! We will be back soon.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-08-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yKC1DJp0SuXt2VJ4pbjHEQ', 'review_id': 'UUmSuKD0d2Qtq3FkB9NeWQ', 'text': 'My new favorite breakfast/brunch spot in Scottsdale. Staff and owner were extremely polite. I had 4 different staff check up on me during my meal.  Food was amazing. I had the croissant croquet madame which was one of the best I have ever had.  I also had the banana nutella crepe and chocolate covered bacon.  OJ was fresh and I will probably be going back tomorrow for more. The menu had a lot of healthy and non healthy options. I was torn between about 20 different items.  I look forward to my next visit and will take all visitors there.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-08-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TQKPQR8csbXmC-_-2XB0PA', 'review_id': 'SP5woBd_IBV-tbBmrtvwPA', 'text': 'This is a great new breakfast spot!  The atmosphere is super cool and the patio is amazing!  Yummy food and huge portions!!!  You need to visit this place!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-08-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'mZA3KS7nFfuY77iigfwRhw', 'review_id': 'cTMNUKXcKTayCC84EEBt_Q', 'text': 'Brand new breakfast and lunch place.  Excellent food, huge portions and if I could give them more than 5 stars for service, I would.  Management kept checking to see if everyh\nthing was OK and kept our drinks full.  A great addition to the Scottsdale restaurant scene.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-08-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'djG2TNKoKvDEY8tMoyy8rQ', 'review_id': 'YOsfOUznq4yMtYn0dP3oTQ', 'text': 'Came here this morning for breakfast/lunch. They just opened this week so we will call this review "constructive criticism." First off the decor is really nice and clean but yet the staff does match the decor. They all looked VERY sloppy, maybe being new they haven\'t implemented attire yet? Or a shower for that matter? Sorry they all looked greasy and gross. Service was over the top, almost to much. Couldn\'t take a full bite without someone interrupting making sure we were okay. Once or twice is good but not every second. Also I like restaurants where you can see the kitchen so I can see the food being prepared, except in this case we were directly facing the kitchen and one guy kept using his hand to wipe his forehead and then was handling the food! Ugh gross!! One out of the 3 chefs touching food was wearing gloves, that reallllllllly bothers me! Gloves should be worn at all times no excuse! Now  to the food, soup was awesome, fries are awesome, but both sandwiches we ordered weren\'t great. One was the Reuben and we asked what sauce came with it and were told none, then half way through the sandwich we were brought what was suppose to be thousand island and it tasted more like vinegar horseradish. Also the corned beef was not good. Can\'t remember the name of the other sandwich but couldn\'t get through that one either. All in all if they clean up in the kitchen (wearing gloves, and not using hands to wipe sweat) I would try this place again seeing the other reviews are good. Gave 3 stars because their new, otherwise would have been 1 or 2.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2014-08-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'RqO7iGPCJ0XLAnoFmJ44zA', 'review_id': 'a9xd8ddZH0Ijn1U4A4EExg', 'text': "All I can say is wow! Great place. Service is incredible. Food is incredible. They're super accommodating. If I could give six stars I would.\n\nThe omelette I had was amazing. They somehow get them fluffy and not too heavy. Highly recommend. I chose roasted garlic, toasted almonds, and grilled asparagus. The balsamic reduction on top was delicious.\n\nHash browns are homemade and top notch.\n\nMy wife got the Melt Away and it was equally delicious. The veggies were really good.\n\nOrange juice is fresh squeezed and tastes like heaven.\n\nI cannot recommend enough.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-08-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rnRAnEB2zZhkNzoX4MaG_w', 'review_id': 'Unc7ZVPwxRvyPzKZ87QSdg', 'text': "Just found a great new breakfast spot in Scottsdale that just opened recently-Eggstacy.  Great menu, excellent food - I had the breakfast burrito with fruit; the best I've ever had.  Amazing service from Britni and Chris.  This place is a homerun.  Goodbye Butterfield's", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-08-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Kb3chRaMAhHiyDJYuzhBCA', 'review_id': '60bX76OlaTUVUZF7M44tMQ', 'text': "I walked in and was immediately seated at their bar.....had I wanted a table it would have been 1 hour....most likely due to church peeps and everyone wants to try a new place out. Service us very friendly and prompt. I had a large OJ which was fresh squeezed....and the water is delicious. ..you can taste the cucumbers. Only thing missing was  mimosa's....still getting their liquor license approved.  I had the crepe's which inside was eggs, spinach and some cheese.  The dish is to have mushrooms but I substituted tomatoes which was delicious.  I ordered a side of bacon and only was able to eat one crepe out of three because it was so big. I definatily will come back after a few weeks of them settling.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2014-08-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kGPzMKbcpqk4TuYYa29uUw', 'review_id': 'UoNLzaUx6fm7i54dnwNFtQ', 'text': 'This was our first visit to Eggstacy in Scottsdale. We had driven by on Shea a few times, and were curious. Normally, we go to Good Egg on Scottsdale Road and Greenway, or to The Breakfast Club. But Good Egg, having been taken over by First Watch corporation, has been going downhill fast (lots of cheap food substitutions) and Breakfast Club is not "all that" anymore and has lousy service. So, it\'s Labor Day and there we were at Eggstacy! \n\nWhen you walk in, the place is like a big loft. Very airy, high ceilings, and because they don\'t have ceiling tiles and/or anything on the walls, very echoey and noisy. However, they have nice window seats and lots of spots for group seating. We were a party of two. As a note, the place had only been open one week, so keep that in mind.\n\nThe greeters at the door were very friendly, but not overly so. Our waiter was Luke, very nice, professional, and helpful. We both had the corned beef hash and eggs, which comes with hash browns, and toast or pancakes. I got the toast and my friend got the pancakes. His eggs were scrambled and he said they were outstanding...moist, yet cooked well. I always get my eggs poached, and they were perfect and not salted. It\'s a good sign when the cooks don\'t pre-salt everything. Heavy pre-salting is usually a sign that the food is not all that great and they are covering it up with salt. Eggstacy does not over salt. \n\nThe corned beef hash is the traditional ground-up kind so the bits are small. Very good and made fresh. I generally like mine shredded instead of ground, so I asked the owner, Peter Varros, if this was possible and he said yes, because it\'s all fresh so you can get it either way. Nice. You don\'t see that kind of versatility in most places. Peter was quite warm and helpful. Nice to see the owner roaming about.\n\nThe hash browns should have their own paragraph....I could have just had a mountain of those. They are not your normal, greasy, pale variety. These were almost toasted, light brown, no grease at all, not over spiced or salted, and amazing. Honestly, the best I\'ve ever had. \n\nTo drink, I had the green tea (hot) and my friend had the coffee, which we had read was great. He said it was VERY good, not like the burned coffee at the other places we\'d been. He actually had three cups, which is odd for him. \n\nAll in all, a very good first experience. Here are our suggestions for the future:\n\n1. Tea selection: There was only Early Grey and Chai for black tea choices. Neither of these is really "black" so they might get a straight, black tea like oolong. Earl Grey has bergamot in it (not an easy taste to love) and Chai is cinnamon. I chose the green as it was straight green. \n\n2. Do something to dampen the noise level. It\'s a GREAT open space, but very loud with nothing to absorb the sound waves. \n\n3. Ditch the heavy perfumes on the employees. Example: Michelle\'s warm, kind demeanor and personal professionalism was being undermined by her strong "Angel" perfume. Every time she walked by, all we could taste was her scent. This is a common issue at restaurants. When you work in food service, you need to leave the perfumes/colognes at home. Scrambled eggs and patchouli don\'t mix! Save it for after work, please. The same situation applied to the hostess who seated us. We want to smell the food, not the perfume counter at Bloomingdales. :) We say this with all due respect. \n\n4. The portions of food, while generous, were a bit too large. One server mentioned the wasted food issue. While we ate everything (it was too good to waste!), the portions could be cut down by a third and be fine. Like three eggs with the corned beef? Maybe make it two. \n\nBottom line: We are SO glad to find this place! The Valley is in desperate need of a great breakfast place (they do lunch too). Your timing is perfect, as Good Egg is going down fast and Breakfast Club is so-so and too in love with themselves. Keep up the good work, Eggstacy, and keep improving....you\'ll soon be eggactly perfect. :)', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2014-09-01', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 3, 'cool': 1}, 'user_id': 'XPTJfl_t4n18_PUM2GSytA', 'review_id': 'v89KjqeEVW188fGPhZuLDg', 'text': "I know when a new place opens up it's easy to get all caught up in the hype and newness of it.  Looking at all these other 5 star reviews leaves me to believe that it's the hype more than anything that is blowing people away.  \n\nI went here yesterday morning and found out that yesterday was their actual grand opening and that the week prior was their soft opening.  That left me wondering if all of these 5 star ratings were just to get the word out about this place. Our server Dan was a really nice guy. He kind of looks like a bootleg version of Ryan Gosling in The Notebook when he had the beard. Yeah, I've seen The Notebook. What guy with a girlfriend hasn't? Anyways bootleg Gosling really took the time to get to know us.  The cucumber infused water was pretty good. And they do have some of the best orange juice I have probably ever tasted.  The chocolate covered bacon i had was pretty good. But maybe had too much chocolate on it. I was hoping for a salty sweet taste with the chocolate covered bacon and I mostly tasted chocolate and not much bacon til the last bite. \n\nI will agree with some of the other reviews that their attire was all over the place. But that's not really a big deal. It seems like places that only cater to breakfast and brunch the staff wears pretty much whatever they like. \n\nThe main issue I had with the place was what I ordered. I drove all the way out there for Red Velvet French Toast. And what I got was Red Velvet cake with some kind of brulee it looked like put on top. It was ok. But considering the distance I drove. I was very disappointed that it was just cake. My girlfriend ordered the stuff french toast binoche. And instead got the Nutella banana french toast and hashbrowns. But she didn't notice until half way eating it cause it was so massive she didn't know that it wasn't stuffed. She really enjoyed the food that she ordered The portions they give you are very good portions.\n\nEggstasy has the look of being a hipster place for sure. The decor is cool even though the bathrooms don't have his/her signs on the doors. They still got some kinks to work out. But all in all it wasn't bad and I would recommend them and give them another try. Next time I'll try their sister restaurant attach to them called Sausage N Crack! Ok....I might have made up that one.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2014-09-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rnRAnEB2zZhkNzoX4MaG_w', 'review_id': 'eEDxTZ26psaEhp0I28PYeg', 'text': "I tried this wonderful new breakfast and lunch spot in Scottsdale for the first time and thoroughly enjoyed it.  The menu is excellent and the food preparation and presentation was superb.  I had a terrific breakfast burrito with fruit which was fresh and served with a generous helping of sliced avacado.  Every plate I noticed being served looked exquisite.  My servers, Britni and Chris were also wonderful which just made the experience all that more enjoyable.  Also, unlike many other breakfast spots Eggstasy does accept reservations.  If you're a Scottsdale breakfast person you'll be pleased you gave Eggstasy a try.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-09-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cDlXzDFRjTOp5J38vvFwqw', 'review_id': 'dYD1zi4p9BzvH8uKudcSvA', 'text': "Eggcellent breakfast place;) Small place with sort of a modern hipster vibe.  Great menu with something for everyone on it. And they give you cucumber infused water, which I thought was nice. \nI ordered the Brie, Apple, pecan and grape crepe which was good. The crepe was REALLY good but  I barely got and Brie in it which would be my only complaint there. I also ordered 1 poached egge which was PERFECT.  Like seriously it was probably the best egg I've ever had. And the hashbrowns as well were soooo good. My friend got the red velvet French toast which, I think she thought was good but REALLY rich.  She ate about 1/3 and then gave up and ate some hashbrowns and her eggs. They should offer half portions of the French toast.\nPlace was clean, though the salt and pepper shakers were half empty which only bothered me because I work in a restaurant and I just think it's tacky.  Our server was friendly, and made recommendations. I think his name was tony.  He talked pretty quiet but was still very nice. Gal working at the front door was SUPER nice and very welcoming.  \nOverall I was pretty impressed expecially since they've only been open a week, I feel like things will only get better. \nCan't wait to go back!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-09-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Uj5Ylr4w1pUduDLsHrm9VQ', 'review_id': 'Zj7_OQSol3KADDqzO8hNWg', 'text': "Eggstasy restaurant is finally open! Had a nice, BIG, breakfast there this morning, just to be sure.  The hash browns are the best, nice mix of crunch and generous seasoning for excellent flavor. The Benedict with crispy prosciutto was recommended by my server and was a great selection, prosciutto was thinly sliced and cooked up like bacon, only crispier, and smokier. The poached egg (just the very teensiest, slightest bit underdone) and hollandaise (very lemony, yum!), over a monster of an English muffin from a local bakery. Portions were HUGE - half of my Bene and most of the hash browns are in the fridge for tomorrow. Service was excellent! Hostess, waiter (Junior), co-owner/manager, and water servers were very attentive, friendly, anxious to please, and delighted to share all the details on anything related to the menu or local restaurant biz. Like that the terrific and spongy English muffin came from Strictly From Scratch bakery, who are also the suppliers for Scramble and recently bought Chompie's. Who knew?\nCan't wait to return and try some of the funky crepes and omelets on offer!\nAlso:  Coffee is strong and good and plentiful, but needs to come with a spoon for stirring in cream.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2014-09-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KOQKCcA01MiwYCWMn6NOfg', 'review_id': 'F3ueM4yFP_OJw3GcJ5eG1A', 'text': 'First off this place has AMAZING food. So what makes great food even better? The service of course! we had such a wonderful server, Junior, who took great care of us. He was friendly and so excited about the menu; that says loads about an establishment. It was clean and I love that you can see the kickass staff making scrumptious food in the kitchen. This is for sure my new breakfast place. Will be telling everyone to come here', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-09-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'F5Rm2xtmWdbYVsnWLsXv7A', 'review_id': 'AJyR41hqQYYsR7bdVg6TnA', 'text': "For just opening, this place is outstanding! What a wonderful addition to the neighborhood; I can't wait to go back. The chocolate covered bacon and the pumpkin cheesecake pancakes were to die for! If you are in the neighborhood, I highly recommend stopping in for some delicious breakfast and/or lunch. I can't wait to go back and try more of their menu items. If it's as good as the first time around, this may be my new favorite spot. Oh, and if you appreciate fresh squeezed juice - you will love theirs! Great service, great ambiance and great food!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-09-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IF8k9KIbGc7xJxjeiwvh9Q', 'review_id': 'jbRDAjbPFofQ60Kh130l4w', 'text': "Pretty good. They just opened so I know the first few moths for a restaurant is hard. I like the vibe, loud and popping. My husband ordered the lemon and blueberry french toast. I was there was a description because he doesn't care for banana bread and that's what it was, so it didn't really taste like french toast at all. I ordered the eggs Benedict it looked amazing but I was super disappointing because my eggs we over cooked basically ruined the meal. I've never gotten them served that way I thought the point was to have the yolk runny. Whatever I'm just going to Ive them the benefit of the doubt on being new.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2014-09-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kGPzMKbcpqk4TuYYa29uUw', 'review_id': 'tkaXGlLpeR5sN1exQoLvMA', 'text': "This is our second visit to Eggstasy and it's just getting better. Peter Varros, the owner, is always out and about, checking on customers and spreading serious joy. He is great and obviously knows what he's doing. \n\nHad the panini today...and the wheat pancakes....and corned beef hash with hash browns....and a fruit crepe...geez. All so very fresh and good. I'm stuffed. The portions are really huge and probably should be cut down by a third. \n\nHad the orange juice today and it was truly fresh-squeezed and almost mango-colored. They must be using the good Valencia oranges. Yum. Hard to find fresh-squeezed anything in the Valley. \n\nOur waitress, Tara, was professional, warm and attentive without being overly so. Nice staff. \n\nThis place is starting out very well. Lovely location, nice natural light from the windows (we always get there early enough to get a window seat!), noisy, but in a happy way. \n\nHopefully, it will be here for a very long time. God knows, the Valley needs a decent breakfast place....this is our new choice. Next time, it's lunch!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-09-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'j2Fexozo_TjLTpYFNvstIQ', 'review_id': 'qG0EEYYiQUAcnAi7Vyq-iw', 'text': 'I has the prosciutto omelette with mozzarella, tomato and red peppers. Really great flavors, hot and fresh. The hash browns were hot and crispy. The fresh fruit was a little meh. \nThe fresh squeezed OJ was also great. \nOtherwise, service was good. The place is LOUD though.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2014-09-06', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'ZZxAeeKT-W2D8Ieplzu1nQ', 'review_id': 'JVVv9pG4_33egFbPSVM_xQ', 'text': 'The food here is eggcellent! Portions are very large, we actually split an omelette and it was so fresh and yummy and the service was amazing!! This is our favorite breakfast spot now...(BYE BYE Butterfields!)', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-09-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'RB3Rz-yvRT4SiFCzInBjgA', 'review_id': 'vLaAuBo1euBa3WL55miodQ', 'text': 'Coffee was great, food was great as well. I had the asparagus, ham and gruyere Crepes and my husband had a ham and cheese omelette (which came with a huge side of pancakes).  Very tasty and plentiful, enough food for four! Owner very engaged with customers and interested in a great experience.  We will definitely be back !', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-09-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'qa-rTbK3ECX15a3kd5buyQ', 'review_id': 'kw6fR4tMqVKjGOKZGCQUuQ', 'text': u"I can't wait to go back here!\n\nWhen we arrived there was a wait to get in, and I can understand why. The food is amazing!\nThe d\xe9cor is minimal but colorful. The place is a little loud, which I actually thought made it more fun.\n\nThe menu is large and everything looks delicious. I ended up ordering the Camelback Panini with broccoli cheese soup.\nWOW, the soup was heavenly and the Panini was grilled to perfection. I also go to sample an omelet, a pancake, a side of sausage and eggs benedict.\nEvery bite was better than the last.\n\nI plan on dining here as often as possible to try as much as the menu has to offer!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-09-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wdMhw1bfwjDSfkjTp3CXdA', 'review_id': 'Ag4Gjtu6z2Dks9mKLZJRRQ', 'text': 'Food is OUTSTANDING(best breakfast in Scottsdale by far)...portions are very generous...atmosphere is bright and cheery- green, yellow and orange. The ecoustics are HORRIBLE...the music was aweful(pounding) and LOUD...you canNOT hear the person speaking sitting next to you. If you brought headphones everything would be perfection..otherwise you might leave with a headache. One last suggestion...turn down the A/C please!\n\n\nService was great and food was fresh with top quality ingredients. Food is rated FIVE stars', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-09-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'T-SKJo372IHScyKTlgpJhA', 'review_id': 'tnsFGAsjxYtzjcq9QHEf_Q', 'text': "The noise level is terrible.. The restaurant was practically empty just couldn't figure out why it was so loud. I had the mango lime crepe it was alright but too much hard mango it need something more than that in the crepe.. It was still alright.. But I wish I gad something else. My aunt had eggs Benedict and we had to ask for more sauce.. But she said she like them. My friend had plain buttermilk pancakes.. Said they were good. Service was excellent. I liked want I saw on the menu so I will try them out again.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2014-09-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'R241_BXzt4-eRA3u673_mw', 'review_id': 'yFGQlWh6pmKUaF_qMScKeg', 'text': 'This place is great! Gave up Good Egg for this morning spot! Peter is awesome already knows our orders and you can see they really want their customers to be happy! Big shout out to Iliya he is a good employee there.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-09-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '2FtCOwNwd6UsBgScSc1_Ug', 'review_id': 'fuzHbD438JE-KOrepTSvoA', 'text': "Love this new breakfast spot in town and such a great location. They are a friendly bunch with fast service and good food. And holy moley-ridiculously large portions! Nobody at our table could even put a dent in the plates they were served. My husband and I agreed that we could've shared a plate and still been stuffed. They have a big menu with plenty of options (think Cheesecake Factory). Prices are moderate, but really affordable when you consider the amount of food.  The dining area is a large open cafeteria style with open kitchen-so loud, loud, loud.  For reference, a crying toddler could not penetrate the wall of noise. May not be an issue for some, but worth mentioning.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-09-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'WehCZQtQu96-VL6RawV_BQ', 'review_id': 'AWE61Mqs09kinAvNrNbNwg', 'text': "I drive by this incredible breakfast spot every day on my way to work, so when I finally got to try it out this morning I was eggstatic!! Eggstasy did not let me down. \n\nTo start, the staff was very welcoming and friendly. We were sat right away. The coffee was strong just the way I like it and cucumber water...refreshing! We were randomly and happily served the banana macadamia pancakes on the house. Not overly sweet and very hearty. \n\nI ordered the prosciutto benedict and my boyfriend ordered the avocado benedict. So we did a lil swap and had one of each. I fell in love with both but the prosciutto really stole my heart! The hashbrowns were crispy just the way I like em! \n\nThen some man with authority, perhaps the manager or owner, stopped by our table a couple times checking in on us, realizing we were newbies. He was very nice and accommodating. \n\nBasically, I can't wait to go back!!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-09-20', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 0}, 'user_id': 'yuGaEtQ6Jnf3Kgo-lo19QA', 'review_id': 'frtKLrxsRT3tCYzccLjs9Q', 'text': 'I was very excited to try this place after seeing the reviews on here.  We waited for about 30 minutes for our table, which isn\'t too bad in general, but upon being seated I figured out what the break in the chain is: the kitchen.  \n\nOur waiter, Luke, was competent and friendly.  As we waited for food, I couldn\'t help but notice large gatherings of servers standing at the food "window" waiting for the seemingly missing dishes from their orders.  Plates would appear one at a time, which was odd since the average table size was 4+.  It became obvious that food tickets weren\'t being completed a ticket at a time, instead, they were batching meals.  \n\nOur appetizer, chocolate covered bacon, came out just before our meals started to be delivered...which took about 20 minutes after ordering.  One side of pancakes (regular) were delivered.  Then, a few minutes later, the second and third side of pancakes (pumpkin cheesecake).  Then, yet another few minutes later, the french toast entree arrived.  It took almost 10 minutes for the omelets to come out.  One side of pancakes never came out, so we got them to go.  \n\nThe food was very good!  The kitchen manager was seen speaking very "animated" to the waiters and line cooks, which was unprofessional and, from what I could tell, he was the weak link (in the white shirt on the left facing away in the picture).  Ticket times were all over the place, and orders were not being delivered all-at-once. \n\nThe restaurant has been around for 5 weeks, so they should be over growing pains like this.  We will be back for the food, though.\n\nFor those complaining about the noise: I feel you.  No carpet, no cushions, all hard surfaces!  \n\nThey take reservations, which is good!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2014-09-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'zmRQ3Rpz3T9gj1FbOYfIYw', 'review_id': 'tUZffoHujNWdrRlE33rteg', 'text': "Usually we frequent Butterfields - but thought we'd switch it up since we drive by it everyday and the name is cute! So glad we did! \n\nOmlette and hash browns were to die for. Sriracha/ chulula and ranch were also on hand which is a huge plus!\n \nJunior was our waiter and he was awesome!!!! Never short on drinks and extremely helpful. The hostess with long dark hair was a doll!\n\nSuch a great experience and the manager also let us try the pumpkin cheesecake pancakes. Oh my goshhhh - it was love.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-09-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qR0LDAlt0CFMwwoms1Oa5g', 'review_id': 'WslxraUgdXUpXfEpY3eavg', 'text': "The food is great. I've had the gruyere, Swiss chard and Carmelized onion omelette and the goat cheese and fig panini. Portions are huge and everything is very tasty. Also, Junior is a great waiter who knows a lot about the food. Only problem is the club music they have blasting. Why such terrible, loud music at breakfast? If they turned off the music it would be perfect.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2014-09-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'W_R-gVF8OHNrIhtmyhDnyg', 'review_id': '24yPphsa6J-l1Zn2gOpf6Q', 'text': 'Always open to trying a new breakfast place and this has a great location on Shea and 70th Street.\n\nWent on a Friday afternoon and was seated right away even though they were pretty busy. The decor is pretty contemporary with some of the larger tables with bench seats. Seems like they try to make it like a open casual home feeling. \n\nShared the Denver Omelette,  asked them to substitute asparagus for bell peppers and they had no problem. Also substituted the buttermilk pancakes for the pumpkin cheesecake pancakes. Also shared the fruit Waffles and ham kaseri crepes.\n\nThe omelette was good but if this makes sense tasted more like a bunch of scrambled eggs than an omelette. The pancakes were good but did not wow me.when the pancakes came out it looked like a glob of melted marshmallows on top of the pancakes. The hash browns were good and crispy the way they should be. The Waffles were done very well as was the huge portion of crepes. \n\nThe interesting thing was the cucumber water, kind of different but okay would prefer just plain water. \n\nOverall the place is nice food is average to good and was nice to try a new place.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2014-09-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fmCY1kbpAVoiyR-zI3dXTA', 'review_id': 'xHGWe-wHSkx5R5pXdb6oBQ', 'text': "Uggh! If you love mimosas, DON'T go here! It's 7$ for a shot glass worth of champagne. I even got the orange juice separate and the champagne was literally in a tall skinny glass and was the size of a shot. Not worth it!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2014-09-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IDnIYkLxdDJ6G_QGpcqaog', 'review_id': 'CUwbNoouwkDIqh34mP20yg', 'text': "Eggstasy seems to be the younger crowds breakfast joint as an alternative to Butterfields down the street. Their menu is so extensive that I took so long to decide. Their mimosas are amazing and my boyfriend loved his Bloody Mary. Any breakfast place is going to be busy on the weekends but they were apologetic and brought waters out to those waiting. \n\nCandace was our waitress and she was very outgoing and went over the top to ensure we had a good experience. Again, I think it might be geared more toward younger adults or a couples morning out than a family gathering place but it's a refreshing change! Just wish they served beer. ;) (they might actually, guess I'll just have to go back and find out)", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-09-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qvlNBjW6iwqfBbmDtrGatQ', 'review_id': 's2CL-DGLnQckK_1kWsY6JA', 'text': "The menu and food was outstanding but the noise level is so loud a large group doesn't work too well; you can only hear the person on either side of you.  Something on the walls to deaden the sound might be in order.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2014-09-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'myd6bQHz5VGqyPLUHL1EVw', 'review_id': 'MMR1VY6bGRqKghyhYIKK0g', 'text': 'My family just finished eating here this AM. For a late Sunday AM brunch crowd this place was packed. We were expecting to wait for 45 minutes but were seated immediately at a large table that had opened up. The place is open and loud but the vibe is great and energetic.  \n\nNow for the food. I have 3 tween boys and they can pack away a lot of food. It is a rare event that a doggy bag is required however this was the exception. The portions are large and filling. The quality of the food we sampled was excellent and without exception. The kitchen staff knows there stuff and can prepare items beyond the standard breakfast fare. Kudos to the protein pancakes for the low carb/gluten free crowd, they were delicious.\n\nI could keeping going on about the food but I suspect every item is delicious and we will be definitely returning to sample more fare. If you are reading this review, do yourself a favor and check out this star amongst the local breakfast fare.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-09-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'r-PylGexyY2_Trzd8fdAjg', 'review_id': 'G-YCqMEp60x3lWUFwYN_5A', 'text': "This place is definitely  as good as all the reviews say! Some of the best food you'll ever taste .....and huge portions! The coffee is amazing ...! Keep up the good work !!!!!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-09-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8zw_YG7L1_uUWomKoEU16A', 'review_id': 'g-WDz1yH8YqVb7Bc1IF3yg', 'text': "Love this place. It's bright, sunny, and modern inside with an excellent menu. The service is lovely and coffee to die for. They even have stevia on the tables. The manager is warm and friendly and remembered I'd ordered their lovely gluten-free protein pancakes on my previous visit, and today just brought me some for dessert, his treat. These nice touches will keep me coming back. Happy to see this place and can't wait for the patio to open.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-10-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'AcErO3j0GFTXbdJHbuD2-Q', 'review_id': '7_fVnTjPMsGvBTNTakwrwQ', 'text': "This changes everything! They have an unbelievable menu here. My wife and I had  crepe items and both were excellent. The variety of crepe dishes and pancakes is the broadest I have seen. Atmosphere is typical Scottsdaleish. The service is better than it needs to be (don't need quite that much attention).\n\nPortions are significant and prices are fair. The big question for us is whether it is worth the drive from Gilbert. Yes, it is!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-10-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zqGATvI3UoOPOyXIfP6iZg', 'review_id': 'VPTruAJkS2wEmzN-i7eKuA', 'text': "We rarely go out to breakfast but I love to do so and the menu caused my husband to remark that we'll have to come back because there are so many things he wants to try! Yay!\n\nI had an omelet (yummy) which I easily shared with my two kids: ages 2 and 4, and still had some leftover. I appreciated that our server suggested sharing, as opposed to swindling us into kids meals instead (though well have to get the Mickey pancakes next time just because they looked fun and yummy). My husband had the salmon eggs Benedict and he said it was fantastic. The orange juice was generous and fresh squeezed and omg the hashbrowns?? Even if the rest of the food was horrible I'd be coming back for the hashbrowns. Best I've ever had, ever. My potato hating husband even devoured them. \nThe owner, or person I assumed was the owner, was very present. He was helpful working with his staff by clearing plates and also making the rounds to check in with guests. Super nice guy!\n\nKid friendly, delicious, great vibe, we'll be back!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-10-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LnoQBXbZae3NF6_a4mVtJQ', 'review_id': '8sgR2MTJF8PGkbDK2ra5xQ', 'text': "Service was fine but the worst corn beef hash I have ever had. Really ruined the whole meal. The server was polite but didn't seem to know what to do. There are so many better options around here.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2014-10-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '2AGGIi5EiVLM1XhBXaaAVw', 'review_id': '_TXxTJrE1shPamd0YdLJaw', 'text': u"The servers at Eggstasy are exceptionally, eggceptionally?, nice and helpful. Even the manager twice checked in on our table during our recent visit. I would suggest that you take the advice of your server when ordering. The menu, as structured, is a little confusing. Their advice is not the typical effort to encourage you to trade up or add on expensive extras. It's actually helpful. \n\nAny complaints about Eggstasy? It is loud. On a Sunday morning you can hardly hear yourself think, much less your tablemates' conversations. A few well placed acoustical panels might help, Much better on weekday mornings. The Eggstasy section of the menu, which contains all of the restaurant's unique featured items, appears last in the menu, a curious choice. The portions of these items are huge. You do not want to order them unless you are sharing. Server suggestion that you order an egg oriented menu item and then select a side from the Eggstasy list is the way to go. Why not just lay that out on the menu?\n\nLove the pumpkin cheesecake pancakes, although the cream cheese topping is a bit overwhelming after a few bites. The lemon blueberry French toast is delicious, but is heavy and resembles a banana bread. Not what you might expect from the description. I'm anxious to see what other surprises there are in the Eggstasy portion of the menu. Everything there is dessert-like, however, so be forewarned. A side order, as part of an egg dish, is definitely the way to go unless you have a massive capacity for carbs and sugar.\n\nHave not eaten here with kids in tow, but they do have a kid's menu.\n\nThe total tab, for two of us, was $33 including tip. Not unreasonable. Just Scottsdale pricing.\n\nThe restaurant d\xe9cor is a bit mid century, a bit industrial, a bit hipster, a bit modern; that is, a bit fun. The outside patio, which was full when I first viewed it, actually made me laugh when I saw it empty. A good thing.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2014-10-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Msq8yU5TCMmWh7MD-bxTqg', 'review_id': 'VL5HVhU9b1YxwFY0q2Dl9Q', 'text': 'If there is ever a time to cry because breakfast is so darn good, this place will have you bawling your eyes out! The food was perfectly prepared, beautifully plated and most importantly, AMAZING!!! The restaurant was a hip little place with enough color to wake up the eyes but the smells of the restaurant is what wakes up the rest! I had the gypsy steak skillet with a side of lemon blueberry frenchtoast. My girlfriend had the toasted coconut mango crepe. Both plates made the table fall silent since all we wanted was just to keep eating! SO GOOD! Definitely my new favorite place for breakfast!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-10-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-087cNxyD11jpuF8wfxzVQ', 'review_id': 'cOqGItIKezcqk_S1uvyR5Q', 'text': 'Absolutely love this place! Owner Joe is hilarious, people-oriented,  welcoming,  and just down right awesome. Portion sizes are huge,  the food is excellent, service all around fantastic!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-10-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xaamvkkGqfKSfaW8DVGnag', 'review_id': 'xMh9uRt7YV652FjCsNjQbg', 'text': 'Best breakfast in Scottsdale by far. Reasonably priced too. Servers really good. Creative choices, not just the usual here. Yes, it was pretty noisy but the food, prices and friendly staff make it worth the noise.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-10-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'T5udw9MB40ghqEGKPrNXtw', 'review_id': 'Cx_vDvrOscYN7wTrH8G5hA', 'text': "This establishment is excellent. The variety of food and the presentation of it makes you feel like you're on vacation. It's decorations and designs are very artistic and creative. Definitely a place to enjoy for a reasonable price.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-10-11', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 0}, 'user_id': 'cc2eTX0wPFUiz5l_UEFCTg', 'review_id': 'cnpAPS1tcVUjrlBSLEaoIw', 'text': 'Food is 5 stars.  If you want to eat alone and not converse with anyone, then this is the place to go. Certainly not a ladies lunch out place if you want to actually hear each other.  They truly need to improve the sound level.  Also, throwing in a few dividers in the place would be nice.  It is like walking into a middle school cafeteria.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2014-10-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'pb-uvKVYsdOkfJCEnAOX8w', 'review_id': 'Qtx5wd3RK5oTUllv6wMRhA', 'text': 'Fantastic food. Service friendly and accommodating. Italian coffee to go. Definitely want to try more items on the menu. Got an omelette entree with a Side order of fried truffle egg toast. HEAVEN! So many options for benedicts as well- traditional, smoked salmon, crispy prosciutto, avocado, caprese and more! Atmosphere and ambience are inviting and energetic.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-10-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ggE8o6opjYdKI9xa3Jzi2g', 'review_id': '0T0badVbAHuyYeqZa534zQ', 'text': 'New favorite Breakfast/brunch place! Lives up to its name!! Try the pumpkin pancakes. Delish! Everyone who works here is friendly and accommodating! We will definitely be back. Pure Eggstasy', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-10-12', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'X_i0TBkVAPUNzUMQnCl6kQ', 'review_id': 'het4Y2lRkL2w5Rt5rQm8Dw', 'text': 'If you don\'t like eggstasy, then I don\'t like you.  Honestly, best breakfast I\'ve ever eaten.  Steak and egg skillet was fantastic.  If there\'s two of you, split one.  Then order a SMALL PORTION off the "eggstasy" selection in the back of the menu, I highly recommend the brioche French toast or the pancakes with pumpkin cheesecake sauce (make sure to order the pancakes crispy.)  I\'ve never tasted anything like either.  The chorizo grits are also tasty (just like chilli), but you won\'t have any room for sides.  So obviously I love the food.  Service:  been there twice, Candace and Michelle are GREAT.  Michelle actually insisted on sending us home with to go cups of coffee (for no extra charge.)  Everything comes out so fast, it\'ll boggle your mind.  The owner, Pete, gave is extra pancakes out of the blue, on the house.  I honestly felt like I was a part of some social experiment where scientists were studying my reactions to insanely delicious food at fire sale prices.  \nPrice:  30 bucks for a fantastic meal for two?  Including coffee?  Hell yes.\nWait:  been there twice, waited 20 min at the bar the first time (the bar tender kevin is now my boy), sat right away the second.\nAmbiance:  too loud, but I didn\'t really care.  There were flies because it\'s an open air restaraunt, honestly the only thing that bothered me at all.\nPretty sure this is the first review I\'ve ever written.  That\'s because this place is the shiat.  Not really sure how they\'re gonna stay in business for very long with those prices, so you might wanna get in the car now.  I SAID NOW!\nPs if anybody happens across any of the recipes for any of the dishes at this restaraunt, I will pay you one million dollars.\nPps Pete, if you\'re reading this, why aren\'t you open at 11:21 pm?  Also, I would consider nominating you for the Nobel peace prize if you implemented delivery.  Maybe if you delivered to Syria, ISIS would chill the phuk out.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-10-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ybvt5e4tMCS9MlJM-vITaw', 'review_id': 'wPBJM0EcTGHVpMk5C88Vtw', 'text': "Cute little gem in Scottsdale. It gets really packed but that's because this place is awesome. It's got a neat decor very upbeat. The waitress said they are going to put in a new ceiling to address the noise issue because it is pretty loud when it's busy. They have a cute patio area that wasn't open yet but I can already tell will be a hit. Food portions are huge so you can probably split a meal or take leftovers.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2014-10-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'V8IgwToO4jsxqC0RrpMwyA', 'review_id': 'b1RrJrQjcxIKIH63p1NtLg', 'text': "Came to Eggstasy for breakfast with my husband. The four stars are primarily for the service. Our waitress was friendly and accommodating. Because we came in on a Monday morning, the restaurant was not super busy. \n\nI ordered the basic eggs Benedict and my husband had the corned beef hash. The Benedict and hash browns were just okay. Nothing special with the flavor. My husband liked the way the corned beef hash was prepared (not undercooked and with a little crispness).  \n\nWe also ordered a mimosa and Bloody Mary drinks. The first Bloody Mary drink needed to be redone. There was not enough spice or tomato flavor. The Bloody Mary comes with a chocolate covered piece of bacon. That was okay (maybe too much chocolate coating).\n\nThere are a lot of choices on the menu and because this place is new, I believe they are still finding their signature flavor. I'd be willing to give it another try.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2014-10-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'c7e_wMw2_Re3lQQmTovAog', 'review_id': 'Sz7-opboJql8E-dhoSU8YA', 'text': "This morning my son, neighbor and I headed over to our favorite spot for breakfast and we were sadly disappointed that it was closed.  We decided to try out Eggstasy for the first time.  The place is too loud.  The menu seemed a bit pricey.  The coffee tasted like it had been left on a burner too long then poured into a thermos to keep warm.  I couldn't drink it, so I left on the far end of the table and the server didn't even notice.  The cream seemed curdled.  My son's iced tea was watered down and flavorless.  The yogurt parfait was okay - the fruit was fresh and the serving size was adequate.  It was served with a slice of cold, dry banana bread that seemed like it had been pulled out of the freezer and set on the plate.  My son ordered pancakes with strawberries, and a side of hash browns.  The pancakes were dry and the strawberries seemed on the verge of rotting.  The hash browns were bland -- although the portion was generous.  I would not recommend this establishment.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2014-10-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '8M9QPbw9A0A2i1mqLYEJHQ', 'review_id': 'AqSUyH2GhenQ1Cl1WW6uYw', 'text': u'Decent food, great service, modern d\xe9cor.  \n\nBelgian waffle was light and tasty, mimosas were okay (a little tart for my taste), bacon slightly undercooked, eggs were light and fluffy (asked for scrambled/well done), and hash browns were okay.\n\nOverall, we were happy enough and plan on returning to try some other menu options.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2014-10-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SzTuIZE8qIDJVQxKKjlJtQ', 'review_id': 'aaGmp71PQX6edQJiFVb-Ig', 'text': "We've been there twice and everything has been great! Love the pumpkin pancakes and their crepes. The servers were always checking if we needed anything. The place is noisy and wait time is kind of long on the weekends. Great place, great food, good service.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2014-10-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'keINTxcneyvCySAtAMXDvQ', 'review_id': 'ehQLxJkECF-HOslCPHNcrA', 'text': 'I was so happy we chose to go here at first. Eggstacy offered a wonderful brunch, full menu with lots of exciting choices, and friendly service. We sat at the bar where there was only one bar tender - apparently the other left sick - and for the most part the service was very accommodating. I got an omlette that was massive, and they give you the choice between toast or pancakes. The sourdough toast I ordered was paired with fresh whipped butter and an individual sized jar of jam. If you order pancakes as your side, be prepared for a full, two-cake plate with whipped cream.\n\n  The wait was not bad at all at first - maybe 15, 20 minutes. The more we have visited, the worse the wait times have become. Expect to wait 40 minutes for your food to arrive, and then watch the waiters ask every table on the way if the order is theres or not. The staff is so poorly trained and managed that its almost comical. The only other downside is a question of the general cleanliness of the restaurant and an odd restroom set up. The bang-for-your-buck factor, along with the quality of food, is great. Just not sure of its worth the circus that ensues.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 2, 'date': '2014-10-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vtedgK7wCKBqRyPOh6alPg', 'review_id': 'oNcZvED9eZi0-puLNJXJBw', 'text': 'The eggs are well prepared and the servings are large. The pancakes are outstanding. The service is friendly and unusually attentive. It is, however, the ambiance that really stands out- very modern and colorful. On the loud side, but that is a small negative compared to all the pluses .', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2014-10-20', 'type': 'review'}
{'votes': {'funny': 8, 'useful': 13, 'cool': 13}, 'user_id': '8dbRf1UsWp2ktXHZ6Zv06w', 'review_id': 'FLx5mD7gapUjfm3iy8kGLQ', 'text': "Eggstasy was the place picked for October's Breakfast Club UYE, and this place does things big! They leave you feeling full and satisfied and well in eggstasy.\n\n1st off, you notice it's a huge menu for a breakfast joint, this place does not mess around,  they have soo much to offer and many choices were made, so I did get a chance to check out a lot of plates and boy they looked great! \n\nI went with the Incredible omelet, it was loaded with green peppers, mushrooms, tomatoes, onions, BACON, ham and sausage, it was HUGE!!! No really it was huge, and it came with hash browns and I opted for pancakes instead of toast.\n\nI didn't realize it was going to be huge, this was something that could have been spilt between 2, but I was starving and did eat my entire omelet, just couldn't put a dent in my pancakes.  This a great breakfast place, and breakfast is there thing. \nI already can't wait to get back to try the many other things on the menu!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2014-10-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '3Gp3rXz91N7UzN_L5iUopA', 'review_id': 'hdfXQ6uQigw48glylKe88A', 'text': "On a recent trip to Arizona I dined at quite a few really good restaurants but this one stood above the rest.  Usually something has to give - either quality, service, or price.  I was impressed on all accounts. Everything exceeded expectation.  The menu was varied and creative, food was fantastic and served in generous quantity. Service from the hostesses and our server Tara was prompt, friendly, and attentive with genuine friendliness that one doesn't find everywhere.  I have never before been personally thanked for my business by the owner (manager?) and sent away with a fresh to-go coffee but it happened here.  Five stars without hesitation for Eggstacy.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-10-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2pewHjH4Le8eNsGswKUc3w', 'review_id': '6-gbI5w0QjZ2uCxkP-R4rg', 'text': "Ate here the other day for breakfast and oh my was it wonderful. Had the Dali and my boyfriend had the gypsy. They both were amazing. And it's very hard to impress him and he loved it. We will be going back for sure.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-10-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 3}, 'user_id': '3gIfcQq5KxAegwCPXc83cQ', 'review_id': 'pEIPs6VLp2Sfg83T2k6s0Q', 'text': "The husband and I joined about 15 other Yelpers here for the breakfast club UYE. This place graciously accommodated our large party, which was much appreciated. Our waitress was incredible, she was friendly, on top of things, and willing to help me navigate their huge menu. I don't think there are many breakfast items that aren't on their menu... this thing is huge, with pages and pages of items. The waitress had to help me decide between 4 items (ha!). I ended up getting the asparagus skillet (asparagus, bacon, garlic, cheese, quinoa, hash browns, and over medium eggs, about 12$ ish), which (to my surprise) comes with a 'side' of pancakes... and I had to try a specialty pancake (the macadamia nut) which was a 4$ up sell. The husband got the nutella crepes. I will be honest, I wasn't overly thrilled with the food. My 'skillet' came out in a bowl.. a little odd for a skillet, and just didn't have as much flavor as you would think from the ingredients. It wasn't bad by any means, it was good, but kind of boring. Maybe some fresh herbs or something would make it pop more. The side of pancakes was ridiculously large... I ate less than a quarter of them... and they really were nothing special. I have a little bit of a problem with restaurants that serve huge portions like this.... I feel like it's just wasteful.... very few people could possibly eat this amount of food, making so much food go to waste (bigger is not always better people). Why not give size options for the breakfast like 'small' and 'large' plates of the same food... then you can choose what you would like (and I know, you can share the food, but you don't always want the same thing, ya know?). Anyway, on the flip side, the husband's nutella crepes were delicious and even good as leftovers. The coffee was also good here and came with real cream... yes, you heard me... real cream... LOVE that. I would like to come back here and try something else, as many other items looked tasty. Will update the review at that time. \n\n\nPS yes this place is loud, but not as loud as I thought it would be.... pretty normal for a restaurant this busy.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2014-10-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WFgmr_fYTGFPbVNPyVCi3w', 'review_id': 'Xf4ie0fqGM7oeczevs2CUg', 'text': 'Let me start by saying that their food is amazing. You will get really big portions and a fair price too. They also have good fresh juices, cons we kinda waited a bit longer than excepted and that the restaurant is noisy. However the food is so good that I had to give them 5 stars.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-10-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'wLDWtFpyh0hr3wfpj_lxWg', 'review_id': '9ZKo4UIWH_4GBxt918kxZQ', 'text': "Wow!! That food was incredible! With every sandwich not only do you get your choice of fries or fruit but you also get soup with it and it was great!\n\nAtmosphere is good, they have a great patio that's large and perfect to sit outside when our weather isn't so hot. Service was very slow but food made it worth it. Deff going back!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-10-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7ciTwLrLdThsOqXmw3B3hw', 'review_id': 'cengf2n0Z09_V7b5A7rjdQ', 'text': "I love this place! Can it be a bit loud. Yes, but everyone is so friendly. Good move having Joe making sure everyone is happy!\n\nI love the Greek Huevous Rancheros and the Skinny Bitch.  The fresh orange juice and delicious coffee make your weekend so special.\n\nIt's my way to start the weekend . Please keep up the good work!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-10-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KBr7UXlfD-Qrq8dk4o2XMw', 'review_id': 'PPNEQRqCsSDIw8375esmEw', 'text': "First time visting the location. I was impressed with the offering of the menu.  I ordered the two eggs with canadian bacon, hash browns and a side of pancakes. With coffee the meal was great and for $12 it was so much more than I could handle.  They are still in the start up phase with the patio and bar opening soon.  I certainly will head back to try another of there offerings.  I got a tast of the Banana crepes delicious.   Can't miss. Need more places that we can explore for great breakfast.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2014-10-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 's0G9Z_P8gTSQF6uKgcOZ0w', 'review_id': 'JwT4sSVJbJPme6Y1v9H2zg', 'text': 'Went on a recommendation from a friend, who said it was good.  He was dead wrong.  I have three words for the owner.  Simplify your menu!  It\'s like they are trying to be 7 restaurants wrapped into one.  Why 1 star?  Well, the food took almost 45 minutes.  I can deal with a long wait if the staff is still attentive, apologetic in some fashion and most importantly that when my food comes it is hot and prepared properly.  I\'m guessing that trying to accommodate what looks to be over 100 menu items out of that kitchen would be the cause for the long wait.  Next reason for the 1 star, when my food did come it tasted like it was all mixed together and undercooked.  Tried a benedict and the egg was barely poached, like runny snot water looking eggs.  The hollandaise was broken and never should have been served.  Tried the "homemade" has browns and they tasted like a greasy burger?  Not sure if they are cooked on the same cooking surface or if the cooks don\'t change gloves. The restaurant was pretty busy, but what breakfast place isn\'t on the weekends.  Butterfields, Pancake House, Breakfast Club, Scramble and Snooze all make this place look like it\'s held together with shoe laces.  Sorry, but won\'t be back.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2014-10-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ERgromJ-1EGB6-DyI2N1nQ', 'review_id': 'XJXs5gcIxZ5rz2jxX58tGQ', 'text': 'We tried this place yesterday for breakfast & everything was delicious. Service was excellent. We got a chance to sit outside since the weather was fab. We would say this place is the best new breakfast spot in Scottsdale. We will be back.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-11-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'e9i236_MFioL138TCjyCKg', 'review_id': '0HiuSN49Vh00Hc1SAQiDZQ', 'text': "Excellent huge portioned plates amazing place it's loud which is rest for me because I have kids", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-11-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'qdh3xEWuMEmzbhWs62LFeg', 'review_id': 'VwYBcQzghzFo9ekEKqAD5w', 'text': "We came here today for the first time. The reviews looked great and it's super close to our house. The experience started out really well. There was a 30 min wait for 11:15am on a Sunday and the host was very nice, we told her we were going to look around in the kids store (KidStop) to keep our 4 & 2 year old occupied, she was so nice to walk down there to get us when our table opened up she sat us and our waitress greeted us promptly. We took about 10 min to order because it was our first time and the menu is pretty big with lots of delicious looking items. We then ordered, nothing complicated but this is when the problems began....an HOUR went by and we still didn't have our food and ALL the tables around us that ordered after us were getting their food. I was a restaurant manager before and I know that's not acceptable.  I went to try to get our waitress but she was avoiding us like we weren't her table. Another server brought my meal by itself and we waited 5 min before I sad anything to our waitress and she assured me the rest of the food was on its way. I told her just get my kids food out (it was just 2 Mickey Mouse pancakes) b/c they were hungry. Well we waited another 5 min before the rest of the food came out. The manager walked by and asked how everything was so we told him nicely and his response was, sorry! I know it's not an excuse but our kitchen is slammed! Said nothing and did nothing. After waiting for over an hour and for how hungry we were I would have expected the food to taste amazing but it was bland and disappointing. We will not be going back for $70 for 2 adults and 2 kids! If you want amazing breakfast food go to Butterfields. Their wait to get a table might be longer but Butterfields food comes out in 5 min from when it's ordered and the food is delicious and consistent. I don't know how Butterfields kitchen is so efficient but Eggstasy needs to take note from their operations and table turn. Long story short Eggstasy was not worth the wait or $ for the quality of food and the lack of care with the manager and server. And the thing that made me most upset is the issue was never addressed or acknowledged. We had to say something in order to get a lame excuse.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2014-11-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'urn5wBRXvy5TwDHBlxG92A', 'review_id': 'EUIPcqKuUDVY2eHsRpJ3Cg', 'text': "Great breakfast place, reminded me of San Diego without the view,  very friendly staff, and food had great presentation and was outstanding! It's definitely going to be a place I frequent!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-11-02', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 1}, 'user_id': 'Qo4gt-eZ7VsCZRWsGIo_nA', 'review_id': '6w0ferebUEC5Kt5BTdQTYw', 'text': "This is the best breakfast place I've found since moving to Scottsdale! The food, service, and ambiance are all quite enjoyable. The service is very friendly and the servers seem to know their menu. The food is simply unbelievable. I couldn't ask for a better breakfast anywhere else. \n\nThe owner (possibly manager) greeted my friend and I and after discovering it was our first experience at the restaurant he brought us little samples of crepes. I wouldn't ever order crepes on my own but after trying these my mind was blown! I don't remember the name but I'm pretty sure they were banana and Nutella. My favorite part of the meal had to be the teas though. To say the food was amazing is one thing, but this little place was on point with everything, even that delicious tea!\n\nI can't wait to go back to Eggstacy for another amazing breakfast and experience!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-11-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rmPWX0TlKXZ1b0cyYO0-pw', 'review_id': '4elxVa7XOb262p1o1LIMdQ', 'text': 'For starters... The bacon is fabulous. I had the avacado Benedict, also fabulous. Great tea selection.... I do take away a star because the music was so loud. Which can be ok, but nothing ruins a fabulous relaxing breakfast like having to scream over a bad counting crows song', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2014-11-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'frDToS8oo993vdwTO7HqVQ', 'review_id': 'y-LZuwfTkWl71-MSR8CP5A', 'text': 'My first visit today. What a great 7 innovative menu. The pancakes are wonderful. Really friendly staff. The tile floors do make it noisy, but you do not have to worry about the table next to you eavesdropping. It will become a regular stop', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-11-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ukAIr2GhNX8S29DKCZOcAg', 'review_id': 'g5MW5uX13aQwofo6oC2X0Q', 'text': 'Great new breakfast spot. The menu is very elaborate and the only bad thing about this place is everything looks delicious. Lives up to how good the food looks. Great espresso machine as well. Very happy and will definitely be a frequent visitor to this place! My wife and I give it two thumbs up', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-11-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hfAsuSHqp2j-gaq_QPQO5Q', 'review_id': 'ddnGRMmFMA0d_gKCcIsshg', 'text': 'Amazing food, friendly staff and good atmosphere! They have done everything right. Perfect location, huge portions, family friendly pricing and best of all, most of it is made from scratch. Their menu mentions they will accommodate or at least try to accommodate any allergy or request. I would highly recommend this place! Better than any breakfast place around!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-11-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MaAKOJCxoo7XPBA-qR_OZw', 'review_id': 'LIInQYzpvt2hGPJ27DqaYQ', 'text': 'We were excited to try this, but our experience was less than the "surreal dining experience" promoted on the menu. Our party of two waited 25 minutes to be seated at the bar alongside people who arrived after but we\'re seated before us. We were greeted by three of the 8 or so people working behind the bar, none of whom offered us any beverages until I had asked three times for water and coffee. (Our server actually argued with me about my request stating that being seated is not a guarantee of fast service.) The beef brisket biscuits and gravy we ordered was actually sausage gravy, and the truffle French toast with asparagus and fried egg was good but not great. The highlight was the coffee, but not even that was worth the wait and poor service.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2014-11-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1HGPIlOKLdQhgetMTrnluQ', 'review_id': 'cL2VFP0YrCwLGmCt663wSQ', 'text': "Oh man, where do I start?  Finally hit this place up yesterday for brunch with a girlfriend and our sons.  Convinced the friend I was meeting today for brunch to go there instead of Postino!\n\nThe menu is fantastic.  We tried the prosciutto and asparagus flatbread and the pumpkin pancakes yesterday, and shared.  You get HUGE servings.  We had the prosciutto omelette today with a side of pumpkin pancakes because they were so good yesterday I had to have them again, and we shared again.  The kids tried the chocolate chip pancakes and were thrilled.\n\nCouple suggestions:\n\n-Don't sit at the bar unless you are in a hurry.  The service was WAY better in the restaurant.  Not thrilled with our service today at the bar.\n-The strawberry mimosas are great but only when stirred.  Ask for a straw and stir it up before you take a sip.  YUM.\n-Yes, it's loud, but that's part of the awesomeness.  It's super kid friendly and also adult brunch friendly.  Something for everyone.  Baby crying? That's okay!  Arguing with the husband?  That's okay!  This place will drown it out and you'll be so happy with your full belly and amazing food when you leave that you'll forget your woes.\n-Do NOT go there for the first time and not order the pumpkin cheesecake pancakes.  They are light, fluffy, and have a tad bit of salt so they are not as heavy and sweet as you would think a dish like this would be.  I can see why they are the signature.  WOW.\n-Their hash browns are off the chain.  Go with a friend, order any omelette (which comes with hash browns) and get the pumpkin pancakes.  They split it for you with no upcharge and it's enough food for 4 people.\n-Chocolate covered bacon.  Order it.  No questions.  Need I say more?  It's chocolate covered bacon!\n\nThis is our new brunch spot.  We've been loyal Four Peaks brunchers for years.  Glad to have a new spot to break things up a bit.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-11-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'x2YvACuYl25P9v-G4q27JA', 'review_id': 'wtD_us8N-xf9WFyr1_XWrw', 'text': 'They have a really cool layout with an open kitchen, an inner dining area that is kind of industrial-like in design and an outer dining area that is open to the inside, separated by the bar. \n\nTry the juice; it is DELICIOUS. Freshly squeezed and no additives, just plain pure fruit pulp. Yum.\n\nI had the pumpkin cheesecake pancakes, which were okay.  They tasted kind of pumpkin-y, and the cheesecake "sauce" was a nice change to the usual old maple syrup routine.  The problem I have with sweet pancakes, though, is that they\'re mostly indistinguishable from one another.  All the "fruity" sweet pancakes taste the same, and same goes for all of the "other" types - chocolate based, dessert based, what have you.  The good thing is that the pancakes are ginormous - like the size of a regular dinner plate - and you get FOUR of them.\n\nProbably will go again, and I\'m thinking of either getting something savory or going for one of the fruitier sweet breakfast options, like the lemon blueberry compote french toast.\n\nThe wait is LONG. You might as well just suck it up and chill at the bar, unless you have a ginormous group or a bunch of kids.  Parking is decent since this brunch place is located in one of those weird plaza areas like EVERYTHING else in Arizona.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2014-11-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '68zB7FYPFA8xy0UfHJGuPw', 'review_id': 'xaZUrE13wvR4Bg-_XCXhfg', 'text': 'This is a place that you to when you are really hungry or seeking to share. The portions are huge including the menu. It is hard to choose what to eat since everything sounds so good.  I had the brioche french toast, the bread is made there and each piece is at least 1 1/2" thick, my mother had a side of pancakes which in most restaurants this would have been a full sized order and it only cost $2.95. Can\'t beat it! Others in our party had omelets which were packed with various add-ins and comes with a side of pancakes. Even the coffee, which is Lavazza, is very good and your cup rarely has a chance to be empty since our waitress kept our cups full all the time. The service is great for such a busy place we had just the right amount of attention paid to our table. They have a great outdoor, dog friendly patio too. But if you go on a weekend be prepared to wait for a table, it is very busy and it\'s best to sit outside if you can since inside is very noisy.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-11-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZiHfgNRhmRSaL6po2YIQCw', 'review_id': '0rhuoevW6UQdMQrNSQvfsg', 'text': 'We loved this place.  Thanks Yelpers for giving us the idea.  The food was great, the service was awesome, and I loved the design overall.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-11-11', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'Oz_OVmCDUbwmnIMJ6Vf1-Q', 'review_id': 'Xxjxkk-wmI4NJVetvKNCVA', 'text': 'This place is awesome!!! The staff is super friendly and the food on both times we have been here has been so yummy!!! The best breakfast place we have been to and we travel for work!! This time we split a meal because the portions are HUGE!!! You will have left overs, so make sure you get something that will last in the car.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-11-12', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 0}, 'user_id': 'WflqWO_shOU-rydoal6z8A', 'review_id': 'g61T9lXAdJfV7RG48sDgjQ', 'text': 'Ok.  Yes, this place can EASILY be a 5 star with a couple of exceptions.\n1) the expeditor chewing on a straw while getting food out of the window. Really?\n2) the 12 year old hostess smacking her gum like a mule.\n\nFood was solid.\n\nchocolate cover bacon a win, house done hash browns were AMAZING! Apple taffy crepes yum!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2014-11-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Uq0RXGDR9cwpkcJtSYBVdw', 'review_id': 'b6SFAhhfBel9F4EoqCNl1w', 'text': "There is only 1 reason to rate this place anything other than 1 star, and that is, their food. They do a very good job with making large, delicious meals. \n\nWith that being said, they don't deserve anything more than 3 stars, at this point in time, because their service, wait time, and patio dining, are all subpar.\n\nService: After coming here 3 times now, I've had to wait 30+ minutes each time for my food to come out of the kitchen. Each time, I had to wait additionally after that for a set of silverware. \n\nWait time: It seems that 30 - 40 minutes is typical on a Saturday or Sunday morning here, which is fine for a busy place, so I can't really blame them for. They're just busy.\n\nPatio: It's November, and still fairly hot on their patio. It wouldn't be so much of a problem if they had shade coverings to keep their patrons cool. If you choose to move inside after something has opened up, you may be in jeopardy of losing your food, cause they have trouble keeping track of the table numbers and their patrons.\n\nOverall, I'd still recommend a friend to give it a shot, because their food really is good. Each time I've been here, I leave with a full and satisfied belly. Just frustrated through the process of getting there.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2014-11-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GMElfShKSfUzjru-fnCh8Q', 'review_id': '9L2m41I9uv9m2DAcnxgvdA', 'text': "We had to check this place out after everything we had heard about it. \n\nWe got there and were seated outside and there were misters above us that were leaking. \nThe service was a bit unprofessional and scattered, and I started to get worried. \n\nI ordered a skirt steak meal, and when it arrived I understood why everyone has been talking about this place. My steak was a bit cold, however it was absolutely delicious. \n\nSO- if you have the patience for it, it's definitely worth taking a chance on it.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2014-11-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '6UYA9U-L2PmaKJqmIj0smw', 'review_id': '7AM9vrCSJchuOOe6gE8njA', 'text': "Really neat space, but SO loud.  Could barely hear the person sitting three feet away from me.  \n\nThe service was super slow and there were obvious kitchen / server / management issues.  \n\nWe waited nearly 50 minutes for our food.  We weren't offered a discount, a drink or anything while we painfully waited while the staff was imploding.  \n\nAt least the food was really tasty when it finally arrived!!  Perhaps I will give them another shot, but not anytime soon.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 2, 'date': '2014-11-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2Iq_-vHSKWwlDyWpAEY1Hw', 'review_id': '7MfPztw4rogqzbYHFQa0NA', 'text': 'Pumpkin Cheesecake Pancakes may be one of the greatest things I have ever eaten in my life. They are a perfect combination of sweet but not too sweet. This is going to the top of my list of breakfast joints. Eggs were fluffy and nice large portions were served. Nothing like enjoying breakfast outside in the beautiful Arizona weather. There are some issues with service, not fast and not all that attentive but the pros greatly outnumber the cons.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-11-19', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'z8QsSViDvS5P2SaR8aRh5w', 'review_id': '2ZAm_Sslq1PsJYUC04Y6MQ', 'text': 'My friend invited me to try this restaurant with her since it got such great Yelp reviews. Let\'s just say it didn\'t go "over easy." Sadly, my visit wasn\'t as I expected it to be. Don\'t get me wrong it wasn\'t a bad experience but it wasn\'t great either. For all the hype I heard it was a huge let down.\n\nThe interior of the restaurant is designed very well and the overall setting is comfortable. The staff was friendly and the service was fine. \n\nLet me start by saying breakfast is one of my favorite meals. I ordered the breakfast panini with fruit on the side. The food was ready within a average amount of time. The sandwich itself was the most depressing part. My eyes gleamed with excitement as they placed it in front of me. I took a bite and confusion immediately set in. The meal looked so wonderful but the taste told me otherwise. Was this a wolf in sheep\'s clothing deceiving me? The only way I can describe it was that it just tasted bland, it was missing every flavor it listed on the menu. Specifically the eggs, they just didn\'t taste like eggs should and I\'m sorry my poor vocabulary knowledge can\'t give your imagination a clear picture of how it was. It included avocado, peppers, onions, and bacon I believe. I\'m not sure why, maybe because they cooked it with the other ingredients and it affected the taste? I found myself dousing it in Cholula sauce to help give it some flavor. The bread was perfectly crisp and was the only satisfying crunch. The side fruit came out on a skewer and I only had like 6 half pieces of fruit which was disappointing. The sandwich just wasn\'t that great, I only ate half and I\'m a non-picky starving 23 year old. My friends pancakes looked tasty but I didn\'t try them. I\'m sure something else on the menu would be better. It was my first time there, but I would only return if someone else suggested it.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2014-11-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'OpN1MhESDpc4_mPpx2Pd9Q', 'review_id': '8gHjEFEMEgHJK77754jSXg', 'text': 'Was a little tempted to give this place two stars, but thought there were enough good things that they deserved a three. The interior was pretty hip and cool, definitely fun to look at ha. The service was also good. Overall I was somewhat disappointed though.\nI was excited when seeing the variety of vegetarian friendly omelettes! It always sucks to go to a breakfast place where only one omelette is just veggies and the rest are meat. I went for the swiss chard, caramelized onion, and gruyere omelette with a side of pancakes and fruit (no pineapple because I\'m slightly allergic). The omelette looked unappealing when they brought it out, but I didn\'t judge it based on looks. I don\'t know if the cheese was just too sweet for an omelette and I didn\'t like that or what, but it left me with a stomach ache lasting the whole day. The pancakes were kind of favorless, not as soft and fluffy as I prefer my pancakes. They also brought me fruit out with pineapple, which i requested no pineapple, when I told the server she was apologetic and happy to fix it. She handed it to her coworker to fix and he said "Can\'t I just take it off?" and she said no, which I am glad about. They brought me a nice bowl of fresh fruit, but it was more than my friend had on his skewer!\nIt was a little pricey as well. Expected though, as it is a nicer breakfast place in Scottsdale! Overall, not very tempted to come back, mostly because of the stomach ache. There might be something much better on the menu though that I did not get so I have not completely written this place off yet.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2014-11-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Kcl95bO82e_fOE9Xv3shyQ', 'review_id': 'CFtkx9N4bh8ShjuLRRcRIw', 'text': 'One of the best restaurants for breakfast I have ever been too. Quality and quantity they have em both!!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-11-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kGPzMKbcpqk4TuYYa29uUw', 'review_id': 'WJMxvS1jPAIvV36UoLLwWQ', 'text': 'After going here for breakfast on Saturday mornings (mostly), for months now, I\'m sorry to say we\'ve seen a decline. The food was great when they first opened, but now it\'s sliding backwards. The corned beef hash was sooo amazing for a couple of visits, but then even the owner, Peter, said he didn\'t understand why it started tasting so dry and vinegary. Oh,well. We\'d just find a new menu item, right?\n\nI switched to the skirt steak, which is now a great cut of meat, but they always, and I mean always burn the outside. Too much "char" in that "broil" for either of us. I found myself having to trim a LOT of meat off just to get the black bits off. They taste really bad.\n\nSo, today, we went yet again (boyfriend is determined to make this place work, lol) and I just skipped the meat items and had their normally amazing hash browns, their multi-grain toast, and a couple of poached eggs. The hash browns were dry and over done, the toast was fine, and the eggs tasted odd. I think it\'s the seasoning they now use. Not sure if the green in my eggs was cilantro or parsley, but it\'s not good for me. I always ask for the eggs poached hard and sometimes they are, or one is, or neither is. lol It\'s really hit and miss with the food now. And I am finding myself just deciding that I\'d rather miss the whole thing.\n\nThe food issues are added to the continuing lack of sound buffering on the ceiling or floor or walls. When we first started going back in September when they opened, we cut them the slack all new restaurants should get...they are working things out, right? Yet at Eggstasy, they\'ve got tracks in the ceiling for acoustic tiles, but still no tiles. The cavernous loft layout, plus the House Music (I\'m not kidding), with nothing to absorb the noise makes for one deafening experience. Plus, we were freezing more than usual this morning as it was about 46 degrees outside and they wouldn\'t turn the heater on, apparently. I asked, and the staff said the owner won\'t do it, ever. It is hardly a cozy place for breakfast on a chilly day. Our server told us that no matter how cold it\'s been, the owner insists that their huge wall windows get rolled up by 9 a.m. Yikes. It\'s a neat feature during the warmer months, but not now. They were trying to do a patio service at the same time. Brrrr!\n\nSo, we sat there chilly in a very noisy space, yelling back and forth, with sub-par food. \n\nSuch a bummer. This place has potential to be amazing, but it\'s like they stopped trying.\n\nThe one really bright spot left is the staff themselves. ALWAYS cheerful (even the brunette Barbies that seat you. lol) and professional. Sadly, though, that can\'t make up for chill, noise, and spotty food.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 2, 'date': '2014-11-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'H3v53KaexhGmS2f3KK8HqQ', 'review_id': 'rVPtUtHojwTHZ-2PZxP66g', 'text': "Delicious food + grapefruit mimosas + a bartender that looks like Jon Snow = an amazing Sunday.\n\nI typically don't comment on servers/bartenders looks because that invites all sorts of attention, but DAMN the bartenders here were some good lookin' boys. \n\nAnyway. I'm engaged. Ahem.\n\nMy best friend lives a couple blocks away so we walked over on Sunday morning. It looked like there would have been a lengthy wait, but they had 2 seats open at the bar outside, which was perfect. We made friends with the salty old gent to my right and proceeded to peruse the menu, which had MANY options. I was almost overwhelmed.\n\nWe ordered:\n\n- Chocolate covered bacon: Do it. Don't ask questions. Thank me later. (You're welcome.)\n- Joe P's Protein Cakes: Gluten free! Berries! FOUR OF THEM! (Too much, if you ask me.) They were very thick, so if I had known there were 4 of them I might have ordered something smaller.\n- Chicks in Blankets: Chicken sausage inside pancakes. Yum!\n- Coffee: my first cup wasn't that hot but the second one was, and both were delicious.\n- Grapefruit mimosas: Just the right amount of bitter and sweet. I could have had a few of those without thinking twice.\n\nA great thing about the bar: there are hooks underneath! I always loath having to hold my purse or put it on the bar, so this was welcome.\n\nMy ONLY complaint is that it was sometimes difficult to get the attention of the servers/bartenders. But they were nice to look at so it really wasn't an issue.\n\nTL;DR: Decently priced, delicious food and drinks, but sometimes the wait might be long.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2014-11-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'pEVf8GRshP9HUkSpizc9LA', 'review_id': 'n6kvUIEXSEJBQ2vT53h5Rg', 'text': "This place is tied as my favorite breakfast place in the Valley...Morning Squeeze, Snooze and now Eggstasy!  \n\nGreat atmosphere both inside and out, friendly service and an extensive menu of delicious food.  I tried the leek, goat cheese and chicken sausage crepes and absolutely loved them!  They don't skimp on the portion size either, so you better come hungry.   \n\nI will definitely be back to try some more tasty items from Eggstasy!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-11-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vtedgK7wCKBqRyPOh6alPg', 'review_id': 'GvbBvOgwTua266aQQKaeLQ', 'text': 'Sadly this place has gone downhill since my last visit.Quite simply there is a lack of management and expediting in the kitchen. Also they are skimping; for example fewer ingredients in an omelette. Sadly, they are no longer competitive with other venues . The patio is very pleasant. Their pancakes used to be great; now they are hardly  edible  .', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 2, 'date': '2014-11-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Lh6aF6wD-yW__iTrwuWSyg', 'review_id': 'GQFsxJPBPZdXvN8806i61A', 'text': 'The ambiance and the food at this place are top notch, but the service leaves a lot to be desired. As I said, the food was incredible (I had the best omelette of my life). I loved the bright indoor/outdoor space and the modern details. Our waiter was very friendly and was clearly trying hard, but the whole staff seemed to struggle with the volume of customers. The kitchen timing was way off - for example, all of our dishes came out as once except for one, which took more than a half hour to arrive after everything else. At one point, a second waiter brought over some plates. We started explaining what went where when he rolled his eyes, slammed our plates on the table and said, "I\'m too busy," before running off. It was so inexplicably rude. At the end of the meal, our waiter kindly explained he hadn\'t charged us for our coffee, but "didn\'t hear" when we responded that we had purchased our coffees at the car prior to being seated. I would probably go back for the food, but I will expect to have a long wait and potentially rude service.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2014-11-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xrJ9HH4oXFx_zostKkGQhA', 'review_id': 'eNh8bl8xrXkW6gK1wuOoHQ', 'text': 'Pretty disappointed.  Over crowded,  omelet was dry, and waitress not very attentive.  Most of the people I was with were not very happy with their meals.  Portions were very substantial, that is a plus.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 2, 'date': '2014-11-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '2DwoohdrBwOFFK8fKQ2t-A', 'review_id': 'iHE-u6YnhndJy2Mz5GuDgA', 'text': 'Not what I expected. The service was soooo slow and the food was just OK .   It took about an hour to serve us our food.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2014-11-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'Jvg0Iv2a67hjZqVdyF4aAQ', 'review_id': 'kHQst6lvO-xIjl--eRygDw', 'text': "This place is beautiful yet the food was mediocre. We left there and we were very unhappy! The food took forever to come out (being with two young kids was not fun with the long wait), our bill came out to $80 with tip ( 2 kids and 2 adults). The omlete was over cooked and didn't taste good at all (don't remember what the name was but it had a balsamic glaze on it). Never again coming her again!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2014-12-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Kqvfep2mxS10S50FbVDi4Q', 'review_id': 'S4vApuR-w7EbouwteVLgOw', 'text': "I've sat at the bar twice now for breakfast and had a good experience both times.  I can see where they can get packed on the weekends but I like to go midweek to avoid the crowds.\n\nMy favorite is the incredible omelet with bacon, sausage, ham and some veggies.  Make sure to order your hash browns crispy or they can be a little mushy.  It also comes with a couple delicious pancakes on the side.\n\nTheir coffee is above average.\n\nOverall, I like this place a lot.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2014-12-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'hIaNop5Vxu2iAP01WHcXzA', 'review_id': 'uVgMvmZa_EUqGLRRxB-i1A', 'text': "Food is delicious and for a Sunday morning the wait wasn't too bad. I called to make reservations and then when I got there they said they don't even make reservations for 2 people so that was annoying and the waitress was a little off. But other than that its a cute and clean place! The portions are very big and they have unique breakfast selections.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2014-12-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'YbDZ-QkckZlf0BMqQ0j16A', 'review_id': 'ffHC1HyFNH9xSRs4r2BKlg', 'text': 'Love this place. Great variety of quality food and a fun atmosphere. The pancakes are out of this world', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-12-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '64zr0ya6XxOYGZ4ao3WZ-Q', 'review_id': 'fNSzh-dUsYoDtFL6CQF5fg', 'text': "Went here on Friday morning as my GF and I are looking for a solid new breakfast place in Scottsdale.  Many have been tried, none have succeeded so far.  So we found Eggstasy.  Let me say this first...it wasn't terrible.  The pancakes were decent.  The Ultimate Omelet that we had was very fresh tasting, which is a plus.  The food was actually fine.  So why the 2 stars? (Really, i would have given 2.5 if I could)  I just didn't like the atmosphere.  What is it with places in Scottsdale that have an overall douchey hipster feel to it?  It a breakfast joint for God's sake!  Why the need for the odd christmas decor? (upside down christmas trees?) And what the fuck was up with the 'coffee'?  It's some sludge that couldn't be fixed.  Fucking awful.  The little ray of sunshine that was our waitress wasn't all that great either.  Most places I don't think that are that great, I just don't go back to, but I want to give this place another shot.  One more note.  If the old lady who came around to say hello to us happens to be the owner, please take a moment to appear as an owner, and not some other customer just making the rounds.  Nothing about you coming to our table made me feel like you were the owner of the place, considering all I saw you doing before was sitting at another table across the way, as if you were just another customer.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 2, 'date': '2014-12-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JZ6_kjBllMWPCPx5_lo1Ug', 'review_id': 'Zlm3Y4HDbykZtHk4xxDF2w', 'text': 'Been here 9-10 times.  Shout out to Michele who got my order perfectly.  \n\nUpbeat atmosphere, a little sparse.  It is noisy, but hip vibe.  Everything from your basic eggs, toast, bacon to exciting omelette combinations like swiss chard/swiss to fig jam & goat cheese. I always order the Skinny Bitch which is a whole wheat tortilla, tomatoes, spinach, lowfat cheese & egg whites with a tasty fruit kebab.  My son ordered the apple dutch French toast.  Hoping someone with me will try the nutella/banana pancakes sometime.\n\nFlavored iced teas & water carafes filled with cucumbers.  Great service on refills.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2014-12-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PO1ltYV-goYle0hzyNZGTw', 'review_id': 'fn4-_Ob2ysk-nB8pY7YKvw', 'text': "I can't say enough about this place.  Junior was really great as well, even though he isn't a fan of the Seahawks:)  \n\nThe food was as good as it gets, Thank you for a great experience.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-12-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'rk3YuRfYz2N6QddxVY3pTQ', 'review_id': '1RNnH6XScOdBLqumPyOD4Q', 'text': 'Finally a new breakfast place!  But oh, the disappointment...\nHave tried Eggsasy 3 times, hoping each time that the next visit would be better.  \nThe decor was great, but wish they would have put as much effort into the food.  \nHostesses dressed like nightclub cocktail waitresses at 8:00 in the morning?  Um, ok.\nMenu was very large and had lots of options, unfortunately it has gotten them in trouble, as nothing I have ordered was any where near delicious.  Super loud in the dining room.  And very exspensive for sub-par food.  This kitchen needs to revamp the menu so they can focus on quality, not quantity!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2014-12-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mQgkD4pi_u3ru5dxCS3a3w', 'review_id': 'o-SAuAEMrF_aJP8HYqgbmw', 'text': "Love Love Love this place!\n\nSeriously, if I didn't live so far from it, I'd be here everyday for breakfast.\n(maybe it's a good thing I live far then)\n\nNice ambient style breakfast diner. Original, yet comfortable and ordinarily fitting.\nFrom the moment you walk in the door, everything is EGGcellent!\n5/5 \n\n[ Keep up the good work guys! ]", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-12-22', 'type': 'review'}
{'votes': {'funny': 5, 'useful': 2, 'cool': 1}, 'user_id': 'UoBfwbXaixelZBghbJ2cSg', 'review_id': '3vP6fyswSGW1YrXPLGaDiQ', 'text': 'Have you ever been at the club, feelin\' fly in your shortest dress and sparkliest hooker glitter makeup, and been like, "dang! I could really go for pancakes right now"? But, if you went for pancakes, you\'d lose your buzz and maybe your random hookup? No one should have to choose between getting drunk, being seen/getting laid, and pancakes. Thank the sweet baby Jesus for Eggstasy. \n\nHoused in an innocuous appearing strip mall in Scottsdale, Eggstasy is truly like having breakfast in a nightclub. The "hostesses", who clearly look to the Kardashian family for fashion guidance, look at my handbag when I come in, not me. The space is pure Ikea, sparsely decorated, cheap and cheesy. While walking to your table, everybody is checking everybody else out hard and not trying to hide it. It is a goddamn fashion show -- stupid, but entertaining.\n\nThe coffee totally sucks and is barely edible -- super burnt and bitter. The servers are nice but overwhelmed; orders go in and come out wrong; empty cups go unfilled of shitty coffee. Twice in row, they\'ve given us food that was ordered by mistake, saying "oh, just have it, don\'t worry about it". It is noisy; it isn\'t cheap. It is crowded; be prepared to wait.\n\nSo why the hell four stars, you\'re asking. One: The OJ is juiced on site and is incredible. Two: the whole wheat and berry pancakes, from the HEALTHY part of the menu, are literally the best fucking pancakes I\'ve ever had. It must be the whole wheat, it gives them a little more heft and texture and allows them to get all perfectly crispy around the edges. Then they pile on mountains of fresh berries. I mean, really -- I am powerless. Three: It is way too much fun to play "let\'s traumatize the Scottsdalites" by showing up in pajamas and no makeup just to see the looks on their buffed and powdered faces. Four: the owners, a Greek family from Chicago, are always there, checking in and getting their hands dirty to help out. I love that. Plus, Greeks from Chicago? They make the world\'s most amazing food.\n\nLastly, the Bloody Marys look amazing. Is that chocolate covered bacon in there? If I hadn\'t already resigned myself to be so uncool as to admit to disliking day drinking, I would be all over that.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2014-12-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'RGKsDTsV3aVvD8AaZfD6Hg', 'review_id': 'xH1grlZKpCB3HVFO5EAKNg', 'text': 'Holy fuck! They give you lots of food so go hungry or hungover or both. The omelets that my husband and I had were both good. My husband ordered his with a side of pancakes which we ended up sharing. The fresh fruits were great too. Oh and they have Kaseri cheese which I saw absolutely nowhere else in a menu anywhere in the state. Not organic.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2014-12-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CBnQuuZXBMTaXW3yvPlRMw', 'review_id': 'WuQ6aLHBstVhQRs3wj0d1Q', 'text': 'This place is LOUD. Went hear for breakfast with my in laws when they were in town. We had reservations and were seated promptly which was great. Overall I would give the service 4-5 stars - our waiter was attentive and the staff was courteous the entire time\n\nHowever, I would say the food was just average - we all got different items and none of them stood out. The corn beef hash could have come from a can, the croque madame needed way more bechemal for the mountain of bread, the bene was fine and the eggs OK. THe standout was the bacon which was fantastic overall - I would come back to try the chocolate bacon but that would be it.\n\nDefinitely better options for bfast in the area but not a bad spot by any means.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2014-12-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cO3XnfP2vYJZFROSB4I3cQ', 'review_id': 'DO4jvjzE5O1ewYxvwPAzoA', 'text': u"After a little wait fighting off the Scottsdale cold we were sat down at a table in the sun to warm up before the meal. My girlfriend ordered the eggs, corned beef hash, and pancakes while I decided to go all out with the Dutch Apple French Toast with a side of chocolate covered bacon. Let me first say that the strawberry mimosa and fresh squeezed orange juice were just incredible but back to the main event. The beautiful presentation of a half chocolate covered piece of crispy bacon with chocolate drizzle, whipped cream and strawberry was a great start. And then the French toast arrived...Thick French toast covered in caramel, saut\xe9ed apples, and graham cracker crumbles, best French toast this side of France, if they even make French toast over there. More food than we could reasonably handle but it won't deter us from returning again. Next time, crispy pancakes...in the eternal words of Arnold Shwarzeneggar, who is not French, I'll be back.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2014-12-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'D0ZTDnjsXdKDHd5UM9XZiA', 'review_id': 'r-_O1vdSavQy8nuD1f0PlQ', 'text': 'I really like this joint, with HUGE portions and a really interesting menu....something for everyone. I had a proper eggs Benedict and my date had corned beef hash and eggs....the hash browns are delishooooo and the bread is extra special, certainly from a local bakery and thickly sliced. We had to try the grits and they were really good...cheesy and chorizo, but we could not eat them all. Split them if you have 4 people. Reason for 4 stars? Dirty coffee cup, fork, and glass. Nice bright new place with dirty dishes?!?!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2014-12-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'LgKS6d0BrMC_eRcHaofKwg', 'review_id': '8uYa2w1G4wOaEVzaGezVLA', 'text': "How this place has 4 overall stars is beyond me.  I took my son here a few weeks ago & I'm still ticked off about our experience.  First off, let me start with the only positive thing I have for this restaurant...it has a very cool modern look and feel, which I like.\nNow for the rest of our experience...the music is so loud you can barely hear anything else, so I opted to sit outside.  The patio is quite large, but has absolutely no shading from the sun, it's Arizona, the sun is out 95% of the year!  I had to move my son 3 times to try & keep the sun out of his eyes.  Next, it took over 10 minutes for anyone to come over & greet us, and take a drink order.  When the waiter finally came by, I could barely hear him or understand him because he was talking so soft, I swear he was on something by the way he was acting.  I asked if we could go ahead and place our food order since my son was getting really hungry & restless.  I ordered buttered noodles for my son and bacon and eggs for me, it took 40 minutes to get our food!!!  The place was not even that busy.  I will say that the eggs were really good, but when I picked up the bacon, the grease dripped off in a huge puddle, like it was not even drained off, yikes!  Now for my son's food, he will eat just about anything you put in front of him, but as soon as he put the noodles in his mouth he spit them right back out, I have no idea what they did to them, but he just wouldn't eat them.  I told the waiter when he finally walked by again that he just couldn't eat them & asked if I could I order something different & he said that was fine & he said he would take it off the check.  I asked him to see if they could rush it & 25 minutes later, still no food for my son, I called the waiter over & he said the kitchen was really busy & couldn't give him a timeframe as to when the food would be out (again, not a ton of people in there at this time), so I said to just cancel the new order & asked if I could have the check.  He brought the check & it still had the buttered noodles on it, so I called him over again and reminded him that he said he would take it off, he then proceeded to argue with me about taking it off the check, I asked to speak to a manager & he told me that no managers are employed there...what?!?!?!  He finally got snarky and said he would take it off.\nNot a good experience at all for us or for the other 4 tables around me from what I observed.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2014-12-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hWsJD-JLR8HUUBsvSGeRfQ', 'review_id': 'kXV1QPI6BerrW68pelPslQ', 'text': "Just had brunch...nothing eggstraordinary (pun intended)!  Hot chocolate was cold, service was a tad slow and Dali's omelette was boring!  If you are wanting brunch, there are many better places in this part of the world.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 2, 'date': '2014-12-31', 'type': 'review'}
{'votes': {'funny': 9, 'useful': 20, 'cool': 16}, 'user_id': '0bNXP9quoJEgyVZu9ipGgQ', 'review_id': '3TiZSn2L3_CNRV019Be5bQ', 'text': "First visit today, and I was not impressed by the food.  Service was very good, though-- look for Shea, and at least for this morning, he was at the bar/counter.  I came in and was surprised by the number of people waiting outside (it was very chilly!), and even more amazed to see the line of people waiting to be seated inside.  And then it hit me, it's a Saturday-- I'm usually at work at this time.  A Yelp friend even warned me last night about the long wait times on the weekends, but I was dining solo, so I figured I could wait for a spot to open at the bar.  I ended up waiting for four minutes-- not too shabby!\n\nFound out that the chocolate syrup in the cafe mocha is Hershey's (corn syrup), so I opted for a cappuccino. http://www.yelp.com/biz_photos/eggstasy-scottsdale?start=100&select=LQ43uEfOvZzDUBGcY_q4hA#LQ43uEfOvZzDUBGcY_q4hA  LavAzza is the coffee sold here, and I like LavAzza, so far, so good.  Shea was nice enough to provide me with some receipt paper so that I may jot down a few of the entrees I had questions about, and he gave me his suggestions from the list of items I wanted to try, and I ended up ordering the Lemon-blueberry French toast http://www.yelp.com/biz_photos/eggstasy-scottsdale?start=100&select=CXV8FUkYF-yixQdKW1BIIA#CXV8FUkYF-yixQdKW1BIIA and Fried truffle egg toast. http://www.yelp.com/biz_photos/eggstasy-scottsdale?start=100&select=J1on-3kAP9IHxQNws194sQ#J1on-3kAP9IHxQNws194sQ  As I mentioned, I wasn't impressed with the food.  First of all, the presentation of both items wasn't pleasing.  There's a reason I posted so many of the Fried truffle egg toast, and that's because no matter how many times I spun that plate around, I couldn't get a decent shot!  Also, the plates were not staged in the best way, but then again, perhaps there was no way to make them appear any better...  The pancakes were sweet on their own, but I added the last bit of pure maple syrup that the kitchen could spare, and it tasted a bit too sweet after.  They usually come with blueberry compote, so I'm assuming it was omitted due to my corn (starch) allergy.  This dish needed a cream sauce to add another layer of texture.  Otherwise, it felt like moistened and heavy pound cake to me.  The Fried truffle egg toast needed more salt, but I was hesitant in adding any more, so I added Tabasco sauce, instead.  The two eggs were sunny-side up and gave the brioche a nice color, as well as good mouth-feel, with the combo of fried bread, egg whites, and melted gruyere.  This dish needed something else, though, besides seasoning.  Some Canadian ham, perhaps?  Or a few slices of extra-thick bacon, or two, or more cheeses?  Yes, this dish, as well as the pancakes, had the makings of something great, and today's offerings do not make me want to order them again.  Two lackluster entrees at the same sitting normally wouldn't make me want to visit again, so why am I eager to go back?  Because of the cool service Shea gave me, of course!  First, he never made me feel like I was an imposition, asking so many questions and sending him to the kitchen with a list of concerns (better than asking him to memorize the questionable ingredients and the four entrees I had my eyes on).  Second, when I asked him what kind of chocolate enrobed the bacon I spotted on a neighbor's Bloody Mary http://www.yelp.com/biz_photos/eggstasy-scottsdale?start=100&select=iiKKb5DG5ApDBjBUEq3-pQ#iiKKb5DG5ApDBjBUEq3-pQ, he guessed Hershey's syrup, as well (I guessed Valrhona, or something similar), but offered to double-check with the kitchen and came back with an apology that it wasn't Hershey's (I kinda knew), but a Belgian chocolate.  But wait, here's the kicker... he excused himself while he grabbed a saucer and napkin and reached into the mini-fridge for a slice of chocolate-covered bacon for me to try (shh! don't tell anyone)! \n  What service!  Now, I haven't had a chance to taste the said bacon slice, but I plan to ask for Shea's section- hopefully it will be at the bar, where the wait time is shorter- whenever I stop by!  Oh, and third, Shea offered to give me a cup of coffee to-go, which is probably a standard service here, but still a nice touch!\n\np.s.  The cappuccino was very good!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2015-01-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oLTp-h0--EdymJvfk2wZiQ', 'review_id': 'Ib5Rrltc_WV2JGCkdhHcXQ', 'text': 'Just stumbled upon this place by chance on a Sunday morning. Long wait is usually a good sign. The food was excellent. Very creative spins on the usual stuff. I had the stuffed brioche French toast and my wife had the salmon omelet. Both were excellent and had so many side dishes we have enough leftovers for dinner!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-01-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fxT9Fk628H4mw7WNHuPn7Q', 'review_id': 'NYChBy0IXTgf_IFNs_jWmg', 'text': 'Went to Eggstasy to celebrate my birthday.  The three cheese omelet with the requested gruyere as one of the cheeses was outstanding-way too much for one person since it came with pancakes and hash browns but managed to eat most of it.  Husband ordered eggs bene and was pleased except perhaps a little too much mustard in the sauce. Daughter mentioned that it was my birthday so also received complimentary pumpkin pancakes - delicious.\n\nKelsey was our server, and she was the best! Attentive, pleasant, and efficient. Kudos to Kelsey!\nYes, the place is noisy but not so much that we were bothered. The food was so good -  we enjoyed a delicious breakfast. Will most certainly return.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-01-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'EzwWUHy2_nL7e8WVTlIieg', 'review_id': 'CzO78BRUeFWi47utXcDc1g', 'text': "Huge omelet portions and fresh squeezed OJ. If only I wasn't working I would have loved to taste a mimosa. The food was delicious; the menu is quite extensive. They have a pretty big outdoor patio that from what I heard gets pop'n for brunch. A must try while visiting Phoenix.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-01-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'iAD9GVUI8m5KaHgi1CnJBQ', 'review_id': 'DDrunFtIM7MKcu9dvRUviQ', 'text': "I tried eggstacy this weekend and it was great. The menu was huge, which is great for picky eaters. There are a ton of things I could have tried. I went with the waffles, eggs and bacon. Great all around. I loved that the fresh fruit was in big chunks and nothing gross or wimpy like those generic little fruit bowls with Honeydew.  \n\nThe look & feel is great. The only exception is the group of tables next to the large kitchen opening, I wouldn't want to sit there, or at the tables that are essentially right in the doorway.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-01-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'keq_CFBEirjtFKs9l9i0AA', 'review_id': 'zyVvKzHu8TsYDuuB6BzHbA', 'text': "Cool and good place for breakfast. Gets busy on weekends about 930am so go early if you don't want to wait. Menu is quite extensive with different flavors. Mascarpone cheese and Caramelized pears in an omelet? Who'd a thought? Definitely be back.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-01-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tlQ4pLFSGzw3Pn8xsXYFOA', 'review_id': 'FwZIRb6L5lfctG2GA01CZQ', 'text': 'New breakfast place on the Shea corridor. They have some real unique dishes with a European flavor. Really good coffee tho it can get a little loud in there. Get there by 10am or you will have a wait. Enjoy!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-01-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ru9-V2yO813OLwhLrhzHcA', 'review_id': 'IWOirzk2eWVo9WJ3wMfusQ', 'text': "DELICIOUS! really great service and HUGE portions. Very fresh and hip atmosphere. Lots of attention to detail. There is a huge out door seating area lots of interesting flavors for pancakes. I really wanted a coffee but didn't and the espresso smelled SO GOOD. This place is great!!! We went on our lunch hour and it was quick service for a large group!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-01-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'zcgF4YADQWUcchqlCsPypQ', 'review_id': 'Hg8-4XBfrNpVDW7wwN1jIA', 'text': "Food is flavorful. Service is prompt. I don't recommend for a breakfast meeting spot. Omelette are yummy", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-01-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'OrkXYCH82NnidREHsGn4uQ', 'review_id': 'HSawu-Pfw3qUGzT29nc4jQ', 'text': 'This place was a real surprise. Was super crowded but we were seated on the patio right away. Great breakfast food and had turkey and chicken sausage options. Check this place out!!!!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-01-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CGWm3c1Q-zei_zvsMX6WTA', 'review_id': 'V9F1K6I9e7DS3-pnWBBZUA', 'text': "Best service, incredible amazingly delicious food.  I have tried many breakfast places but this will definitely be my new forever home. The menu is for everyone from gluten free, healthy, to kinda bad and just straight so dang good it's bad for you!  Love this place!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-01-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'sDicKzDigarYqWHgHyNk9Q', 'review_id': 'BUGgu1gSK7m1TcTLHeymuQ', 'text': "Got to put our name on the list before we got here. Only waited about 10 min. Bloody Mary and coffee is amazing!!!! Some vodka I have never heard of and I usually go topshelf, dunno what it is but it's great. Coffee is imported from Italy and very bold.  Amazing! Food is 5 star as well. I got the panini and it was perfect. Huge! Girlfriend got the chorizo skillet and it is equally as good. Damn! Yum! Service was very good. You wouldn't even know it was packed cause the staff is on it! We'll be back!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-01-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'FB5y4CbqJzX3r7zELc7SqA', 'review_id': 'mondhgO7F3qV1rDxA13Iyw', 'text': "Service was terrible. We waited 45 minutes to be seated. We were told 30 and that's fine except for when a lady walked in who appeared to be a regular, gave the hostess a hug and asked if she could find her a table for 3 and was seated right away. It was frustrating because they have a limited number of seating for two people so larger parties were being seated before us. Once we were seated the service was very slow and we only saw our waiter twice. Once to take our drink order and once to take our food order. Once we got our food my boyfriend asked for maple syrup and never got it. Also, we observed that the table of four next to us who were seated way before is finally got their food and we were already done. What?! The food was ok. The experience blew.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 2, 'date': '2015-01-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WFgmr_fYTGFPbVNPyVCi3w', 'review_id': 'GEv8EIUwukPKaqtHkqKF_Q', 'text': "Update, 19/1/15 \nPros\nCan't stress enough how good the food is and the big plates that are full with goodes. \n\nCons\nHowever the service is very slow and not good enough. \n\nPlus it gets very very loud for some reason.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-01-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '67laV9h8zt7efuBZeTFmeQ', 'review_id': 'CgP-FhLE7M6qP3H5vpAxVQ', 'text': 'A delicious breakfast complete with mimosas.  I had a very nicely prepared salmon benedict.  They allowed me to add spinach to the benedict and the spinach was fresh.  Nice.  Excellent service.  Fairly quiet dining area.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-01-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MRIPbO8Vqx36eLdKmTg8aw', 'review_id': 'moMAx8_jp_w-wy5SKzn1RA', 'text': "This place has a cute atmosphere and a very extensive menu. I've been here twice - service has been consistently friendly but on the slow side. Don't go if you're in a hurry. The food has been good during both visits and portion sizes are huge, good for sharing. \n\nThe restaurant gets very crowded on weekends - there has been a wait both times I've visited. The space is open and can get pretty loud. \n\nThey take their chocolate covered bacon seriously - they even put it in your bloody mary.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-01-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ibsA3kDEsu9h4wOVcuXXvQ', 'review_id': 'lB0Q1b-pV9_IBGtyZrFgKQ', 'text': "The food is good but I don't think management knows what they're doing.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 2, 'date': '2015-01-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'bJLdwu-lajcGwf1gxEVD1g', 'review_id': 'pPjeYYCMKWiZYpvFBBzbJw', 'text': 'This was my second time to Eggstasy. The first time was their first day so I kind of shrugged off the slow service. Just went again and the service was still terribly slow. We were starving and it took a whole hour to get our food. They were really busy, and I understand that, but that means they need more staff. I give 2 stars because the food really is extremely delicious, you just have to wait a while for it. I hope this improves soon because it is in a great location.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 2, 'date': '2015-01-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Xho9EiuEW1BYrZcEB0Ddng', 'review_id': 'dPmHDz8WkxP1QRCewiz1Tw', 'text': 'Went on a Sunday morning. Waited 20 minutes for a table, which is okay for a busy time. Got seated at the table by the door where others are standing and waiting, so we had people standing next to us. Waited about 10 minutes before the server came over. Then waited over an hour for our order. Server said the kitchen lost our ticket. Paid $40 for basic french toast and crepes. Overall not a good experience. Food was just okay. Will not go back.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2015-01-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Vh5k4r6OTX51TJZSGs57bQ', 'review_id': 'HKOLI31N9vQZOcUPIAxamA', 'text': "I tried this place cause my friend recommended it highly and I was not impressed.  The food was mediocre and the atmosphere plain.   They have unusual items, which I tried and it wasn't very tasty, just blah.  I won't be going back.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 2, 'date': '2015-01-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vO14FeLhQf2Vz1u2KtYIRg', 'review_id': '1uP_zItCAQdrRh3gRvC70A', 'text': 'Food is amazing! Menu is HUGE! Almost too much to chose from. Pay the $2 upgrade and get crepes or Nutella French toast. And the best part is the staff is super friendly and the owner is always there to meet and greet. What more could u ask for??', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-02-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Hv-wNIW-f1sU2kykRfF8aw', 'review_id': 'QXSxA1OHqBxTGce74lROfw', 'text': "Great first experience here. We sat outside at the bar. Awesome bartender; even though they were extremely busy, he took care of us. Bloody Mary's are a must have, specially when it comes to the chocolate covered bacon. We got the garlic and almond omelet but we're coming back for the skillet.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-02-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0bRaX5SsrMAx2pt4c1gHng', 'review_id': 'gw-I6u3jNtpwoS9ZD3rMcQ', 'text': "Just went here for the first time with a co-worker...it was excellent! I love waffles, and these were light and crispy, with fresh strawberries on top. And I was pleasantly surprised that it came with a large skewer of fresh fruit on the side. We only had coffee, but they have a pretty extensive list of fresh squeezed juices I'm looking forward to trying. Atmosphere is bright and the vibe is great! Very friendly staff that were right on top of everything we needed, despite being packed with people. Extensive menu that will appeal to just about anyone. Love this place!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-02-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'jhFs50aXeqCdWw0SQD_MZg', 'review_id': 'tDi6bZd5q7my5iHxbiUwEA', 'text': "Love this restaurant! The salmon, onion, chive omelette is a fluffy, delicious delight. The pancakes are also perfect- sweet yet light. I was charmed by the ambiance & decor as well. I adore breakfast/ brunch and this is most definitely at the top of my list for brunch hotspots in Phoenix/Scottsdale. The menu here is insanely diverse & there's truly something for everyone here!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-02-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MI-uWv-pSrj448vzTrS4yA', 'review_id': 'lJvcEd2nJpSM1WDFC9jqdg', 'text': "We have been to Eggstacy a few times and have always loved it.  The food is amazing--fresh and well-prepared, with large portions.   Our server Shea was the best.  Here's a hint--order the multi-grain toast with your breakfast  It's delicious.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-02-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'bbX_h39g3_PxXXcjbE_Vnw', 'review_id': 'NWvg-IxpR2L4z3WMjDvHnA', 'text': 'This place has the best breakfast in Scottsdale and hardly the wait you expect in Old Town. Friendly staff, great food, and awesome atmosphere.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-02-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '0EY9rt4QYSoHgTXlbPk8pw', 'review_id': 'CKkMbheopduliwwrNKDksw', 'text': "Positively, one could say the menu is extensive (and somewhat adventurous) and much appreciated in the area. Truthfully, it means the kitchen is over-extended. Over an hour to get our food on a Sunday morning, and it's not worth the wait. While the omelet filling was tasty, the eggs themselves tasted powdered.  French toast was dry. I think the name refers more to the tripping cooks (who probably used a toaster for the French toast) than how you'll feel. \n\nThe patio is nice. And the decor is nice in a CB2 kind of way.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 2, 'date': '2015-02-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZEq3FChMJXDbRYHVoaATRA', 'review_id': 'g-XtHJlz0fEiWd_YOOwyWQ', 'text': "Oh my goodness! Seriously amazing choices for breakfast! My hubby and I went last Saturday and sat at the bar. The other reviews are right about the service being a bit spotty at the bar, but we weren't in any rush. \n\nWe ordered lattes and they were small, but the amount of food you get makes up for that! We had the pumpkin cheesecake pancakes as a side, salmon omelette and portobello Benedict. Oh yeah.....and a side of chocolate covered bacon. Needless to say, I didn't need to eat for the rest of the day hahaha. \n\nAside from ordering WAY too much food, it was all excellent! When I go again, I will try all new items since there were so many amazing options. Will be back!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-02-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dQ3xJ39SFm7I8MRvjgxfjw', 'review_id': 'ZturH7OIUQMb0XAs9hBD6Q', 'text': 'Stuffed French toast terrible! Very dry, sent it back and just got yogurt with fruit, nut bread that came with it dry too! Not happy with this place and it was my first time!!!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2015-02-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HslmxC2ZfCUATBzUTbzWpQ', 'review_id': 'ObNoIUf4jZwlbMpybrMumw', 'text': 'This place is amazing!  Why go anywhere else for breakfast or lunch?  So many great options beautifully presented in such a cool looking place!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-02-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'pitcseZJ_USj3tS5i1x9dw', 'review_id': 'PlvXsq6fiHhWN6SuhFx1Sw', 'text': 'So this is my third time here. Both previous times I have complained on yelp about how slow the service is. On the weekends, forget it, you will wait for an hour if you are lucky. But the other two times it was middle of the day on a weekday. Not too busy. Food took 45 minutes for one thing. Today I was told 15 minutes after I ordered a Turkey burger that there were no more. So I ordered a shrimp salad. A few minutes later the manager came to me to apologize but they are out of shrimp. Im not sure how a kitchen doesnt communicate this to staff???? Anyway, I gave them 2 stArs because they are friendly and the food is usually good. But I wont be coming back again!!!!!!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 2, 'date': '2015-02-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MDBiTisANuswFF7oH63Apg', 'review_id': 'A9gI9Mj9ojc92bF7NpxMgw', 'text': 'Me and my home girl went there yesterday and had  a decent breakfast.  I will say that the patio looks great and I would return just to hang out on it.  The food was good.  Brown eggs... need to up there game here.  But the pancakes were good.  Training server made a mistake and gave my vegan friend salmon instead of avocado but they corrected and it was ok.  Took off a coffee for the mistake.  The menu is huge.... Too huge if you ask me but it was a good experience.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2015-02-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xdYphPCFlkk7UD0Gq72rkQ', 'review_id': 'zS-BVNLgNl3xu7DriyZZig', 'text': 'The atmosphere was the best part of this place, my food was ok. I really wanted to love this place. My friend and I sat outside, and it was very pretty and then it got super hot we asked our waiter to move and he forgot about us. We then gave our order, my friend got the skinny burrito and I got the steak and eggs. I was excited when the food came, only to find a hair in my eggs. I told the waiter, and he did not apologize, he just said, "that is a hair" and took my plate with the eggs. He came back and said that he would have a new egg out shortly... it never came. I had to ask for water 3x because he kept forgetting, along with ketchup. My friend said her burrito was amazing, meanwhile my food was okay. I think the service put a bad taste in my mouth. The bill came, and I still tipped the guy because that is who I am. I told the manager and she was very friendly, and apologized to me for the poor service.  She even gave me a 20.00 gift certificate to make up for it. She was very professional and I appreciated that. However, I am a first impression kind of gal, so I gave the gift certificate to my friend. I probably won\'t go back. Also there was no chocolate bacon, which was my reason for going in the first place after reading the yelp reviews. I was very disappointed.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2015-02-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pitcseZJ_USj3tS5i1x9dw', 'review_id': '-n8utVMpZN31KKAtIoau4g', 'text': 'By the way, she comped my meal which I never received and didnt even offer to give me a free meal to come bavk! WTF?', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2015-02-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'T9_j8lcgcqa0k1cCCGZamw', 'review_id': 'PwI7EcxbSAMeHHmIKjcObw', 'text': "This brunch place has so many options it's hard to choose! Tried the skinny B and it was great! The fruit here is a huge surprise. No cantaloupe or honeydew here; it's berries and fresh pineapple. The coffee is pretty good too.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-02-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': 'iUZ_Big46eGCW7VBKd4rcw', 'review_id': 'oIoNGSJZqPD1cMAs50Ym_g', 'text': 'We waited for over an hour from when we sat down to when the first plate of food was put on the table!  We had to ask three times for silverware.  It took them 20 minutes to bring me the check so we could leave!!  We approached the manager and told her about our discontent and asked her why this had happened.  She gave us excuse after excuse about what was not going right at the restaurant.  She never once asked how she could rectify our situation.  We told her we would not be back and she watched us walk out the door!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2015-02-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 1}, 'user_id': 'ZUdcCEprYaW0hSynnaP4jw', 'review_id': 'IHdG3MdIW7lp8UyAkNOsbw', 'text': 'First time here what a fantastic experience, especially being my birthday today.\nFrom the moment I walked in the hostess was amazing and our server was fantastic. She had tons of recommendations and the hardest thing was to choose one of them.  The food is a perfect fusion of American contemporary food with traditional elements with a modern creative and fun to eat spin on it. The pumpkin cheesecake pancakes are a definite must.  The chorizo Maple French toast was also a huge hit if you love sweet and spicy, what a perfect blend.  This place is amazing! You have to try it out', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-02-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'B2uU0YIMQB01TGY50XE9bw', 'review_id': 'ERJlDx8jNJWtAoGIIPJcyg', 'text': "Great place for breakfast! Still need to comeback for lunch but I know you'll love it!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-02-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jHiDhITbHSP799pPKWpYPg', 'review_id': 'QNsCpajyhFruSl5SHL64GA', 'text': "Heard positive things about this place so I was happy when a friend suggested it for our breakfast today. It's in a nice area and has great decor with an open setting. We didn't notice they had a patio until we left, and it was really nice. We would've rather eaten there! Everyone was friendly and the waiter checked up on us plenty of times. \nThis is probably one of the longest menus I've seen at a breakfast place, which usually overwhelms me. Just give me one page and limit my options! But seriously, a great selection and lots of lunch choices too. I ordered the sun-dried tomato, goat cheese and pine nut omelette. Delicious combo! I got hash browns and pancakes on the side, both great and the cakes are huge. Overall I really enjoyed this place and hope to come back.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-02-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8WG1vs9AxcfROIHBfoahrw', 'review_id': 'vZpZ3IkvPUsejJPk4EEbXw', 'text': "Took friends from out of town. Everything was good. Tried the chocolate bacon...they must use really good chocolate like Belgian, but could not taste the bacon so felt like extra fat grams for no reason.  Hash browns were great.  Everyone liked their food, fresh squeezed oj good. Would have had a mimosa if I didn't have a cold.  Will go back. Want to try the banana Nutella crepes.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-02-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kJqSnakTIxJ4-oxuUZethw', 'review_id': 'gvKPVLmd8Mdl5PrZ6BXQgw', 'text': 'I ate here the morning before last, and it was very good.\nThere was a lot to choose from on the menu.\nI was a little surprised that when my cousin ordered a cafe-latte, they said "Sure."\nTill that point, I had only heard of Starbucks offering that, but I\'m not a coffee drinker. \nI had a 3-egg, ham and cheese omelet, hash browns, bacon, and toast.\nI also finished my cousin\'s plate of pancakes.\nAll of the food was very good, and the service was very good.\nThe portion size was also very good.\nI was full when I left the place, so that\'s always special.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-02-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fXdskdCFDQdZh_-Fif6LIg', 'review_id': 'efCcxkyWH8DkQAhxbiItNQ', 'text': 'Steak and eggs are great!!!! We always seem to run into friends here which is a good sign. This place makes good pancakes too. Recommend this place for sure.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-02-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'dhVqzZ-D0GDYT65MGADqTw', 'review_id': '-onN7EjYcFKfiw_6JR-MwA', 'text': "After wasting about 30 minutes at this place, I don't even want to dignify it by spending much more of my time on a review. Call ahead for inside seating was useless. Outside patio was filthy and uncomfortable. 5-10 minutes before a server even stopped by. Coffee takes another 5 and comes without cream. Takes another 5 for the server to come back by and another 5 to get the cream. By that time the coffee is cold. No talk of specials or of taking an order. Meanwhile, servers / runners are dropping food around us, coughing on food and generally looking sluggish, unmotivated and confused. Half of the customers around us are complaining about not getting their food. Others are sending food back to the kitchen. Went across the street to US Egg and had a reliable meal with good service and ambiance. Caveat emptor people!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2015-02-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'p7VKdqjT3WNvL7dRNNetcw', 'review_id': 'VIc0mRA2sCdIGgRx3HvvRg', 'text': "Really loud music, can't hear anyone at your table, horrible service, and over 1.5 hours to get basic breakfast!!!!  Not to mention watching the manager or whoever he was just stand in the kitchen - I suppose supervising.  If you are that short of help, take off your suit coat, roll up your sleeves and hit the grills.  The only good I can stay is when we FINALLY got our food, apparently the omelets were good.  The coffee was great.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2015-02-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'qsHDUkLVwJ5PbUdgao43gg', 'review_id': 'zEBfuL9u7HGVUp3IsUDz3g', 'text': 'Me and my girls came here at about 1 pm on a Sunday. My sister had been raving about it for a week and we were all so excited to try it!! That excitement died down quickly after we had all placed our order and our server came back 10 mins later telling us they were out of steak and had to rearrange the order(2 out of the 4 orders contained it). 5 mins after that, the server came back and told us she had placed the order to the best of her ability and hoped that it all came out right. 2 orders came out 35 mins AFTER she had told us that the order was placed and we waited an extra 15 mins for the rest of the order to come out. My sisters food came out completely wrong. Our server told us she would get a manager to come and talk to us and we saw no sign for a manager but the hostess came and addressed our needs and told us she\'d "talk to her boss and see what they can do." She came back and gave us a $20 gift certificate to use for next time. Didn\'t even offer to take off my sisters meal that was COMPLETELY wrong-we had to ask for it to taken off!! Message to management-get out of your office and make sure your staff is on track, your servers are knowledgeable about the menu AND the 86\'ed items and address your customers needs instead of sending a hostess over to do your dirty work for you.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 2, 'date': '2015-03-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 2}, 'user_id': 'OhZ5-00exQSCvqWJhVq1tA', 'review_id': 'GAoMU6eOXRmJ3oDNVcfe_Q', 'text': "The very fact reviews vary between good and terrible speaks to the inconsistency and we believe the ultimate undoing of this restaurant.\nWalked in and seated promptly. The menu looked incredible. That's it. Fell apart from there,\n1) the service is horrendous. Our waitress and all others were unsmiling sourpusses who moved glacially. Had the restaurant been busy, then the wait to see a waitress and the wait for food would have been understandable especially if the food is great. They were not that busy. Call me quirky but I like a smiling pleasant waitress.\n2) the poor service was not for want of staff. They were all chronically aggregated at the side doing nothing and when the food came out,  no one was sure where it should go.\nThere was no expediter. Compared to restaurants like Butterfields which always has a line to get in, this was pure amateurish and clearly without a manager. There was a very young lady in the front that was pitifully unknowledgeable. \n3) worst coffee I have had in years. They claim it is premium stuff. It was bitter and overly strong suggesting machine not cleaned and proportions wrong\n4)never got to the food because watching this whole thing was painful and very slow\n\nSpoke with someone that claimed to be the mother of the owner and she may have been the cook. She blew us off\n\nToo many other options out there. A shame as menu appeared very promising", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2015-03-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'LSsURPMolBYStEUWOpG22w', 'review_id': 'zFMYx-Q6M3_M6gdO-O4nGQ', 'text': "The name says it for itself... Eggstacy which is Eggcelent. I can't tell you how many times my boyfriend and I leave super impressed with the food and service. We always request Jr. As our server.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-03-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lviDcQ3XJhSDV6505H7JfA', 'review_id': 'heSfgjcUtoYgNyFbY7QxZw', 'text': 'Great spot in Shea. We got to sit outside in the gorgeous weather. Our eggs and bacon were spot on with our request to be scrambled soft and other was over medium. I absolutely loved the coffee, I could not stop drinking it!\n\nOur waiter was new, but I hope this business does well!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-03-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'X6UBTH18gVYR9kO7MRUlWA', 'review_id': 'YzrkuqfMsRMkn_Loz4lbRg', 'text': "Love this place! The food is amazing and so are the drinks. It's cheap and great food. They also allow dogs on the patio which is great! The service is great and they are very attentive for how busy they always are. Great place", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-03-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'pBvWkTepzEelbbOQWeJntQ', 'review_id': 'cJpZF9GCscT_Z-5LX9A66g', 'text': 'Well my wife and I just left there, I must say if your looking for a nice place to have food with friends. This is NOT your place.\nThe noise level is very high, and if you hate eating with dogs around, this definitely is not your place.\n\nFor me it gets a 1', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2015-03-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qe6fWewlqnnY-yZ2k89zWA', 'review_id': 'TsAJAbZRNl1fOqe6k0b-Sg', 'text': "This is my favorite place to come to! The food is great, people are fantastic, the atmosphere is fun, and there just isn't enough good things to say! I've introduced this place to my friends, family, and work! They all tell me thank you for the recommendation and now they keep going back as well. You will not find a more unique selection for your taste buds or fresher ingredients. The coffee there is so bold and the juices are so good! One if my favorite dishes is their crepes with mangos with toasted coconut on top!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-03-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'yqJwlL6MoM2TsSC_WmPU9g', 'review_id': 'ttdv7fa7QTkd4QSybed47A', 'text': "So bummed!  We've been here several times before and it's been pretty good.\nIt started with us calling ahead to put our name in and we should have been seated quickly.  After 20 min we checked in with the hostess stand and our name was crossed off the list?!  They gave our table to someone else.  \nAfter we finally got seated it was at least an hour before they brought 1 item of food out.  5 min later another single order came out wrong.  Basically staggered food for a table of 4.  Terrible!  No manager came over and when we asked for the manager- she never showed.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2015-03-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'HR_Lxh2ycv0t745Ohiziew', 'review_id': 'fyrMppCrv_J82O3ufG4MqQ', 'text': 'Bacon smothered in chocolate does not typically pair with a Bloody Mary but the fact that Eggstasy just "goes for it" is an admirable feat. Sweet and salty mixed goodness is a true and tried recipe that seldom fails. Even without the Bloody Mary, I would just order the chocolate covered bacon on its own.\n\nI\'ve been here a few times, and the first time, our group was give pumpkin pancake with cream cheese type icing for free to sample. It was very dessert like and pleasant!\n\nThe corned beef hash is pretty good to order when hungry. I thought the crispy pancetta Benedict was a bit more memorable. Then again, I\'m partial to the richness of Hollandaise sauce. \n\nIf you come here on a Friday morning close to when they open, then service is amazing. The waitress even told me to take a breath of fresh air instead of looking at my phone and focusing on taking foodie pics and actually enjoy the food. She was so hilarious and on top of everything.\n\nComing here on Sunday\'s especially around "11am-noonish," good luck. There\'s usually a list to wait for a table and service will be hit or miss because there\'s just too many d@#n people to wait on. I\'m not blaming the staff, it\'s actually really good that they\'re that busy but I can tell there\'s a little more stress around. Food remains un-compromised and just as tasty.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2015-03-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UZyk5uIo5htYZORSiOcvrg', 'review_id': 'kLTjGuNvR1wLBjNC8jNcnA', 'text': "Eggstasy is a local breakfast concept with a chic and refreshing interior, coupled by a surprisingly unique menu. The staff are young and friendly, serving an increasingly larger clientele. On the weekends, it's not uncommon to find Eggstasy customers queuing out the door, hoping to get a table inside. \n\nThis area desperately needed a local breakfast place worth going to. Now we don't have to commute south to Arcadia to find palatable breakfast cuisine \n\n\nMake sure to try the Dali Skillet if you like spicy chorizo and eggs!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-03-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vOvXcoJ7aSV53z4ocUVNpw', 'review_id': 'tVz18umKNh4xroaPgibP-g', 'text': 'Food was fantastic! My favorite lunch place. They were able to substitute toast/muffin with pumpkin cheesecake pancake (boy was it amazing! even 2 days later!). They give generous portions and price is right. \n\nWaiter was very professional and was on top of everything. I like how they have an older gentleman/lady who screens all the food before they get taken to the customers. \n\nGood atmosphere. attracts the right crowd (no little kids running and crying).', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-03-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '_PzSNcfrCjeBxSLXRoMmgQ', 'review_id': 'x7exKfcIn29Awqp4OCt5Qw', 'text': "Came here for my brother's bday breakfast!  It was a slight wait for a table of 5.  They got us a table right by the door.  So it was a bit cold every time the door was open.  The service was awesome...  Food was good....\n\n1.  Chocolate pancakes - HELLO!!!!  It is slightly crispy and way to yummy!\n2.  Ham & Cheese Omelette - My brother said YOU NEED TO TRY IT (apple gouda chicken sausage) so I added to my omelette.  I have to say, yeah it was great but the omelette itself was ok.\n\nI need to come back to try other items.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-03-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ob-aUBLAA9JhhwC4VUTQSQ', 'review_id': 'SSXp1PT3JKm1iwajWSfEDg', 'text': 'My husband and I saw a video on my Twitter page and took our grandsons the next day for breakfast.  The boys loved the smore pancakes and the nutella and banana crepes.  My husband had a great veggie omelet and tried the banana pancakes on the side.  I had the goat cheese and fig jam omelet.\n\nEvery bite was delish and we were able to share w/ the huge portions.  The coffee was fantastic as well.  Our server was new but really wonderful.  We hope to make reservations and take the entire family for a holiday breakfast very soon!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-03-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kRbQXbWCjn3lwWyIQD9cXw', 'review_id': 'SCSdA48t1vmZyQxSNhAqNA', 'text': "I went to Eggstacy in Scottsdale today for brunch. The food was excellent. I had an asparagus and almond omelette and banana pancakes and my wife had an omelette and lemon/blueberry cake. The omelettes were tasty, but the dessert/pancakes were even better. I'd recommend the banana pancakes to anyone looking for a sweet breakfast. The coffee was excellent. I would definitely recommend and return.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-03-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'jtpzVNkntzJz0T5EihxkRw', 'review_id': 'Ix1OaT0VR12Eu6WVnp-gMQ', 'text': "I was looking for a new breakfast place to try yesterday and decided to go here after driving by. \n\nThe restaurant is fresh and clean appearing and very lively. We were greeted quickly and sat down immediately. \n\nI ordered a cappuccino and mimosa, mmmmmm! The cappuccino was well done and the mimosa was mostly champagne with a splash of orange juice - AWESOME!\n\nFor breakfast I tried the skirt steak and eggs. The steak was cooked to medium (what I asked for) and was really good. My friend tried the corned beef hash and eggs with pancakes. The corned beef hash looked like the canned version, but you could tell by the taste it wasn't, had good flavor, but not my favorite texture. The pancakes were delicious, nice and fluffy and very sweet, almost like cake. \n\nI will definitely be back and looking forward to trying one of the benedict's with another mimosa!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-03-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'bI2ebr-_7mgrdBGam04mTg', 'review_id': 'bLE4OEy6qs5hY9ijR-fBCw', 'text': 'I had an unfortunate experience this morning at Eggstacy. When I arrived and put my name on the list I was told that it would be about 25 to 30 minutes for a table. We were pleased when we were called after a 22 minute wait. I was going to complement the hostess on their accuracy in estimating the wait but it was so noisey and crowded I just tried to keep up with her on the way to the table. Water came and I asked a bus boy for coffee and he gave me a signal for "just a minute". He didn\'t return and a server hadn\'t arrived although tables seated after us were being served, so after waiting 15 minutes I went back to the hostess and told her we hadn\'t had a server yet. She promptly went behind the bar and got one of the women working there to come out to us.  We placed our food order and I asked for coffee. She said she\'d be right back with that.  After waiting several more minutes with no coffee I took our cups and walked up to the coffee station at the bar. Seeing me do this, our server rushed up to me and said she\'d take care of it and es courted me back to the table. Delicious coffee!  We both finished our cup and I began looking for a refill. During this now 30 minutes that we\'ve been at our table, we\'ve been watching the to-go boxes placed on the window sill between the indoor and outdoor space blow off the sill into the high chair seats with the bus people swirling by picking them out of the seats (think babies in diapers in those seats) and putting them back on the counter. Finally a big gust of wind blows them onto the floor. A good natured bus boy makes a comment about them, gathers them up from the floor and puts them back on the counter to be used. After 45 minutes at the table with still only one cup of coffee our food comes out and it is delicious. The server says he\'ll be right back with our side of pancakes.  Coffee finally came round again.  It was another 10 minutes before the side of pancakes come out. I spread the room temperate whipped butter on the pancakes and they were completely cold and the butter didn\'t melt. Oh well. I really didn\'t need them. We flagged our server down for our bill and gave her our two credit cards. She comes back to the table and informs us that both of our cards had been declined. We had her try again and guess what?  They worked.  \n\nThe manager came around once while we had been waiting and asked how things were. I was telling her about the service when a gust of wind came in throwing the to-go boxes and she got distracted by the commotion and lost her attention and didn\'t turn back to us. \n\nWhile the food was good, the service was so disorganized that we did not have a good experience.  They need some training!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2015-03-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 1}, 'user_id': 'qYCsTyuFX1SUT0xIw8VyHQ', 'review_id': 'I0MxpNrI4Ii_YN23tmY2iw', 'text': "Good food. But the worst service I've ever had in my life. \n\nSaw the waiter once the whole time. Orders were wrong and had to be sent back but since we never saw the waiter we had to physically walk our plates over to the grill to have them fixed. Their iced tea was just colored water and was never brought Splenda even though I asked four different waiters. \n\nIt's sad because the food was good but definitely never coming back. And would advise anyone to avoid the headache.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2015-03-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'q4UUPoIXFQfF89xFYxOsWg', 'review_id': 'KZawn5y6Xp3XHSXSzav0XQ', 'text': "I have eaten here many times during the week and the food is excellent.  On the weekend, we waited over an hour to be seated.  They were very short staffed and didn't have busers to turn the tables quickly.  Owner was busing tables and informed us two staff did not show today.  Disappointed.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 2, 'date': '2015-03-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jDdkR5eGZqKO_klxvBfThA', 'review_id': 'yD9pRxJahFlq5zHFG1tTOA', 'text': "We love this restaurant...the breakfast is amazing! I get the quinoa, kale, sun dried tomato omelette with goat cheese, and it is delicious! The coffee is also delicious and they have almond milk for those non-dairy drinkers. The service is generally pretty good. On the weekends it's been a little disorganized, but the management is so professional that they always resolve any issues. I'm so excited to have a trendy, healthy and tasty restaurant in central Scottsdale! The cookie cutter restaurants in the Shea area are such a disappointment and eggstacy is a breath of fresh air!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-03-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vO14FeLhQf2Vz1u2KtYIRg', 'review_id': 'vSz_p8iVYj5OAwAKeZIa5g', 'text': "Hands down the best breakfast joint in the area!! There's a reason why it's ALWAYS SLAMMED. Word has apparently spread...", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-03-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'xFG4Ca2HHmbxDTkMlmHnjQ', 'review_id': 'ZztWu_XxWIHxj0YP1icn3A', 'text': 'They need a bit of work on their service, and the food is pretty good.\n\nLots of options, which is always great! The patio is very nice, but it might need a bit more shade options. The portions are huge, so you do get a lot for your money!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2015-03-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ZC8wNkm3_W4vebSv6AFeLg', 'review_id': '8S_In3tw4W1oK_hTSrws2A', 'text': 'Start to finish:\nArriving the place seemed PACKED. asked the hostess to put our name in \n(4 people) and she said it was going to be 45 minutes. Walked around to the bar which was also packed and got some mimosas. Then we started looking around. All though the place seemed packed, only about  1/2 their tables were occupied. We soon found out the reason: owner and/or manager was this old mean lady who was incredibly rude to both customers and wait staff. \nFinally a waiter snuck us into an empty table in his section after seeing us standing at the bar for 30 minutes. Manager/owner then proceeded to come over and yell at him in front of all the diners. Despite her actions the waiter held his ground and we were able to keep our table. \nOur waiter was awesome! he totally took care of everything we wanted, kept our waters full, joked around with us about, gave us some great advice about where to visit, and talked us through the whole menu. He even brought a sample of the chocolate bacon for us to try!\nThis is what we had:\nBloddy Marry- Loved the veggies and chocolate cover bacon that came with this. However the mixer seemed a little thin and tasteless to me. All in all 4 stars\nPumpkin Cheesecake Pancakes-Not enough Pumpkin flavor for us personally, but they were still great. Eat these fast! 4 stars\nCaprese Benedict-Egg was poached perfectly and the pesto tasted amazing. 5 stars\nBreakfast Burger-Fried leeks were amazing but the burger meat itself needed more flavoring. 5 stars\nDutch Apple French Toast-Apples were cooked perfectly and the cinnamon butter was to die for. 5 stars\nProsciutto & Chocolate Chip Waffles-Super yummy, but it was bacon not prosciutto served with it. 5 stars\n\nAll in all we will definitely be coming back here because of the food and the wait staff. Hopefully the manager/owner will start to understand she needs to work behind the scenes a bit more.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-03-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'gKYzOju8yG6E471L3kPIrw', 'review_id': '2LtBl8Mh3CZY_w9rMKC41w', 'text': 'Me and m\ny daughter eat at eggstasy at least once a week I have recommended it to many of my friends and they love it. I was on a couple weekends ago and received as always exceptional service and attention from lona. I always try to get in her station. My.friends love her too she remembers what you like, your name etc....thank you lona ..', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-03-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': '4OXb9Ggo3Bg7M_1U2IWFXw', 'review_id': 'hQ5Qcq6kDlR7g6nb6PYwrw', 'text': "This place is the WORST!  The service is terrible!!! The owner, an old man, who needs to remember he is in the SERVICE industry. He has NO issue yelling at staff in front of customers. It makes it very uncomfortable...my daughter actually asked why he was being so rude! The food was nothing special. My wife had the sun-dried tomato, goat cheese & pine nuts omelette, pretty Plain Jane. I had the same problem with the asparagus, ham & gruyere crepes. I'm sure he is just using a Swiss cheese and not a true gruyere. This is the type of guy who seems more worried about prices than quality. My daughter did enjoy her chocolate chip pancakes. \nI saw the menu online and thought this place might be a delicious change. It was not. Again, I'm sure that quality is 2nd behind price when this guy does his food buying! We won't be back. We will be going across the street to the U.S. Egg. They at least have an attentive wait staff and FRIENDLY owners!!!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2015-03-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'f21bNXhiCyRGfTrINVz7EQ', 'review_id': '0uKiVBe_wYzCLVFBaDtbiA', 'text': 'This breakfast place was "as advertised ". Several yelpers complained about service, the fact is that this place has outstanding food and, as a result it is very busy.  We waited 35 minutes (which is what they told us when we arrived). The host staff was very efficient in seating folks and in (what seemed like) a short time were seated. I had a Bloody Mary (with chocolate dipped bacon!) which was great.  Dark roasted real coffee too.  I had the maple chorizo French toast. All good!  Eat here!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-03-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'fXNWwZM96eNVpShklrOdhA', 'review_id': 'GZErZYczw27v4mj1utdDOA', 'text': "I give the food a perfect 5 star rating. I never have had such a great menu of food that has such a wide range of variety and innovation. The owner, Joe(?), is very accommodating and understands what it means to have a new concept in Scottsdale restaurants. Unfortunately, he needs better staff. Being from the east coast I often criticize how customer service is a dying breed but maybe it's simply because I'm more towards the west coast and everyone is just used to giving only 60%. I rarely witness Quick To Serve experiences. This place is one of them. The hostesses will be two young girls looking around not knowing what tables are available while what appeared to be Joe's mother yelling at them in a thick foreign accent and they just don't even budge. Our sever was awful and as excited as we were to bring our friends to this restaurant, they were so upset about the service that they will not come back. It upsets me because I know yelp is an easy access for bad reviews and rarely do you get a good one, however, I hope Joe takes the coaching and witnesses the staff and makes changes. Our server not once refilled our drinks, when I had to tell her to refill the drinks she didn't even clear the empty ones. Food was forgotten and not brought out and we had to ask to remove it from our bill, and then when she brought the bill after not clearing our dishes, it was one check. We asked her to split it three ways and she throws the empty plates back on the table to walk back and change the bill. It took everything in me not to coach her on the spot and I just felt it wouldn't go far enough had I not given the owner the direct experience. I was embarrassed. I love this restaurant but if we keep receiving bad service, it won't be worth the trouble to come back.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2015-03-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'iJREBBdu5NHFmzRsz4Jm-A', 'review_id': 'BoQufHjdwnXrCVsNvmlzbg', 'text': u"The eatery is new to our neighborhood so we decided to check it out. My party and I got there early in the morning so there was no wait and we were seated right away. The decor was modern yet made you feel right at home. Our server was great and gave us the rundown. He suggested what to try and what his favorite dish was. It was very helpful as there are so many options; the menu was a tad overwhelming. I decided to try the veggie omelette and upgrade to have the raspberry br\xfbl\xe9e pancakes. Well I'm glad I wore elastic pants because the portion sizes were huge! The food was absolutely delicious and the perfect balance of sweet desert and breakfast foods. I will definitely be back as I can't wait to try other items off the menu!!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-03-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': 'Vwt_F5D095qb15NziEltSw', 'review_id': 'u_tAjqBQff3onmTPPVFMHA', 'text': 'We met friends for Sunday brunch and thankfully they had made a reservation because the place was hopping. The decor and atmosphere was inviting, so I was looking forward to the meal. Sadly, it turned out to be an awful experience! The service was slow and the guy waiting our table seemed to be annoyed that he was even working that day. He barely cracked a smile. The service was slow! It took 15 minutes after being seated to get water and an hour to get our food. \n\nThe glowing recommendations may be from people who do not go on the weekend. The staff here need training! Smile, check on your tables, apologize for slow service, something to show there is a caring human being behind the mask. \n\nThe food was adequate, but not good enough to compensate for the unpleasant dining experience.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 2, 'date': '2015-03-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'FVSpUG2tCifMcs2sFTTzqw', 'review_id': '18QHuw5RlYe_Q1jiTOXD0A', 'text': "It is a fact that I will NEVER go to Eggstasy ever again! HORRIBLE HORRIBLE EXPERIENCE!\n\nI WOULD ADVISE AGAINST ANYONE GOING THERE. \nThe food is actually decent BUT the service is quite terrible. We were a large party, but frankly they did not know how to keep our orders organized. The waiter had no idea what he was doing, the manager could care less that the service was so bad and actually yelled at us, then the last straw was the obnoxious owner who claimed that the staff did nothing wrong! \n\nI'm sorry but I do not think it should take an hour to get a beverage! We were also sitting in the hot sun during midday and had to beg for water! \nThey never once apologized for the terrible service. They made one lame attempt to give my friend a $20 gift card (this brunch was her birthday celebration with friends & family) but when she tried to use it, they refused to take it! Then the owner violently ripped the gift card right out of my friend's hands!!! The waiter also acted inappropriately many times and got very angry, and then towards the end he actually took one of those leather binders that the checks come in and threw it against the wall as he stormed off!!\n\nThe whole thing was soooo unbelievable. \nAs I've been telling the story, more people have shared with me that they also had very bad experiences with the service!\nIf you have no desire to actually provide customer service and make sure that people can enjoy their food in a comfortable, friendly environment - then GET OUT OF THE HOSPITALITY BUSINESS! \nOk, venting done. Had to get that out and WARN people! \nThanks for listening!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2015-03-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 4, 'cool': 2}, 'user_id': 'mujx7LdRXmDt_nHze1Rhfw', 'review_id': 'lmwWnbdKY_TdaW1-a2uhkg', 'text': "I will never come back to this place. The food is decent but the service and management is beyond horrible. Never once have I been to an establishment where the waiter is so unprofessional that he throws peoples bills at them, while throwing a tantrum like a 2 year old bc he can't handle a party larger than 3. When I called the owner over to speak w him abt the poor service , he not only disrespected me in front of the entire patio but proceeded to tell me off saying nothing was wrong w his staff or service. Really? That's why two additional tables left after seeing how rude he was to our party. I brought in a party of 20 ppl-- they could have made a killing off of us! But taking 30-45 mins just to get water (while baking in the sun) and an additional 30-45 mins for our drink orders to be taken is not ok. It really is a shame.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2015-03-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DAEs9JSfoBCdyMSrzZPZVw', 'review_id': '7Ss-bKCHFkua7tOd1MPRMw', 'text': 'One of my favorite places to go. When I come up to Scottsdale to visit my family this is where we go for breakfast. The Staff is awesome, food is very good and always comes out on time and is nice and hot. We use to go to Butterfields down the street but this place is way better. I got the hash and eggs last time and it is spot on. 5  from me!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-04-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': '65yRqtZmoElX33mknQ3W9g', 'review_id': 'XknDTxJYuL6fGa6wenUcZg', 'text': "Horrible experience.  Me and my wife waited 20min for the bus boy to bring us a glass of water on our first visit.  We got our food about an hour after we ordered it abd it was mediocre at best, cold small portions and not the correct items but at this point we didnt feel like waiting another hour for a remake.  But the manager came over and gave us a $20 gift card.  So we though maybe it was an off day since it was saturday and we would try it again on a weekday when it wouldn't be so busy since we live close by.  And it was ab exact repeat.  But this time when we asked to speak with the manager they said he wasn't in today.  How can a restaurant have no management. We walked out before we even ordered.  Maybe we'll give the gift certificates to our kids cause we will not be returning.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2015-04-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 't4jbVyKnUBYiX_oV5Cxvzw', 'review_id': '6RIzEB_58KVJQi1SWPEbdw', 'text': "OMG!!! I think I am still full from Sunday Brunch last week! From the street you dont even notice this amazing Gem off of Shea! Its a must visit but get there early as they get a long waiting list early. We were a party of 3 and found a seat at the bar. Don't know how the service was but seemed a bit slim.\n\nTIP!!!!!!-- The bar is all open seating, if its a small group, place your name on the list and go stand by the bar for people to leave, turns a 1.5 hour wait into a 15 minute wait. \n\nFor their food.. Watch out for the portions, they are massive, Had the corn beef hash and eggs, I dont know how I finished it but it was massive. The pancakes are the fluffiest ive ever had. We defined them as ..... Fluff-tastic !! Yes we made up a word because they were so good. \n\nOn top of that, you have to try the chocolate covered bacon. Its a must!\n\nDown side, no drink specials and nothing too fancy, its all about the food not the drinks\n\nWhen I feel like I can eat that much again, im going back but will make sure to workout all week leading up to it. \n\nA must try!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-04-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PwF9xD_Ahz4KmvN9y1L-CA', 'review_id': '1omLBF-KktYuanXhmcwEbA', 'text': "I stopped for breakfast because it was next to my hotel when I was in Scottsdale for work.  I got a good vibe as soon as I walked in.  It was homey, but modern, clean and fresh looking.  I ordered from the healthy section of the menu - a brie and green apple omelet!  I also ordered an almond coffee - unfortunately they were out of the almond, so I got a caramel macchiato.  The omelet came with a fruit shish kabob on the side.  The omelet was fluffy and big and yummy - I thought the brie would be worked into , but it was a big slab of it on the top!!  Perfect - better for the tasting!  A couple of mistakes by the staff - I ordered coffee in a to go cup, and it came in a ceramic cup, then they brought a hot to go cup, I finally asked for a cold cup with a straw, and the waiter said sorry - he couldn't find the right cup before!  They weren't even that busy!  But overall a very enjoyable experience. I also had enough food to have breakfast for the next day!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-04-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '0lXjMakFtAX_iVbKYOCsfQ', 'review_id': 'lM15fAybas0NM-R4h7OshA', 'text': "The food was so good I couldn't stop eating after o got full yesterday.  \n\nI saw this restaurant on my way to hike, I actually so a few other breakfast restaurant within a half miles radius. I chose to stop by here for its name after three hours of hiking.\n\nWhen I walked in, I stepped back a little as it was nothing what I expected. I thought I came to have breakfast but inside it looks like as if you are in an island somewhere in Caribbean. The use of orange, light green and yellow color as well as a huge open bar area made me think I just stepped inside a bar or restaurant in tropical island. \n\nWhen we arrived around noon, the wait we were told was 20-30 mins but they were able to seat us in 10 mins.  Server greeted us right away with cucumber water, just what I needed to quench slightly dehydrate body after a long hike.\n\nI liked the freshly squeezed juice selection. Not just orange juice, but grapefruit, strawberry with pomegranate... \n\nFull order of pancakes comes with four large fluffy packages. The server suggested to split to two plates for us. I had no ideas how big the pancakes plate was going to be. I am glad she explained otherwise I would have been taking leftover home and it doesn't taste as good.  Pancakes were very fluffy and generous portion of fresh fruits complimented the dish very nicely.\n\nFlat bread salmon plate was also big but tasted so good. They proudly serve Lavazza coffee (my second favorite Italian coffee) and they kept coming back to refill my cup. I don't think my cup went down more than a half as a coffee person and our server kept coming back for more coffee.\n\nThey take reservations for a group of 8 or more. Their food and service was so good, I wanted to make reservation for Mother's Day. They suggested I call ahead to leave my name when I am ready to leave my house as they expect wait is going to be close to one hour on Mother's Day during peak hour. \n\nThey were busy but I never felt being rushed. We enjoyed leisurely breakfast on weekend and had a very relaxing time with great food and service. Can't wait to come back again.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-04-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'srLazQXi4Sw2hsFvpDH3xA', 'review_id': 'ilB3ByLJuLUNUlPo2Cohwg', 'text': "Well, where to begin... The food was ok. I would rate it a solid 3. However, that's not what prompted me to write this review. My girlfriend and I came here for Sunday brunch and were so uncomfortable that we had to box up our food and leave. The temperature inside was a steamy 87 degrees. We tried to get past it but that was an impossibility. We made the manager aware of our dissatisfaction and were told the owners control when the AC is turned off and on and they didn't think it was too hot yet. Needless to say, I wouldn't recommend this establishment.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 2, 'date': '2015-04-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'v1vxys-9tkB9KT2TG_5HIQ', 'review_id': 'JJS9_oGYd_5lMV-rDh4Qiw', 'text': "The service at this restaurant is absolutely horrendous. We are nurses and have tried to eat at this restaurant on 2 separate Wednesday mornings. Both times it took our server 20 min to even take a drink order, the second time after we asked the hostess to see a server! I ordered two drinks at a time for fear I wouldn't see another server again. What a shame to have such excellent food be ruined by such awful service! None of us will go back again!!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2015-04-14', 'type': 'review'}
{'votes': {'funny': 5, 'useful': 9, 'cool': 8}, 'user_id': '8dbRf1UsWp2ktXHZ6Zv06w', 'review_id': 'v0EJdvbYfD1Hfl8lILpzig', 'text': u"Headed on down to Eggstacy on Saturday morning to have breakfast with my daughter & grandson, it had been awhile since I last had been and I was ready to try them again.\n\nThe menu still can be overwhelming, so many choices to choose from, before I got there I was thinking nope not doing an omelet, those things are huge, but after checking out the menu I went ahead and ordered me one haha.\n\nI ordered the Dali's Omelet, it had chorizo, jalapenos, onion and queso, this omelet was the best omelet I have had in a very long time, and it was flavorful, spicy and cooked perfectly!  So dang good! \n\nI also ordered a side of one raspberry white chocolate pancake that is what I originally was headed there to try. It was a fluffy pancake drizzled with white chocolate and topped with raspberries, but it had a br\xfbl\xe9e sugar coating on top of the pancake, oh my this was pure sweet bliss!   \n\nAnother great breakfast down at Eggstacy!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-04-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'S1Ts85FdWgDsL7XKJNVENw', 'review_id': 'MyJ9VHZqXOP3thkAcChj3w', 'text': 'Love the savory crepes!!! Nice place to get quality bfast and good portions too. They serve 4 to 5 crepes on a plate. Today i tried the ham and kaseri which was delicious.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-04-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '3whoROdqflJH3CETjhDSsA', 'review_id': 'bt-IJTSWxluQznCpUwRUHg', 'text': 'Wow...this place has such potential! Great atmosphere and patio, but poor service. I hope the owners read the reviews and take them to heart....location is perfect, patio is a great place to hang in the Arizona weather, nice large bar. They have a long way to go with service and professionalism. Will not return until I hear they have improved.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2015-04-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'sl2z1XzsxSEn-ICtA35Y4Q', 'review_id': 'Q5H3ePBDPt9bfFXOF7IqcQ', 'text': "Gave it two tries and the service and operations were so bad that we are not going back.  Waited 15 minutes before we were even served water the first time...food took just as long.  Didn't plan on returning but they gave us a gift card because we had to wait for so long.  Went back again today and the same service issues.  Food was fine but not great...we had the smoked salmon Benedict and a breakfast flatbread. Ordered a kids breakfast for my kids and they brought out both breakfasts on the same dish?!?!  Maybe the cook doesn't have kids but children don't really like to eat their meals off the same plate...had to get a separate dish to split the breakfasts.  I will say the pancakes are good and it has a nice indoor outdoor trendy atmosphere but not enough to make us return.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 2, 'date': '2015-04-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': 'PLPptfP2WWVE2zxNHfaAyg', 'review_id': 'h5x6MJfpW-F0FbHA9eEWUQ', 'text': "For a place called Eggstasy, the scrambled eggs taste really weird. We didn't bother finishing ours.\n\nWonderful creative menu but fails on execution. \n\nEnglish muffin - dense and bitter tasting\nHash browns - not crispy and little seasoning\nScrambled eggs - tastes like some kind of egg substitute\nChicks in a blanket - sausage not a good flavor\nCoconut mango crepe - amateur crepe with non ripe mango and coconut thrown in with little thought\n\nEssentially an add-your-own spices kind of place with big enough portions and low enough prices to attract repeat customers. For foodies not so much.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2015-04-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'b5NysWHPHvhd0EA6-yCRCQ', 'review_id': 'Qbe7G3N9c-xMMX40ShBr4w', 'text': "This is probably only the 4th review I have ever written on yelp. I found this place because of yelp. Every time I have gone here it has been amazing. Great food and it's always fresh! The coffee is the main reason I go and the portions are out of control! A huge omelette with two pancakes and hash browns! Can't beat it ! The omelette a are great the skillets are great and again the coffee coffee coffee! Check this place out! Good vibes all around.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-04-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '80f3fnjFHeOnl-imvvZrQA', 'review_id': '9-7OkBHH7passW80KQ2KSQ', 'text': "We wanted to hit up a new breakfast joint and we had heard of Eggstasy opening up so we made our way there at 8:30 in the morning.  It appears that we just beat the morning rush on a Sunday morning because 20 minutes after we arrived it got noticeably busy.  We waiting 5 minutes to sit outside in the patio area.  Love the patio layout and the colors.  They have a large patio that can accommodate large groups.  They also have a pretty extensive menu,  If you're in the mood for good breakfast this is the spot.\n\nI order the stuffed brioche french toast and the prosciutto eggs Benedict with a side of maple sausage. The french toast can feed 2 people easily.  4 big slices of bread stuffed brioche style.  The prosciutto eggs Benedict would've been better if the prosciutto wasn't so salty.  It was very over powering while eating.\n\nI would defeinitly come back here to try more of the menu.  It's hit or miss if you show up any time before 9am.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-04-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xWxZ45jaeQN77c2UMzPijw', 'review_id': 'dMlW1-Jy13Zu2ERHoDvIEA', 'text': 'Had lunch with friends this past weekend. Food was good but service was lousy. Not even crowded and we had to repeatedly ask for stuff. Looks like a bunch of high school wait staff who are not very professional. However, the food is really good and plentiful.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2015-04-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'X7FSmqMRnG02hcvo7bxwdw', 'review_id': 'Wb20raO3cV4QKRob97eAYw', 'text': "I've been here several times and it's definitely one of my favorite breakfast places in Scottsdale! \n\nToday we walked in there was a 30 minute wait but we walked up to the bar and got full service right away. Lona took care of us today and I must say, she was pretty awesome! We ordered, coffee, water and a Bloody Mary to start. Let's say she knows how to pour a good Bloody Mary! And of course it's topped with chocolate covered bacon, you can't go wrong with that! \n\nLona was on it and took our order right away, made suggestions and talked me into the cinnamon swirl pancakes (not on the menu). I loooove cinnamon rolls so this was an easy sell for me. I ordered the gypsy steak skillet again. Lots of protein and added the cinnamon swirl pancakes to share with my friend. \n\nMy friend ordered the buffalo chicken wrap. She isn't a big breakfast person (I had to convince her to come with the enticing Bloody Mary!) The buffalo chicken in the wrap had a maple syrup flavor. Which seems appropriate for a breakfast/brunch spot, but it didn't taste so great in combo with the buffalo sauce. We let Lona know and she was super friendly and took care of it, no problem! \n\nThe atmosphere is super friendly and upbeat. And I enjoyed watching all the dishes come out. Sitting at the bar added to the fun as we got to talk to fellow breakfast lovers :) they have a bar that is both indoors and outdoors. \n\nOnly downfalls, in the past we have waited forever on a Sunday after church. And the patio after about 11:00 the sun is BEATING down on you. No shade if you aren't under the cover. They definitely need some umbrellas or a shade cover if they plan to use the patio more. \n\nOther than that. I love this place!! :) enjoy!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-04-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'cRWABPn7e0_odXlwiDgbww', 'review_id': 'He2S6YCvUu0EuNfc1TB-6A', 'text': "I don't even know where to start! The food was amazing everything was so full of flavor and presentation (not that this matters too much) was beautiful too! 3 out of the 4 of us at the table had eggs Benedict. I switched out the ham for bacon on mine...still delicious (better in my opinion :p). I also ordered a side of the homemade corn beef hash and everyone at the table agreed that was good too! No one had any complaints about their meals. Every order that we saw come out of the kitchen looked drool-worthy. I'm pretty sure everything you order here is good, at least it all looks delicious! \nOur waitress was fast, efficient, and helpful! She even offered a solution for us with sides we ordered to get it at a cheaper rate! Good looking out and much appreciated! \nThe place is hip and for a younger crowd maybe...music was pretty loud making everyone have to yell a little to speak to each other. No inside voices here! I loved it! It was new up to date music and put me in a great mood to start the day.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-04-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mt89YVJucXxAr3YinQQESw', 'review_id': 'VBwMEnRZmbi-VZdgCMEBAA', 'text': "What a great find! Large portions, fun innovative menu. Atmosphere is phenomenal with luxurious outside seating. Even inside feels like you are outdoors.  Couldn't have asked for a better experience!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-04-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'QBOmj8Q3WnsMb0Wd9caFAA', 'review_id': 'TnTpBFiKzxhqeWXXnp7ihg', 'text': "I am writing to express my disappointment with today's service, ironically this is not my first time eating here. My first visit to Eggstasy was quite pleasant, and this is why we decided to pay this place a visit again. Based on today's service, I don't that I will be back here anytime soon. My server was not only inattentive but seemed very apologetic when she made a huge error on my wife's order. My wife and I are always very explicit when it comes to not having any pork or pork products in our meal; I let the first 4 mistakes slide (steak not cooked appropriately; hash browns not cooked correctly (to her defense, she did correct this after I told her); other tables being served before us; and having to hunt my server down to explain the mistake on our order). Finally after I expressed my disdain for the service we received, our sever did finally right her one wrong. But what bothers me is, she only righted her wrong, because I had to tell her how disappointed I was with our service. I am not willing to give this place a 1 star, because of our service the first time, but I would hope that management understands that servers need to be extra cautious when it comes to food allergies and requests, because this could be a law-suit waiting to happen.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 2, 'date': '2015-05-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'U8vyUODOrk9AkFDRe5NZPQ', 'review_id': 'c6yX9U4OJXhS-OE0nDyUMQ', 'text': "We had been wanting to try this place for a while. Got there around 9:30 and were seated immediately. That was nice, considering we usually have to wait 30-45 minutes at other places. I ordered the gypsy skillet and my daughters order French toast with bacon and a scramble with mushrooms bacon cheese and avocado. The later was a special order bc they didn't have exactly what my daughter wanted. They had no problem accommodating us. Very nice. Once we ordered we started to wait. And wait. And wait. And wait. The food took a long time to come out. Another two tables got their food before us even though we had ordered first. When our food finally came, thank goodness, it was yummy. The gypsy skillet is delicious and the skirt steak is tender and cook perfectly. Both my daughters were happy with their food also. So even though we waited a long time for our food, it ended being good. We will try this place again.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2015-05-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'U8vyUODOrk9AkFDRe5NZPQ', 'review_id': '5e0AmIWNDUnLU7P_4H1CrQ', 'text': "We had been wanting to try this place for a while. Got there around 9:30 and were seated immediately. That was nice, considering we usually have to wait 30-45 minutes at other places. I ordered the gypsy skillet and my daughters order French toast with bacon and a scramble with mushrooms bacon cheese and avocado. The later was a special order bc they didn't have exactly what my daughter wanted. They had no problem accommodating us. Very nice. Once we ordered we started to wait. And wait. And wait. And wait. The food took a long time to come out. Another two tables got their food before us even though we had ordered first. When our food finally came, thank goodness, it was yummy. The gypsy skillet is delicious and the skirt steak is tender and cook perfectly. Both my daughters were happy with their food also. So even though we waited a long time for our food, it ended being good. We will try this place again. I am giving it three stars because of the long wait for our food.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2015-05-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'V8VL7b1J5WOLrZrTEtYQNg', 'review_id': 'sEZlobvwFfAtaCXLbuiOlQ', 'text': "My salmon flatbread was pretty good, but the edges were too crispy to eat easily, and it was somewhat too salty for my taste. \n\nMy wife's savory crepes had a good savory filling, but the crepe itself was sweet. This made for a combination that neither of us cared for. \n\nThe menu was full of interesting sounding items. I suspect the best things here are the omelettes and Benedicts.  I'll try that next. \n\nThe bacon was the best bacon I've had in my whole life!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2015-05-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'k8E5TApmvkdgVS5-yx8YSg', 'review_id': 'ryD4Om-IbC8qWVs-3YBfDA', 'text': "I have been a number of times and this past Friday went for breakfast and the place was a train wreck in the making. Horrible service, messy floors, over cooked omlettes with barely any ingredients, pancakes delivered twice to our table which we did not order, artwork crooked on the walls, hostesses and servers just standing there and I can keep going...  I even had to point out the syrup on the floor after I watched the server spill it 15 minutes earlier (and yes she knew she spilled it) but never cleaned it up. WHAT HAS HAPPENED?! Open your eyes management and staff, people will start trying US Egg down the road if you don't get back what made you great!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2015-05-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ah9yVJpwudw45bc9d6HQxw', 'review_id': 'gCnbZLAvJfeuO891VU498A', 'text': "The service was good but the food was not made correctly and for being my first time the owner argued with me instead of fixing my order.  The waiter was kind enough and took care of it for me.  Very disappointed in the owner of the restaurant.  Ruined my mother's day for my mom.........never going back again.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 2, 'date': '2015-05-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'pBL7LhYTPjocHSZwSU8kSw', 'review_id': 'vyauGD40WSNDug7qQ7ijFw', 'text': "I ordered the strawberry oj, caprese Benedict, coconut/mango/papaya crepe and chocolate bacon. The juice was too sweetened with the strawberry pulp or whatever. I should have gotten straight oj. The caprese Benedict came on brioche that wasn't toasted making it bland and cold. The fruit in the crepe wasn't ripe. The chocolate bacon just wasn't very good. Ate one of the 3 pieces. Not worth the $7. Service was ok. They took care of the Benedict and gave us a gift certificate to apologize but I doubt I will use it as I won't be coming back.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 2, 'date': '2015-05-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'iJREBBdu5NHFmzRsz4Jm-A', 'review_id': 'nm_69vGXHAQwcXBPLiRHCg', 'text': "I've been here several times now and today was an experience to warn others about! Eggstacy has a beautiful patio so don't be afraid to sit outside however be careful in asking where you want to sit! I got seated in the one table that had NO shade. With it being Mother's Day it was packed so we couldn't seat anywhere else. I had never eaten a meal so fast in my life. The service has been so so and with us being in the sun I eventually got up and walked over into the shade. I had to find my server in order to pay which was annoying. If you can put up with so so service and eat inside its worth it as the food is amazing!!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-05-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZEmIOsA94aFJ83Iidak98g', 'review_id': 'eBRfoHnXzPkbbxDT7D-bzQ', 'text': "My husband and I came to have breakfast here last Saturday. It was packed but they seated us right away...Yay!! \nFirst off, the place is very cool, loved the hip design. They have an extensive menu, very hard to decide! But none the less, we made up our minds. I ordered the prosciutto, red pepper & burrata omelette, it was DELISH! Loved how the flavors came together. Not only is the dish tasty, it is gigantic! Can easily share....it was a 3 egg omelet with hash browns and 2 pancakes! \n\nThe service was good and the good delish! I'm only giving it 4 stars & not 5, because it was a bit too loud & crazy.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-05-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'KbDqHeSwhv8yiC6G2Ee7hA', 'review_id': 'jhmDdad4Jbjh4v8qzDljnw', 'text': 'Service is terribly slow and sporadic. Seems completely disjointed from hostess desk through the meal service. Although there were plenty of tables empty and clean, it took 15 minutes to be seated. Waited over 45 minutes for food after order was taken. Waiter never checked in the whole time. Would not recommend unless you want to wait all day.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 2, 'date': '2015-05-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'b7EEhp_TdMEVvN8k4bHfRA', 'review_id': 'sPfMnXzP7i8dc5d3wEvgpg', 'text': "My daughter and I came here yesterday for the first time for breakfast. Here we are again today two days in a row. It's that good! \n\nYesterday: I had the ham and asparagus crepes. Divine. My daughter had the pumpkin cheesecake pancakes and a side of hash browns. The food was cooked and designed to perfection.  The only thing I will say is those crepes need a light hollandaise sauce. The pancakes were perfect. We also each had the fresh squeezed strawberry OJ. AMAZING.\n\nToday: we went with something a little different. We tried the strawberry mimosas. Great!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-05-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6odKol8M_aUnbb3knM6Yug', 'review_id': 'IA-y1fI3aE2EyBWg3JWmPw', 'text': 'First time  to this place, very busy an noisy, thats ok.  The cappucino was very weak and took almost 20 minutes to get, almost coffee with froth on top.  The waffle was great, bacon also.  The french toast was also delicous but the canadian bacon was rubbery and tasteless and the hash browns were funky tasting.  The waiter was attentive BUT $42 tip  +  FOR BREAKFAST WITH NO ALCOHOL IS STIFF AND I CAN AFFORD IT. Will i go back yes but no cappuccino at $4 x2 and no canadian bacon at $4 no potatoes at $4 x 2 savings $20 +tax and tip.  There are other options around town like the Breakfast Club which is always consistant.  +-$32.  I give Egstasy a 78%.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2015-05-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'sxJh-Kxt_QYGJcdclF7uKw', 'review_id': 'jyjc62THe7dzjeb7zTwMTg', 'text': 'The chocolate covered bacon is a hands down crowd pleaser! The prosciutto omelette and granola french toast are amongst my favorites that keep me coming back to this place!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-05-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 6, 'cool': 0}, 'user_id': 'xVbnmLJ8g8zBHMs_vtDDKw', 'review_id': 'T7YEWem6Mwjdkac8GBkmlw', 'text': 'This place needs to hire people who actually have serving experience, instead of confused hipsters who match the decor. The servers, the food runners, the bussers, it\'s like no one has EVER worked in a restaurant before. They all run into each other, there\'s NO "behind you," "on your left", there\'s no helping each other out, they have NO IDEA WHAT THEY\'RE DOING. They disappear for long stretches of time, they lie to their tables, they are just completely incompetent. \n\nNever, ever going back to Eggstacy. The food is amazing but the service is ATROCIOUS. Two weekends in a row, our server (a different person each time) disappeared for 15-20 minutes. Last time he disappeared right before our food came out, and I had to wait 10 minutes for him to reappear so I could send back my omelette to get it with no mushrooms...the way I ordered it to begin with. Ok, no biggie, stuff happens, but the food is so, SO good I\'m definitely going to give it another shot.\n\nThe second time, she just didn\'t even put our order in before she disappeared. First she didn\'t put our appetizer order in, then she took our main order and didn\'t put THAT in either! So we sit there, for OVER 40 MINUTES, as tables get sat around us, order from their server (not ours, we didn\'t see her at all for 20 minutes), GET THEIR FOOD, and eat all of it, and STILL WE DON\'T HAVE OUR APPETIZER. \n\nThen she comes rushing over to "double check" what we ordered and she flat out lied about forgetting to put our order in, and that\'s what pisses me off the most. People screw up, fine, but OWN IT and APOLOGIZE. We\'re not stupid. She finally admitted it, and of course my eggs were undercooked because the kitchen had to rush the entire order. UGH. \n\nNever, ever again. Two visits, two instances of terrible service. Done.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2015-05-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'urn5wBRXvy5TwDHBlxG92A', 'review_id': 'FpTtM2_836pT7wsPlptPQA', 'text': 'Great experience as always, food is off the charts amazing,  bartender today was very attentive. The hostess though, she kept coming over to a table next to us, drinking their drinks eating off their plates  she probably knows them but it was very distracting and kind of disgusting.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-05-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '28nsy0LMP9C7K_4bnuSpDw', 'review_id': '-QbAkVU1Jqk8N43ue-ROTw', 'text': "We will not ever eat here. Got out of church on Sunday and called at 12:40 to see how long the wait would be since with the kids we are a party of 5. I was eager to try this place but with 2 kids and a toddler we can't wait 45 mins for a table. \n\nI KNOW Sunday is their busiest day, and having run restaurants many years I also know that they should STAFF FOR IT. I called the restaurant no kidding, a DOZEN TIMES and NO ONE EVER WOULD ANSWER THE PHONE! I don't care how busy you are, you answer the phone when you run a restaurant! As a GM I always had a three ring rule on incoming calls, you have to answer it by three or you might lose the customer. A few times I called, someone picked up and hung up immediately. WTF. \n\nI guess that means they are too busy for my party of 5. FORGETTABOUDIT!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2015-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 6, 'cool': 0}, 'user_id': 'SkRLZojKusTNAugGWQ_ksA', 'review_id': 'zl4gFAp9WPHjrCDSFIg6Ug', 'text': 'Always willing to try something new, but we should have paid closer attention to other reviews. let\'s start from the beginning\n\nUpon arrival not only was the place blasting house style remixed music (on a Sunday morning) but we could hear the full roar of the place from the parking lot. yes, other yelpers said it was noisy, didn\'t think it would be that bad. we opted to put our name down for a patio table. not only did the hostess have to ask three\ntimes how many people we were but she kept asking if we were other parties she had talked to that were already waiting, even after I told her no we just arrived.  she also kept turning around to yell at other hosts about various tables and things. it took almost ten minutes just to get our name down. we were told about 15 minutes, great no problem.\n\nthank god our party was late because it actually took 25 minutes to seat us, at which time we were told they were out of high chairs but they would bring a booster seat over. sounds good right, no... they sat us on a couch! how do you put a booster seat on a couch?! we asked to be moved to a table with chairs and were told they were reserved for other parties. thankfully one of the hosts remembered and brought us a high chair a while later when one became available. \n\nAvoid the couches on the patio if the sun is out, they are plastic and get very hot very quickly.\n\nI\'ll keep the rest short, server did not bring enough water for the table and offered no refills, splashed mimosa on my husband and didn\'t bother to help clean up or apologize, and we only saw him 3 times the entire meal. Crispy pancakes were burnt, salmon eggs Benny ; salty. Skinny bit*h burrito was bland. chocolate covered bacon had too much chocolate. side of bacon was not "thick cut" and was similar to Denny\'s bacon. all around just disappointing. \n\nwon\'t be back that\'s for sure.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2015-05-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'zKY-8M8FLqGDzYPtTxrJcw', 'review_id': 'Jm0cmfMjNAjF23xV87VuFQ', 'text': 'I came here with a few friends just to try something new and I was blown away by the extensive menu. I definitely recommend the Gypsy skillet. I had it this morning and loved it. Next on my list will be the pumpkin cheese cake pancakes. Everyone  should try the bloody marry as well. Its served with chocolate covered bacon! Delicious!  Not only was the food great but out server was very attentive and checked on us multiple times.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'iJJmGWXe9Zwpvrzvyl3ERA', 'review_id': 'uA-hcx5HG1_FvrY-ZzTiWg', 'text': "I sat at the bar today and had wonderful service from Savannah. I should start with the fact that the coffee was great. I had 3 cups! I ordered the avocado benedict and it came out in just a few minutes. I loved that it had swiss cheese on it. I'll definitely be back again.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'grou9UD0FHGOdhkA6r55yg', 'review_id': 'AxowfgYtrLsPyAUsIQeiDw', 'text': "The food was delicious and the atmosphere was bright and relaxing. The mimosas are made from fresh squeezed oranges. If you like pumpkin then go for the pumpkin cheesecake pancakes. Yum!\n\nThe only reason I didn't rate this place higher was because of the cleanliness (or lack thereof).  On a not-so-busy Tuesday morning, we were sat next to an unbussed table that remained that way through our entire meal. The outdoor couches needed a good wipe and the fixtures were void of any light bulbs giving the space a very unfinished look. The restrooms were also in need of attention and they always say the cleanliness of a restaurant's restroom is an indication of the cleanliness of its kitchen. Just a listing sprucing up would make the experience much more pleasing.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2015-05-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QWsDPAFwNgCrUeTNBGVW6g', 'review_id': 'rAdMMjgPrIsSWghyOrgMng', 'text': "Food was delicious with generous portions. My friends and I knew that this place would probably be busy on a Sunday morning so we came early and got a table out on the patio. Everything we ordered came out promptly even though there was a large crowd, and we all loved our entrees. \n\nThe only reason why I didn't rate this place higher was because of the service. After being seated and our drink orders taken, our waitress did not show up to our table to take our order for almost half an hour. Additionally, when our food was brought out the servers forgot my friend's pancakes and toast. We were also the only table in our section without a water pitcher on our table and my friend had to ask our waitress three times for water until she finally got someone to bring us a pitcher. While we were eating our meal, a server came to our table with a dish that we did not order. I don't necessarily blame our waitress per se because I also work in a restaurant and understand that things get busy sometimes, I believe that this was due to poor and uncoordinated teamwork/communication with the cooks, servers, busboys, and waitress.      \n\nIn the end, my friends and I agreed that we would come back and give it another try! We've already kind of decided on what we would like to try next time.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2015-05-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'NQCsyY_ePTi-QnwpcMq3Mw', 'review_id': 'Cx5DgLsctv0s0yyA2w7lxQ', 'text': 'Amazing food. Great presentation as well which I appreciate. Coffee amazing. Now here is my concern. The meals are way too big and I can eat a lot. They are big enough to split and I do not this place to go out of business. Cut your pineapple in half. Make the pancakes smaller.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-05-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '_Rdh3_nXAczlPBNc4aUw6w', 'review_id': 'lw8_gxcG8rV3l1X85gsaZQ', 'text': "Have been here several time and on my last visit it was as good and consistent as my first time.\n\nFirst, kudos for having fresh squeezed orange juice, not to many places take the time and this one does.\n\nSo Fiancee had the crepes and I had the crab and cheddar omelette.  We did share as the crepes where huge!   The crepes had ham, mushrooms, spinach and cheese.  Very impressed, the crepe was perfectly done and beautifully presented.  There was the right amount of balance between the eggs, spinach, mushrooms and cheese.   Did I mention the portions size was huge??  Not kidding as we took a whole one home and I have a good sized appetite. \n\nThe omelette contained crab, cheddar cheese and had ritz crackers on top.  Couldn't understand the ritz cracker thing until I started eating.  Fluffy eggs cooked perfect with a rich cheddar throughout with a good size helping of crab.  Now this is where the Ritz crackers come in- as rich as the components are, the crackers provided just the right balance and saltiness to the dish.  Who would have thought.\n\nAt this point, anything you could have done to the hash browns or pancakes that came with the omelette wouldn't have mattered, but hash browns cooked perfectly and the pancakes I was again impressed.  Light, almost buttermilk but something different and by different I meant delicious.  \n\nService prompt and polite.  Remember to come early or late on weekends as there sometimes is  a small wait\n\nOverall, a great breakfast with a great atmosphere.  Probably my favorite place in AZ so far.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-05-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '332qn-qgZYnDuqhoq2RosQ', 'review_id': 'ugJwaKTTDOdD-g4js5pl0w', 'text': "Not only does this place have the best coffee, but it has such a variety of unique food items and everything is SO good.  Even the healthy stuff is great!  Love the 'skinny b@#c*' wrap and the various french toasts are to die for.  The only negative thing I can say about this place is that the wait staff is a little slow, although very friendly.  I have learned to ask them to either come back to the table often to refill my coffee or leave the carafe at the table because their cups are small and they don't come back often enough.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-05-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jDdkR5eGZqKO_klxvBfThA', 'review_id': '2BsUADso0Qo_PB9eWQZBTw', 'text': "I love the food, but the service is shaky! I waited over 45 minutes the other day for takeout after being told it would be 15 minutes...last week, we picked up takeout and the order was wrong. The time before that, we never got our coffee or drinks, and the food came out before the drinks. We were charged for the drinks, and I said something to the waitress who didn't adjust the check, so I mentioned this to the owners, and they made everything right, which I appreciate, but the servers don't ever seem to care! I love the food so much that I can't lower the stars anymore than 4, but I refuse to go there anymore when it's remotely busy. It seems like 7 out of 10 times there's an issue.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-05-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Hgh6KS2Efc8FR7J1svV9lA', 'review_id': '0PeVpgmhS5m7JvpDNRdurw', 'text': "What consistency. It seems like ever since this restaurant opened I've gone every time I've been in town. They have a ton of options but the menu doesn't make it difficult to order. I'd recommend the steel cut oatmeal, absolutely delicious.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-06-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'A-jjRYTVlUrL6Z7wIIzZIg', 'review_id': 'E7cqKFOV0ouuni5xPjzE-g', 'text': "Place was clean and good the food was pretty good. Orange juice was really good fresh squeezed. Cucumber flavored water. I got bacon eggs and hash browns with. Pancakes the pancakes weren't my favorite they tasted like from the box but okay. The orange juice was my fav. Waitress was nice . They took long to notice me at the bar cause I was alone. It took around 4 for them to even say hello. Which is why I gave a 4 hospitality is very important for this type of restaurant. . I would come back they have interesting items on their menu.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-06-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZH6EpqEGniVqIs4mckDIYA', 'review_id': 'RsTjuUI4XQasdhmF8ELYNg', 'text': 'Now that the snow birds have gone home, get here for anything on the menu if you have not been here yet. I am trying to figure out how to get a few to go orders and stick them in my travel bags next week!!!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-06-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '19BunjXk7zhd811rF42U7w', 'review_id': 'cAa0wKF8zHZVMjMnU1CPng', 'text': "Love the concept of this place.  Menu is creative and on trend with both guilty and healthy options.  Today's breakfast flatbread was inedibly salty.  The restaurant was really apologetic.  The chocolate covered bacon was also a miss.  First time our family hasn't finished an order of bacon.  It was cold and soggy.  Will definitely give it another try bc service and effort on behalf of the staff were great but it will probably not ever be on my go-to list.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2015-06-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': '_8o_CVDQNWx3QluULdaTdQ', 'review_id': 'lNWCcIUH8ii1sE2Ad-noDQ', 'text': 'Maybe this was just an isolated incident, but for my wife to say she absolutely hated a breakfast experience is something that I\'ve probably never heard from her mouth. The server was completely absent the entire meal - no check-in, no coffee refill, nothing. The food was bland. One of the poached eggs on the benedict was cooked through, the other barely runny. Didn\'t matter too much though since the meal was only luke-warm by the time it made it to the table anyway.\n\nThe owner came over and asked how things were and my wife said "disappointing," then she left and never came back. A bit later a manager came back to say it was our fault for not complaining while we were eating. Would have been an option had the server ever stopped by. \n\nNever. Again.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2015-06-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-qEO4PkRNlkmQKvpB0Im2Q', 'review_id': 'OPqi0Bih2W9l5iuu1vOFaQ', 'text': 'I have been searching for another special breakfast spot for awhile. I finally found it. Awesome selection,  great service,  delicious food. I have been won over.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-06-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HyqXOQcsdlOPj-xDxLe5tw', 'review_id': 'lSpf1gZ4ipt1lzBekPux8g', 'text': "Well... This place was recommended as a new breakfast spot in my neighborhood. I'm always down for a delicious breakfast but the overall experience was less than stellar. The hostess greeted us immediately with a smile and sat us at a table near the kitchen. Great start. Our service was ok. There were maybe 5 other tables taken at 11:45am on a Tuesday but got as much attention as if the place were packed. The servers all looked bored and less than thrilled to be there. I'm giving 3 stars is for the food. The Salmon omelette was HUGE and pretty comparable to similar dishes I've had elsewhere. Fruit was fresh and hash browns were perfectly cooked (in my opinion). Might give it another go on a weekend morning to get the full experience :)", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2015-06-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ghgnf-uxWmaAWCEYlyDxqA', 'review_id': 'Q2b4TmACOWbtW0qnaKU53g', 'text': "The best breakfast place around!! The place is cool!  Awesome lively atmosphere!  I love the thick smoked bacon and fruit kabob's.  Cool decor!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-06-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'YuP0nieAHhieo8DbBC84zg', 'review_id': 'bS9ZCk6ICaEO-Q1I7ifVlg', 'text': "Not impressed. Although we got seated right away which was rare for a Sunday, service wasn't great. I immediately recognized it was quite warm when we walked in.  Disappointing when it's July in AZ and people are looking to escape the heat.  \nOrdered the Brioche French Toast, came out way undercooked. Very rarely do I send items back, but this was not edible. Not to mention the fear of consuming raw eggs when you're pregnant isn't very comforting...  They offered to remake it and I kindly declined but they did it anyway and it arrived when my family was done with their meals.  \nHaving been in the food and bev business for years, it's common courtesy to remove an item from a customers check when they are clearly unhappy with it. Not the case here. Guess they need the money more than returning customers.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 2, 'date': '2015-07-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HqaVO-7mUn1PjSHhB5BKNQ', 'review_id': 'QocCf773F06TGuD7CMwRAg', 'text': 'We love it; kid friendly and great food :)', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-07-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ksk1X-DT_jA_QnrjrJL8fA', 'review_id': '_ASCbAu31OBN-5vQ51otrA', 'text': 'Delicious food, enormous portions and great service!  However 83/84 temperature will keep anyone away..... Please fix!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-07-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fETgjsZ6mUfeM82oDvhBEg', 'review_id': 'IEB7ZE-YqP7fDuSQNR4eiQ', 'text': 'Love everything about this place, including the impressive options on the "healthy" and "healthier" menu. Sat at the bar and ate the most incredible "healthy" berry crepes I\'ve ever had. The blackberries are the size of my thumb - they do not skimp! Luckily it\'s a weekday so not too busy because this place has a line out the door on weekends. The coffee is strong and today was not a mimosa day but those are awesome here as well. And I\'m not a Bloody Mary drinker but here, they are works of art and can include bacon!! Back to the crepes again...I\'ll be dreaming about them.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-07-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'rAQELUZSV53dEW4ecAcILg', 'review_id': '7Y0jmlIQ8GBfyop2kl0xAA', 'text': "My friend and I had such a great experience at Eggstasy! We made reservations for brunch on a Saturday, late morning. When we arrived, we were quickly seated. Every employee that greeted us seemed genuinely friendly. They were attentive without being overbearing. And the menu! Oh, the menu! So many unique options! It took us quite a while to make up our minds. We decided on sharing a sweet and a savory dish. Our fantastic server Elena split our dish for us. We shared the quinoa, kale and sun-dried tomato omelette and splurged on the pumpkin cheesecake pancakes. Wonderful choices! The pancakes weren't too sweet. My friend got the fresh-squeezed orange juice. I had coffee which was served with real cream. The carafe of water on our table had cucumber in it. Every detail was perfect! I wish I had discovered this place earlier! I'll be back soon. I want to try the chocolate covered bacon!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-07-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JNynkUjwb9UH6mr3izlJ3w', 'review_id': 'wBOZP9ngGI1KqapIEfXIvg', 'text': "Just about the crappiest service I've ever received. I took my parents and grandparents and we will never be coming back. It took 1 1/2 hours for them to screw up 3 of 6 orders. I only gave one star because I had to.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2015-07-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zxW4ceCK6pb4XhhJx61i9Q', 'review_id': '0Jv358efJ4BRSxB0vVqIwQ', 'text': 'I have been coming here for a year now with the best corn beef hash I have had to date!  Food is great and on top of that cannot even finish the portions. The service was great and manager came by to check on everything!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-07-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1EThs7Vakny7bGBRQk6x2w', 'review_id': 'gP8_kcFk6PkfCVH8QVlq_w', 'text': "Good service, excellent fresh squeezed/pressed juices, but only so-so food and higher than normal prices.  The omelet I ordered had great filling, but way too many (overcooked, rubbery, greenish) eggs surrounding the good stuff.  My boyfriend had some decadent stuffed french toast and he was happy in sugar high heaven.  We also ordered coffee and bacon, as those are our litmus test items for breakfast places.  The coffee was just ok and the bacon was decent.  The restaurant itself was clean, bright, and had a good vibe (very friendly wait staff).  I did note that the main dining area was really noisy.  Definitely won't be bringing Grandpa here.  Huh? What?  Never mind.  Overall, *shrug* - we're 50/50 on this place.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2015-07-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': 'LOxeeZNWCPeR1NkIT1OUig', 'review_id': 'YaabiPvlQYn4J96FhsgoJQ', 'text': "One of my fave breakfast/brunch spots in the Valley!\nThe Red Velvet French Toast was a religious experience. The wait time can be lengthy on a weekend but it's worth the wait.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-07-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'OKVWX29kQ9yF3MoyPVb4YQ', 'review_id': 'VqtRpbWYrX_np68XdXd49g', 'text': "I'm 30 years old and this was the best breakfast I've ever had my whole life. My husband also agrees the best. I had the fig jam and goat cheese omelette and it was everything I've ever wanted in a breakfast. My only complaint is the huge portions which really isn't even a complaint. \nThe dining area is one huge dining room so it does get a bit loud but it's worth it.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-07-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fS8t0K8jGXOA_8ZYy9rO3g', 'review_id': '92hkR3APoOCK4foXUJLJUw', 'text': "The menu is amazing, each time we dine here is better than the time before. Service is great, and the coffee rivals any we've had in Europe. The only thing that saddens me is there isn't an eggstacy in the Midwest.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-07-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 't9aMX210408x1ybkz-UK8Q', 'review_id': 'qEZmRtIAtuJX7mRfIWBrAw', 'text': "We had the best breakfast yesterday. They started out with 5 stars due to the cucumber water and LaVazza coffee and espresso and never lost a star. The mimosas were delicious with the fresh-squeezed OJ and then the food came. We split a two egg breakfast with turkey sausage, since we like a light breakfast, and it was delicious and cooked perfectly. The hash browns were crispy and the turkey sausage was amazing, not your typical Jimmy Dean sausage link. To top it off, the sourdough toast is some of the best we've had. We will definitely be back. If you want a leisurely breakfast, sit at the bar - it gets busy and they are quick to turn tables.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-07-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Jd99ZkNojrTxy-tDKjsROw', 'review_id': 'fnOyN6t8wHjoFrcVKloAHw', 'text': "My family went there as a celebration so there were 6 of us.  The service was slow and we had to keep looking for our server and then flagging her down so she would come to our table.  Three of us ordered the eggs benedict and all agreed that the english muffin was very gummy and soft.  The pancakes were good though which seems to be the safe bet there.  It seemed very warm in there and we were seated inside.  Our bill came and it seemed extremely expensive for the quality of the food.  I can say that the coffees and the fresh orange juice was good.  Would i go back... I don't think so...", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 2, 'date': '2015-07-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ob-aUBLAA9JhhwC4VUTQSQ', 'review_id': 'o6tDRQPR8jPnI0pCIuX9Tw', 'text': 'Still love the food-but we had a rather weird experience there on our last visit!  Our waiter started out great:  brought us waters, got our coffee, took our order, pleasant and courtesy.  Then after he served us, he came back for our obligatory "how\'s everything?" and DISAPPEARED!!!  We flagged down another waitress who re-filled our cups, got a box for my leftovers and she apologized saying she didn\'t know where our server had gone.\nAbout 10 minutes later we were ready to leave and STILL never saw our server!  Hated to do it but flagged down the nice waitress who had helped us before and asked if she could find our bill.\n\nShe did and apologized again, but we never saw the original waiter again.  Lucky the food was good.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-07-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Tr3JSR6nNtCkmBXShvlQHw', 'review_id': 'wHQGhLrF1stRXl5rAF8PEw', 'text': 'My significant other and I visited Eggstasy this Sunday morning of July 26th - this was our second visit to the establishment. On our first visit, she ordered the Incredible Omelette and I chose the Traditional Eggs Benedict. We both felt the food had an exceptional taste and thought we had found another option for our breakfast outtings. \n\nWell, needless to say she ordered the same Incredible Omelette and I, this time chose the Steak and Eggs Benedict. Things seem to be ok until the BIG SURPRISE. We both started to feel ill an hour after breakfast-- she more than I as she was truly so sickly throughout the entire day. We did not eat for the rest of the day, only hydrated. \n\nWe both immediately knew something was defintely wrong with the food this day...a big disappointment. She was the one who ultimately wanted to visit Eggstasy this morning -- I wanted to go elsewhere. She says she will never go back to the establishment again.\n\nSo, with no disrespect to the establishment...it appears the food was either mishandled or perhaps your meat was either spoiled or not cooked properly.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2015-07-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'F0ikCDDePAkiTkKZoeVqOw', 'review_id': '3ej-35h_wWNKzuFk9-P9Nw', 'text': 'Wow I just love this place!!\n5 star Customer Service \nGreat Prices \nExcellent Food\nVery Healthy.....!!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-07-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'd95On_QNeQPr01pRNzHa5w', 'review_id': 'WgNFk63jZ-dWEnNc2yt2sA', 'text': "Went here for a birthday breakfast with a girlfriend. Had the classic eggs benedict. It was good, but not the best I've ever had, although I can't really tell you why-maybe it was their hollandaise sauce?  The place is very modern but it kind of feels like you are in a cafeteria the way the tables are situated. And I can see it getting very loud if it's really busy. The portions are enormous! Good potatoes too.  Definitely enough to share a couple things. I will try something else next time.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-08-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Asmapmun4RCApMNFl4-OaQ', 'review_id': 'aPB_jr5GDlZvlYMLiAwTSw', 'text': u"Could easily be Five Stars except even in my young 40's i have to comment that the tile on the floors and walls make the place exceedingly loud...to the point that any group bigger than two will strain to converse and hear.  If you have family in town, as much as you may want to show off the great food, your guests will definitely not appreciate the absolute cacophony.\n\nSo on to the fabulous food!!!\nEating with a large group of 7 made it easy to taste the menu broadly.  The biggest hit was the Pretzel Croque.  Egg perfectly done atop a pretzel bun with light stone mustard and perfect bacon.  The accompanying b\xe9chamel sauce was not over done and the kitchen knows how to show restraint, despite the massive portion for 3.\n\nAll of the crepes were large portions and deep in layered real fruit flavor that doesn't club you over the head with typical syrup.\n\nThe breakfast panini is very satisfying and balanced to perfection.\n\nThe kid portions ate equally massive.  One regular dish and the kids S'more pancakes could feed Kate+8.\n\nThe Red Velvet french toast is overtly decadent.  I would add that it is simply real red velvet cake battered and fried.  Now here, the massive portion size ruins it.  This is just too much of a good thing.\n\nAside from the gross feeling you may get from the amount of food you have either wasted or consumed, the only weak spot regarding the menu is the fresh juices.  They are  quite tart to the edge of pucker and entirely over priced.\n\nIn summary, great flavors, dodge the juices and keep your group small.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-08-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'r9rIGtBSE2cZY8SwE1gKtQ', 'review_id': 'FF7i3O8AH_eCOgI5O7kTbw', 'text': "If I closed my eyes and pointed to anything on the menu I bet it would be as amazing as any of the other items I've already tried and thought were fantastic. Crepes- delicious! Mimosas- awesome! Not a huge pancake fan, but even their pancakes are EGGSTASY- AND super close to my house. BOOM! So good :)", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-08-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mhFx_-3VCd_4yPz3yy1z1w', 'review_id': 'm25qO1wsLQgjk1yjzrNnpA', 'text': "Had a breakfast here last weekend that I can't stop thinking about... Savory pop tart with fried chicken, it was magical!  The owner recommended it to me & I'm so thankful I listened, not that I've ever had a meal here I didn't like!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-08-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VpRR1mcbK4FahWifr2mpYQ', 'review_id': 'wy75nR9CmFdwpPzn01pucg', 'text': "We really enjoy this place. Our first visit didn't go so well because we were confused that a pancake would come as a side for an already large meal and there was just overall miscommunication.  We have been back twice since and have enjoyed both of the other visits.  Good mimosas, good breakfast and an assortment of things to choose from.  It's great because my mother-in-law can get something super healthy and my father-in-law can get his not-so-healthy choices.  I love the avocado benedict but also enjoy the skinny b as well.  Cute decor. The inside can be really noisy.  There's a lot of concrete/tile/metal so noise kind of bounces around. I think it's better when the windows are up on the one side of the bar because the noise has an outlet- but on a day like today when it's 112 and not practical to open the windows, it gets noisy.  Not a huge deal though because the great food makes it worthwhile and normally we sit outside if we can anyway.  Nice breakfast place that we enjoy on occasion.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-08-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Oaw7VEeqlGAbODkik3m4CA', 'review_id': 'uiMhizNsPUlqxyScL__Bbg', 'text': 'Food was great, Pumpkin cheesecake pancakes especially! I want to go back for the red velvet ones!\nService was terrible. Took 30 mins for my drink to come and the food took a while as well. Server barely stopped by. Need to work on that but I will try again.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2015-08-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'Iqbr8D8qLFXoS3YuEIdHcw', 'review_id': 'ReNKIuojmf9WE8V0tvLQ9A', 'text': 'I\'ll admit I was a little skeptical of trying brunch at a restaurant with a name like "eggstasy"- it just sounded kind of cheesy. At the same time, the pun of the name sucked me in and we had to try it! \n\nThe challenge of weekend brunch is always finding a place to go that doesn\'t have a 45 min wait. I was pleasantly surprised that we only had a 10 min wait on a Sunday around 9:30/10. \n\nThe ambiance is trendy with a bright, semi industrial and loft like feel. There\'s a white tiled wall that gives the entire place a clean, fresh feeling. The light fixtures are modern and inviting. The layout is spacious. It\'s a bit loud with the hustle and bustle of servers and people but not uncomfortable. \n\nThe menu! That is what impressed me the most. The sheer variety and unusual options make it worth coming here. The portions are huge also! My hubs and I could easily share a plate and be satisfied but we usually opt to try two and share for the variety and take the rest home.  \n\nOf the two times I\'ve been, I really enjoyed the brie, apple, and chicken sausage omelette. I\'ve also had a savory crepe which was delicious! Like the rest of their menu, the crepe section is extensive. \n\nThey serve Lavazza coffee and offer to-go cups- such a bonus. \n\nFor me, the value is definitely here for breakfast/brunch. The prices are comparable to other brunch places except their menu is much more interesting.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-08-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0NK3ZytUl8PznPx4JXelvw', 'review_id': '8wnCFkB7H3cpxWvB8JwwYg', 'text': 'My husband loved the house made maple sausage patties. Our juice order was very delicious. Good flavors and very good service. Our server, I think his name was Jake. He was very attentive and super friendly. He made our experience even better.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-08-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WEoItQSXkMYnuILzo-lKmw', 'review_id': 'Di21AIb27bXBIEEwu1clcw', 'text': "If you are looking for really good breakfast or brunch in a great atmosphere...this is your place! They have a huge menu so there is something for everyone. If you want to eat healthy, like my girlfriend, there is something on the menu for you. If you want to not eat healthy, then there is something for you too and everything in between. I normally get their omelets and create my own. Their omelets come with a side of 2 massive pancakes! They are the best pancakes that I have ever had! And you get an option for a side...whether it be has browns or fruit...get the hash browns..you won't be sorry! They offer freshly squeezed juices and other great drinks. Their service is fantastic! This place is always busy when I come so expect to wait a little bit. Highly recommend!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-08-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'poO1yHdmNgADwiZ6A6JNcg', 'review_id': '1xjkOfb6F1dfLsvP8sD8OA', 'text': "Thanks to all the great wait staff  you are all great ! Kudos! The food is the best around by far ! I've had at least 8 different dishes here so far and no one can top the cooks ability here. Fruit is always fresh and sweet and the veggies are alway crisp and flavorful. Great eggs and French toast and pancakes and Bloody Mary's and ........... well you get the idea , I Love This Place", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-08-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JIVx3uGe6PlyXAN3hDajqg', 'review_id': 'tITA8Qt5m3Wq8jTwQQzwpQ', 'text': "So i've been to Eggstasy three times and there are a few things that have been pretty consistent in terms of pros and cons.\n\nPros:  Really unique menu options and the food is really good. The staff is also very friendly.\n\nCons:\nIt's really, REALLY loud in there!  I feel like I'm in a middle school cafeteria.  It doesn't help that they play club music which just makes people talk louder.\nThe service can be really slow. I've either had to wait to have my order taken or wait to cash out.  \nThey tend to mess up the order. The first time I was there I got the wrong pancakes. The second time I was there my omelet was wrong. I was there today and although I ordered the banana crepes, I got the french toast.  I can only assume they screw up the order because they can't hear me correctly since it's so LOUD!!\nThey also tend to do a hit and run when dropping off the food. Not once in the three times I was there did the runner ask if I needed anything. As a result, I had to flag down or wait for the server to get ketchup, extra napkins or anything else for that matter.\n\nOverall, if you want good eclectic food options give it a try; just be prepared to shout and get a slightly different version of what you ordered.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2015-08-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JLdgRxiIsu0Ce0WDDCQ7Yg', 'review_id': 'mv5VhhvxYMJxSmAxEmqtOQ', 'text': 'Overall a disappointing experience.  The restaurant is very trendy looking.  It seems like it should be in LA.  The menu is filled with intriguing options and interesting choices for those who like to not eat a boring breakfast.  The meal started out with rancid "fresh" pressed apple juice for my son...obviously not so fresh.  A second stab at it returned another slightly less rancid tasting juice.  At that time I just said forget about it.  My wife and I had bloody marys, described to us as the best you\'ll have.  They came with a piece of chocolate covered bacon and a useless skewered garnish of 1/2" thick green and red bell pepper rounds and 1 green olive.  No matter how much I stirred I couldn\'t get any flavor out of the bloody mary, I even added more salt and it was tough to get "the best bloddy mary ever" out of it.  My wife only took about 3 sips.  We ordered our breakfast.  To my surprise the waitress came back a third time and brought me apple juice that was not rancid and was quite delicious.  The savory food was overwhelmingly underseasoned with the exception of the prociutto benedict, which was so salty it was difficult to stomach.  I had the crab dip omlete and again, no flavor, the cheese was only in the the very very center and not throughout the omlete.  We added a cheesecake pumpkin pancake and it was OK.  The pancake was moist and yummy, the sauce could have been a little richer (It tasted like a loose cream cheese frosting).  Finally the banana nutella crepe was very good, but it would be extremely difficult to mess that up.  The waitress was attentive to our needs until the end when we needed to pay, then she couldn\'t be found.  Our card was sitting in the checkbook, upright, for 10 minutes.  The prices are very high for a breakfast establishment.  The tasteless bloody mary will set you back $10, because you are paying for chocolate bacon and bell pepper that do not compliment a bloody mary.  The icing on the cake for me was being charged $5.50 for the apple juice after being served not one, but two rancid apple juices.  I\'ve been in food and beverage nearly my whole life and I would never charge a guest after screwing something up twice.  I\'m not saying that they may not shine, but for the price I would expect nothing short of spectacular and that is not what my family received on August 29, 2015.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2015-08-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oMyMhtqxKi3vki3xrMWXQg', 'review_id': 'ZYID-h--0QnHIn_Gdy4aOg', 'text': 'Great food, massive portion however - service forgot our orders, coffee was way to sweet like drinking suger and no AC.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2015-09-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kM-z6yDLAWAPwWhmH2Qikg', 'review_id': 'fyhKvjeXPwy74Tk19Ku_jA', 'text': "Just Ok. Yet another breakfast place attempt to be trendy. It's very noisy because of the interior, nothing to absorb sound. So if you want a Sunday brunch where you can sit and enjoy you coffee with conversation, this isn't the place for you. If you want decent breakfast food, a modern utilitarian decor, and tables filled people wanting to be seen, this is it. Popular with the post Saturday Night hangover crowd.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2015-09-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wdMhw1bfwjDSfkjTp3CXdA', 'review_id': 'z8cBNFx-vF1RvsWAmBvc3g', 'text': 'Food is great...portions are generous(best OJ anywhere), service was impeccable(Michael was our server) BUT in the summer the A/C is HORRIBLE...we were hot the entire meal...they need to repair the A/C or get new units...what a  great way to ruin a wonderful restaurant!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2015-09-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'psSxO_7PWbBbUiV2jB6BUg', 'review_id': 'QruWtQXd26kZTbvFbn1QdQ', 'text': 'Best place to eat.  Everything is fresh.  Food is fantadic and cooked properly.  Elizabeth is a great server.  Pumpkin pancakes are delicious!  My new all time favorite place to eat breakfast hands down!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-09-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'itMqNCceKH3-whpDsgtoAg', 'review_id': 'QmeqmlxScRUN2RannP3dZQ', 'text': 'Totally love the ambiance, service (Erica), and food was amazing if I lived here would be there several times a week.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-09-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Wcklre6gDWFL1Atsw5OGWQ', 'review_id': 'GCrJfWf6DvF5IwUkiothHw', 'text': "I've eaten here a couple of times. The food isn't anything that great. Pumpkin cheesecake pancakes were good. I had to send my food back once. Last time I ate here I got the crepes. They were dry around the edges. I can get better crepes elsewhere. They had the roll up doors open that lead out to the patio. I really wanted to drink hot coffee with my breakfast but it was too hot to do that. It was 99 degrees that day. It was way too hot to have them open, not sure what they were thinking. Or open them in the morning and close them when it gets hot. My mom did not like her food either. Service was mediocre. I won't be going back. I'll stick with Butterfield's.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 2, 'date': '2015-09-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jhqa6jxYXiGCYq4nm9d-uw', 'review_id': 'IG85Zdm8_oE0sWlnl9fRVw', 'text': 'This was our second time at Eggstasy.  On both occasions we came with our kids.  Although the food is good, the kitchen  staff seem flustered and the food orders get mixed up.  Today my family ordered and the food took about 20-25 minutes to arrive which is a long time to wait with hungry kids.  I ordered the Roasted Veggie Skillet.  The veggies were frozen and defrosted and not even roasted as the name suggested.  My dish also came with a side of pancakes which never came.  I kept asking and then finally I took them to go.  \n\nThe kids meals are good, but I wish they would include fries instead we had to order them separately.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2015-09-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7eMZSm2pnpmNm_1h6S_tig', 'review_id': 'AcYVKHXiDOVKpBMNjQoIbg', 'text': "I'm new to Scottsdale and I decided to venture out for breakfast one morning. This place is pretty close to home and I thought I would check it out. \n\nMy first impression - this place is LOUD. The acoustics in this place make general conversation by diners echo and it sounds like a high school cafeteria in there. I could barely hear my server. So, if you're looking for a quiet breakfast, this won't be the place for you.\n\nI must have just missed the main breakfast rush, because the place was full, but I only had to wait a few minutes for a table. \n\nBonus points - the regular coffee is really quite good.  If the coffee was that good, I was very excited for my meal.\n\nI ordered the Steak and Eggs Benedict which came with hash browns or fruit (I chose hash browns) and I also ordered a side of the Chorizo Cheesy Grits, because I was curious.  I requested the steak be cooked medium.\n\nMy food arrived fairly quickly, and it was almost perfect.  The steak was juicy and flavourful, the eggs were poached perfectly, the sauce was delicious. My only slight complaint was the English Muffin was a little under toasted, so it tasted a little gummy. The hash browns had a slight hint of heat to them, which made them fantastic.  The Cheesy Grits were fine, but not what I was hoping for.  I wouldn't order those again.\n\nThere were so many menu options that I deciding what I wanted to eat was a challenge.  I will definitely be back to sample more of their options.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-09-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '64zr0ya6XxOYGZ4ao3WZ-Q', 'review_id': '2XRkrX1MQTXOGb9NovnDfw', 'text': "Went here for breakfast yesterday, which was Labor Day. Sat at the bar, on the patio side. The guy behind the bar said he was new and apologized in advance for his not being familiar with the bar. Wasn't a problem at all. What was a problem was the old lady wearing a mumu working behind the bar. From previous trips, I assume she is one of the owners. She was a horrible representation of the restaurant. Dressed like she just rolled out of bed, you could tell she had dark underwear on since her clothing was super thin. At least get hair and makeup were done. But this is the worst part. On several occasions, I saw her wipe her forehead with her hands, and then serve drinks. WITHOUT WASHING HER HANDS. Then, she collected trash, pushed it down in the bag, and went back to serving customers. Again, WITHOUT WASHING HER HANDS. I really hope this gets read by ownership/management, because there is no place for people like this in an industry where appearance and cleanliness are so important. And if she is indeed an owner, she should be ashamed and embarrassed. Have some class and give your employees the proper training and support so you don't have to be hands on in that capacity ever again.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2015-09-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Hqh0x1iXguIPvuR02T7JNA', 'review_id': 'ap9UV1xCMgXV-RB1Ya4LDw', 'text': 'Excellent\nVisiting my daughter who attends ASU\nDrive out from San Diego, CA. What a great place to eat ...Delicious !!!! Eggs Benedict fresh fruit kabobs crepes, pancakes, amazing Omelets. A must Try. You will not be disappointed. Our waitress was so nice...Jessi\nC. Lovejoy\nSan Diego, CA.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-09-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nfR1WIVWJMEeVLLvtMF-gQ', 'review_id': 'kTN8sYX6PyMFxlgauexcBQ', 'text': "Pumpkin cheesecake pancakes were good but the sauce didn't taste anything like cheesecake to me, and 4 giant pancakes is really too much for one person, especially with how sweet they are, so I'd suggest sharing. Also tried a special of the day which was an omelet with a sweet corn relish and braised beef which was really tasty. The omelet was super fluffy but hash browns were crispy to he point of being dry so I wasn't a fan. And my boyfriend said the toast, despite looming really yummy, was weird and not good. Service was good!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-09-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CH86vJhWEHHxea1vstTpPQ', 'review_id': '1EQE6pllnEGfs-vxJFzWEw', 'text': 'I watched the bus boy grab glasses from inside glass with hands that just cleaned tables, and hold stacked coffee cups up to his sweaty shirt chest. The food is tasty but seriously question health ratings! Mgmt needs to pay attention', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2015-09-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LxlU4sLDYuK_EhTBxmuDeQ', 'review_id': 'aC5IpQDP4A-3UBicuVjn6A', 'text': "came here for the first time this morning for a birthday brunch. the chocolate milk was pretty good and the service was fast. for a group of 10 girls we got our food out within 20 minutes for everyone. I ordered the toasted coconut papaya crepes and a side of crispy prosciutto. the prosciutto was really good and was the highlight of the meal. the coconut crepes were nasty. the actual crepe tasted gross and there was no coconut flavor. my friend had the strawberry Nutella crepes and she said hers were like dog food. overall I wouldn't come back. I can get a better meal elsewhere.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 2, 'date': '2015-09-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8MH1_AV9Z7gL8uLz2IZhzQ', 'review_id': 'NMMf2VSVfTrbe0jhJaz2oA', 'text': 'Lets talk about HORRIBLE! \nFirst time here, recommended by a few clients.\n\nServer: Leona or something like that. The WORST!\n\nIn my 20 something years, I have never had such a bad experience. One thing about any type of work, leave your bad attitude at the door. If you don\'t like your job, find something else to do, don\'t ruin my day just because yours isn\'t going well.\n\n-came in, host was nice\n-sat down\n-L came and poured us water, walked away\n-once again, never been here. Would of been nice to explain a bit of the menu\n-L two tables away, starts yelling to us asking if we wanted anything to drink. Really? You couldn\'t wait until you actually approached our table? \nOrdered two bloody Mary\'s \n-for all the fuss about the bloody Mary\'s, they actually had no taste, very disappointing \n-L come by again asking if we are ready to order, before I could even say anything, she turns her head and walks away\n-about 2/3 minutes later, she comes back and asks what we want\n-my friend had a few questions, of course, and L seemed irritated to answer\n-I asked about the eggs Benedict. Got two options, later to find out they have about 6 different ones to choose from. And yes, she looked annoyed about that as well\n-about 30 minutes into it, our food has yet to come\n-I look around and notice 3 tables, who came after us, are already half way through there meals\n-I look up trying to find our waitress and see her by the kitchen, she starts walking to her section and notices that we still don\'t have our food\n-runs to the computer and puts our order in\n-comes to the table and blames the kitchen for not getting the "prosciutto" right.\n- don\'t ever LIE to your quests, if you were honest, I would of understood, shit happens. But don\'t tell me 3 orders went in, but ours simply didn\'t go through the system. Are you fucking kidding me? \n-on top of that, don\'t blame the kitchen, take fault for your mistakes\n-I got up, stopped the order, called for a manager\n-took off our drinks, obviously. \n-asked if we wanted the food to go on the house. After the worst service ever, no thanks.\nOffered coupons or whatever for next time, no thanks. I didn\'t complain to get free stuff. Your servers need to be taught better. \n\nI\'m not one to complain, people have their off days. But this one, I can\'t even put in to words, of how I felt. So un welcomed. \n\nIt\'s unfortunate, your food has been talked up by many. We didn\'t get to taste it, and I refuse to ever go back. \n\n0 stars!!!!!!!!!!!!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2015-09-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'thdVzCfKx-DV0zYWqId3pw', 'review_id': 'rNi8pJiZZNRLQ9QffnFBIQ', 'text': "A good pun for a name will always have me interested in a at least giving the place a try. So when meeting some friends for brunch, why not try Eggstasy? To sum up my experience eating there; Pretty good food, but length of the dining experience was unnecessarily long.\n\nMy group of four adults and a baby walked in at 10:30am on a Sunday morning, but didn't leave until about 12:30pm. Like at any breakfast place, anywhere, I expected the 30 minute wait to get a table on a weekend morning (especially a Sunday). But what I didn't expect was to wait another 30 minutes for my food to come after I ordered it. One of the best parts about going out for breakfast is how quickly it can be cooked up. It was obvious the kitchen was in the weeds. We could easily see all the runners and servers standing around waiting for orders. And an apologetic waiter could only do so much.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2015-09-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'U2YywC6a7Qp4yosyJFE7ZA', 'review_id': '9WRD502fhR7lO-Rzu5xY6Q', 'text': 'Great food and awesome service. Get there early on the weekends because they are packed!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-09-19', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'qvVUH58N9WrsA1pSMi7Zig', 'review_id': 'Lr6ZHXbsKTZUMsldwHijEg', 'text': "I'm so disappointed in Eggstasy. I've been here a dozen times or so. My husband and I love to go out to breakfast and Eggstasy was in our regular rotation. \n\nOur last visit we went right after our workout. The food is good, portions are large and they have excellent coffee (my demise).  However, on this day, we sat at the bar. The bartender refilled my iced coffee with hot coffee and more ice. I took a sip and the bottom of the glass blew out. A FULL cup of warm coffee spilled all over my pants and nikes. The bartender throws me a fist full of napkins. As I continue cleaning myself off, the bartender moves our plates down a few spots so they could mop up the floor. She runs to the back to consult with the manager (i assume, although no one ever came out). When she comes back she asks if she can make me a fancy latte to make up for spilling coffee all over me, ok thanks.  After a brief sorry and a latte, we get the bill. They comped our coffees. So not only so I have drenched pants and Nikes that are stained and smell like coffee, I got $6 worth of free coffee. Super. \n\nI was incredibly disappointed and baffled with how they handled this siuation. No apology from the manager. This just goes to show how much they value their customers. I will not likely be back.  \n\nMe and my coffee drenched Nikes will be at US Egg across the street.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 2, 'date': '2015-09-19', 'type': 'review'}
{'votes': {'funny': 17, 'useful': 26, 'cool': 25}, 'user_id': 'RsUNADZTrJ5xFXVMXJC1MQ', 'review_id': 'iiaz5osU7PpsZxDDGuiPcg', 'text': "I was running some errands on a Saturday morning so we decided to get breakfast. I've been wanting to try Eggstasy for awhile. So today was the day. \n\nWe walked in and thought great we're gonna have to wait cause there was so many people waiting. Luckily, it was me and my wife and they seated us right away. What a relief. \n\nThe place very bright with bright yellow and green bring color to the room with cool light fixtures. Very welcoming and warm but really busy and loud. \n\nAnyways, I ordered the Lemon Blueberry French Toast with a side of homemade Hash Browns. I got three huge pieces of French toast with fresh blueberries sprinkled around with fresh whip cream, strawberry, butter and syrup. First bite and wow. Loved it. It had the lemon flavor with blueberries inside the French toast. Really tasty and thick. The homemade hash browns did not disappoint. Really good and crispy the way I like it. I'm a pretty big eater and I could barely finish it. Portions are huge. \n\nMy wife got the two egg breakfast with hash browns and pancakes. She loved it and was talking about it on the way home. That doesn't happen too often. She loved the crispy hash browns but was crazy about the pancakes. She thought the pancakes were crispy on the outside and moist on the inside. Cooked just right. She thought the pancakes had a different taste than all the others ones she had before. \n\nThe service I thought was good. Our waiter poured glasses of water and they leave a pitcher of water with ice & cucumber in it. Out waiter kept an eye on us and took away our finished plates very quickly. One thing that impressed me was how quickly then can clean a table up. One person cleans, one person sets the table, and one person sweeps up for those messy people. \n\nI thought this was a really fun place to eat. Very lively. Huge portions. Good food. What else could I ask for breakfast. Enjoy.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-09-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6nLU4NyM2u5XmqBMdgPsiw', 'review_id': 'a_5oYitcNLHIWT-SJPDcMA', 'text': 'Eggstacy is a great spot for brunch! It has a fun, open layout with colorful decor! The omelet and coffee have never disappointed and they have fruit kabobs that come as a side for a dishes - Delish!!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-10-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BOfA5AOIY4Y9huxjkwMWdw', 'review_id': 'np9j6Ca3B-hzZa6dtjhYvg', 'text': "Pretty disappointing. While our server was very well versed in the menu options, all I wanted was a pancake and a couple eggs. Options included protein, fruit, potatoes and what seemed to be a host of other decisions that frankly took away the joy of having breakfast. \n\nBut so did waiting for what seemed like 20 minutes to get pancakes and eggs. When it did finally arrive, the portions were shameful.  One order of pancakes with berries came and there were 4 or 5 large pancakes on the plate. My order was 2 pancakes plus a skewer of fruit that should have been cut down to size prior to be served. It really was insane since we could have shared an order of pancakes and we still would have been unable to finish them all!  \n\nOur server was really on top of providing anything she could to make the meal pleasant but it wasn't her fault that it took so long. It might make some sense if there was anyone else in the restaurant but it was sparsely populated. \n\nFinally, the pancakes had no taste which might be why they suggest you doctor their cakes with different toppings. This was a bust of a meal when it should be the easiest, tastiest and most reasonable breakfast possible. Big disappointment and wasteful too. Too many other options in the breakfast space.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2015-10-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '76gUkt-0TDTrV9hBXMpP3Q', 'review_id': '8jrF8gM_qUJbgdpRl_gVtw', 'text': 'Amazing service, amazing food quality and the portions are huge which is hard to find these days!! Love them! Seriously going every weekend now!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-10-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'I9IKwscAPHSeqM6fThfaFg', 'review_id': '4mdB7rKul2p4w6p57ru4_Q', 'text': "I'm torn. Food is great, but inconsistent. I have had crepes all sizes. I've had egg omelets not cooked all the way, then had a fantastic one. We've gone back multiple times but I am done. Service is also inconsistent.  Every busy shift, we never know when we'll get drinks.. and although our servers are very nice, they seem overwhelmed with tables and it's just not worth the wait. Food is lovely, just wish everything else would fall into line. Best of luck.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 2, 'date': '2015-10-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_k_eD-2E-2okOYfM-fsCWw', 'review_id': 'yQikd05cAHeusqsbic_TFQ', 'text': 'Greatest breakfast spot in Scottsdale! \nAmazing service, food and atmosphere. Breakfast or lunch, never disappointed. Manager was awesome and surprised us with a homemade strawberry balsamic poptart. Sooooo good!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-10-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'dRFWAjD0JRUPItHfgEk4qQ', 'review_id': 'NZIi-FVqpUAR8zf6mDh1zg', 'text': 'I had a really good experience here. Great service and excellent atmosphere. Lots of room in the patio and comfortable couches/chairs. Good food.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-10-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'qWCadscFwvg-6VSSpwBJUg', 'review_id': '7DRvG9SQQnpC_PBvSW7C2Q', 'text': 'Like an earlier review I am also a frequent patron. I can honeslty say this place is falling apart not just in service quality but also physically. The patio umbrellas are completely broke.  The floors are not kept and I told my group to please wipe there shoes on the pavement before entering my truck.  The food quality was good but not great as it use to be.  I am worried this place may not make it even though it has a huge following.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2015-10-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Z3btOcjfOQMquyCmpDTdqQ', 'review_id': 'QxiBLMuWjT9UFRDD0QKiHg', 'text': "I wasn't even going to waste time in writing this review, but after I left the breakfast 'nightclub' known as eggstacy I had to. I have no idea why this place is so busy, except that while looking around at the high school age filled tables, I can guess. The only bright point in this adventure was our waiter, a young kid who was trying his best to salvage the disaster of food the kitchen had sent out. I'll spare the description of food, it's not worth it. We sent it back and it came back worse (did not eat it). The noise level in place rivaled the interior of a crashing jet, but the food would probably be better on the plane. Save your time, your money, your hearing and make just toast at home, it'll be a better experience.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 2, 'date': '2015-10-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hiCj28537nn1MkXmZ6qWxQ', 'review_id': 'zI6NySae4EJFk5oGZQ0coQ', 'text': 'The food was outstanding, service impeccable! Everyone should eat here! Top notch class act, home run ouitta the ball park, breakfast & lunch at its finest.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-10-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JaPSK5dvOQzF1ulpYSJaEQ', 'review_id': 'lfc6sIBCg69XXzq_1TyPzg', 'text': "I love everything about this restaurant. It is always crazy busy but that's how you know it is great food and very friendly staff.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-10-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Nv7TKgacnnUPO8vbyaxQaQ', 'review_id': 'za_xshTq5zmeA8CB74tQqw', 'text': "Our friends suggested Eggstasy for Sunday brunch when we were in town visiting because of the diverse menu. The place was busy, but we called ahead to get on the list and were immediately seated on the patio and served fresh coffee. \n\nAfter much deliberation, I ordered an egg white omelet with goat cheese and fig preserves, fruit and an English muffin. The portion sizes are massive, so come hungry! It was fantastic, perfect ratio of cheese and preserves, the fruit was fresh, and the homemade English muffin was delicious. \n\nOur waitress was lovely and made sure our water stayed full. If I had to nitpick, I'd say extra umbrellas outside would be nice because it got HOT, but it's Arizona. Duh. Our orders came out staggered. One person at the table had to wait an extra 5 minutes or so to get his food, but whatever. It happens. Other than that, everything was excellent. I would love to return and try everything on the menu, it all sounded so good! \n\nSide note: extra points for them being dog friendly.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-11-01', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'maUtMEgvC87VZvoUMbmDLQ', 'review_id': '7RtzyyyKEO0thJsCfO31eg', 'text': "As you may know, I'm a huge breakfast guy and this was my first  experience at Eggstasy.  My finance and her family have came here before and really like this place.  To me, this place is OK, I can't say I was impressed with the food.  The ambiance  was nice though, it was well decorated and had a lively atmosphere.  The service was good and they constantly fill up your water and coffee.  The place had a diverse menu alot of variety.  As you may know, I'm not a sweets person and not a huge fan of waffles, pancakes, or crepes, which this place is know for.  I'm more of a biscuits and gravy guy or meals that are hearty.  I ordered the brisket and gravy, but was eventually told they ran out of brisket, so I went with the standard biscuits and gravy and two eggs.  I also ordered the chrizo  cheddar grits.  The biscuits were whole and had gravy on top.  It didnt have enough gravy for the whole dish.  I felt the dish was very dry and bland.  The cheddar grits were nothing to rave about either and for the price, the portions were small. \n\nIf you ask my fiancee she would give this place 5 stars.  She's into the fancy fresh juices and presentation.  I'm all about the food.  I was told they have big portions, but it was nothing to rave about.  I did see an omelette dish the person ordered next to us, it did look good.  Anyways, I'm always open to try out breakfast joints, but I dont think I would go back to this place again...Who am I kidding..my lady loves this place, I'm sure I'll be back and hopefully will try something better and give it a better review.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2015-11-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Asmapmun4RCApMNFl4-OaQ', 'review_id': 'UEB6DCPqT9h2mTHjmGjdMw', 'text': 'Eggstacy has Officially Jumped the Shark.\n\nI can only hope the leadership cares enough to read each and every word of this review.\n\nSo I was a BIG fan of Eggstacy in the early months but the last five times I have visited, the service, food and ambiance have imploded.  I mourn for the loss of yet another Phoenix restaurant.\n\nI don\'t know the inner dynamics of what has gone so horribly wrong at this place but just watch the interplay at the open kitchen window between the expediter and wait staff and you can witness that all cylinders are misfiring.  The wait staff is victim to the kitchen fails and the kitchen is getting flooded with a failure of the front to professionally manage pacing, menu descriptions and simple bussing of tables.  \n\nBut you, reader, want details so let\'s organize and paint the picture from tip to tail.\n\nReception stand:\nSomehow the restaurant industry has managed to carve a special place for pretty young girls with little capacity for common sense.  The front desk has become something to suffer rather than welcome.  This last visit was for my wife\'s birthday breakfast.  We made a reservation for 8 one week in advance.  The weather unexpectedly turned cold, so I called in two hours ahead to inquire if we could ensure an inside table.  The desk could not find the reservation at first and later revealed that they kept a separate book for reservations and walk ins.  With the reservation now found, they were accommodating on the phone.  We arrive 10 minutes early and checked in at the desk.  I could recognize the bubbly voice of the gal at the desk from the phone...and again she cannot locate the reservation...until I ask if it may be in the reservation book.  At least the table was set and ready.  Other people, however, were visibly upset by the desk.  It is set just inside the main entrance and creates a choke point.  The is no civility in the mob rush of the desk and this crowd mismanagement further impedes the ability of patrons finished with their meal to exit.  Additionally, During a lull I asked the hostess how they s at the tables and her answer was simple, "We just seat the next group once the table is set."  But when I asked if they consider the load upon the servers in seating 2-3 tables in a section all at once, she replied that she didn\'t understand what I was asking.  I am sure there\'s an app that could remedy this.\n\nAmbiance:\nJust read the better reviews and you can tell the public is keenly aware this place is just too loud.  The decibels rival pit row at a NASCAR event.  Even at the end of my last visit when I was talking to the manager table side, I found that both she and I were yelling at each other just to be heard three feet away.  Perhaps the interior designer is a retired rock star or jackhammer operator with major hearing loss.  The tile floors, arabesque tile walls, steel beam ceiling and total absence of soft structures is simply dumb.  To the owners, spend a little coin on some heavy drapes to frame the Windows, baffle the ceilings and  you will immediately change the decibels to a pleasant range whereby patrons could leave feeling good about the conversation and the food.\n\nAt the Table:\nBe leery of ordering drinks ahead of your meal.  The staff routinely greets you promptly but once that drink order is in, you typically loose sight of your server for 5-10min.  On this last visit, four hot chocolates, one coffee, one latte and two mimosas took 15 min to deliver.  Made worse, the hot chocolate was missing the "hot" and the coffee was bitter or burned.  The second cup of coffee (30min later when the waitress finally brought a pot around for refills) was worse.  Also, a simple tip to all those wait staff out there: if you are filling a cup, leave enough room for your diner to add cream or sugar to their liking.  Nobody wants a piping hot cup filled to the rim spilling on the table before they can make it the way they like it.\n\nMove on to ordering.  Nobody should be set free on the public if they don\'t know the menu.  For at least six months, many of the items on the menu are described one way but now churned out of the kitchen in that manner.  This happens from time to time but it is the waiter\'s responsibility to represent those changes.  Once upon a time Eggstacy served a pretzel bun croque madame...that is still inaccurately haunting the menu.  For the last six months, they have been "out" of the pretzel buns yet they continue to appear amazed the kitchen serves this flavorless bechemel-drenched mess over flavorless brioche.\n\nSo the "Food":\nMehh....perhaps they have changed suppliers or the original owners turn keyed their restaurant to a soulless corporation riding a wave of popularity, no longer resembling quality.  With eight people at the table, statistically they couldn\'t ALL be terrible...could they?\n\n1.  The Rueben -  I am certain that a Reuben has corned beef and sauerkraut typically on rye.  The meat that was served contains approximately 10% of the fla', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 1, 'date': '2015-11-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'C9xS56J54MMXVnSAHC5Wnw', 'review_id': 'XW-9FV-SipLso7TAzr1Q8A', 'text': 'Been here several times. Service had certainly improved and food seems more consistent.  Need a little more southwest flavors a little toooo hipster but worth a try', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-11-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kaTjmpnx3wjvjuuyTEFuOQ', 'review_id': 'Q7pWULnpEzX2AQ14uRqTzQ', 'text': 'My husband, daughter and I have been going here since it opened. They just catered my daughters Breakfast at Tiffany theme 1st birthday.  We always love the variety and somehow all of if is always amazing... Thanks again!', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-12-06', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 3}, 'user_id': 'CYHX8nnPoqclfWSsl1JWnA', 'review_id': 'PJi9IYrrkKJbyNEckkNZrw', 'text': u"My new spot. Mimosa mimosa mimosa mimosa.. Did I say mimosa? Lolz TWO THUMBS UP.\n\nYou can't go wrong with anything here. But what you need to get is the vegetarian eggs benedict, the hash brown was crisp and my eggs was on par! \nMy sister got fruit pancakes,  she said it was fluffy and very tasteful. \nMy daddy got the skirt steak eggs. He thought the steak could be more juicier, but other than that, he like his entr\xe9e.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-12-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'NOFdxLUjXq4QlqHlJA90ow', 'review_id': 'qr4R8tzm98ZnmIQ6BjkItw', 'text': "Eggstasy is an okay restaurant. The 1-2 times I've been there have been okay. The service is mediocre and so is the food. There portions are pretty big, and they aren't amazing. The one thing I will say, is that there outside seating is pretty nice. Couches and the inside space is humongous. Its located in a convenient place!", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 3, 'date': '2015-12-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 1}, 'user_id': 'XUd9-XTjvjDj4MoyzMscgA', 'review_id': 'bYMmQagvHppC1dSbFdWvsQ', 'text': "I have eaten here about 10 times.   The menu is a good mix of unique and standard breakfast choices. I'm partial to the old standards and they do them perfectly. Top this off with fresh squeezed juices, great coffee, and for those like me, excellent screwdrivers and mimosas.\n\nThere is a nice sized patio that is great when the season fits. Downside is that it is really rundown especially because the place is pretty new. \n\nService has always been good, fast, and with a smile.  Even if there looks like a long wait, stop in because it moves fast.", 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 4, 'date': '2015-12-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'zt0gb2zuD4hYOPPVu2ROHg', 'review_id': 'WWLb1n-IYG3GGD04nBNLcw', 'text': 'First time here and the menu is a little overwhelming with so many options! Loved the food, okay coffee, great service. Will definitely be back.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-12-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'A8RIEalcQW8RdCpPeOcUfQ', 'review_id': '4cps5JHJnE73dAyo-bKIgw', 'text': 'Great vibe and great food. Protein pancakes and chicken sausage on point. And the eggs Benny are some of the best in the valley. Will be coming back to this spot.', 'business_id': 'Cun_PbjTnPdfZRZAd9wx2A', 'stars': 5, 'date': '2015-12-23', 'type': 'review'}
