{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4sVnHVZplik1XZgRZGMqYQ', 'review_id': '57zCH1U2nSr17jmv6gmG_A', 'text': 'I will go easy on them cause without knowing we went on the first day they opened this location. I should say I have been to Buca before so I know how everything should taste. \n\nFirst off the food took forever. Again, it was their first day so they were really on their trial run. We got spaghetti bolognese and pepperoni pizza. The pizza was fantastic. It was loaded with pepperoni just like I love. It could have been a little more done but that is my fault for not asking. The pasta tasted as it was supposed to but it was luke warm. I could have sent it back but it took so long to get it I didn\'t want to wait. My wife had a craving for garlic bread so we just ordered it without checking the price. It came as chunks of break with very little butter or garlic flavor. We thought "oh well" until we got the check and it was $11 for a basket. That was very disappointing. There is no garlic bread in any restaurant in the United States that is worth $11. It\'s bread, butter and garlic. I can make it better at home for $3-$4.\n\nAll in all they have some improving to do. I wish them good luck.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2011-12-27', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': 's29iUoPdKWjeHyvM6c9WHA', 'review_id': 'BN7pI4Wl6-BsotZQ3sQxcw', 'text': "Worst experience ever! The waiter was a complete moron and a liar. I asked him about cheese being in certain dishes due to dietary issues. He told us the spicy chicken rigatoni only had a little parmesean sprinkled on top amd the garlic bread was cheese free. The bread came out slathered in melted cheese. The sauce on the pasta was also super cheesy. I called him out on it, especially after he told the next table about the cheese. He lied and said there were three kinds of garlic bread, but did not explain why he got us a cheesy one when we told him we did not want cheese. I then pointed out what he said to the table next to us. He could not explain lying to us. He acted and looked very unprofessional. Don't trust a man with a giant hole in his ear and knuckle tattoos. The manager came out and comped our meal. Would not go back. Food was not good.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2012-01-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IPIDauU59IuJ3YFtRFBeag', 'review_id': 'tV1jZIm2odX21d86PG5dSA', 'text': "I like buca di beppo when I've tried it in other cities. This one lacks a bit. We still enjoyed our chicken Parm, spaghetti, and cheese bread. The Alfredo was very disappointing though. Served cold at first then replaced with hotter version still no flavor. We told the buser when they asked and they said they hear that a lot, the. Why not fix it?!? Oh well is was a decent meal and I like the family style. Oh and the creme cake is great.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2012-01-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '-iEwUutRc4pfoa_Y2gAJtA', 'review_id': 'eiPlATB3Qz2UDLwPvRAcRw', 'text': 'Ate at this location last Sunday with my wife and daughter.  Very good food and huge portions!!  We ordered the "Bucca Small" size lasagna and still had plenty to take home with us, and I\'m a plenty big eater!  We also tried the sampler appetizer with fried raviolis, cheese sticks and calamari.  It was also excellent, the calamari was particularly good and prepared just right to be tender and not tough.\n\nThe meatballs are a Bucca signature dish as each one is 1/2 lb.  They are a must try and are very good and taste homemade.  The prices are a little higher than you would pay in an family restaurant like Olive Garden, however it is an excellent spot to celebrate Valentine\'s Day, a birthday or special occasion.  Very excellent Italian cuisine, we will definately try it again soon!', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2012-02-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CEkDuMS0GciaeOw6lKXdQQ', 'review_id': 'BAxffbA8LYMTHjY5klqcmw', 'text': 'Excellent service; small portions are big enough to share; excellent Caesar salad and good chocolate chip cannolis.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2012-02-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'UTlPBDNu2uhuARTDjP-fbw', 'review_id': 'w1RYmy9DbLiTaKXQIJ0-VA', 'text': "We ate the cheese bread with alfredo sauce and the trio of baked pastas, and something didn't agree with either of us.  We basically wasted one of our Vegas nights (my aunt's birthday celebration to boot) because we were feeling so crappy after eating at Buca di Beppo in Excalibur.  One extra star for decent service at the bar.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 2, 'date': '2012-04-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '49Ln2nBTkY5CV65ZnmRfhA', 'review_id': 'R_6kwjjJpv9XbqnATxTrDQ', 'text': 'Great food even for vegetarians, towards closing during happy hour in the bar service by Eddie was excellent.He remembered everything even our to go order.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2012-04-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Yjq21PL6Rj3pWvQ512daaQ', 'review_id': 'N5WprdZeaGMR9IVd9Z-lzQ', 'text': 'I love this resturant! Family style servings and food is the best! The lasaunga is my FAV!', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2012-04-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5Rqs6CStR44fmi_NUna08g', 'review_id': 'O5Ki0y8hmJtI93Vplif8Rw', 'text': "I took my mom to this Italian place after we checked in at the Excalibur hotel. We ordered a Caesar salads and an Small Round Square pizza, don't remember the name of it. I had an Italian soda. The waiter was great, the food was great. I am a fan, awesome place.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2012-05-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'B-ck69P675GDn3xhskleaQ', 'review_id': 'KvCD1pxNA4pVMQcB3dnLbw', 'text': "We went to Buca on a Monday night, it's a favorite restaurant for both of us. I have never had worse service anywhere. Our waiter got a bigger table and pretty much ignored us. He never brought us bread, he didn't even bring out our food. When the food did come out, the waiter almost dropped both of them until another waitress helped him and then slammed the plate down on top of my phone and wallet, with no apology, and walked away. We still hadn't gotten the refill and water we asked for at this point. Our original waiter decided to make an appearance and my boyfriend asked him to finally bring us our bread that we should have gotten 45 minutes earlier. We asked for the check and he forgot to apply the $10 discount for the coupon I had given him. Then when he came back to box up our leftovers, he dropped the entire plate on the table, shattering my wine glass and pasta flew all over the place. He was very apologetic, and then brought out our check again. After horrible service and shattering a wine glass and having pasta spill all over, he didn't even comp us the $2 side of Alfredo sauce my boyfriend asked for. Absolutely ridiculous.\n\nUPDATE:\n\nAfter reading this review, I was contacted by the manager and received THE BEST customer service ever. Craig was extremely apologetic and just an overall sweetheart. He offered to send us something in the mail for our next visit to Buca and we accepted. The next time we're in Vegas, we will be giving this Buca another shot, just because of how awesome Craig was. Thank you Craig for your great customer service!!", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2012-05-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bsadXhH5DnD2p_tI1ppURA', 'review_id': 'hhxk5PTz5pHVl5bvE7UqHA', 'text': 'Go here with at least 4 people, as everything is served family style in huge bowls that you share. You can get a "small" or "large" of basically any dish, and they SAY the small is enough for 2, but you could get 4 light meals from one small dish pretty easily. We had a rehearsal dinner here before my friend\'s wedding and there were about 14 of us, which they didn\'t seem to have a problem with at all. The waiter was fun and cheery the whole night, never once complained, and I only had to ask twice for extra lemons for my iced tea and water (the iced tea doesn\'t come with lemon by default, so make sure to ask if you like it with lemon). We tried some limoncello at the end of the meal and it was the perfect end to a most delicious dinner!', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2012-05-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'H1tN4ITtiMj3UH83OSviiw', 'review_id': 'KE3oTrKkeTAaKGPhPxH0Gw', 'text': "For some reason, lunch this afternoon felt like quite a rush - or more like, service felt like it was rushed and that isn't exactly a compliment. I'm usually a big fan of Buca Di Beppo - foodwise, count me in - but when the overall dining experience isn't up to par with what is expected, I am forced to lower down the rating a notch. \n\nMy parents and I came here a late Mother's Day lunch and ordered a small chicken carbonara, small calamari as well as the garlic pepper broccoli. Our waiter had great sales talk about items on the menu, however, at some point, he started to feel a little pushy. When we weren't even done with our dishes, he came up and asked if we wanted a box for our carbonara of if we wanted it taken away already, when there were still some calamari left on the plate, he took it away without asking...and my parents and I were left staring at each other in uncomfortable silence as he walked away. \n\nOther than that, the food was awesome. Carbonara filled us up to the brim, we didn't have room for dessert although that tiramisu sample our waiter showed us looked prettttyyyyy tasty. I also highly appreciate the photo service with complimentary postcards per table - with optional bigger photos for about $5 if I remember well. Music was really chill and the atmosphere didn't feel as intimate as the Paradise branch. So that's a 3/5, nothing more, nothing less.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2012-05-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'NBWUrKMUgC6xh5yf10-gzA', 'review_id': 'yA9vax-Ax8hW2j_P4u8rMA', 'text': 'Enjoyed the chicken pasta with artichokes and the pasta with shrimp was delicious. Casual and dark, in Excalibur, moderate piece- huge quantity - great prices.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2012-05-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'KOIWgIoBEEIuAnUJm3HXOQ', 'review_id': 'jJU0L8qQ0TPdhP7w5fuOeQ', 'text': 'I love the food at this chain.  They have HUGE portions here, which is great.  \n\nHeres why the bad rating.  Service\nWe were greeted several minutes after sitting down and the server seemed to not really care a whole lot about doing his job.  After getting drinks, he asked about an appetizer, which we ordered.  About 10 minutes later we placed the order for the food and waiting another 15 minutes before asking what happened to the appetizer.  "Whoops, I goofed" was the response we got about why we had not gotten this yet, since he never rang it in.  He said he would do that right away, which we cancelled since the food should be there shortly.  \nFound out, he forgot to put the order in for that too, so after 40 min from ordering the appetizer, we got the food.\nThe server was hardly seen the rest of the night.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 2, 'date': '2012-05-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WbqE1sPUxUJNjSV8wgJKHQ', 'review_id': 'nVKhg_rnW3sd9u4yQAgJ4g', 'text': 'I went Memorial Day Weekend.\n\nService was good and bad.  It was good because it was our first time at BdB, and we did not know about serving sizes.  We opted for 1 small appetizer and 3 small main courses for 5 people.  Our waiter said that would be a lot of food, and he only recommends 2 small main courses.  So we trusted him and he was definitely right.\nService was bad because, our food took 45 minutes to come out.  The people who had came at the same time as us ordered right away and got their food quite fast.  When they had finished their meal we were still waiting for our food.\n\nFood was good and bad as well.  The food was good because the sauces were delicious.  The pasta seemed undercook and still a bit hard.\n\nMaybe service and food was bad because of the Memorial Day Weekend, so not quite sure.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 2, 'date': '2012-05-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lkb37sPqc72itQMLv_XcnQ', 'review_id': 'h30HkJYJttfGjmAh4bbfGw', 'text': 'Worst experience ever, ask for the house bread, they didn\'t have any "sold out", drinks took forever, Food had no flavors and is extremely expensive ,I have to go to Mc Donald\'s to get my own ranch,then they bring the plates so we can start having our appetizer, and got a dirty plate, when I ask the bus boy working on the table next to my table, for a clean plate he even made jokes to the fact we got a dirty plate??  I would never go again and  I know now if i ever have the craving for pasta again, just call any  other "carry out pizza" and get the chicken  Alfredo Im sure any other place can make better pasta than this place', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2012-06-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'O0vvS6arf6WlUfTOoczcEA', 'review_id': 'GJlQVst_JSbwHDGqu3qOxg', 'text': "I can't tell you how happy I was with their service. My friend planned a funny 40th birthday party for her fiancee downstairs. It kinda got all jumbled up. I ran upstairs they were able to accommodate us. Manager was super nice, hostesses were too, and our waiter Christian was awesome!\n\nabout 40 patron shots later our bill was over $600 mainly from the booze and we were happy to spend it!  \n\nNicest service at a 'chain restaurant' that I've had.  \n\nWe ordered pasta, Chicken, Pizza, fried cheese, salad, everything we had food for days!", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2012-06-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'BY1GIR5IxvIkd4yO986lAQ', 'review_id': 'WOHqfDav0ctUe_fG1xwjXA', 'text': 'They are located inside the Excalibur.  We stopped in for lunch and WOW it was THE BEST Italian food I have ever eaten! We ordered the thin crust pizza with everything and it was outta this world good.  They brought us warm bread while we were waiting for the food to arrive, which was also good and we both walked away stuffed.  It was a little pricey but worth it in my opinion. My only regret was not being able to go back and try some other dishes before we left but will be going back to Vegas in a couple of months and cant wait to eat here again.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2012-06-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2hsxbHjqGfky3ZIol3X2mQ', 'review_id': 'k4eJQZxqTNFkB6mC0ASV3w', 'text': "Best italian food in Las Vegas. It is so tasty.....\n\nWhatever you do, you MUST order the cheese garlic bread with the marinara sauce.....trust me your life will be complete without it.\n\nNow they say that their small serves 2 or more people..., Honestly, I'd say after eating the cheesy bread that could serve 4 or more people...so much food.\n\nThe customer service was delightful as well which always makes me happy :D", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2012-06-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XkBk8mBUFt67pTJhnvkCQQ', 'review_id': '2DgjPBDMZPBQmFKuZVGkuQ', 'text': "The food here is horrific. The shrimp pasta had the same shrimp as the ones you will find in your cup of noodles. I've ate at Buca di Beppo before and hadn't gone back cause it sucked and well, they haven't gotten any better. Save your money and just eat out of the snack machine, it's very comparable. Chef Boyardi is rolling over in his grave, it ain't right, leave that man alone!!!", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2012-07-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'AF-TT9GfU_e6UyNIpyIFHQ', 'review_id': 'r9omjOmNcjlY2HC0d7tGLQ', 'text': "I was so starving when I got here.  Had antipasto salad and spicy chicken rigatoni. Wow. When I ordered the guy said that's a lot of food for one person!  I said you'd shut up if ya knew what's good fee ya!  And bring me more bread!  Haha after 2 days of nothing but beer...", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2012-07-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Kjk9-nMzRfuBmd1M9dMVWA', 'review_id': 'QYsDvVeTBQyT1zA83fMOzA', 'text': 'This place had happy hour specials all day long while we stayed at the Luxor. $3 beers and $5 mixed drinks at the bar.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2012-07-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'gsdSJTKtaLtjynSD6hgQVw', 'review_id': 'nb-tKNNEHBfwYE0OFM_X0g', 'text': "I actually like this Buca better than the one in Summerlin. It's all open space which gives it that family style feel. Of course the portions are served family style which feeds 3 or more people (so order accordingly! It's very easy to over order!). Our group ordered the stuffed chicken and the fettuccine supremo. This way more than enough for light eaters in a group of four. The stuffed chicken is AMAZING which I would suggest to any person who decides to come here. It has a great crunchy outer breading and inside the chicken is super tender and full of flavor in addition to the ham and the creamed filling. Super delish! The fettuccine supremo was also good. What you would expect of a typical pasta. The sauce was thick and creamy and filled with helpings of bell peppers and sausage.\n\nThey also offer happy hour which is $2 domestic, $3 imports, $5 glass of wine and specialty drinks at the bar only. Their house wine is ok. They offer a sample tasting of it, but honestly, it's a little boring and dry to me. I opted for their moscato instead which was light and sweet. Service was also ok. Our server was attentive as he could be in a busy restaurant, but he did satisfy all of our needs.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2012-08-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hqj5bcwCV3mxvthlhHnxGQ', 'review_id': 'Q-KCrPjYKih1jHVMJogEJQ', 'text': 'Just left there after trying this place for the 1st time. Our server Tim recommended his favorite dish the Baked Rigatoni. Wen waited 29 minutes (timed it) just to get a very dry (no sauce) overcooked dish. We tried it and left the rest. Tim was not people friendly. We had to get his attention a few times to come attend to us. We will not be returning.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2012-08-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'naV6jXf5krJXK45WSdlVGw', 'review_id': 'bplWadSvusmPD4rQ6GScQA', 'text': 'For the price and portion.. I was expecting better.\nYes, it\'s family style.. They went on and on about it, the portion was decent, but I wouldn\'t say it was that big. I\'ve seen a fair amount of places with portions that big for less than that price. Granted I\'m from Wisconsin and I went there on an empty stomach, I was going all out. So yeah, Buca calls it family style, I call it one hungry Wisconsinite portion with 1/3 to take home. \nAnyway, noodles are quite inexpensive so the dish better taste pretty damn good to be worth the price, and to me.. It was lacking. That extra money is basically going to the atmosphere and experience. ( which my friend said that the Buca on Flamingo is much cozier)\nMy friend and I ordered 2 appetizers ( with a coupon through Buca\'s website) We had the antipasto salad, and  mozzarella garlic bread. I enjoyed the salad, and the bread was decent, but it took at least 20-25 minutes for it to come out. The waiter wasn\'t the greatest either, and he looked busy, but I really felt like we were put on the back burner compared to his other tables. People that were seated after us were receiving their appetizers before we did, one family even had their pizza come out while we STIll waited for our appetizers! \nI ordered the ravioli al pomodoro, and trust me, it wasn\'t worth 25 dollars. To me it tasted quite basic, and the sauce tasted like it came out of a Ragu jar. I have to say that my friend enjoyed the sauce, but it looked watered down and tasted pretty basic.\nMy friend ordered the penne arrabbiata, that was okay, I liked it more than what I ordered, but still nothing to write home about.\nWhen the bill came out, the waiter had forgotten that we had mentioned earlier that we had a coupon, we had showed it to him earlier but he needed to see it again for the code, but because it was through my friends phone, it only allowed him to open it once and it couldn\'t be used again. Our waiter said, "sorry" but there was nothing he could do. I think he really didn\'t care, and was sick of dealing with us, he wanted us out of there ASAP. He had mentioned earlier that today was his last night before his vacation so... Hmm. I understand that the coupon issue wasn\'t the waiters fault, but I\'ve worked at restaurants before where you try your best to please the customer, he made no attempt to offer up the manager or try to help. It wasn\'t like we were lying since we showed the coupon to him earlier.\nI know it\'s a chain, and I really noticed it in the food, perhaps I\'m picky, but I prefer a smaller, non-chain, authentic Italian restaurant, where you might get a slightly smaller portion size, but the food is cooked with thought and doesn\'t taste like it came out of a bag, jar, or can.\nNeedless to say.. Not going back there again.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 2, 'date': '2012-08-15', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': '45kqQ-wAUTYzLNVIpYHnrA', 'review_id': '4KOsSg8mAqaCfOx9DAuTCA', 'text': "Whether you are at City Walk, Brea shopping plaza, or any other city with Buca, its the same food, just different state. Same Birthday song, same drinks. Difference, it's at the Excalibur in Fabulous Las Vegas! So if you like the same cheesy garlic bread, the same pasta and chicken, then albiet, you'll love this place.\n\nService was good, especially for the party size we had.\n\nOh, no walk through the kitchen?! No Kitchen table, and No different rooms. I was so hoping to get the Pope's table. Oh well...", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 2, 'date': '2012-08-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'N-3g6yUbw2Z6ov4IwjF1_Q', 'review_id': '8gGqosG3FWUNcesA_ZMWug', 'text': "I had dinner the day before because its near to me I love to go to Bucca. If you wanna have a family time with real italian food its a great place. The one i go to a the excalibur is a busy joint so don't expect quite ambiance. Most of the food are flavored in garlic, I am not huge fun but like it.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2012-08-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0iZ3lEA8h6uF_CxEUh21Yg', 'review_id': 'NAFLXoxUDLFcVWjLCf7aWw', 'text': 'We had great food and great service here. The Dolce platter is a combination of 4 incredible desserts. The portions here are extremely large! We also had the supreme pizza. They have happy hour all day long with very reasonable drink prices at the bar.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2012-10-11', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': 'OsE7rfPZqpfjJZJeiANQUQ', 'review_id': 'fI0lWVIx2Vb3VlWIu07ejg', 'text': 'Happy Hour ALL DAY long... WTF? done.\n\nwe were staying next door and our friends were staying in Excalibur. happened to peruse the menu for food and noticed the $2, $3 and $5 Happy Hour. awesome. look, it may be BdB and commercial "italian", but, who cares. HAPPY HOUR!!! $2 domestic beer, $3 imports and $5 wells and wines. Bam. done. DONE!\n\nit\'s difficult to get cheap drinks inside a Hotel/Casino located ON the Strip, unless of course you\'re gambling. so when i come across a spot that has one, i\'m all about it. the HH is bar only, but, there is plenty of room in there at the bar, as well as the seats around. no HH food, and what was available was kinda expensive, which is my knock. the mozzerella "sticks" that we ordered were premade and frozen, prior to being fried. oh well. at least i got $2 Blue Moons.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2012-10-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'TbOcaHHGCzSqOHCAvBBHWw', 'review_id': 'CVupl0wxEn-vMlVvSUDyNQ', 'text': "Came here for a company dinner and let me tell you to come here HUNGRY because you get tons of food. We had a 5 course family meal and it was ok. The service was good and the food was good compared to the prices. In other words it was cheap so the food tasted cheap but I was so hungry I really didn't care!\nThey also have happy hour all day which is nice!!", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2012-10-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xeruRvQ1VsOqOwv4wgHCNg', 'review_id': '5WwhTFOhMP5NOTte__Ikjg', 'text': 'Warm decor and friendly service!\n\nOur waiter was not kidding when he said the portions were big! There were four grown adults in our party and we could not finish the fettuccine pasta and pepperoni pizza we ordered.\n\nOnly gripe was that the pizza was extremely oily.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2012-11-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '7q0JPNzi4US-6yJhNRUzoA', 'review_id': 'tVc1EBszasEGv2ERGAK6qA', 'text': 'Shocked by the level of service on our visit.\n\nWe ordered to start Caesar Salad and arrived with some bread after we asked for bread.  We then ordered the Chicken Limone with the capers on the side as one person in our party is allergic to them and another one is just opposed to the taste.  The Chicken Limone arrived with the capers on top and spread throughout the dish.  I informed Andrea that we ordered it with the capers on the side; she apologized for this and brought the dish back to the kitchen.  The next actions which occurred had me completely shocked as well as puzzled because Buca di Beppo is such a fine establishment with a completely amazing reputation for the high quality of food and service you provide.  Watching the kitchen, the expeditor grabbed a pair of tongs, took a piece of chicken dumped off the capers and put on a new plate which is when I got up to look closer and saw him do this with the rest of the chicken.  A server then went to bring this back to our table; which is when a manager asked me if there was a problem.  I informed him of the actions I had just witnessed and he said first that would not have happened which I told him I saw this action with my own eyes and then he asked the expeditor whom confirmed the actions.  A new dish was brought to our table maybe 15 minutes later if not more - where our children had already finished their food.  \n\nScared to think this is a company norm.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2012-11-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '08cqdtyHqpJYCtPd8pkdSQ', 'review_id': 'n5xv1NqUoH9YgJfsupbMmg', 'text': "The ambiance was nice but the food was pretty pricey for what they gave you. Food was okay, not great. Food took a while to get to us as well. It's okay if you're staying at the Excalibur but there are better Italian restaurants.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 2, 'date': '2012-12-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'iW91u5B_mUsr-UMELc5fBg', 'review_id': '0kjIcxipcVI5QlfAN_K-ag', 'text': "My wife and I ate here the night we arrived in Vegas.  We were staying at the Excalibur so were looking for someplace close.  We didn't really have a good experience here.  The service was friendly.  No complaints there.  The free bread was okay.  Nothing special and really not much flavor.  The olive oil also seemed very bland and cheap.  This place is family style.  Each menu item has two choices for portion sizes - one that is to be shared by 2 people and another by like 4 or something.  The salad was definitely enough for 2+ people.  We got the Caeser salad.  It was really good.  For the meal, we settled on the Baked Ziti.  It was probably one of the worst baked zitis that I've had.  Very dry and bland.  Hardly any sauce or cheese.  Devoid of flavor.  Also, the portion was really good for 1 person.  My wife and I both agree on this.  Afterwards, we were both still hungry.  So, for the price, I don't think it was good.  For that price for Baked Ziti, I was expecting a large amount of pasta.  I've been served bigger portion sizes in the $10 range and this was like $20+ or something.  Maybe they were just having a bad night, but I wouldn't be in a rush to go back here again.  That's just me.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 2, 'date': '2012-12-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'P0M292i-OgKf6ZlPyTtuqw', 'review_id': '3cmY38F99H3lh5tM0Z-ehg', 'text': "This review is for the Buca in Excalibur casino, I had an early dinner here on a Saturday evening and sat in the bar area off the side of the main restaurant.\n\nPlease be aware that the entrees are served family style, I can eat a lot, when I ordered for me and my companion the 'small' size entree's were PLENTY of food to eat.\n\nWe tried the 'Small' size calamari for the appetizer, it was very good and perfectly crunchy, for our main entree we had the 'Small' size chicken carbonara.  The food was very good and flavorful, for two of us we didn't finish it and had to take our leftovers with us.\n\nThe drinks were good, we had a glass of wine and draft beer with the meal, they do have Happy hour specials here as well.\n\nThe only complaint I had was with the 'Small' size of garlic bread we had on the side, the bread was too hard and not very buttery and could barely taste the garlic.  The portion size for the 'small' was huge though, so if you do order the garlic bread, the 'small' size is 16 mid size pieces which was over the top in my opinion for two people.\n\nOverall, the food was good, nice ambiance, and our server was very helpful.  My recommendation for dinner for two, 1 small appetizer and entree should do the trick.  I will definitely try this place again.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2012-12-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'h_hUZCy8nXLm8fJMTZwVFQ', 'review_id': 'sIo4D2v-rUPCDZKMXCsrrQ', 'text': 'Really dissapointed after the great food in San Diego. They only have the big family style meals here but the lasagna was dry and not very tasty. The spaghetti with meatballs was boring and bland. Chicken parm was still good but hard to screw up that. The service was pretty ordinary too. Wont be back', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 2, 'date': '2013-01-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1Y5_6rclWlg1ZXSGreFQzQ', 'review_id': 'glFW6DEvAdpJEFEbLd1ZlA', 'text': "Came to this Buca for dinner; food is the same in all Buca's, I love their olive oil and the balsamic vinager with the bread basket they serve. As with all Buca's their meals are meant to be shared even the small portions, so that's nice. Their spaghetti and meat balls are not my favorite but I was told by others in my group that for them it was, so I guess it a taste thing. Their salads are good and crispy not soggy and bland like in other restaurants. Had their Prosciutto Stuffed Chicken... delicious, the sauce was on point and the chicken tender and juicy, and the prosciutto (bacon) was crispy but not hard. Also tried the Chicken Saltimbocca... the sauce was different with a tangy kick from the lemon and matched the way the chicken was cooked but it was not my favorite, a little to tangy and lemony for my taste. Their drinks are reasonably priced and they have a good selection of wine. Our waiter was nice and attentive, he definitely earned his tip. Lost one star because you could smell the smoke from the casino and that may have been why I didn't enjoy the food like at a regular Buca.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2013-01-15', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'XojQYliTrFGq-V94NjlQ7A', 'review_id': 'hFS4KXfBloxkxNtVoue_RA', 'text': "We're in Vegas.... I have NO idea why we ate here instead of the hundreds of other amazing restaurants on the strip.\n\nIt wasn't bad, but I would def recommend going to someplace you can only eat in Vegas!! It's the same price anyhow..", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2013-02-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6l7ytJkMoXYUBQBHzcBydw', 'review_id': 'QO8wH26yy5ubWlvweaa3lg', 'text': "Great, inexpensive after midnight deals on a Saturday night.  Service and ambiance was good. The drinks and pizza were fine but for their normal hours prices I'm not sure it would be worth a return trip.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2013-03-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mvseP5eZisF2lZy_7slv3g', 'review_id': 'nhANRfFSgq8mdQag_4wW-g', 'text': "To my surprise I saw a sign that said Happy Hour all Day that imports beers $3 and Drinks $5 of course we came into the bar area and sat down.  Order a pizza half cheese and half pepperoni and it was yummy. Service wasn't bad either.  A definite come back on my list of places to eat & drink in Vegas.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2013-03-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cbIHtc5Ke2x9zFLU1fgJOw', 'review_id': 'p4vDGEYkr0i-YrgBFn1VLQ', 'text': "Liked the pizza. Hot. Crispy. Great fried mozzarella. Attentive bartender. Waitress checked on us only once. She wouldn't  come back to take additional drink orders.  The place wasn't that busy at the time. Looks like others had the same problem with the service.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2013-04-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'FJMjyFNhydeLSb8NMgM9yw', 'review_id': 'ucGU90HpIvfl3QrHomEWuQ', 'text': "The food here is alright. It wasn't amazing and I probably could have just dined at the Olive Garden and been just as content. Our server definitely hated her job but once I got to talking to her she lightened up a bit. We didn't feel entirely cared about as guests in the restaurant but I'm not complaining too much. It wasn't bad it just wasn't great.\n\nIt's decorated really cool, there's a lot to look at and I think it would be great for large parties especially with kids.\n\nBut the garlic bread made me want to give this place five stars.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2013-05-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 4, 'cool': 0}, 'user_id': 'wK8KIPNNAjEdcPNrhFpwkw', 'review_id': 'Dt1g1YfRpt5jxV9N1DVOjQ', 'text': 'I was with a prom group of 48 who came here for the "prom package". This was a three course meal that we prepaid for and everything. The food wasn\'t revolting or anything. But the day after, about 25 of us got sick. Vomiting, stomach aches, migraines, fatigue you name it. We called the restaurant and they merely said "we\'ll look into it" and never called us back as they promised. The school nurses got involved, which brought the health district involved. They realized we have contracted norovirus. How can they take this so lightly?! I\'m surprised they haven\'t called back many of the students who called them to report the food poisoning, begging them to take a free gift card or something. For crying out loud they took our names and numbers and said specifically they will call back the next day. \n\nhttp://www.fox5vegas.com/story/22286174/health-district-students-contracted-norovirus-after-visiting-restaurant', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2013-05-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ErsBXW-E-mWNjMc62TPQNw', 'review_id': 'ctcRkZYhIQEHOkqFJVbGWQ', 'text': "This is the place to get cheap drinks while waiting to get into Thunder From Down Under next door. Their happy hour runs all day and includes $2 beer and $5 cocktails. There's hardly anyone here in the evenings too so service is fast. Load up ladies because you'll need it!", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2013-06-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9LvN6GUNTiWGNXp7z8-P2Q', 'review_id': 'keF2Uoz6sVmj6aPLHnFF1w', 'text': "Came here to have dinner with my whole family in celebration of my eldest nephews 21st. We ordered the antipasto salad, pepperoni pizza, eggplant and chicken parm., and baked ziti. I died and went to a marinara and cheese filled heaven! I am the queen of making eggplant parm. (This is my official title.) But they have beat me at this dish. It was so good, crispy, not soggy at all. Delicious. If you've never been I highly suggest you go with a few friends and order all of the above mentioned and don't forget your elastic waistband pants! Overall it is a great atmosphere, the decor is great to look. My 3 year old exclaimed that the photo of the lady with the big melons looked like his mom. The lady literally was holding melons! Ha! Lots to look at. Great place to enjoy a meal with family. I love this place. It is a bit on the pricey side but I feel it is worth it for the portions and not to mention the food is great.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2013-06-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 't1OPhVhkl2WA4pHJXXmYog', 'review_id': 'f9Vkyqc0u4gHkIzohDGMVA', 'text': "Happy hour all day sounds great, but its for specific cocktails and beer as most places. The food is great and the portions are quite generous as it is served family style. Make sure you go during dinner hours so you'll feel you've gotten your money's worth. We dined in the bar area twice and both times the service was horrible. I'm not sure if it was the set up or if our servers just lacked experience, but I asked myself several times if anyone was even working that day. \nOverall, it wouldn't be the worst experience ever if you aren't focused on service.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2013-06-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CLfejdugBUUcLQuYiK7lIg', 'review_id': 'hm237oqu2D8rToToKlRvCw', 'text': "The food was very good but the prices were a bit high and everything is pretty much ala carte. No bread on the table or the like.\n\nThe espresso we had was good as was the pizza. My party seemed to enjoy their meals as well. I've also been to the location in Albany which I've liked. It's not authentic but it's a good choice for quick Italian.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2013-06-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'u8dPvAMO0yeXcKmWabbaVg', 'review_id': 'SAtqEFZVSNDsB93hLgSgAg', 'text': "Food was good. However the service could be better. Our server was pushy, and made us bus our own table before bringing out our entrees. Seriously aren't you suppose clear the table yourself?", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 2, 'date': '2013-07-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WuBg8WVNzFw-0bN4xybkFQ', 'review_id': 'T2zejfOlog8mG0JuT1hDtQ', 'text': 'Bread sticks was awesome. The place was very loud and waitress was rude', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 2, 'date': '2013-07-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jcK2ElIXWfWOERX9bz-0_g', 'review_id': 'bElUZrl_ozRHpzy1B4qehw', 'text': 'Came in for a take out order. I was pretty much ignored for a while while the bartender chatted with two girls who were sitting at the bar. Someone else eventually took my order, and it was brought in a timely manner. When I was handed my to go bag, I asked if there was a fork in the bag. She said yes. Imagine my anger when I got all the way across the casino and up a billion floors to my room and discovered I was given no fork or napkins. I had to go all the way back to the casino to grab a fork from another restaurant. Definitely regretting leaving a tip!\n\nUPDATE 8/8/13- I was contacted by management who more than made amends for my inconvenience. Super impressed with how much they care about their guests!', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 2, 'date': '2013-07-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '_UFwgH0LPqEyqTViomnHcw', 'review_id': 'HGnojunMBfuAt--g8LeOoQ', 'text': "I've always been a Buca Di Beppo fan and our visit in Las Vegas hasn't changed my mind in the least.  \n\nWe ate here for dinner AFTER ( they're open to midnight)  the Tournament of Kings.  They never fail to impress. We might have been the only ones there that it's more expensive at home than Vegas.  We managed to feed an entire family for about $100, yes 9 of us ( do 3 yr olds count?).\n\nIt's located on the third level of the Excalibur hotel which made it really convenient.  The service was fantastic !  Unlike most Bucas, this restaurant featured an open concept making it much brighter than usual.\nLOVE the bread", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2013-07-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'o6GL7VipfsfMJoVyuljQ4g', 'review_id': 'itSwz0W5mzrHHk3yVLc_pQ', 'text': "I just cannot believe how bad this restaurant is.  The room is decorated nicely but trust me that is it for the positive side.  I don't know how long it has been open for the service was really spotty.  The tables are too small for the family style service and we constantly had to ask for plates to eat on.  We started with a caesar salad that was really plain and had a very sweet pungent dressing.  The salad was delivered and placed on the wrong table before we received it.  We ordered the Chicken Limone, and the Veal Parmesan with two sides of pasta.   The chicken was tender, but flavorless and had virtually no sauce and two small capers.  The Veal was so sweet it tasted like sugar was literally sprinkled directly on the meat.  The sides of pasta were overcooked and the sauce was also sickeningly sweet and looked like it came out of a can.  \nOverpriced, amateur staff, and really bad food.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2013-08-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mjAOtfKO_XkPMfe7uFSU6w', 'review_id': 'ESBYhjZRb--2u8NZsUN8PA', 'text': 'This one started out on the right foot--the Manager recognized my alma mater, the waitress was friendly and smiled a lot, the atmosphere was cool, intimate and typical Italian music.  The chicken parm was excellent and food was served quickly.  Typical franchise-type restaurant...nothing too fancy. Overall a good eat for the price.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2013-08-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'w4mmlm3EnCWi27ws0ePEow', 'review_id': 'K0Zfx2Oj_DvKCRrOK9j0Nw', 'text': "I have dreams about their chicken carbonara. It's the dish I could eat everyday of my life. They'd have to knock out my walls and carry me on a flatbed truck to get me anywhere, but its fantastic. They don't use bacon, which really makes the difference. \nTheir chicken limon is fantastic, so is the caprese salad. Fantastic mozzarella. \n\nTheir bread is always a little hard and stale. Plus, it's family size amounts unless you get a lunch special. \n\nMost importantly, sign up for their mailing list and like them on Facebook. You get great coupons.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2013-08-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'sfi0B8fsUesvt8qjmfYEhw', 'review_id': 'Y4yvMzksKQXzrwRYpPewmw', 'text': 'Another late night Vegas dinner, we made reservations for 9:30pm, showed up on time and still had to wait for a table.  Big pet peeve of mine.\n\nOur server was fairly snappy about their portion sizes when we both ordered separate entrees.  She over-emphasized it was for sharing.  Yes... we know.. you said it multiple times.   Our plan was to eat some of our entree and have it as lunch and leftovers during our road trip.\n\nThe portions were ginormous, and we were warned, we planned for 2 day lunch leftovers but it was good for 3 days.\n\nI ordered the spaghetti and meatballs, it was delicious.  Giant meatballs made properly Italian (half pork/half beef).   Despite the small annoyances, I enjoyed the food.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2013-09-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'iSppmXbo0UyAQg8AX-fqJA', 'review_id': 'jaTJn9WeZJRnitB_AWcoGA', 'text': "We had a party of 10.  We ordered appetizers and drinks first thing.  It took an hour.  We ordered food didn't get what we wanted.  They ran out of Lasanga. Basically the service was so bad that the manager had to come over.  When the food finally came out I had to get up and get plates.  Awful, awful.  \nAgain the manager came over and said that our meal was free including our alcohol drinks.  You know it's bad when a party of 10 had free food and alcohol. It just took 3 hours.  It was so annoying watching people being seated after us, then eat and then leave before we got our drink, our appetizers and main course.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2013-09-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XAooNdr4UtK4jcfqiFGVkw', 'review_id': 'f75y74jgk786IBZ8tziTsg', 'text': "I love the decor of this place. It's walls are filled with Italian themed pictures. As for the food, the spaghetti is good and one serving is enough for 2 persons or maybe even for 3 servings. I also tried the pepperoni pizza and it was awful! Super greasy and the crust was too crunchy borderline hard. The service was not bad, our server was attentive and friendly. Would return but would not eat pizza at this place again.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2013-09-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3qnAwJukbPvkwkIIMU96SA', 'review_id': 'QgG1c_X8KmpOzX4L20_VdA', 'text': "Great looking place with big prices, big portions and mediocre food. The meat dishes (that are in the range of $21 - $40 a plate) don't come with a side. If you want a side, then that's an extra $7-$9. Even something such as the Italian broccoli is $9. Here's a tip for anyone who goes here, the small portions are huge and the large portions are even huger. Order the small portions and share your food with others. Order a meat dish and then order a pasta dish, ask for extra plates and just create your own meat with a side of pasta dish.\n\nFor appetizers, we ordered the calamari ($13). They were so tiny. Tiny little itty bitty rings and teeny tiny little clusters of tentacles. I've had bigger and better calamari, and for far less. Then for our entrees, we ordered the Linguini Frutti Di Mare (a seafood linguini in wine sauce) and the Prosciutto Stuffed Chicken. My husband and I shared them amongst each other. The seafood on the Linguini was good and abundant, however the pasta was terrible. For $23 a plate, I expected the Linguini to be fresh (there is a huge and obvious difference) It wasn't, it was obviously a dried pasta that was overcooked, whereas it had a slimy consistency. I've had fresh pastas at Italian restaurants in Chicago, Philly, and New York that weren't even close to these outrageous prices. One that comes to mind is La Luce in Chicago (one of my favorites). They serve fresh homemade pasta, and the prices range from $14-$17 for huge portions. \n\nAs for the chicken, it was ok. The chicken was cooked perfectly and was wonderfully juicy. However, the breading on top was a little burnt, creating a bitter flavor. That was really disappointing. Again, for $23 I expected more. \n\nThe service was great though. That is until we paid for our dinner. After that our waiter could have cared less. He shoved a large portion of linguini into a tiny plastic container, then wrapped it in a plastic bag with my husbands leftovers. When I went to grab the bag, the bag broke, fell on the ground and my linguini spilled everywhere within the bag. Our waiter just walked by a few times without saying a word. He didn't even offer to help get us a second container and bag. We finally stopped him to ask for them. He fetched one for us, and still completely dismissed what had happened. The sad part is, it was only us and another small party, so being too busy to help wasn't really an issue. He just flat out didn't care. It was so obvious and really awkward. \n\nAll in all, the experience was not that great. My wallet is very sad and so is my palate. Bucca should either serve better food or lower their prices.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 2, 'date': '2013-09-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5hq_ckKRofsHZ8OKVxt3PA', 'review_id': 'Qs-BeVPcTLw-GDNkyG4BrQ', 'text': "This location does not match my previous experience on quality. Meatballs were full of filler. Tomato sauce was bland. Buca's is a place I use to rave about, Italian like Mom makes, but no more and not in las Vegas. Very disappointed.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2013-09-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': '0WRo9NFL10av3eQVMR4Egg', 'review_id': '95ScXUfT4FBH-0nPomtfPQ', 'text': "Wonderful Service. I had a Luxor $25 credit voucher I used, a $10 off coupon & also a FREE birthday brownie. The guys at Buca let me use ALL deals, which lead me to a GREAT bill. Happy Birthday to me! hehe! Food was amazing as usual, since I love Buca in general. Also, our watier was a cool guy. \n\nThis location has a cute setting. Also, it doesn't get too crowded. I guess I'm just so used to having Buca so crowded at the SF location,  also the most busiest & closest Buca to me.\n\nI  would def recommend the Vegas location to go to. :)", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2013-10-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'PpbsSri1gtUFGYsovdzTIA', 'review_id': 'H6vvapmxj6vjOw92D_gT3w', 'text': 'Buca di Beppo has always been a favorite! Although this Buca di Beppo branch does not offer the same homey feel as the ones in San Diego, the Buca in Las Vegas was enjoyable as well. \n\nAfter a very long drive from San Diego, our big family decided to stop by Buca for a family style dinner. Their dishes are definitely meant to be shared so it is best to come here when you have a bunch of people tagging along with you. For their antipasti, the mozzarella garlic bread and fried calamari is a must! Make sure you ask for extra marinara sauce because you would want to dip your calamari in that tomato goodness. For the insalate, you will never go wrong with the Caesar salad. That bowl of greens is very refreshing! For pizza, order the spicy arrabbiata although I think it is a bit weak for my liking. If you name something "spicy-whatever" make sure that it is spicy enough. The large linguine fruitti di mare made up for the not-so-stellar spicy arrabiatta. Always a favorite, their fruitti di mare is a must for seafood lovers.\n\nI would have given this restaurant a 4 but gave them a 3 instead because of the spicy arrabbiata. And even though the fruitti di mare was very good, at least 6 of the mussels were closed. I think that was poor preparation. Such a shame...', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2013-11-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'YqiHj6Jy1fWFmp056rfRPA', 'review_id': 'rYHFK0ScrIl2Wu9KrRoopA', 'text': 'Amazing pizza!\nReally good minestrone soup!\nSat at the bar and had a complimentary post card of us.\nReally happy to find this place', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2013-11-27', 'type': 'review'}
{'votes': {'funny': 6, 'useful': 7, 'cool': 6}, 'user_id': 'qAioovV3QDdsuR4bJ-2cCA', 'review_id': '6d0pXdIxc_Ww2DGZKVSgaw', 'text': "Am I doing another 5K? Why am I carbo loading? -- questions that were running through my head as I had more bites. \n\nWe ordered fettuccine supreme, baked ziti, pepperoni pizza, and cheesy garlic bread. Also ordered Sassy Strawberry Italian soda.\n\nSo glad we only ordered the small size. Between the 5 of us, there were still plenty of left overs. About half a plate for both fettuccine and baked ziti. But maybe it's because we weren't really impressed with the food. Really liked the soda though, in all it's strawberry goodness!\n\nService was on the slow side. We had reservations for 4:00 and arrived on time but still had to wait 10-15mins to get seated. Another few minutes for our server to get our order. The entrees didn't come til 20 minutes or so later and yes, I was timing it 'cause I thought my sister was on some kind of schedule. \n\nAlso this location is pricier than other Bucas so don't be shy to use those coupons that they lured you in with", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2013-11-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'Y3vwco-7dT6LBRCnwZpu6A', 'review_id': '-y0o5BE7R9YqbbJlerRddA', 'text': "The food was on point with any other Buca di Beppo location.  Not overly sauced pasta, hefty hefty portion.  And the chicken in the chicken Alfredo was cooked to near perfection.  $45 for a heaping bowl that can feed a family of 6 easily is a pretty decent deal when in Vegas.  The di Beppo 1893 salad however for $25 is a rip off.\n\nwhy 2 stars for good food then?  The service was bad.  We were quickly seated but it took the waiter well over 15 minutes to greet us.  Quick and friendly was his greeting when he finally did arrive.  But once the food was dropped off by the food runner we didn't see him again during the meal, having to ask for refills from other servers.  The guy that came to refill our waters, I asked him if I can place an order of bread with him but he said he'll get the waiter.  Who never came.  When we finished our meal the waiter shows up with the check (never asking who our meal was).  We asked for boxes and that took an additional 15 minutes to bring out even though there was only two other tables in his section.  Instead of getting us boxes and closing out our tab he was cleaning other tables and doing side work.  \n\nGood food.  Not so good service.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 2, 'date': '2013-12-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'a-QOcUIXgRfFKv5YvB9eOQ', 'review_id': '-Th9ISDnfrHVvCExbe_5bw', 'text': 'Nice standard Buca food.  It can get pricey, but the quality is never in doubt.  We stopped in for dinner and we were not disappointed.  The food and the service were great.  No complaints what so ever.  This is always a good place for the family to stop in and have dinner. \n\nIt is located inside of the Excaliber hotel, so it can be a little tricky to get to.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2013-12-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'gcI5IDOwf2XkDiJWLphC3g', 'review_id': 'GFSUsX5aZRAgYB5dSj6W8Q', 'text': 'Looking for a great restaurant on the strip that won\'t destroy your budget?  This is the place, with their HUGE family style portion sizes you can easily feed 4-6 on a single item.  We ordered the supreme Alfredo and the bowl measured 12" x 6" deep and was completely full with great tasting pasta.  \n\nIt\'s easy to find and located inside Excalibur Casino.  Our server was attentive and very friendly, and in addition we were checked on by two managers.  The appetizer was super quick and the main course was brought out as soon as we finished.  The atmosphere is made up of several different Italian themed rooms with pictures covering every inch of the walls.  The only minuses to this location is the lack of a table in the kitchen -if you haven\'t sat at this "special" table in other locations do it!- and the bathrooms are out in the casino.  \n\nAs for the pricing, well it\'s on the strip but still within $5, per item, of their off strip location here in Vegas. Last, I HIGHLY recommend making reservations as the stand by wait was 90 minutes...OUCH!', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2014-01-05', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 1}, 'user_id': 'FRJNdEwCuy7QFlOkveTtCw', 'review_id': 'uh_XJarB42T3CWs6hcOr1Q', 'text': "Mediocre food. Okay service.\n\nThe best thing here was the cheesy garlic bread they served us from the beginning. The main dishes were not good at all, looked and tasted like throw up. And why was it so fucking dim, could hardly see my date's face. They had someone taking pics and selling to us... which was alright. My date was ecstatic because I don't usually allow others to take pics, camera shy and they usually take too fucking long.\n\nPffft. Olive Garden is better. Sad to say.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2014-01-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9dYJJgv3ZJs30wrYBWmNbg', 'review_id': 'fr89w8DNXnHkvt-PJuQo-g', 'text': "Richard Pro here with another review.\n\nOrdered the lasagna and veal marsala. Don't be misled by the portion sizes. They claim a small can feed 2 people...well it doesn't even come close. I probably could have eaten two of their small lasagnas by myself. As for the small veal marsala, it comes on one normal sized plate with mushrooms and sauce smothered on top. Without any noodles, I can't even imagine how they would expect this dish to serve two people. \n\nThe bread is quite fresh and tasty. My lasagna was slightly overcooked. I like my noodles to be slightly firm with some bite to it, like any good pasta. Instead my lasagna noodles were flabby and dissolved in my mouth. However, like I said, it was only slightly overcooked.\n\n2.5 stars. Would rate higher for bigger portions because the price is exorbitant for what you get.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2014-01-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'h_hUZCy8nXLm8fJMTZwVFQ', 'review_id': '3GkuE46Uj4g7P2GhlOjAtg', 'text': 'I am only deducting a star because there were heaps of empty tables and not enough staff so we had to wait half an hour. The food was spectacular this time and totally 5 star. Pizza was just perfect and our waiter was lovely. The chicken parmigiana was divine like last time and the cheesecake and mudcake were perfect. Great red wine recomendation. Seriously glad we gave it another shot. Very very worth it', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2014-01-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ZhDUVCThOzw5LwVQ4sR59A', 'review_id': 'IhoMnkh-k07kf3t_OC5L1g', 'text': 'Awesome food!!! We came here to eat on Christmas Eve and they were not busy yet. We ordered the Chicken Marsala , Penne pasta and chesse bread and brought food home and gave us two and a half meals !!\nThe staff was ok. Our waitress was slow in bringing us refills on our drinks and our check when we wanted to go. But the delicious food made up for that. \nThis location is inside Excaliber upstairs. You can make reservations online too.\nWe will be back. I believe they open at 10:30 and close late 7 days a week and all Holidays.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2014-01-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'wr5VQSrcIb0ArNG_K4WttQ', 'review_id': 'b2_80U3GB6RbkBHskeCW2g', 'text': "My boyfriend and I came for dinner around 10:30 on a Tuesday.. Not many people in the restaurant. We got our drinks quickly and food followed in a decent time frame. We just ordered a few appetizers: fried mozzarella, mini meatballs, and garlic bread. We both love fried mozzarella, it's our favorite fatty food.. And they unfortunately have no ranch here! That's what makes them so good so they were bland.. Had to use Caesar :( Other than that the restaurant was just meteorite. Waiter, Ian, was friendly and quick to bring things out and help us.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2014-01-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qQlluECPOV193tj7G-Pypw', 'review_id': '_RWn8uXUoSvUQVfW_xGO6Q', 'text': 'Great location and had take out for the Superbowl with a short 15 minute walk to the Aria----great party platters and over fed 8 people with left overs....great Vegas option with groups', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2014-02-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VzSgvFEZTNYa7EptKQ-hWA', 'review_id': 'LHcYvnWhAcJl85w62GMDwQ', 'text': 'Solid 3.5 stars. We would come back again. Staff was very attentive. Liquor cheap at the bar - Happy Hour all day!  The food was consistently fine as you would expect at a chain restaurant. Portions are huge! For Vegas a great value.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2014-02-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GBw7QlGaIjUrVXXi_KnrTw', 'review_id': 'Bt2BPvumsqrQezHp3iG73A', 'text': 'I thought the service was crappy, the food was ok at best, the prices are definitely on the high side. It only took an hour to get our food and another 30 minutes to get more water. Vegas is hot, I need a constant flow of water at a restaurant!', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 2, 'date': '2014-02-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'ejS7RUEtfIxf8F-QSnSyCA', 'review_id': 'FnrKkVKrRWqAAZue1x_M7Q', 'text': "I've had Bucca Di Peppo as catering before, it was just OK. \n\nWe decided on Italian and since Bucca Di Peppo was in the hotel we were staying at, there was a 30 minute wait (Saturday night)  So we walked over to one of the gift shops and bought a few things for the kids while we waited. Once seated our orders were taken quickly, my drink was delivered quickly and the waiter explained how big the portions were and took the time to give recommendations for us.\n\nI am blown away. Yes it was busy,  but our server was SUPER attentive, he came by 7 times, checking on my drink, if the food was good, but not in a rushing or pushy way, he was just passing by and would check on us.\n\nThe food was fantastic! We had meatballs (the pasta was the only thing lacking, it was WAY over cooked, and watery in the bottom of the bowl) But the meatballs were AMAZING and then we also got chicken stuffed with cheese and prosciutto, we got potatoes as a side. I'm so glad that we tried this place. I got lemon basil vojitos and which were PERFECT!\n\nThere was a lot of food, and we couldn't finish the left over which we didn't take because we were in a hotel but it was worth it. Since we have one here in the area we live in, I think we will take the kids next time, its SO worth it to go sit down and enjoy it all fresh.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2014-03-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': '7N0D2Z1DAFMyzNVfkIwwCg', 'review_id': 'qWA7YwPaSqZ8IiMvYyXPhw', 'text': "Came here with a group of about 15 friends. They put us in the Pope Room, so we had the pope in the middle of the table to entertain us. \n\nWe were pretty loud (mostly me), but our waiter was super awesome in working with us and recommending stuff. He was super nice and took great care of us. \n\nService was a little slow, which is understandable with a group of our size. \n\nHere's what I shared with three other people:\n\nArtichoke Florentine Dip- super yummy with crunchy little bread slices, plenty for 4\nBaked Ziti (Large)- loved the ricotta, PLENTY for 4, enough for 5 regular people without monster-appetites \n\nTurns out to be pretty affordable if you come in a group and you don't mind all eating the same thing.\n\nI also had a few drinks, so don't judge me. Be happy I can offer so much review! \n\nAlso, the drink menu isn't online (except for the wine, which doesn't help me), so the names are what I can remember, which isn't correlated with the fact that I had about 4 drinks...\n\nCheap Red (just ask for their cheap red), 9 oz.- good about for 2-3 people to share\nBlended (something) Margarita- pretty delicious\nRed Sangria- sweet and yummy! Comes with an orange slice and cherry\n\nOverall, great for groups, or a first date. :]", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2014-03-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bPtNcyzoS837XdH4xSEFvQ', 'review_id': '4JK_DK0T6s40fHWTo6jXng', 'text': "Excellent food brought the family and it was great even with a picky eater! It's family style service and the portions were just right. I think the biggest thing was the quality of food for the price. Walked out spending $75 for a great family dinner on the strip! \n\nThe wait was only 15 minutes so wasn't too bad. All in all it was a great experience!", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2014-03-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'R5xFT51d3WTYywhDYa4iow', 'review_id': '2621X87FVnNPDgFOkh7WTA', 'text': 'We came here for lunch with a group of 10 ladies. I called and asked them how long the wait would be for a party of 10. They told me that they did not take reservations, but if we got there within 10 minutes they could seat us right away. We walked over 5 minutes later, and the hostess told us that it would be a 30 minute wait. Huh?\n\nWe ended up getting seated in the bar, we had to move the tables around because no one offered to help us. Our waitress came over within a few moments to take drink orders. We did not get our drinks until 20 minutes later. The waitress was rude and catty, and we all told her how we had not been there before. She failed to mention to us that it was "family serving" and so we all ended up ordering our own dish which was wayyyy too much food. You think she would have told us?\n\nShe had a miserable look on her face the entire time, and then at the end told us that she would not take our coupon because we were sitting in the bar. We got the manager involved, and they ended up honoring our coupon.\nT\nhe food and drinks were good, very tasty. But the service was HORRIBLE and I cannot believe we paid almost $40 per person to be disrespected by the miserable waitress.\n\nI would not recommend ANYONE coming to this location!', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2014-03-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jh2sUTt5ysCkSylT1Y4t3g', 'review_id': '1L6qhEcLec_C6WC0AWCwLA', 'text': "I've been to this restaurant at four different locations and every time I go, I walk or should I say, crawl out with a full belly and a smile from ear to ear! - Everything you order here will be great and everything you drink will be as equally appealing! - We have yet to have enough room for dessert, but this last time our neighbor table ordered some form of dessert bowl and it had to have been around a foot in diameter! LOL - You cannot go wrong with Buca, but make sure you've got a full wallet because you definitely get what you pay for!!", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2014-03-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 2}, 'user_id': 'O9OMgh9MRZnR1qi6rNFTdA', 'review_id': 'FUi5vNY2Q7QdWncQtZv9Rw', 'text': "Currently I am sitting here and waiting for my food for almost 1 hour... it's only me and my wife...and placed only two simple orders... horrible service. .. can't believe it takes more than hour to serve us food...", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2014-03-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DcujsgrhDqZPPCEjnvaNHw', 'review_id': 'g8RhomYjTYWVnhoN7OR9bw', 'text': u"We ate there on Saturday night. We had reservations for 5pm, we arrived at 5pm and still had a wait. The place was pretty much empty. There were a ton of tables. We were told 5 minutes. 15 minutes went by and we were going to leave. We had hockey tickets and still needed to catch a cab. That's why I made reservations in the first place!!! Right at the 15 minute mark we were seated. Our waiter was great, helpful and friendly. The d\xe9cor is outdated and dusty, yes dust coming from the lights over the tables but the food was good and the service was good. if you're staying at Luxor or Excalibur you get a $10 off coupon at check in. Use it and enjoy!! We will be back.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2014-03-31', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'WQXa5YUbVy-jPwvNLQQY0w', 'review_id': '-XPSb3HeruG4sSsdzJC0AA', 'text': 'The service here was awful. We had a total of 4 people in our party and were treated horribly. I would honestly rather eat at one of the fast food places in out hotel before we come back. Our server didn\'t clear our plates once, took 15 mins to cash out one bill with cash, we were not given any refills of beverages, nor thanked once when we left. Also, we went to the bar for drinks before our dinner and when we asked the happy hour specials, we were thrown a menu at us and told "these are it." At least at Dicks last resort they have an excuse to be rude.... Def last time coming here.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2014-03-31', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'i-KhxLrbVm_PF-eGUznAHQ', 'review_id': 'GcPjhz550x8GLYRK88WAcA', 'text': "Not sure why other Yelpers are complaining about service, but we had no issues and no waiting (maybe because we had a 9:45 reservation on a Thursday night). My friends and I agreed on the dishes we were gonna share beforehand and ordered the second we sat down, also letting the waiter know that we'd appreciate the check ASAP as we have tickets for the 11pm show next door ;-p\nWe ordered the my standard spaghetti frutti di mare which was delicious and seafood-filled as always, and a salad. \nAfter paying our check, we left the restaurant and realized that we were so efficient with dinner that we still had time to kill! We spotted a happy hour which offered $5 sangria, so naturally we went. We then realized that we're just in the bar area of the the restaurant. The sangria glasses were huge and it was delicious. \nI wouldn't go out of my way to come here (Excalibur eek), but good option for dinner if you are at this end of the strip for some reason", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2014-04-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lHuebB4IJUPD7uc9kexb9g', 'review_id': 'ZDhV_lFLxQ3iZ2ZZoVmilQ', 'text': 'The food was good. The spicy ckn penne with the rosa sauce was delicious. The staff had great customer service and the food came out very fast and fresh. It looked appeasing and the taste was bold.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2014-04-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IFmGUt3Md2Y7SJMVAYUzfA', 'review_id': 'QahUWZi8CvgDd0M1h_0ZaQ', 'text': "Fricken waiter spills soda all over us, then charges us 37$ gratuity for 2 friends that didn't even eat with us, for sitting down at our table. What a ripoff!", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 2, 'date': '2014-04-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zRuyGKh-ksUzJ1wqNU46Gw', 'review_id': 'buFkbq7ESHZXSabtbrO_Ew', 'text': "My boyfriend and I had a coupon for $10 off $30... so, why not? We went for lunch. When we walked in, we asked if we could sit in the bar area and use the coupon still. The hostesses, who were holding menus and ready to seat us, said yes. We ended up seating ourselves like normal customers who decide to sit in the bar area, but we were completely ignored for a good seven to ten minutes or so... without menus! Finally, our server came up to us and asked if we needed menus. Duh. I have never been to a Buca di Beppo in my whole, entire life, so yes. I would very much like a menu. Well, the server ended up being pretty nice, though. He took our order in a timely manner, and he refilled our drinks when needed. I ordered the baked ziti, and my boyfriend ordered the chicken carbonara. The chicken on his dish wasn't all that good, as it tasted like frozen chicken or pre-cooked chicken. Other than that, the food was good. Our bill came out to $27 after the $10 off (without tip), which isn't bad, because we didn't finish our meals and had leftovers to take back to the room for dinner! I would rate the experience as three and a half stars... but I'll round up.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2014-04-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'gz0KE2ovHMcaqQ2-gR1w3g', 'review_id': 'lB3o2k3cdqpVAr5b0imuWQ', 'text': "Inflated strip prices.  Bad service, slow service and the place was empty. Wouldn't take a mobile coupon,  and we paid 8 dollars for about a half serving of pasta to go with our chicken parm. As LV locals we know better than to eat on the strip,  but went with Buca because it's a known quantity.  Wrong. The strip location is 25% more for 50% less food snd a bad attitude.  Never again.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2014-04-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'YVc-l-bnbWsXcVhfZmzoQg', 'review_id': 'b0KKBkfrbcS16UFOtGD6Ng', 'text': 'Came here for the happy hour....$3 beers all day. Good service, no to crowded, looks the same as the California locations. Relaxing atmosphere, everyone looked like they were enjoying themselves, maybe because they were all buzzed.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2014-04-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JNnLYnkMe08k7AVRD9803A', 'review_id': 'ldUZRK70mp4wyTKxd8UIIg', 'text': "If I could give this place zero stars, I would... but unfortunately, I can't. We arrived at the restaurant for a late lunch at around 3:15pm. Although the restaurant was literally empty, when we asked for a table, we were told to sit on the bench outside and that we would have to wait a few minutes. We saw the hostess constantly running around looking like she was very busy and talking on the phone. Keep in mind that the restaurant was empty, so I am not sure what she was running around doing. We asked for our table again, but we were once again told to wait. After almost 15 minutes of waiting, we decided to leave. During this time, two other couples were also told to wait, and they also left. To add insult to the injury, she had a horrible attitude - she was quite rude and dismissive, acting like we were doing something horrible by making her get up and do her job. Definitely the worst service I have experienced in a long time (if not the worst service I have EVER experienced).", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2014-04-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'laFLdZPSm8W_iIvjZdnE6A', 'review_id': 'Bt6nZWTeAxC9M6yyy8IfDw', 'text': 'Place was empty and they made us wait 30 mins to be seated.  Ugh... People who walked in after us thought they were being punked.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2014-05-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'NfqIA25Ue78DHV8yOKi8Gw', 'review_id': 'WIhUzvk_7CTlt5gxW9rc1Q', 'text': "The food is good and plentiful.  It's served family style in large dishes. Nothing special about the menu, on par with Macaroni Grill or Carrabba's. The service was a little slow, especially from the bar.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2014-05-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ySTFGWuZLgARVzOKZQLMjw', 'review_id': 'HrfjApY5Tblf7qRg9McgjA', 'text': "Let me start off by saying I usually love the Buca di Beppo restaurants. I have been many, many times when I lived in San Francisco and I have always loved it. However, I had the worst experience at this location in Las Vegas. \n\n We arrived at the restaurant after 3pm for a late lunch. Although the restaurant was almost completely empty, when we asked for a table, we were told to sit on the bench outside and that we would have to wait a few minutes. We saw the hostess constantly running around looking like she was very busy and talking on the phone. Keep in mind that the restaurant was empty, so I am not sure what she was running around doing. We asked for our table again, but we were once again told to wait. After almost 15 minutes of waiting, we decided to leave. During this time, two other couples were also told to wait, and they also left. To add insult to the injury, she had a horrible attitude - she was quite rude and dismissive, acting like we were doing something horrible by making her get up and do her job. Definitely the worst service I have experienced in a long time (if not the worst service I have EVER experienced).\n\nHonestly, the entire thing is a mystery to me, as I have always loved this restaurant, but I guess they need major re-training of their staff. If I could give it zero stars, I would, but I can't, so I'm giving it - grudgingly - 1 star.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2014-05-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'obJMPMkhpyN_eC36cKSWyQ', 'review_id': 'aF-ayNqpSpDk3Du3H8YYCQ', 'text': 'My partner and I decided to go here because we were tired and did not feel like leaving the strip. We were both disappointed. I put our name in and was told that it would take twenty minutes to be seated; it ended up taking thirty.\n\nThe service was okay if you were paying $30-40 for a meal. We ordered a small gorgonzola salad, a small pepperoni pizza, a small chicken saltimbocca, garlic mashed potatoes and two (plastic) glasses of water. This meal came to $82 without counting tip!\n\nThe salad was okay, the pizza was very salty and flat, the chicken was average, there was not much garlic taste to the mashed potatoes and the water was chlorinated with not even a lemon wedge to mask the taste.\n\nTheir "family-style" philosophy forces you into sharing entrees rather than ordering your own meal. You see, the small portions are supposed to be shared. So I guess people who are dining alone are not welcome.\n\nThe service was surly and polite. Take your money and go to Olive Garden.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 2, 'date': '2014-05-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6CL-ckO-7ugvyrajvqbIJg', 'review_id': 'q8dEuQCiYPmIoEruTjPk5A', 'text': "Great service\nOverpriced corporate menu, but not surprised.  If your looking for something predictable you won't be disappointed. Although good flavor, $30 for veal Marsala should be more than 3 small pieces", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2014-05-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9BXctVOUJYOrGOJs39T7IA', 'review_id': 'kLOtIM-esDOY8uRqMF_nUw', 'text': 'I have to say, as a local here in Las Vegas, I hate crappy service.  Went with a couple of out of town friends for a total of four people.  Our waiter was just plain in a funk.  Service was slow, food arrived before we could finish the salad (Is it pre-cooked?) No plates provided until we flagged someone down. Never refilled beverages without us asking.  When he cleared the table, he reached into the center of the table and began stacking all the used plates right in our faces. No finesse at all. everything as far as service is in slow motion, and you get ignored a lot.  The only thing I must admit they do with great expediency is drop the check on the table.  Oh and by the way, not once did  any staff member say thank you, while we all thanked them every time they brought us something.  Sorry just poor service, but the food was not too bad.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 2, 'date': '2014-06-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tT5RJh8oNBFXeKad_bPskg', 'review_id': 'J9dvGaUEbi91rVPcC4FaPQ', 'text': 'Very much like a family-style Olive Garden. The only difference I detect is the decor, which is nice. The food is subpar for the price but not bad. Not really notable either. I would say that the atmosphere here is the draw. They do have a great happy hour and it is conveniently located in our hotel. They need to work on their service, however. Our group of 11 was told to check back in 30 minutes to be seated; which we did. When we returned we were made to feel as though it was a strain to "fit" us in. We were ignored, waited another 15 minutes to be seated although the table was ready. When we were, our waiter hardly ever came to check on us. I\'m not sure if he felt overwhelmed by our group or what, he looked over at us frequently but never actually came to refill drinks. I had to go find the hostess to send someone over. We always tip %20 and probably would have more if we had been better taken care of. \n\nIn short, the food is generic and somewhat over priced. $5 wines are pretty awesome, the atmosphere is nice but the service stinks.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2014-06-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'AGBgM6Sn_tH2PURLLwxc3Q', 'review_id': 'PHRyODHFL_Kmhgxp-glWOg', 'text': 'Family style Italian cuisine- delicious, generous- had to take home- dinner and lunch the next day! No comparison to the horrible Olive Gardens we have in NM. Also noticed a big difference between Bucca in Vegas and the one in Alb- I thought chains all carried the same standards and quality? Anywhooooo- this is a great place to eat while in Vegas.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2014-06-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jXHjrcPC8qseC_8mc6zjKA', 'review_id': 'gNM-LbolLVlGKrwhX-dWjA', 'text': "I love the food here, but I ordered a pizza to go and came back when I was told. I had to wait like an extra 15 mins than my original wait and this was originally supposed to be an order on the go. The to-go service is lacking because many of the workers won't even acknowledge if you're not staying to sit down. I would say come for the food, but leave for the service.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2014-06-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZwIutsAQsD47SwBbJBqOdg', 'review_id': '7oRlbB98S0HwiiOnkvDY2w', 'text': "Great family style Italian restaurant with a decent selection of pastas and pizzas.  Huge portions and great for sharing in big groups.  The meatballs are even the size of softballs.  Get a reservation if you plan on going during peak times.  Wasn't too impressed with their desserts though... maybe just a bad night. \n\nThe place had a fun vibe and the waitstaff was really nice and helpful.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2014-06-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9lt9bAwux95Qx0dX-iCgng', 'review_id': 'BXIGkFaBS35IyxGJPTsKXw', 'text': 'We had our rehearsal dinner at Bucca di Beppo in Excalibur last Saturday  We had a party of 24 and arranged everything ahead of time.  We had to order from the banquet menu and our food for 24 included bread, cesar salad, Italian salad, fettuccini alfredo, spaghetti marinara, chicken parmesan and cheesecake.  It was so much food, and quite excellent.  They were more than willing to substitute chocolate cake for my three little picky eaters and made my nieces special day extra special.  The servers were very attentive and we never had to want for anything.  The manager personally oversaw our dinner.  Overall it was an excellent experience that I enjoyed with my wedding party.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2014-06-27', 'type': 'review'}
{'votes': {'funny': 12, 'useful': 17, 'cool': 13}, 'user_id': 'V0WEZ2PQtJGX0sWNe89A8g', 'review_id': 'BNlb93VwWkWVESo4dwhq1g', 'text': 'I haven\'t been to Buca di Beppo in years, and I recently had the opportunity to eat at this restaurant with my friends here in Vegas.  From the moment you walk into the restaurant, there is tons of excitement and energy!  Love it! \n\nFirst, you have to set expectations before eating here and writing a review - it is a family style restaurant that caters to large groups.   This is not a James Beard Award Winning restaurant, but it is a fun place for groups to grab a meal together.\n\nI called in to make a reservation for 8 people at 7:00 p.m. and Miss Hostess was the nicest person I\'ve encountered in a long time!  Easy Peasy!  When we got to the restaurant, we were greeted by three lovely hostesses.  We were told to wait 5 minutes for them to set up our table (HUH?  The restaurant was half empty!).  After being seated, we were quickly greeted and served by lovely Miss Server Shennae!\n\nFor starters, we got the Apple Gorgonzola Salad (Small for 4).  The salad was your typical green salad but was loaded with gorgonzola cheese, thinly sliced Granny Apples, walnuts and cranberries.  It was light, fresh, and tasty!   Grade:  B\n\nFor the main dish, we got the Frutti di Mare Pasta (Small for 4).  The pasta was topped with mussels, clams, shrimp, and calamari.   The pasa noodles were tossed with a rich and spicy marinara sauce.  I loved the taste of this dish.  I didn\'t like the texture of the noodles.  It tasted like either the noodles were over cooked or were a cheap brand of noodles.  The texture was mushy and did not have a chew to it like most noodles should have.    Grade:  B-\n\nThe kiddos at the table ordered from the kid\'s menu ($5!).  Each had a personalized sized cheese pizza or spaghetti and meatballs.  Both selections were VERY generous and large!  The pizzas were 9" across.  The spaghetti and meatballs was served in a medium sized pasta bowl and looked like it was enough for 2 adults.   (It looked so tasty, I wanted to eat the leftovers of the kids, but I refrained!).   Grade:  A!\n\nBest part of the meal was the energy and smiles of Miss Server Shennae!  She was patient and really made it an enjoyable evening!  You can tell she loves her job!  Thanks a bunch, Shennae!\n\nFood Grade:  B\nService Grade:  A!\nWorth the Money Grade:  B-  (sorry, the bad pasta noodles and prices did this)\nOverall Impression Grade:  B', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2014-07-02', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 4}, 'user_id': 'yxp9i_wQo9wd6PE09IjT7A', 'review_id': 'IkFRJHMLRpOC2XILETWxVA', 'text': 'On April 17 this year we married in the Little Church of the West- and we planned a family dinner at Buca di Beppo in the Excalibur.\n\nWe were served by Johnathon who was great! Our drinks and family style pastas were good.\nThe youngsters in our family enjoyed the specialty drinks.\n\nStaffing was short but (I hope I spelled his nam e right) our server kept up the pace and I think he even stayed after the rush to keep everyone happy.\n\nThe headache of dealing with the Excalibur valet parking rush did not dampen our spirits.\n\nGood thing I had squeezed into my blingy dress and got married before dinner- lots of garlic bread and drinks later I was a larger but happy bride!!', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2014-07-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tV9Gkwzlyq1MJLlGVXBFJg', 'review_id': 'ZWfMQfFlYfMfO_y7EWVuMA', 'text': "This is a GREAT family restaurant to eat at. The prices are reasonable and the food was excellent. I'm picky about my Alfredo sauce and this one passed the test. The sauce was creamy and the chicken tasted great.  The price for a meal to feed 2-3 was the same as I paid for one plate the night before and the portions were generous,  we had lots that went uneaten The server was friendly and when we asked him a question about something we were thinking of doing he gave us so much good information. Our wait wasn't very long at all and our food came out pretty quick considering how busy they were. \nHighly Recommend.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2014-07-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'lrnegtxpxPhACzOd3DpxBQ', 'review_id': 'Ypk53Pa_xRdp90vn0faG0A', 'text': "I am reviewing for takeout that we took to our room. \nFirst, I understand the family style approach, but I don't like it for couples. For my husband and I, we would usually each get something different and share. The way the ordering works here, we can't. \nLasagna is usually a winner at Italian restaurants, but this was disappointing. The sauce lacked depth and overall, it didn't have the indulgence usually part of the baked pasta experience. The garlic bread was also just mediocre. \nIn the end, I felt like I wasted calories. Not a good thing in Sin City.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 2, 'date': '2014-07-28', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 3}, 'user_id': 'yjixur1pAYn_CkQpjWFnBQ', 'review_id': 'hPiMrWQ_GT5_wOPMZXqq-A', 'text': "I didn't really have any expectations prior to visiting Buca di Beppo.  My friends and I just wanted to have a nice dinner before watching a show.  And Buca di Beppo is conveniently located at the Excalibur hotel, so we decided to eat there.  \n\nThe wait was about 15 minutes, and when we got to our table, our server (forgot his name) was so attentive and friendly.  I enjoyed the atmosphere, very casual and relax - it's a family style restaurant where they serve large portions to share.  \n\nWe ordered Baked Ziti and Salmon for all of us to share (4 total) and it was plenty enough that we had left overs.  \n\nI would go back there again to try their other entries.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2014-07-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SdeFlbzd8wYP_PjqJXufbg', 'review_id': '-dUVxn1eMuFloXG89SNfmg', 'text': "Me and my Wife went to the Bucca Di Beppo inside the Excalibur and had a terrible experience. The food is very overpriced, the bread they brought out was cold plain white break that looks like they got it from a cheap supermarket, my baked ziti was dry on the top which tells me they either didn't make it fresh or it was sitting out for a long time and my Wife's veal tasted like rubber. Every time someone had a birthday there would be a waiter who would yell extremely loud and start singing, VERY disrupting. A woman choked in front of us and people were doing the Heimlich maneuver on her; not their fault, but just part of the overall negative experience and total waste of $60 for two rotten entrees.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 2, 'date': '2014-08-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'n2G_Wwwi-9NaitG5gCC7hw', 'review_id': 'hbk5qKnP8FHpLtiA0I8Fww', 'text': "Visited July 2014. My two friends and I stopped by late at night for dinner. After all the hype it was a mediocre experience that ended up with all of us getting food poisoning - I'm fairly sure it was this place as we'd all eaten different things for 24 hours leading up to eating and sharing meals here.\n\nI will say our waiter was fantastic, I wish I'd got his name, and we were seated very quickly. But the food was average. I've made better lasagna and I'm no Jamie Oliver! Then the next morning we all had upset stomachs...I couldn't believe it would be such a reputable place but like I say, we hadn't all eaten the same thing for a whole day before. It's a shame.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 2, 'date': '2014-08-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GcF6D0OHbSmfjTPd61-BVw', 'review_id': '6aT0Bc83SO6mgyCaU-i6_A', 'text': 'Big portions , chicken was tough forgot my delicious garlic bread, service was excellent .', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2014-08-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GoSccjliZiKwO6UC5EPW7Q', 'review_id': '21ySJEZAylyjrcjlUXAg8g', 'text': 'My husband and I have eaten here the past two years on our anniversary. We loved it the first time, but were so impressed with our last visit that we just HAD to write a review. This year I made a reservation online, not realizing there is more than one location of this restaurant. When we arrived at our reserved time, the hostess informed me I had reserved a table at the Flamingo location, not the one we were at. It was my mistake, but they seated us right away anyhow. The place was packed, but we received the best service we could have asked for and the food was amazing, as usual.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2014-08-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'gm4PhjcmThqRnZVewPRHpA', 'review_id': '-7cHPdKJIxE-3Vy0Vjf4qQ', 'text': "This was such a good Italian place. My friends and I got the Supreme Italian pizza and the Chicken Parmesan. Both were delicious! Their Italian margarita is also tasty. Their prices were reasonable and we didn't have to wait long before being seated. i can't wait to go back!", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2014-08-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '8Sw90z8HlBp10W4p0TGtzA', 'review_id': 'bdRjOAifaB3nkg_eKILBkg', 'text': 'Horrible, horrible, horrible! Whatever you do, do not eat here, go anywhere else.\n\nWe came here on a slow lunch day--I mean the place was practically empty.\n\nThe services was painfully slow, took so long just to get acknowledged and the food took even longer.\n\nThe portions are huge and the food was gross. We ordered a chicken fettuccine and bread sticks. The food was gooey and clumpy, and the bread sticks were chewy. \n\nThis place makes Olive Garden look like a 5 start restaurant.  Avoid.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2014-08-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UtplVB4L1YkVsZLlzgKVXQ', 'review_id': 'hhIXNXxwLVk4drfzpUWYWQ', 'text': 'Food is great....on the pricy side but I think its worth it. The service is just so so.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2014-08-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'OGVd43q3SpJWlzPAvQjEXQ', 'review_id': 'WdjdptZDkkssKafKDDvi3g', 'text': "Alright, Buca earns a solid 4 STARS. The Family dinning option is great. The environment is superb. This is NOT your typical Italian restaurant where they want you in and out. They want you to stay as long as you want! Family Style all around.\n\nThe Good.- all the pasta is made in-house! The pasta is delicious, the sauces are full flavor and The portions are huge! With a large serving at least 6 people can eat and be fully satisfied! \n\nThe Great.- if you are having a birthday, this is the spot to celebrate it! They bring you a huge candle, everyone comes and sings to you. They make you feel special! Like your family would! \n\nThe Best.- kudos to the staff, everyone is very friendly and They keep checking on you. They even give you a free picture, and of course they try to sell you an additional one, but it's a great deal! And guess what! Its a business, that's what business do.\n\nOverall.- portions are huge, staff is very friendly, food is good. Come hungry, make sure that you do not order too much food and you will leave happy!", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2014-08-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'U0k2uVr2-hihuqhejwFQWw', 'review_id': 'ut1g7bzZraJHsmH7enDevA', 'text': "Made a reservation through open table .... When we arrived they did not have our reservation and told us we made it too late - 2hrs in advance was too late. :( ... Made us wait in line with everyone else.\n\nUpdate: got seated 15 minutes later, in a nice booth.\n\nUpdate: got a glass of wine smelling like vinegar with 3 flies in it ... Wow you can't beat this!! ... Called manager - he apologized - that's it. Replaced the glass (opened a bottle in front of us)\n\nUpdate: food ... Choose Olive Garden over this place.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2014-08-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '57KDCvhQijBR_u5LrvrSew', 'review_id': 'Z4bodqkOPH8D5Q-1LFlHXQ', 'text': 'Should not even give any star. We, group of four, went to sat down at the bar area for happy hour but we received no service at all Afro 15 minutes. Server did not even welcome us or start our drink. I understand this is Las Vegas but poor service. No I rephrase this to no service. Not going there.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2014-09-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hC704OsTJ_5ZEOsKpI94wA', 'review_id': '_u7cyC8zKLXwGjc6Pco5dw', 'text': 'Over priced even for Vegas. I got spicy backed sausage which was dry could use more sauce. The sausage was not even spice despite the name.  I do not plan to come back to this chain ever again.  There meals are not hard to make so if I want them again I will make it myself.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 2, 'date': '2014-09-15', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': '57KDCvhQijBR_u5LrvrSew', 'review_id': 'DRxqAUBSxEEBbh6mFpLj3w', 'text': "The manage David gave me a call and apologize. I wasn't expecting for them to care what I think but it was very for the phone call.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2014-09-24', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 1}, 'user_id': 'hVL3194zc2lvN_ZxOO59jA', 'review_id': '6p779NOb7aQvcevGVLsZGg', 'text': "They get two star because the food was good. Else I would have given zero stars. Our server was not polite at all. He took the order wrong and brought us wrong dish size.\nWhen we informed him, he took away the half dish saying they can adjust if they take half the dish back. So low on courtesy. Are they going to serve it to someone else I wonder.\nAt the time of ordering we had given him a coupon which being hotel guest we had got at check in. He took it but didn't apply it while billing. When we told him to check, he said give the coupon now. We said we gave it to you while ordering. He said really!! Then he went away. He brought the corrected bill then he rudely asked for our ID and said they want to confirm we are staying here.\nIt's ok we understand but then he started talking deliberately to adjacent customers while my husband was handing over the ID. Very rude... I felt so annoyed.\nWe gave tip as it's courtesy on our part but the hospitality is horrible rather absent.\nI would say go for good food, don't expect good behavior.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 2, 'date': '2014-09-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Hy6fFn5SN-3mhdv6oahllg', 'review_id': 'm-9T-8-bZBBl9ttewF-LUg', 'text': 'First time there,we were really excited but left really unhappy,our server was really rude and he took forever to bring me the bread and refill i asked him for,when he brought back our checked with our credit card he barely looked at us and walked away...i dont like to give bad reviews but he really ruined our day..the only good thing was the food and the girl that took a picture of us,we bought the $20 pic and it came out really nice,when we were leaving the two hostess and another girl were talking there and didnt realize we were leaving no one said bye or thank you!', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2014-10-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'm7zG0DyryTfepYfo7J1TLQ', 'review_id': 'Nxz__ytA2Yc0tXnM9Mn88g', 'text': 'Not sure why they have such a low review. We booked our wedding reception here. We eat at the one in Houston. \nWe had 31 people. Very accommodating. Only slow where you would imagine from serving 31 people. One the drinks were done everything was smooth. Wait staff wad great. Food was amazing as always.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2014-10-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'NpO2mhJRXNNAyT4cBoL4Dg', 'review_id': 'WRtV7u0tD5p7TBSyep9M_g', 'text': "I was embarrassed after suggesting this location to visiting family. We had three small children in our group. You think we could get some crayons? No bread. No refills. No bussing the table. The waiter didn't address anyone at the table, he just stood there looking at us. He just sets a stack of plates next to me and walks away as the appetizer was being served. He Recommended only two large entrees to feed 8 people. We didn't bother to order more (we were all taking about where to go to dinner as we were paying the check) because we had been there an hour and a half already. Buca is usually a decent pick for a big group with kids, but this location is atrocious. They also ruined the quaint little decor that the chain is known for... just sayin...", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2014-10-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'saeYkFTdAqNrbiWgVgF3Tw', 'review_id': 'mBuhFTRTGbKsSKI8EFoGCg', 'text': "I had never been to the Bucca in Las Vegas so my husband and I decided to try the one in the Excaliber casino and it was delicious. The wait staff was very nice and anticipated our every need. We didn't even have to ask for refills on our soda. The restuarant was very clean and our food was very fresh. Thank you for a great night out and we will definitely be in again.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2014-10-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '-oez4NYef0jClXZuhB_lLg', 'review_id': 'cT151nv-0H6lVMVs4sO1_Q', 'text': "Very disappointing. Soup was served cold twice even after we complained. \nThe eggplant wasn't made enough, really not eatable.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2014-10-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'u8On54h5LBJPaLfGdQeflQ', 'review_id': 'PNgqjuzEMPcp5uad9tfZNQ', 'text': "I had my wedding reception here. The price packaging was fantastic considering we're on the strip. There were a few hiccups. The wrong drinks were placed in carafes (sangria instead of wine, and no one really likes sangria in my group), we were never served garlic bread even though it was supposed to be part of our wedding package, and our wedding cake was served well past our 2 hour allotted dinner (but it was taken off the final bill) Food was great, and services was also great, and surprisingly quick considering we had a party of thirty.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2014-10-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GQT3CBF4LJC4dN5LY8CMlA', 'review_id': 'TLh8x9OS1mQurYQDurkltQ', 'text': u"We have dined at Buca before, but it had been a long time ago and boy did we forget how great the food is here! We started off with the di Beppo salad, so fresh and the Italian dressing was so flavorful.  We shared the supreme pizza and WOW, large topping, super fresh ingredients so full of flavor. For dinner we shared the carbonara. Our server Jake suggested saut\xe9ed shrimp with the dish and it was just perfect. We finished the meal with the chocolate cake. The food was superb and the personal service from Jake just made the evening perfect. We can't wait to go back!! Thanks Buca!", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2014-10-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BUP6rMPEn62Cn9kVUZqp4w', 'review_id': 'x2lHfAPLFzb5O9TofuXeEw', 'text': 'My friend and I came here because we saw several signs promoting an ALL DAY HAPPY HOUR. It was awesome ha Each drink was $5.41 at the bar. I had several red sangrias lol \n\nThe food here is served family style so the portions are huge. We had the Spicy Chicken Rigatoni. It was pretty good, not enough chicken in the dish but it was just enough to balance out the large amount of alcohol we downed lol', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2014-10-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'i0OFbbcs6VeQpOdHwCi5fQ', 'review_id': '2qs6DtfCiEyiig5eQA6Lcw', 'text': u'comida estupenda, el mejor restaurante italiano de las vegas. todo fenomenal salvo una cosa, el aire acondicionado estaba a tope, parec\xeda el polo norte!!', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2014-10-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '2b-aju7blMF-8nYYkw-Cjg', 'review_id': 'nORoYqEMLuA9nzUqqR7HxQ', 'text': 'Normally I would steer clear of chain restaurants like this while on vacation. I can visit Buca di Beppo at home, why would I go to one in another city when there are so many other choices right? After a long road trip and getting in very late we didnt feel like venturing out however. Service was great, waiter was very friendly. Food was great as well! A little on the pricy side, but they serve family portions which is why. Don\'t be fooled by the "small", its still A LOT of food', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2014-10-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-3AE9g5ECpOiyI3IxzcQgQ', 'review_id': 'zBYTWj6tVY3eXI6OKxhlyg', 'text': "Thank you Bucca for making my Wedding Dinner so wonderful! Undeniably the best service we've ever had!! My guests were in Awe!! I honestly didn't have any idea what to expect coming from Alaska; but leaving it in your hands was the Best Decision I made!! Great Atmosphere & the food was amazing! Served Family Style with 40 guests was very intimate! For anyone considering a wedding Reception at the Bucca di Beppo at the Excalibur; DO IT!! You will not be disappointed! Just amazed!! Thank you Laura & Cynthia! Your Team Rocks!", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2014-10-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ujhIMxP7-7z4vyju5ws1sg', 'review_id': 'w1pHvUFmL_X-G00Ek8jCIg', 'text': "What a disappoinment! I should have guessed when the bread baskets came out and they were filled with COLD bread!?! Really people? First off let me say this place was not our first choice. We had to settle for Buca because our party grew too large to be seated at our restaurant of choice. We all ordered entrees from the menu (not cheap either) and not one of them had any flavor! A plate of calamari with one lemon slice?Chicken Parm-soggy batter, way underseasoned marinara sauce, Manicotti-there is a better recipe on the box of pasta folks! Pasta in a white sauce, artichoke, sundried tomato, and chicken breast...same thing, bland bland bland. An Italian restaurant should romance you with all those wonderful smells. Next time, I'll not and say I did. :(", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 2, 'date': '2014-11-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'udGAojuv-TvotaASDcuo6A', 'review_id': 'vjmHoVT235dOCOp_Wz8WJw', 'text': "My mom and I came here for happy hour for beers were $5 all day, we ordered a house salad and eggplant parmigiana. The salad was soggy tasted like it was pre-made and sitting in dressing all day! The eggplant parmigiana was salty and hard, did not taste good! I hardly ate it because it tasted horrible! If Gordon Ramsey walked into this place and tasted the dishes he would say that it tasted like shit and it looks discussing!\n\nWhen we complained about the food to the manager he took the eggplant parmigiana off the bill and we only paid for the drinks and salad, which I hardly ate also. My mom had most of the salad and I left hungry because we were going to see a show. The waitress came over and apologize to us and said that it wasn't made fresh! I was looking at her like wtf what did they do microwave the food that was served?! All I could think of was the kitchen nightmares with Gordon Ramsey where the one restaurant kitchen staff prepares all the food then reheats it in the microwave! I rather go to Gordon Ramsey's restaurant in planet Hollywood at least I know that place has standards being that it his restaurant compared to bucca which use to be good!", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 2, 'date': '2014-11-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8VIu5fIUeTH5gRn2TkuBgQ', 'review_id': 'Hp4ZvQM3Ks9-0CAx0RRP7w', 'text': 'I was very impressed with menu variety, portions, price and service. I was not expecting such good food for a chain restaurant. No comparison to the Olive Garden. I highly suggest the Penne San Remo. They use family style for the entrees. Two small entrees more than enough for three people. Take this into consideration before adding on appetizers, breads and salads.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2014-11-12', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'PVo9NLBOtApUPoGGvTgEOA', 'review_id': 'xYo2D9y2qB-EdV0UwNWFYg', 'text': 'Horrible service...waited 10 minutes for acknowledgement that they knew we were here.  Then another 5 for water to arrive.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2014-11-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IywD2LIdgPKg-vMwNtCXhQ', 'review_id': 'Xe4RGTmkO1B7B2mhT6WmzQ', 'text': 'Been to the ones in San Jose and San Francisco. This one was delish as well. The $10 24oz drink with $7 refills rocked.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2014-12-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1aNyBVJe2hNSXrVY5zsR1Q', 'review_id': 'EqztWTy5zaPmG7cONel3gQ', 'text': "I love Italian food. It's one of my favorites! I've never gone here before, and I've heard that they have big portions and the food is really good. My friend and I were in the area the other day because we had a show to watch. She wanted pasta, and Olive Garden was too far. We went to Buca di Beppo, and the prices were expensive! It did say that the small portions would serve 2 or more people, so we shared a dish. We had chicken cannolini- a stuffed dish with chicken and cheese and spinach. \n\nThey did come with bread and butter. Our bread was cold. It would have tasted much better if our bread was piping hot. Since I was starving, I stuffed myself with bread. When our stuffed pasta came out, there was only 4 pieces. I was kind of shocked because they said portions are large. I had 2 pieces and my friend had 2 as well. I was still hungry after eating. I don't eat much either. It was $24, which was definitely not worth it. Some of the other dishes might have bigger portions, but when you purchase meat, you get way less food? The pasta itself was delicious.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2014-12-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LdwnPakNOSAINPAC6qszmQ', 'review_id': 'TFBq_4-Y1KM8zNCKbZfj-Q', 'text': u"I was recently here for lunch with a Party of 6, and was very disappointed with the manager and waiter ! I ordered a sangria  and had left muy passaport in the hotel safe ( I'm 35 and look like 40) and I was asked for an id I showed him muy Intl drivers Lic. But he could not find my age, so he asked his m\xe1nager if he could allow me to purchase the drink but. Was denied!! Thanks you guys Made my day! \nP.S. the bread was cold!", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2014-12-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rMWEolYH5zBdMYpEHO5s7A', 'review_id': 'gNbJaXRUdf-B4dpkkG8m6g', 'text': "It was my birthday!! So birthday lunch here it was. OMG so there is this amazing Mozzarella Garlic bread you have to get as an appetizer!! It's mouth watering.The portions are served a la carte, therefore portions are family style. The Chicken Parmesan was delicious and more than enough. I tried the Peony which is similar to a sex on the beach. For 13.99 you get to keep the glass as a souvenir   awesome isn't it? Yes! The waiter was kind, attentive and friendly. I was surprised with the colossal brownie as the team sung happy birthday and blew out a candelabra. AMAZING!! I LOVE THIS PLACE! \n(Only downfall were two screaming kids)", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2014-12-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': '7r-dBhPrMWZjk9N0P7WeyA', 'review_id': 'Zi45QPSe-XuzBLqhEEuzOQ', 'text': 'A real Italian restaurant located at the Excalibur. Super friendly staff and super cheap beer. Only $ 2 Bud Light on tap. We were at this restaurant almost every day. The lasagna was really amazing.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2014-12-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HnwTsKmorwqbqMkfghwYXA', 'review_id': 'MMwCpGzsl2yhaRfeggXwkw', 'text': 'The meals are so great,  that I want to grow another stomach to keep consuming the heavenly meals.  The portions are big.  Great sangria too', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2015-01-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'rQIqfLps0L-Qtl53atBEog', 'review_id': 'UuuxaJota4-UVad18zIlww', 'text': "Good Italian food but the servings are huge. We ordered from the lunch menu thinking the portions were smaller but no they are still enough for sharing. The best part was the lemon cake for dessert a little expensive $13.99 but it was enough to eat half in the restaurant and half to take back to our room so I guess the price wasn't too bad since I got to each twice", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2015-01-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'TZuzvzguBW9_7muc-fa_uw', 'review_id': '5R5k0NCFKvPb3hqLbOsxdA', 'text': 'Came here on our last night in Vegas. Sat us in a large booth. Server was very polite and on point. The hardest thing is trying to find vegetarian friendly food in Vegas. Ordered the Fettucine Alredo and asked for chicken on the side. They had no problem with it at all. Would highly recommend this place over a buffet considering the price. And if you stay at the Excalibur you get a $10 off coupon. \n\nCome here to overload on carbs and have a good night sleep!\n\nYeah Buddy!!!!!', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2015-01-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KUhcXSg5emZssb_IgzF5kA', 'review_id': 'lZ5FZ2gayRLCPvZtOHgo6g', 'text': 'Good meatballs and spaghetti, large portions a small will feed 4 ppl. Good prices and nice atmosphere, worth a stop while in the Excalibur Casino.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2015-01-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'IBAPFDO80uU3sWw0Vx7klQ', 'review_id': 'J2OKHPyCVekXy4iC9EiYaw', 'text': "The food was excellent and the service was good. I don't know why they have some bad reviews? I have never had anything bad from Buca.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2015-01-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'rHYUwqSVcew7CCwIpM8QEA', 'review_id': '_2reaCGDxgpW1ixy8u-NAA', 'text': "We ordered Baked Ragatoni. OMG this meal was fantastic. We ordered a large for just 2 of us. Needless to say, the homeless around the hotel will eat well.  Great wait staff, sat us very quickly (7:40pm) and the food was out in less than 15 min of ordering. The restaurant had about 50 people in it so that's saying something about their promptness.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2015-01-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BJPMxn5hvLSptX0qODWcgA', 'review_id': 'Ez6itrDk9F7BkmK7FyW7vg', 'text': 'Friendly, Fine, Food simple great Italian dishes.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2015-01-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'qi4AzPwMR1ba6VPUPk9sIg', 'review_id': '-WgxDQCZk9p4NMaJZoxtTw', 'text': 'Mini portion Togo. Best lasagna ever! I love eating left overs from here. Happy birthday mom.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2015-02-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'aIcBmKA3LZfjA7Xu8NQqfA', 'review_id': 'iYPAX7IUzdNHbt4Ms_rQFw', 'text': "Have had 3 great meal here. Super food, Great service.\nGreat value for the money. Always left with a doggy bag. Sorry but dog didn't get it.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2015-02-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hZr85BTimXWb38-mL-IbfA', 'review_id': '_a5MB-sACN01nJ9Jnj864g', 'text': "Out to rip you off. I recommended this place to friends based on my good experiences back home. The four of them made a reservation and were having dinner when we joined them. The hostess tried to tell us we couldn't sit down when there were two empty seats at their table. We ordered two glasses of wine as recommended by the server and were handed a bill for $34. That's right, they charged us $17 a glass for the house wine. We're here for a week. Not only will we not be returning but will be telling everyone here at the conference to avoid yet another Las Vegas ripoff.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 2, 'date': '2015-02-16', 'type': 'review'}
{'votes': {'funny': 5, 'useful': 2, 'cool': 2}, 'user_id': 'ooRn9RNTwyNtPNMj19n6PA', 'review_id': 'g6aTAqcCZux_hZoxu5uPpg', 'text': 'Horrible..horrible...horrible..', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2015-02-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '20DKKd5TzCOkyCbKqFgDGg', 'review_id': '3opQfqPyVc6-sJU0KYfhkA', 'text': 'Good food. Warned by menu abd staff, share. Our waiter was excellent. One of the best ever. Courteous, prompt, attentive.\n\nFault of give shared two entrees abd a salad. Warm tomato abd spinach. Creating had a bit of sliced, delicious. Abd even though huge, Werth Nader it through the cheese ravioli. Miss than with the last minute. trip', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2015-02-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'n3HMBi4UcHPa1pDwIFCmCw', 'review_id': '6FiCn8K8AfuVrrq_N9oo7Q', 'text': 'Walking into Excalibur should\'ve been a forewarning to the level of service we would receive.  Knowing Buca is generally a family-style eatery, the hostess sat us a the bar table without asking if we were ordering a meal or only beverages.  The server was overwhelmed with tables which was odd since the restaurant didn\'t have that many patrons. We asked to be moved to a booth which took some time. Eventually we were accomodated and promptly asked "what is wrong". I explained we needed more room for the 3 of us. We received our food quickly afterward which the quality and portions were fair.  I would\'ve rated an average had it not been for the passively twatty hostess\'s crappy attitude.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 2, 'date': '2015-03-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ov-aobPBkYcy-AijabuRgQ', 'review_id': '1varAGSfo3r_key7vLWCkQ', 'text': "fried calamarie and Shrimp Florentine was the bomb dot com. Will come with more people. And I'll come for that COLOSSAL BROWNIE SUNDAE nxt time. I'm to stuffed to eat a 12lb SUNDAE", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2015-03-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fO6x7MllY3dzRbYJOEEK9g', 'review_id': 'RPEDWHAGYkd7GPMgh7s58w', 'text': "I was skeptic about service at this place, but i didn't experience anything negative. \nWe ate late lunch/early dinner at 4pm. \nThe welcoming staff took a little till we were sited, our waitress was kind and helpful. The food (minestrone soup and the shrimp florentine were both really good and plenty) \nI have nothing negative to say about tis place. I enjoyed myself", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2015-03-15', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 4, 'cool': 1}, 'user_id': 'FadM3FrreR233vVcvi7Cpw', 'review_id': 'bhQdODLeTzZZz_4D5wYVAw', 'text': "Yesterday my friends and I decided to give this place a try for the lunch specials that they have to offer. We waited sometime before someone came and took our order, when the waitress came she wasn't too friendly [Name was Jackelyn] we ordered and waited and waited and waited finally we received our food. The pros to this place are that the portions are a very good size you will definitely take some leftovers home and it is very filling. The cons our waitress didn't come and check on us and when we asked of they did anything for your birthday she stated we just sing you have to purchase dessert...um okay, also let them know before if you want your check split or they will just assume one person is picking the tab up. Overall I gave this place 3 stars because the decor is awesome and the food was great.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2015-03-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PBZ925VU61hor5WT_flIAA', 'review_id': 'Wf-GTJlBuZuA6UTF4-jTfQ', 'text': 'We had a team dinner for soccer here. I scheduled in advance with their banquet coordinator Cynthia. She was fantastic! We did a 3 oclock sitting so we could get the lunch price of $19 per person which includes tax and tip. It was so easy and really inexpensive! There was 34 of us that sat all together. The table was ready and the salad and bread were already at the table when we sat down. We had spaghetti, fettucine alfredo and chicken parm, bread salad and drinks. It was so good, extremely easy for such a large group and we even had left over food. If you are going in a large group or for a team event I highly recommend this Bucas.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2015-03-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DhvfUvjdYF6AVfcUzVPIiA', 'review_id': 'PccwhLL0H35OPck09-2Amw', 'text': 'Dave m was Uhhhhh Mazing! Could his service be any more impeccable ? So friendly and attentive he was great. Always smiling and talking to our entire group keeping things fun. I wish more servers were like him and I say that because I am a server so I recognize great service!! This guy deserves a raise or a promotion. Bravo Dave you were awesome! Thanks for making our experience here so great. Also the food was good but the service even better', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2015-03-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'zU6w2bHGlDFu-nEx7aP_dA', 'review_id': 'rCROTkhJzjhm-bD_OA4r6A', 'text': 'I had a not so positive experience, however, the management contacted me and was very willing to make everything right. Will give them another try.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2015-03-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'ScCWCLXQF0q7mtCfJe511Q', 'review_id': 'TmItMye_wrsNp_xccGkwEQ', 'text': 'POOP ALERT!!  BEWARE!!! So my hubby and were having our house fumigated for termites so we thought, "Let\'s go to Vegas for a short vacation."  We were having a great time at the Mandalay and shopping at the outlet.  On Fri March 27 2015 we decided to have a late dinner at Bucca since were familiar with the great food at the location at Universal City.  There was a wait at the location at Excalibur as there is at the one we normally go to.  We didn\'t mind.  The service was great.  We had the green salad and garlic bread, delicious.  Then came the lasagna.  It was good but then something happened.  We both felt bloated very quickly.  We had a lot left over so we decided to take it with us. Both my husband and I had a horrible night with stomach cramps and nausea.  In the middle of the night I ran to the bathroom to vomit but didn\'t make it to the toilet and ended hurling in one of the sinks. I tried to hold it back with my hands but my body rejected the obvious bacteria that permeated all of the layers of the lasagna.  Moments later my husband started vomiting also.  So all night we took turns vomiting violently.  There was a beautiful couple across from us that were also having lasagna.  I just hope they weren\'t on their honey moon. Day three,  my wonderful husband and I are back home and still recuperating, our backs and rib cages sore from the force of the vomiting.  I\'d also like to mention that my husband and I don\'t drink alcohol. So the vomiting can\'t be attributed to being intoxicated. I\'m writing this review because a child or elderly person could suffer serious results from food poisoning.  We will never go to a Bucca di Beppo again.  Too bad because we often celebrated birthdays and other social events at the Universal location.  We just aren\'t willing to take the chance and besides, Italian food doesn\'t sound that appealing any more.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2015-03-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_inAsrE5WRXPYVq6waBmeA', 'review_id': 'sUEPPWCDAG-JOsc3Xi5yCg', 'text': "We ate here because we felt like Italian food.  We had a salad and the spaghetti and meatballs.  They are served in family style (large portions).\n\nThe chopped antipasto salad was good.  The spaghetti and meatballs were adequate.  I wouldn't say delicious but it was acceptable spaghetti.\n\nThe waitress was friendly and helpful.\n\nThe limoncello was amazingly delicious.\n\nI'd go here again.  It isn't cheap. It isn't great.  But for the strip and Italian, it was good and acceptable.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2015-04-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '5kIbAaWWNQZwR-TaOcFxxw', 'review_id': 'uHm5Nnb07OI2qtY57RtRbA', 'text': "I got married March 17 and had dinner after the ceremony for all our guest. Which was 70+ people. We brought our own cake, they set up a cake table for us free of charge. They set up our wedding favors, so we didn't have to come early to do it ourselves. Everything was perfect and we had a great time. Cynthia Diaz is the sales coordinator, she made everything so easy and smooth. She's the best. We couldn't ask for more, she made our stressful day easy, well on the reception part. I recommend to anyone to book a party with them, they'll make your day special and easy.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2015-04-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'oI-q8fl_I4AJNn45LHgBOA', 'review_id': 'pqv8xcqbmo2d8lFQdrjVQA', 'text': 'I came here last minute to use my Groupon. The waiter, john, was very patient and efficient. He brought out the fresh bread right away and refilled our drinks. The meal was a small penne portion and more than enough for two. It was very yummy. At the end of our meal, the server forgot to run the Groupon and my card was already charged for the amount. The manager, Jay, came to our table to handle the situation in a very professional and respectful way. We are beyond impressed with how they handled the situation. We will be back to this location because of the incredible customer service.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2015-04-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'JsM8AT4tWUMbjxlbUrQ0TA', 'review_id': 'kvm1KeW8D_XfnuXJ8oKEmQ', 'text': "The boyfriend and I are foodies and we're always on the hunt for a delicious new date spot in Vegas as locals! We went last night and had a great experience! For Italian it's a little pricey, but keep in mind that the portions are family size so it's perfect for sharing. We started with the trio appetizer, the baked rigatoni and the stuffed chicken with prosciutto. Now I need to say that I am extremely picky about Italian food being a born and raised New Yorker, but I thought the meal was really good. The sauce for the rigatoni was a little sweeter than I like but the creamy pesto sauce for the chicken was great! Of course my boyfriend preferred the rigatoni to the chicken! Good experience and great service! Also the Excalibur has a killer food court selection so you can grab a Krispy Kreme on the way out! We will be back!", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2015-04-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TTQeZ9r1C5KOU7xldw4t7A', 'review_id': 'KNgDc28WRFBLKvVeRpUocA', 'text': 'Second attempt to eat here. No service in the bar. Waited and waited! Second time table at bar was wobbly. So we waited to sot inside. Stuck in the corner like a red headed step child . WTF! The only good about this is looking out the window at the hot babes go to the male strip club.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2015-04-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'iYO_OgO7kKxhZK-ZTbfekg', 'review_id': 'P1Yl_m3_qpvug-Q-xdP2XQ', 'text': "Two families went for dinner with some friends. We ate at the same table and had two seperate bills with gratuity  on each. When each family tried to use their coupons the manager said they could not do it because if was the companies policy. The food was alright and service was ok. Ask about the coupons before you eat and the beer was two expensive. Won't eat here again.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2015-05-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'u6NwGKkqsurcxIumMnBQfQ', 'review_id': 'xmjYsJdKp59EpbupJV-Omw', 'text': 'This was our first time coming to this restaurant and it was very good food.  The service needed to be better as we had to ask for refills and when needing our waiter, we always had to ask the bus person or another server.  Over all, it was a good experience and would dine with them again.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2015-05-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UoxvDmm6vb2vp33P86NXpQ', 'review_id': 'l8Vj-avqN_3pUGB_g2mZqw', 'text': 'Italian atmosphere.  Always seems busy with kong wait times to be expected.  Portions are real big so might want to think about sharing.  Their beer selection is terrible unless your favorite beer is bud light.  Food is ok quality pizza is pretty good.  I give it 3.5 stars. If going on weekend night be prepared to wait at least a half hour.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2015-05-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'B2nK3C3xF8-7VKlhTaB-iQ', 'review_id': '2UxQL_lE_VvPx0HrIEKhuw', 'text': 'Good food but service wasn\'t great. The "$8.99 lunch specials" sign outside is pretty misleading, considering a soup and salad combo is $8.99 and the rest of the lunch entrees are about $12 and up. Our server told us we could order from the lunch menu or family style menu, which would probably save us a couple bucks if two or more of us wanted the same thing. You can definitely share even the lunch portions. We had the chicken parmigiana with spaghetti, the baked ziti and the spicy chicken rigatoni. All three were HUGE portions and I ate maybe 1/3 of mine. Our server was just kind of rude and insisted she couldn\'t split the appetizer between our checks (I waited tables for about five years and I find it hard to believe your computer system doesn\'t have that capability), but food was decent and not bad for the price compared to other Vegas restaurants.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2015-05-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'w0qlOUoKaxxs_moX19KTYg', 'review_id': 'PvPU2jUSlgI63_JLmpuBWg', 'text': "I was there with my wife and some friends for my wife's birthday.  The two of us just ordered a  drink each. The two drinks on my tab came out to $40.00. The drinks were $16.00 each and the waitress decided to add $6.00 gratuity.  $40.00 for 2 drinks? REALLY? I live in Santa Clarita Ca. And visit that location many times but if that restaurant corporation is OK with ripping off customers then I will no longer go to any of their locations.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2015-06-07', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 1}, 'user_id': 'Ormpy8Ptyw1njZqrXEvHuA', 'review_id': 'WslIBsVt3lxXGLPUGzLfOA', 'text': "Let's just say that the food was awful.  Lasagna was terrible and everything else was.  I would never go back", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2015-06-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'NYyXEIZH_qZH2i7T37i_HQ', 'review_id': '3wnKrpmEwhPjV1xvkMBC4g', 'text': 'This will be brief.\n\nThe service was good, she checked on us. And was very helpful. \n\nThe food, I could have done without. Pasta is bland, very lil flavor. It all around sucked sad to say I was hoping for better. Seems like the cook had his hand slip with the red peppers because I had to stop eating, it was way to spicy. Not a fan of this place.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2015-06-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '8uvZSpKcVT5T_SDl91wObg', 'review_id': '2j5_8rKCgZStlrUyixchCQ', 'text': "First time trying this place. I'm not sure what's all the hype about it.  We had the cheese bread which is good but the spaghetti was just okay. All four of us had upset stomachs after eating the meatballs. We all agreed they had a funny taste. Even my youngest child who I swear is part spaghetti and meatballs didn't finish for the first time ever. Probably will never go back again.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 2, 'date': '2015-06-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cG3yot-QC4P_YyRs_Bb-ZQ', 'review_id': '7BQlun-MgkreL67pMKYGKg', 'text': "Our waitress Paula was awesome! Great service, recommendations, and personality. We didn't have room for dessert so she dropped off some star bursts candy haha it's something little but a little goes a long way.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2015-06-21', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'bm2-Wr_jfvGBwpABmJAd1g', 'review_id': 'A_9_lMokzlYqAe8BnZU4wg', 'text': 'While wait for a table there was no bar tender. Once seated no one came to get our drink order they only came to get our food order. We ordered 4 waters and 3 ice teas and still did not get the drink order right! Definitely sub par service here.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2015-07-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vX3QP-NG0EuN2SLpGyulyw', 'review_id': 'dVOaPUQb-tCQtWAiOUdXJQ', 'text': 'Having a wedding party here with 23 people. Great service and food. Had the cheese manicotti, chicken parm and spaghetti. Plus salad and deserts. All excellent. Would come back again any time.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2015-07-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PY047z9tD1ZsDy1Nq3l9Yw', 'review_id': 'GO3CIJpohfXj6GNU1fIFFA', 'text': "Terrible spinach dip,great chicken stuffed\nPresuitto, don't get spinach cheese bread\nTasted like cheese substitute,fantastic\nAtmosphere and waitstaff", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2015-07-26', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 1}, 'user_id': '2YKz5A6G0sRxN0hFbWTyhg', 'review_id': 'qC4pqJF30XMyqwpMdnzEoA', 'text': "This is the worst service we have ever had before. Our server - Paula - was absolutely ridiculous. She took 10 minutes just to take our drink order. Nowhere to be found for most of our dinner and had an excuse to offer every time. All of the food did not come out how we ordered it. The eggplant was so overcooked I couldn't cut it. My advice is to NOT come anywhere near this restaurant. An hour and 30 minutes wasted.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2015-07-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FX4WXzJXhmVy4QVACVFsvA', 'review_id': 'rKdXK_SGH5GyM5CzXhYV2A', 'text': "Fantastic pizza and prices. Nice varied lunch menu. Prompt, friendly service. I believe our waitress' name was Paula and she had great energy and was fun to talk to! She checked on us frequently and was quite frankly the best waitress we had in our entire trip to Vegas! She was busting her butt at every table!!Highly recommended for a classy, inexpensive Italian lunch with top-notch service!", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2015-07-31', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 5, 'cool': 2}, 'user_id': 'ruqAS0sS_fLmMiioU-0JCg', 'review_id': 'E4M8oVBBcBVCJzAbXthpNw', 'text': "The reason I give this place 2 stars is because of price and average food. We had a party of 6 and we ordered a large lasagna, a small shrimp florentine, small basket of garlic bread, a beer, and 3 soft drinks. My bill came out to be 100 bucks. The lasagna wasn't great. It lacked meat and it was overly salty. I wasn't impressed at all. And a large isn't so large. You would think that the large would be fairly a large portion when it says it feeds 4 or more people. Trust me, when you have a group of men, it will probably feeds 2-3 people. The lasagna was $40 dollars for a cheese lasagna with no meat. It says meat sauce, but it was just salty cheesy tomato sauce with not a single meat piece. Skip the lasagna, not worth it. The shrimp florentine was good and the garlic bread was delicious. Everything here is al a carte so the bread was $10! And the shrimp florentine was $30 for a small size. What kind of irks me here was that they charge for refills too. So when everyone got refills on their root beer and diet coke they charge $1.75 or something for each refill. So, it was 20 bucks roughly for 3 sodas and a Heineken. Wtf. Let me tell you guys, in Vegas there is not a single establishment that charges for refills on drinks. I feel like this place is a money eater and sends out overly salty food. When the waiter came to ask, would you like a refill on your drink, my party made the assumption that refills were free. I'm surprised they didn't charge me for my tap water and the cups and utensils I used. Jeez. My head was hurting from the massive intake on salt after that. I don't mind dropping a 100 bucks for food, if it was good. A bit disappointed with them. Won't ever be back, way too many great Italian places in Vegas to spend that much on mediocre food.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 2, 'date': '2015-08-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': 'f4NLXIFt2KhN_WrwRHNOoA', 'review_id': 'p7zcjz7dbFQM9pnvYzBznQ', 'text': 'Great as always, great server, he was handling at least 20 tables and took care of me well. Ian was his name. Food was amazing, love eating at this restaurant when I get a chance because I love big portions and take home.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2015-08-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'm0YIKvZPrLG96TLt5z7OSw', 'review_id': 'KBvDMOJ0D15d4KkSxhhR_g', 'text': "Seriously Good Meatballs!\n\nI'm so happy I've discovered this place.\nGood home style pasta, meatballs, marinara souce.\nGood quality home bread and butter (you supposed to eat pasta with bread and butter)\nGood service, if they busy it might take a bit longer to get your food, but it's worth it!\n\nTip: they will let you use items from their Lunch Menu if you show up all by yourself even at 10pm.\n\nTip #2\nBetter bring a friend or two, as all their menu items are designed for 2 or more people!", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2015-08-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'EYpieRbCi1MeC6ZQnFm6bw', 'review_id': 'uLDJbdzmnvTVc8g-H0lOyA', 'text': 'We had a good breakfast here, although service was a bit slow. Their Bananas Foster French toast was delicious! Omelets here are good as well, but wished there had been an add your choice ingredients option. The waiter was nice but scarce until it came time to pay.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2015-08-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'SfaiBlG0VzRWjCc8csFV1w', 'review_id': '_SOCB8XN7Lkc3VjIE0-5Zw', 'text': 'The food was okay but the service was really slow and they took over 30 minutes to bring us our food!', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 2, 'date': '2015-08-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wu4IX7CHUvsGpizX8uhMMA', 'review_id': '0tYg_leWJ560PcZTJaAUXw', 'text': 'My wife and I went for lunch.  We had to wait for a table even though there were lots empty.  The explanation was that there were not enough servers?!\nThe sign outside said lunch from $8.99.  But the lunch menu had nothing less than $11.99!!\nMy wife ordered the cannelloni.  Two !! arrived in a small amount of white sauce.  No garnish, no bread, that\'s it!\nMy lasagna arrived. A tiny portion, maybe about 3" by 4" with a little red sauce.  Again, no garnish, no bread.  It was barely room temperature.  I sent it back for some heat.  It was returned to me hot, but it had been microwaved!!!  How could a restaurant possibly think that is OK?  I refused to pay.\nI spoke to the manager on the way out.  He couldn\'t understand why I didn\'t pay for nuked, mediocre, food!!!  He actually thought it was OK!!!\nIf you want Buca, go to the one on Flamingo East.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2015-08-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '0CyD0jOtbWu4dAi_Djo0LQ', 'review_id': 'oD2huPZMK4giVQstFHFVwQ', 'text': 'The food is always amazing here & last night I went in with my boyfriend and Hector helped us out and made a great recommendation on the stuffed chicken! \n\nThanks Hector for your awesome service & for your great recommendation!', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2015-08-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'O5ns-YPpv7FmbYxvNRQQ1A', 'review_id': 'XXpEJmH2tto88Y9HCltgvw', 'text': 'Came here for my first time ever, on my last day i came here to eat some great food. When i got here everything is so unenthusiastic, waiters and hostesses are dull and boring, once i arrived at my table we got greeted by our waiter. He took down our order got us our drinks and left. After receiving our food my friends mom asked for tabasco, our waiter said ok and that he will bring it, we looked at him and proceeded talking to his coworkers until my friends mom got up and said something. After I almost finished my meal i noticed a HAIR in my food, i checked if it was my hair to see if maybe it fell in there but my hair is 10x more darker than the one in the food. If i could rate this place lower i could. I will never in my life come to this place again. I thought CUSTOMERS ARE NUMBER ONE PRIORITY, i guess not here. 10/10 would not recommend, save your money folks.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2015-08-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SBvulOzUDuuHMRKCsS86Gg', 'review_id': '3mQtIDPh88ViezkrwbXJTQ', 'text': 'I came to this restaurant for my first time the other day and I definitely enjoyed it. The portion sizes are quite large, so you can share with other members of your party. We ordered 3 dishes: the lasagna, a salad, and chicken. We were all fully satisfied with what was ordered and I would definitely come here again. Their happy hour is also a plus.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2015-08-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MeSdqNQOKtZxIIIY3NxDXw', 'review_id': 'UtW3MmzP6atYTrllkSHgNA', 'text': "I came here with 3 other people and we ordered 3 items because we couldn't decide and everything looked delicious. When the food came we were overwhelmed. The server did tell us that it was family style with huge portions but we figured we would take the rest home. Glad we did! We got the lasagna, the spaghetti with meatballs and the spicy chicken rigatoni. All were so good! I especially liked the rigatoni. It had a nice kick and even though I don't like peas the sauce was so good I didn't even taste them.  I finished about half the bowl and took the rest home and it was still really good the next day. Can't wait to come here again.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2015-08-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'Dorg57DfTwyLVvbECTmUOw', 'review_id': 'hfiKZ6oPGhbbcHgZtM0wYg', 'text': "I'm usually not a fan of Buca but after a day of travel, we were ravenous. We were staying at the Excalibur so this was pretty convenient and located on the second floor. We had a party of 6 and ordered 3 small entrees, a salad, and a side. We actually finished all the food, and surprisingly the food was good! Not sure if it was because we were hungry or not, but the meal was surprisingly pleasant! They also have an all day happy hour, $3 beers at the bar (select beers).", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2015-09-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'O5ns-YPpv7FmbYxvNRQQ1A', 'review_id': '16uAHYLPbqr9ZQRrv5hHXg', 'text': 'This is an update from September 10th, the owner or manager of this Bucca contacted me and gave an sincere apology for what happened, I explained to him what have happened and tried fixing it. So i decided to give Bucca another shot here in Fullerton, California. Here\'s what i liked and disliked.\n\nLiked:\n* The service was 10x more better here, with more customer interaction and little jokes here and there.\n* The environment was a little more Family Oriented which I really like. \n* So much more friendlier staff that aren\'t looking like they hate their jobs. \n* Way better pasta, the one I got in Vegas was a bit bland. \n* The food proportion are HUGE, which i like, if I\'m paying 22$ for a "Small" it better be good.\n\nDisliked: \n* Everything came out really slow like, I was waiting a bit just to get a water refill.\n* Some of these foods need a little more flavor, for example , I order the mozzarella garlic bread, it was good when i bit into it, but when i dipped it in my pasta sauce it was 100x more better, things like bread need a bit of sauce on the side to enhance the flavor.\n\nOver all it was a hell of a lot better experience I had in Nevada, Hopefully this review helps and lets this business learn from its mistakes and strives to make this restaurant a better place for all if its customers, Remember Bucca "Customer Is The Number 1 Priority!"', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2015-09-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'L7j6tkOvuuQx814tzNS0IA', 'review_id': 'vo7sAAJXYdYCDqRHq24naw', 'text': 'Great food. Ordered baked ziti and penne al vodka pasta. Penne al vodka was spicy and we really enjoyed the food.\n\nEven though there was a wait time,the service was fast.Reasonable prize and the quantities that they serve is more than the what we expect!! Plan accordingly. \n\nWe stayed at Excalibur and so we got 10% discount which was Amazing. Will definitely go again.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2015-10-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'o__BNcipECrS8eJf6tazew', 'review_id': 'lR0feYMygGDngK5cgBvjcQ', 'text': "Had my wedding reception here last weekend and It was absolutely wonderful. I had a party of 30 and did the group menu option. Cynthia the group coordinator helped us over the phone and was completely awesome. Being I'm from out of state she was able to help with all questions and concerns. We got to choose our menu items before hand and I was a little nervous of how it would actually turn out and I was beyond happy with the results. The food was amazing (cheese manicotti is to die for) and service was excellent. Waiters and waitresses were extremely kind and helpful. My groom and I were very happy with the entire experience, as well as my entire wedding group. I would absolutely recommend.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2015-10-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pjwlc1pLmiGAMi2xm2rHKA', 'review_id': 'Bd9dzvtDLW8rosUYQdofZQ', 'text': 'Ordered the bruschetta and spaghetti and meatballs. Bruschetta bread really hard. Spaghetti was bland and meatball was hard.  The service was bad. No napkins and only saw waiter twice. Yeah we sat quick at the bar but would rather pass on it and go to sbarro at the food court.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2015-10-07', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': 'coNLFNH2_Tc-XWTrjw_1Ww', 'review_id': 'F052zZQvUNxb0dA0EL2_jg', 'text': 'We found this place wandering around looking for lunch.  The decor is a bit cheesy, including a Pope room with a domed roof.  The menu if "family style" (aka, everything is super big).  We ordered one appetizer and one entree to share, and couldn\'t finish everything.  Eggplant parmesan was very good.  Food presentation was average.  Service was average.  Prices seemed a bit high.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2015-10-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3V5xa05sh6UN84Z0p1CNDQ', 'review_id': 'Xo5UL0WwjIYwnTJ2KAdMXQ', 'text': "Worst experience ever!!!!! Carolina or karolina was really rude.!! Hire a better manager!!! Never again!! Carolina didn't want to serve us. Yet again worst service ever!!!", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2015-10-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'sAxdGpUBOI18YWzGoEE0Cw', 'review_id': 'e7DqDBlQ8T6n3pxn_EUr8g', 'text': 'We went for dinner while we were in Vegas. Food was very good. Waitress was very nice and friendly, explained everything to us as it was our first time there. Price was good. We stayed at the Luxor and walk over. We would go back again when in Vegas.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2015-10-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'DWzluO4NWLOuw1ks6zpUWg', 'review_id': 't3F7eKPeSSHfQiXKIodJgA', 'text': 'Ate here last night with friends and co-workers. While the food we ordered was flavorful, the service was horrible and slooooow. We waited almost an hour for the food to be served. The waiter could not be located and we had to ask the receptionist for drink refills. The manager (if that was the manager) just chatted with the receptionist staff and did not go around to check with customers. We were ready to leave when the food came. There are better options out there I bet. Avoid this place if you are in a hurry.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2015-10-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MTEoTE4dLOdF4s5NijbjAg', 'review_id': '8SgwnPeK3xIAkkoBnkse2g', 'text': 'We had classic meatballs and spaghetti with the Caesar salad.The meal was prepared beautifully and the server was very helpful.', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2015-10-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-bXlUX8McGJlQMY8NrYatw', 'review_id': 'oGwk3HqSHrkx368N2vhoYw', 'text': "I don't know where to start messed up the order had to wait 20 minutes for my wife's chicken everybody else at the table was finished eating. I ordered a fry provolone tasted freezer burnt and was smashed together. There was four of us the bill was $130 for pasta !  Come on $130 for pasta never again will I be at this restaurant !", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 1, 'date': '2015-10-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zio9WR7yiK-NWjRX-nz1kg', 'review_id': 'eejdyW6DagDuPIbfnumupw', 'text': "Spaghetti Western is a great authentic Italian family restaurant. It is family owned and operated from Italian's. \n\nThe penne aribiatta and tiraimisu is awesome.  Order it everytime!!", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 5, 'date': '2015-11-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'EJBgkCAYU6tn0TNFNX-62A', 'review_id': '-NkWEvOd_Z4UtZiEJqPTrw', 'text': "This place is so much worse than the one I always go to in Santa Monica Ca. The baked ziti was not really baked. In Santa Monica, the actual plate is hot bc it's baked. This one in Vegas the plate was cold to the touch. The garlic bread for $5 was a waste of money it was awful. Food overall wasn't great here. Service was meh.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 2, 'date': '2015-11-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 3}, 'user_id': '81zrDdXbLskjQ3HrpiVd7w', 'review_id': 'gkTCWze0szw33eUOLBxqxw', 'text': 'This place is a bit hidden but they get my 4 stars because the waiters are very people friendly and make you feel right at home . I just wish that the hotel would give them an easier way to get there .', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2015-11-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'bU53hFt_qqmThHfFHDj7Og', 'review_id': '0Zl9mPvS-RHCooyeYgDyOQ', 'text': 'This was the best meal I had at Vegas..!\nSausage and pepper and the stuffed shell with ricotta and sausage...!\nI sure will come back here and the service was good!', 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 4, 'date': '2015-12-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SM4FFgXlhHzuDJNRI6HDCA', 'review_id': 'ti9wTFF6dOoxmNtJ2rz76g', 'text': "This was our first night in LV after 20 hours of travelling and wanted somewhere within easy reach of our hotel for dinner. Buca di Beppo is inside the Excalibur Hotel complex and offers 'family sized' Italian meals - that means for us Brits that the portions are big. We had the large Pepperoni which was too big for three of us with a few slices remaining on the board. The pizza was thin crust and the pepperoni was quite tasty but the tomato sauce was a bit insipid.\n\nDrinks are on permanent happy hour so we could get a Light Beer for just $3 a glass. \n\nThere was a little issue with initially getting served but this was due to the bar area only being covered by one person at 8:30pm. When we were served though the guy was great and looked after us really well, making recommendations to save money.\n\nBearing in mind it's inside a hotel it's a good bargain and acceptable for a quick snack.", 'business_id': 'E3n771Z4Uqy46WNaFS5u0g', 'stars': 3, 'date': '2015-12-22', 'type': 'review'}
