{'votes': {'funny': 1, 'useful': 4, 'cool': 1}, 'user_id': 'PfFI0HLkg_pSBJoDAzjG_A', 'review_id': 'zn5_XBGhUyGY1awIR9eERQ', 'text': u'It was a bit of a slow start, but once the food started rolling (pun intended) it was one great hit after another. We sat at the bar where Nate took great care of us. Being that this is a new establishment, I expected there to be some hiccups along the way. But there was very little. To sum it up simply, the food was spot on. The manager/ owner (I assume) was sure to come over and make sure that everything was to our liking. Which I very much appreciated. This was a fun and delicious experience. I highly recommend the yellowtail jalape\xf1o appetizer. Flavors of all the dishes we tried were balanced, and in my opinion tasted "decadently expensive" without the super high dollar price tag that you sometimes expect from good sushi. We also tried the signature "Osaka roll" which had a whole lobster tail, crab, eel,  and English cucumber ($20). It was well worth the price. One of the best maki rolls I\'ve had. If you are in the Gilbert area and looking for a fantastic taste of the east, try this restaurant. I will definitely be venturing back when I am in the area. Well done Osaka!!!', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2012-07-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'DGIgz4nlp71kYlLr_mRxkQ', 'review_id': '-50iiqJVxhUeBODcVOzSNQ', 'text': "I was excited when I saw this Japanese-style steakhouse open up in my neighborhood because I love Japanese food. Upon entering I was immediately impressed with the lovely interior design and cleanliness. The decor and furnishings are very tasteful and relaxing. I especially liked the way the bar and teppan dining areas are softly lit from below.\n\nAfter I was seated and the server came to my table I had a moment of concern. My waitress was authentically Japanese and she approached my table smiling and pleasant, but then just stood there without speaking. I finally asked her for hot green tea and water. She nodded without saying anything and went off to get it but then I had the sinking feeling she didn't speak much English and was afraid there might be a communication problem. Turns out I had no need to worry. Though she never said much at all the whole time she was serving me, she got everything right. Plus, they must operate on a team concept because other servers also came by to check on me or clear empty dishes as they passed by, so I never wanted for service or attention.\n\nI was there for a late lunch and the restaurant was fairly empty at that time, so I would like to go back sometime when they are busy to see if they maintain the same level of service.\n\nThe green tea was a bit of a let down at first. I know green tea isn't supposed to be served boiling hot like one would serve black tea, but the first cup of it was actually room-temperature cold. The second cup was the proper temp, though, and it was organic tea, so all was good there.\n\nI'm a fan of bento box meals and so I ordered the Chicken Teriyaki box. These are accompanied by a little bowl of miso soup and a small house salad. The hostess had told me that appetizers were half price so I also ordered a starter. My server bought out the soup and salad before the appetizer, so I don't know if she was confused about the order of service or just didn't want me to wait for food. Not a big deal, but next time I will order the app separately and then order the main course after it is served.\n\nThe appetizer was Age-dashi Tofu, little squares of homemade tofu lightly fried and served with a interesting sprinkle of seaweed seasonings and tempura dipping sauce. It turned out to be a large portion of six good-sized squares of silken tofu that were delicately crispy on the outside with an interior that was virtually the consistency of melt-in-your-mouth pudding. Wonderful, but they were the temperature of fresh lava on the inside and I burnt my mouth trying to eat them.\n\nI turned instead to the miso soup (not bad, but a wee bit bland, even for miso soup - a sprinkle of chopped green onion would have made it better) and the little salad (also not bad, but I was somewhat disappointed in the dressing which just tasted like commercial 1000 Island.) Meanwhile. the bento box was served so I tucked into that was well. Throughout the meal I kept trying to eat more of the Age-dashi Tofu but it just never seemed to cool off.\n\nThe box contents were very satisfying. The chicken portion was tender and served on a small bed of stir-fried veggies in a classic and tasty teriyaki sauce. It also came with a good fried rice, 5 large pieces of California roll, and pot stickers (menu said 3, I only got 2.)\n\nSo I had one appetizer half-priced for $2.50, a bento box combo for $9 and unlimited cups of organic green tea for $2 and there was enough food that I was able to bring nearly 1/2 of it home for lunch tomorrow. In the end, the food was good but not great, with good service and a pleasant atmosphere that I will be happy to return to.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2012-07-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 1}, 'user_id': '-5DVq0fSQBsbXXGJaDNvWg', 'review_id': 'WshhvKLBFqhqEEfgxogHtg', 'text': "In the short time they have been open I have been there at least 4 times and I love their food. Be it the sushi or the lunch special bento boxes. (I have yet to try the teppan).  I love the fact that they appear to value quality and presentation over quantity when it comes to the sushi. Too many places want to give you what amounts to two/three pieces in one on a huge wad of rice. Some folks may go for that kind of thing, but not me I would rather have a nice bite sized edible piece of sushi as it was meant to be. \n\nGranted if I had to pick at something. Like the other poster I could pick at the miso soup and the salad dressing, but to me it appears to be the standard soup provided at most valley Japanese restaurants and the salad dressing like most places is some gingered up stock dressing. So yes I would love if they included fresh homemade miso soup and a unique homemade salad dressing. However I can't knock them too much on those things. \n\nMy wife also caught the error on the menu for the number of gyoza included in the bento box. Last time I was in they corrected the menu it now says two pieces. But I think the website still says three. \n\nI understand there are better places in the Scottsdale area...But in this area I think they are the best for the money!\n\nBottom line every time I have been there I have been completely satisfied with the quality and service for the $$, in fact the wife and I plan to have lunch there today.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2012-07-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'OytVfji_7LRR80BfVw0SpQ', 'review_id': 'fH7UR6cuHOMYz7ULq_6bIA', 'text': 'Great service great food and free beer! Will go back for sure', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2012-07-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'UJS1V9_QJCACQFvcsd7L5g', 'review_id': 'Tyetb0BM3mT2MsI8PZdKsw', 'text': 'My overall experience was good.service was fast sashimi was fresh! They did screw my order up and gave me the sashimi dinner instead of the bento dinner with sashimi. But I had no complaints it was good and going back tonight.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2012-07-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 1}, 'user_id': 'UIHT5FjnQu99trc8mueQEg', 'review_id': 'XUbxA50wRbQk04cpEtUMFA', 'text': "So excited to have such a nice place opening in SE Mesa!  We usually have to drive to Scottsdale, Tempe, Chandler, etc. to get this kind of atmosphere.  For drinks we ordered wine and sake.  Appetizers were half off for happy hour, so we got gyzo (pot stickers) and calamari.  The calamari came in rings and was very crispy.  We then split 3 sushi rolls - the citrus roll was excellent!  We didn't wait long for anything, and even though it was our server's second day on the job, she did great and was very attentive.  Only complaint, as someone has already mentioned, is that you have to ask for water.  I prefer they automatically bring water out with the drinks, especially when it's 110 degrees outside.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2012-07-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'TuLjkOVG7jBPADZ3nIg5vw', 'review_id': 'sS_gmVaa2Si0vqP29hp3Nw', 'text': 'Traditional sushi menu. Nice place inside.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2012-07-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 2}, 'user_id': 'cP0rnKVK1qW22nuwCK5ECg', 'review_id': 'cP8JrwFbTvIWj9wZGMK2ig', 'text': 'First time poster here, basically because this place has compelled me!)\nBelieve me when I tell you that I know the difference between bad sushi, average sushi, and great sushi. I have experienced most of what the valley offers up as "great sushi" including Supporos, Sushi Ki, Kabuki, etc, THIS PLACE TRUMPS THEM ALL. We were completely taken by surprise when we discovered this gem last night. We sat at the sushi bar and asked the sushi chefs to surprise us. Surprise us they did with a roll called Osaka Chef Special, (which is what they were experimenting with at the time) and were treated to a fantastic spicey roll that was not only amazing to look at, but extremely clean, tight, and masterly put together. As we kept ordering, we found out that the head sushi chef was a 10 year vet out of some of the best houses in NYC, and basically brought those same items to Osaka\'s and was busy training the other oriental chefs. Impressive. Besides the killer sushi, the place looks very sharp inside from modern flooring and wood ceilings, to stacked stone wall accents. Very cool decor. (Although their choice in music is from a bad Esteban album) I hope they survive in Mesa, which is a city that rarely rewards good cuisine unless it\'s cheap wings and burgers.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2012-08-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'vNzDyLy20GfV4T_0Nm_Wdg', 'review_id': '5gXUgIanDvLNahSYPuoUIw', 'text': 'A little bit on the expensive side, the interior is gorgeous though and the atmosphere is great so the price is justified. The quality of the sushi was really good as well. Overall Osaka is a solid choice when looking for sushi on this side of town.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2012-08-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kmSihnVFE155887JqG6sCg', 'review_id': 'l5ERFjVpTXdOoMeBEtA6iA', 'text': "excellent japanese steak house. great service with fresh food. they really take care of their customers. highly recommended! mesa's hidden gem!!!", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2012-08-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IPkcWuWMYAShjNzwPepK5w', 'review_id': 'mS_F-Fvbp_5TiG66dIRLew', 'text': "I've been to a lot of Teppan-style Japanese restaurants and this one is one of the best and definately the best that I've gone to in Arizona.\n\nThis place hasn't been open long (It's in the old Hooters building by the Superstition Springs Mall), but they did a great job with decorating the place and setting it up.  The layout is very friendly as they have seating for the Teppan grills, sushi bar and standard table seating which are easily distinguishable.\n\nMy girlfriend and I ordered the Teppan for 2 (Filet, Chicken, Shrimp and Scallops) some sushi and appetizers.  The food came out at a very good pace and was very good.  If I had anything negative to say, it would be about the soup.  I wish they would have put some more mushrooms and scallions into the soup (2 thin slices of mushrooms and about 3-4 slices of scallions aren't near enough).\n\nOur table consisted of a lady and her two daughters (around 11 and under), my girlfriend and myself.  The server and cook we had were very family friendly, even if the table itself wasn't participating much in his antics (I think he shot about a shot of sake in my mouth during his performance).  Our chef's performance and attitude was great, trying to get everyone involved and was very lively.  One of the better chef's I've had.\n\nOverall, I was very pleased with the service, food and experience we had here and will definitely be visiting again in the near future.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2012-08-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '-sHOugMpr6EFX4JlmW-ihw', 'review_id': 'FxaSN7XPpRSTpupXat3o0Q', 'text': 'I have been with just my husband and then another time with my family. The wait staff is pretty good. The chefs are very engaging and lots of fun! The food is great and you get a TON of food too! The atmosphere is great, the set up is beautiful and we will be there again. Great value for the money. \n\nIt is a refreshing change in the lame restaurant scene in Mesa. I have been telling everyone about it!', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2012-09-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'PGSIJ7qFYAhGTtCVnT7Pvg', 'review_id': 'P0AE9EGyiHA1ztn2uR0f-Q', 'text': 'Firstly, although I read a lot of restaurant reviews, I have never felt the urge to write one... until now.\n\nMy bride and I happened to be staying overnight in the hotel adjacent to the Osaka Japanese Steakhouse, Sushi, & Bar.  Coincidentally, it happened to be our 29th wedding anniversary.  (My wife had to fly out of Phoenix-Mesa Gateway Airport early the following morning; we occasionally drive to Mesa from Tucson to take advantage of Allegiant flights.)  We observed this restaurant\'s sign as we drove into the hotel parking lot.  My wife, who wouldn\'t eat sushi if her life depended on it - although she does enjoy Teppanyaki cooking, remarked that it might be a good place to enjoy an anniversary dinner.  (We\'ve had many a Teppanyaki "show & dinner" over the years - in California, Arizona, & Montana, to name a few... and I\'ve recently become a real sushi aficionado.)  Upon asking our hotel desk clerk for a dining recommendation for a special dinner at a good restaurant within a 5-mile radius of the hotel, we were given the names of a half-dozen or so restaurants.  We then specifically asked about the Japanese restaurant next door.  The clerk said she didn\'t know from personal experience because the restaurant had only been open since July 5th, but that she\'d heard good things from a few hotel guests.  So... we took a chance, and ended up enjoying one of the best dinners of our lives!\n\nWe walked across the hotel parking lot, and upon entering Osaka; we were greeted by a smiling, affable hostess who seated us, by request, at a Teppan table.  We told her we were celebrating our anniversary.  She told us that she would also be our waitress, and said that because they were still celebrating their "grand opening," we could take advantage of a complimentary 12-ounce beer of our choice with the order of any entree.  In addition, she said that all appetizers on the menu were half-price.  My wife, who totally abstains from all alcoholic beverages, but thankfully doesn\'t mind at all that her hubby imbibes on a very regular basis, promptly asked, "What kind of beer would you like, Sweetie?"  I said I\'d have a Sapporo, and she said, "I think I\'ll order one, too, that way YOU can enjoy a couple of \'em!"  (Now you know why I\'ve been married to this angel for 29 years!)  Our personable waitress, named Elaina, gave us both a wink and a smile!\n\nFor appetizers, I ordered Edamame (sea-salted, steamed soybeans served in the pod); my better half ordered Gyoza (Japanese potstickers/dumplings filled with pork & vegetables).  They were served promptly, along with "our" beers in frosted mugs.  I also ordered a Traditional Yellowtail Roll (Negihama) as a prelude to dinner, because I wanted to compare with the various sushi joints I\'ve been frequenting in Tucson.  Both appetizers, along with the sushi roll, were outstanding treats.  Oh, and each of us consumed a bowl of Mushroom Soup (clear chicken broth with mushrooms & fried onion) and House Salad (lettuce, cucumber, & tomato served with a homemade ginger dressing - which tasted a lot like regular Thousand Island dressing to me.)  The soup and salad, of course, are served as a part of a Teppanyaki entree order.\n\nThen, even though we were already pretty full of food, the highlight of our meal really began.  Our chef, named Darryl, cooked our Teppanyaki entrees.  My wife had the Filet Mignon (ordered medium-well) & Chicken combo; I had the Filet Mignon (ordered very rare) & Shrimp combo.  Darryl not only cooked our entrees to perfection, but he was quite entertaining.  He provided a truly delightful show.  Methinks he would delight children of all ages!  My wife and I commented how much our sons (one college aged, one high-school aged) would have enjoyed the dinner and "show."  Our entrees were absolutely scrumptious, but we could only eat about half of them, since we were so full.  (I brought the leftovers back home to my boys the following day - they just loved & destroyed \'em!)\n\nTo conclude our meal, Elaina simply wouldn\'t let us leave without serving us a complimentary order of tempura-battered ice cream (which I don\'t believe is even on the menu) to share in celebration of our anniversary.  It, too, was luscious.  And before we left, Darryl came from the kitchen area to the dining room again - just to wish us a happy anniversary.  When we told him how much we had enjoyed dinner, he asked us our names, saying that he likes to learn the names of his special customers.  Talk about making a pair feel good about their dining experience!\n\nAll in all, my wife and I agree that this was one of the most "special" dinners we\'ve ever had.  Before tax and gratuities, our bill was $60.50 - not inexpensive, but relatively nothin\' when compared to other "special" dinners.  Would we go back?  Oh yes - again and again!  The next time we\'re in the Phoenix metro area, whether it is for the next D-backs series we attend or the next Allegiant flight we schedule, you can bet that we will be back', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2012-09-06', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'h6DrO6PAi7PoVXPiEztg-g', 'review_id': '_GIzYGNlaMLjucToAQ8icA', 'text': "I went with my parents and the service could've been much better. When we ordered the teppan we assumed the waitress would know that it would be for all of us. She could've clarified that with us by simply asking us if we wanted to share. We ordered some sushi and the filet mignon and scallop teppan. However, she was attenttive on refilling our drinks. Sushi was pretty good for a place in Arizona. However the teppan was terrible. Our chef made it so salty! I couldn't have more than a couple bites. I don't know about you, but I don't like to be annoyed by overenthusiastic chefs or servers when I'm trying to eat. Honestly, the chef put more effort into putting on a show than cooking the food.; which annoyed me to no end. Also, if you still go here after reading my review watch out because you might slip on some broccoli the chef dropped while trying to toss it into a diner's mouth for more tip. The restrooms are clean though. Put more effort on cooking and serving your customers than a show. I will not be coming back.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 2, 'date': '2012-09-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'tgTGdxM7cuI7fOM8oSzm1w', 'review_id': 'nv0BMuHoNffvrFX4ppI9-g', 'text': "Best sushi I've had in AZ yet. Just moved here 3 mos ago from Southern California & was striking out with every spot I tried. Finally I found my go to sushi spot. Ambiance very nice, fast service, professional, & most of all fresh delicious sushi. I highly recommend the the specialty rolls: Temple Roll and the Citrus Roll. \n\nAll in all, if you've had great sushi, and won't settle for anything less than great sushi, then this is your spot!", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2012-09-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pDWkkDFMyVi-U2bYOMMJVg', 'review_id': '3QdfpMXYFwBzN1J7qp9w_g', 'text': "Excellent sushi! The mushroom broth to start is tasty! Great quality food, decent prices! Chefs are entertaining and friendly. My kids love going just for the entertainment and trying to catch the food that the chef throws at them. I love the fried rice and the shrimp! The chefs are very generous with sake so you probably won't even have to buy any :)", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2012-10-01', 'type': 'review'}
{'votes': {'funny': 5, 'useful': 5, 'cool': 1}, 'user_id': 'XqMkm-DD9VsdcKx2YVGhSA', 'review_id': 'fzJK-DUNBa5ZmXw5otSfEg', 'text': "Excuse me Morpheus is calling --- Yes I don't think the Machines really know what good food taste like --- Yes, yes, yeah I know chicken haha!  Silly Machines!\n\nI say this in a good way.  Osaka, Japan, or Mesa, Arizona, Close enough right?\n\nLet's not get too carried away!  Osaka Japanese Steakhouse is a Teppanyaki restaurant so don't forget to make your reservations!  Yes, this place can get full real especially during dinner hour on the weekends. \n\nOJS, serves up a modern Japanese cuisine.  The decors are very elegant, yet has a traditional appeal.  The place itself has a real contemporary feel.  Think Matrix with Japanese flare!  Minus, Neo, Morpheus, and Trinity, though I wouldn't mind seeing some butt kicking action.  \n\nI ordered the Yakisoba with Ramen noodles and beef.  Let's just say it literally looked like the opened up a bag of ramen and stir-fried it with some beef.  It was really bland, but luckily my friend had a packet of spicy sauce in her purse.  Yeah, I know in her purse!  I had to douse it with some soy sauce to give it an extra saltiness and I never add soy sauce to anything!\n\nNeedless to say, my noodles were under par.  I think I could have made it myself and I don't cook.  I don't know about their Teppanyaki, but if it's anything like their noodles then I don't think I'll be making reservations anytime soon. - Enjoy!", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 2, 'date': '2012-10-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-zKptvSoB-FjStqZSMLWMg', 'review_id': '6l-TH1FEsd3SY4GPKFeWGA', 'text': "I wanted something fun for my birthday, something my kids would enjoy as much as I did. Coming here was definitely the right decision. The boys enjoyed the show at the grill, even if they were splitting a bento box, and I got to have some sushi (the rest of our party had teppanyaki). The sushi was very good, and the samples I had of my grandmother's teppan salmon were delicious. All in all, a fun birthday dinner!", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2012-10-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tVUVDWC-RDaf8GN4-7-iXg', 'review_id': 'nQtVpMnyswohA_2y3qUuAQ', 'text': "Very fresh Sushi, best I've had in AZ. I went here for the first time the other night and I was very impressed.  My whole part thought the food was excellent (Hibachi and Sushi).  I am from the east coast as is my family and this place def lives up to back home.  I've found my new sushi spot.  My brother got the scallops and they came out with this huge scallops.  The tuna was so fresh it melted in my mouth.  \nThe place is large and has nice decor for a date night.\nPortions are large and worth the money.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2012-10-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '0UT3CxZuoNZavmluVvTaiw', 'review_id': 'zdoa1PEe9PNs6OfsC7tmAA', 'text': "My review is only based on the bar during the week  :)\n\nBeen here twice and each time the service was great, thanks Tony!  Super friendly staff and beautiful decor inside.  \n\nCurrently their happy hour is from 2:30-6pm, I think they'd get more business extending it possibly to 7pm, I'd go!\n\nI'm looking forward to bringing some friends for dinner soon!", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2012-10-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HnlVxMJUFt0senwi9mYzuA', 'review_id': 'l96jyte-f3xnFgqohwBE3Q', 'text': 'Was my first teppanyaki (sp?) ever. Well I loved the experience, finally able to feel it first hand.  Our cook was good and friendly, constanly squirting us with the house sake. I had almost 50 counts of the sake, before the cook had to give up lol. and I am a vegetarian, so I had the veggie teppanyaki, which is pretty much fried rice and grilled veggies. It was ok, nothing fancy, but the ginger sauce was good and so was endamame. The place is not cheap, so beware. The service of the waiters could be better.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 3, 'date': '2012-10-12', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': '1nlUwAqmTI4LVye9RJsT5g', 'review_id': 'l-0ih9JzIxTfYz4VcL65KQ', 'text': "First time here and we loved it!  Came with our kids to celebrate a birthday and we were all entertained and our tummies were satisfied.  We had teppanyaki dinners and sushi from the bar and all was delicious!  We also were able to use a $25 gift certificate with no hassle, towards our dinner after signing up on the osakaaz.com website.  Service was great plus $1 sake night on Tuesdays?  Can't get any better!  Will definitely be back again.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2012-10-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'bQtfGMdeH1vhiODASzIO0w', 'review_id': 'KKGZrb14QfoS-NuViNpgmw', 'text': 'I have been to this restaurant twice now and each time keeps getting better!\nI highly recommend the "Dynamite" appetizer, I almost wish you could get this as an entree! \nThe service is friendly and fast, great atmosphere! I also like how the dinning room is separated so if you don\'t want to sit by the Teppanyaki grill you don\'t have to.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2012-10-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'AkJFqLqHHAKY3H5R8p7cPQ', 'review_id': '4jy13F-xJPrRznUTkBPKIA', 'text': 'Godzilla is what I remember this place for.  I had all sorts of yummy rolls, but the Godzilla roll was orgasmic.  You can get everything from raw sushi to cooked, and I feel that everything was absolutely delicious.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2012-11-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kJyR4gT1pfCcNjEY9-YMoQ', 'review_id': 'NQtdKl2d6LoPlhJF_ptrAw', 'text': 'The thing about this place is the food....ie sashimi ,tempura,pot stickers rolls are all good .they serve cocktails but the bar tender/ tenders are slow and do not make a good  drink. Service is always polite but again sometimes slow and inconsistent. tonite they forgot the roll we ordered and we think they gave it to the table next to us allthough it was not on the bill.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 3, 'date': '2012-12-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'O_EswPq9esodgPjh-fUdBw', 'review_id': 'vL-7sotVnZ2cuVV-FVWgdQ', 'text': "The best sushi I've found in the valley. I can't wait to go back.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2012-12-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'q-blnoObtPWH6swd6ZgbFw', 'review_id': '56KZHt39UZT9rbs8k8saDg', 'text': 'Most fun at a restaurant on the east side of town hands down.   Service was great and the energy was off the charts.   The owners did a great job on the decor inside, which provides a great ambiance that matches the positive vibe.  Felt like we were on vacation.\n\nFood was good, flirting with great on teppenyaki standards.   Sushi selections could be modified to offer a more regionalized fare, but really no complaints.  \n\nPlan to frequent this spot for sure.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2012-12-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'xdl61MWMguYRSunH8CniQw', 'review_id': '7wU0_iwC5i5kDn87ExP_HQ', 'text': "Great new spot in the east valley! My coworkers and I went here for lunch the week before Christmas. We made a reservation as we wanted to be sure we could have lunch in the allotted lunch hour, and they let us place our food orders ahead of time. (If you've ever tried to do a group lunch in this Superstition area in an hour, you know what I'm talking about.) When we arrived, the server took drink orders and began bringing out salads, followed by soups. Pretty much everything on the lunch menu comes with a salad and soup, which makes for plenty of food! The lunch prices were great too, ranging from $7-12, including the teppanyaki dishes. I had 2 maki rolls and both were delicious and fresh. Definitely a place we will do lunch again!", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2012-12-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'pQ6ij6cOBRB3yJGHbVZHUQ', 'review_id': 'OBPajYD4VrX2qPlSHywIGA', 'text': 'OSUCKA is more like it! expensive & horrible service, never again!', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 1, 'date': '2013-01-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'iTs6ytEvovRSthP2PrvMAw', 'review_id': 'VQXZxiLRGu3svRlXZ32wTQ', 'text': "I was happy to see a sushi place that I haven't tried, but was sad after I tried Osaka last night. My standard sushi rolls were simply flavorless and the wasabi was not spicy. The place has a cozy layout and seems to be getting decent reviews, so I plan on giving it another chance.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 2, 'date': '2013-01-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lxEosFKJhW8B5oOL8pIqUQ', 'review_id': 'AClf2jFaP91oWk2AHna4pA', 'text': 'Friendly and speedy service. Fun and clean atmosphere. Food was great. Price was a little high but it is in the same ball park as other competitors. Highly recommend. :)', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2013-01-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'PWRPbewMxQc7GsQSn9egDw', 'review_id': 'DeNwPPXzyhlO4dezWy1R0Q', 'text': 'I have eaten at many flat grill Japanese Steakhouses across the US and this one by far had the best prepared food and entertaining chef. My girlfriend and i decided late in the evening to visit this newer place to eat. Usually my experiance when dining in a place like this late is bad service cause its slow and they just want to leave. Not the case here. The server was very happy to see us, we got to pick our table of choice, and our drinks showed up quickly. She forgot the water with our drinks i asked for until half way through the meal but thats excusable by me. The chef cooked my steak perfect medium rare and the salmon was to die for. My girlfriend was equally pleased with her mi ti drink and her chicken and shrimp dinner. The servers name was David we were told and he was wonderful. All and all i highly recommend going to this restraunt to eat but like people in previous reviews have said make a reservation before going if your going to go during busy hours. Hope your visit will be as good as mine.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2013-01-11', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '-fhkLP6B7BDAZ1jBrAfwwg', 'review_id': '8rpmcqnqOOqbejiI4Ds9_A', 'text': "Playboy roll is great, avocado roll is good, service was good and prompt. the rest of the rolls we had where also good. the rice was perfect and it did not fall apart like at some other places. family ordered teppan food which the chef did a great job with the cooking and the show, better than benihana. prices are really fair for sushi. will come here everytime I'm in the area.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2013-01-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dqNAl9HWKtFvj9IltcJAVQ', 'review_id': 'uKaKlaqwCN66MrEsJZPCqw', 'text': "I've been here a handful of times already since they've opened, I believe in June or July. At first I was skeptical about the place, they seemed a tad unorganized (but every starting business is) their lunch menu isn't too bad, they have THREE sushi rolls for only $10! ( although there is a list for you to choose from) the sushi here isn't too bad, but yet I haven't tried anything too fancy. The only time I had lunch here it wasn't too busy, I was taken care of pretty well by Vivi, although I did need to ask her to fill up my glass a few times.\n\nThe next couple of times I've came, were all weekends. HECTIC!! I went there Friday night and they were slammed!! Good thing my party did make a reservation ahead of time! ( highly recommended ) even though we did have to wait a few minutes to be seated, it was definitely better than the hour wait that some people had. There was a huge crowd in front of the door and it was pretty hard to spot the hostesses to check in, but it eventually happened. Tiffany, which seemed to be the only hostess, was very accommodating and helpful and sat us fairly quick. As we were seated, we were greeted within 2-3 minutes by our wonderful server Kathy. I ordered the Ocrean Trio, which included lobster tail, scallops and shrimp for $36 and it also came with soup and salad, fried rice, veggies and two pcs of shrimp! I say that's a great deal! Our teppan chef David was very funny and entertaining and cooked everything to order. Our server Kathy was excellent! She was very good with refilling drinks, there were times that I didn't even know she took my glass to refill it, I never had a half empty glass! Even though she was slammed with other tables across the room, she always came and checked on us with a smile. \n\nRestaurant itself is very well decorated, bathrooms were tidy, you can choose to sit in regular dining or teppan side. Atmosphere is great eventhough it's a tad crowded on weekends, but that's what makes it fun!\n\nThanks, Tony!!\n\nI definitely will continue coming, I hope this great place will last in Mesa!", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2013-01-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'm68toiEBaWpyLPT_Er_PWA', 'review_id': 'I5Cz9FVE-Ns7ZomE8H_dMA', 'text': "I've been going to this style of restaurant for 25+ plus years & I'm in the restaurant business. This place is #1, no contest in the Phx area. Service, food, chefs, & sushi chefs are amazing.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2013-02-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'g9lf21-BUkdCGe2wA_tANw', 'review_id': 'IiZ2Rk7NykEC8v9xZG7gOw', 'text': 'VERY happy with our experience at Osaka!  This was our first time going, went on a Friday night for my birthday and it was awesome!  They were busy, but made a reservation so had no problem getting in.  Despite being busy our waitress never let our drinks be empty, brought everything we asked for in a timely manner, cleared dishes as needed, answered questions, the food was cooked perfectly, everything was fresh, generous portions were given, and the Teppanyaki chef was outstanding!  Restaurant had a nice ambiance, and was very clean as well.\n\nWe came to Osaka because we love this type of dining for special occasions, but Bennihanas has become not as good in recent years (smaller portions, not as fresh, chefs not as well trained).  So, decided to try Osaka and so glad we did.  Loved it so much that I think we will be taking our son (who will be turning 12) and one of his friends for his birthday later in the year to enjoy the fun and make a memorable experience.\n\nWould definitely recommend and will definitely be returning (and I admit, I am typically very hard to please with restaurants).\n\nWe had the mussle appetizer and the tempura sampler appetizer, along with the terriyaki chicken and shrimp entree, the filet mignon and scallop entree, and green tea ice cream for dessert.  Everything was cooked perfectly, fresh, and beautiful!', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2013-02-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'FBa0sRkjWuTV95lErPQZSQ', 'review_id': 'DlcnYpb0NI1FVT2dNHG04g', 'text': 'Just back from a great evening at Osaka, celebrating my 75 BDAY.\n4 of us upon leaving commented, " what a great fun evening "\nDefinitely will go back', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2013-02-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IPkcWuWMYAShjNzwPepK5w', 'review_id': 'OzSchwxZhj-Zrpc5pRnY7g', 'text': "My girlfriend and I have visited this place three times over a six month period since they opened.  Each time we've gone we have enjoyed ourselves immensely with both the atmosphere of the place, the humorous chefs and the excellent wait staff.\n\nTwo of the occasions were birthday events in which they went all out having us wear these funny hats while they sang happy birthday.  Our chefs have always been funny and love to give out saki to the guests while they cook (and I don't much care for saki).\n\nThe sushi has been some of the best that I've tried (and I have a very limited amount of sushi that I eat) and the prices are right on par with what I expect.\n\nTheir Teppan grill food has a large variety for almost any taste and they'll cater to any special requests you may have (I eat it all, so they don't worry about it).\n\nMy girlfriend had their Strawberry Saki last time we were there and said it was really delicious.  I tried some, but since I'm not a Saki person in general, I didn't much care for it, but it did have a good, fruity flavor.\n\nWe're already planning our next trip here and, next time, we'll be bringing the kids along with us so they can experience it.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2013-03-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'zdPRXhhJNCiCOgWQwoPlpg', 'review_id': 'fPkwKWSzG3EFchobIDIiBw', 'text': "Excellent service! Great sushi & they had a lot of specialties that you don't normally find at sushi bars. Great restaurant-looking forward to returning and enjoying some Tapan", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2013-03-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'Syc4pbEkL3bbzjO4X4HhQw', 'review_id': '38opc11ZfzWoI0w6FCd7YA', 'text': 'This is my new favorite sushi spot.  The menu is extensive, the portions are generous, the teppan chefs are great fun, the sushi chefs know EXACTLY what they are doing and the sake is top notch.  Everything you want in one place at a good price.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2013-04-26', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 0, 'cool': 0}, 'user_id': 'Ovlb8WWsyprHBs8Lk2Jgew', 'review_id': 'kyGzWmvDjnSJau8nTz5sgA', 'text': 'Osaka Japanese Steakhouse, Mesa Arizona. What a poor excuse for a restaurant! A no star rating would be closer to the experience my wife & I had. We had a recommendation from an aquaintance and decided to try OJS for our 17th anniversary dinner. What an error in judgment. We arrived about ten minutes before our reservation and were promptly seated from there on it was downhill. Our server Ka#hy. greeted us and took our drink orders, ok so far, when she returned she took our appetizer order and asked if we knew what we wanted for our main course. We ordered and TOLD her that all our dishes should NOT come as one meal. Our first clue to the poor service was that our salad and soup came before the appetizer, then about five minutes later our appetizrers gyoza & yakituba, jalapenos & tender pork  (not) shoe leather is a better discription arrived over cooked, gyoza undercooked and not crisp. Once again, too fast, our main course was served. At this point I told Ka#hy, I was very upset that the meal had come, she offered to take it back to the kitchen and HOLD it for us. WTF hold it, you must be kidding! We ordered lobster! Ka#hy came by twice more once to ask if the food was good. When I replied" just ok" she showed no interest or concern (thanks for the customer service). I feel that  this all is partially my fault, two seven ounce lobster tails at a restaurant only $33.00( buyer beware), I should have sent everything back to begin with (my error).  As we were leaving I asked to see the manager,  I was told he was out on an errand, ( Saturday night at 7:00pm?). So I asked to talk to the person running the restaurant(surprise) they were on a business call and could NOT see me. Again WTF! I left my name & # received a call the next day from Tony? the GM, he asked about our experience. I told him the same thing I have written here and said I would NEVER go back, he offered me a gift card AFTER I told him"I WILL NEVER GO BACK" to the restaurant. I reiterated my concerns and once again he offered a gift card( are you listening?). Oh well. Maybe the restaurants reputation lays with the Teppan Kitchen? I can\'t say, we had table service because it was our anniversary. :(  \n\n Jeremy M. Goldman', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 1, 'date': '2013-05-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'E8OdPGNMMWtEx032vXDLTg', 'review_id': 'lcE5nFrLWSW_Yhh4e15H0g', 'text': "Bring a crowd with you,  This Place is great fun!\n\nWent here for my birthday 2013. I'll gladly go here again for the next big occasion.\nOur chef was ***** great, and funny too. He made the whole group laugh and he was good at tossing and chopping the food. \nThe food was *** nothing specatular but good. \nThe whole experience was A+ if you want a memorable time for your bday or anniversary or whatever occasion it may be. \n\nI didn't go to the sushi side, but that may be a place to go sometime for happy hour...", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2013-05-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zT1tN6YoE4YZvyVOsGznmQ', 'review_id': 'ohHWotn3W__l2oPSDe1rrA', 'text': 'Overall, very good experience here. We usually go to Benni Hanna but decided to try Osaka after our good friends recommended it. The food was excellent and the portions huge. The service was standard. We will definitely go there again and bring friends.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2013-06-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qttGXy09w-5gwsUYRb-z1Q', 'review_id': 'DlTOuvbc6o4AFZQz_cXipQ', 'text': 'Really fun, food was very good. Comparable to Benihana.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2013-06-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IpaY0MueAda612hHgDGsrg', 'review_id': '9Kwcim0Af83YlS_w030eVw', 'text': "Saki flowing. Place rocks. Most places fried rice is bland but there's was good. PS. I'm drunk off saki bombers.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2013-07-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2koiDKo6N4dSJBFN-rpJXQ', 'review_id': 'sI2sm0JTxTr_nveE4jqvbw', 'text': 'I could not rave more about this place. Great, awesome, well done.\n\nThere was five of us including my 7 and 9 year old nieces. Everybody enjoyed everything. The girls enjoyed the "show" and everybody thought the food was over the top.\n\nYou can\'t go wrong with anything you order but one item deserves special mention. Order the Osaka Sushi Roll. Omg!\n\nFYI, kids eat free on Sunday nights. It was yet another pleasant surprise. Great job by the entire staff!!', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2013-07-28', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'fUs5XxOR82Hfrnyl4wi2QQ', 'review_id': 'rRBL5SQSMdnh-2sI5RscDQ', 'text': 'Well, I took my girlfriend here for a simple lunch since she never had teppanyaki before.  I wanted her to experience the food and the "show".  I was pleasantly surprised by the nice job the chef did - he put on a decent show, especially for lunch, and provided my girlfriend with some entertainment.  The prices are reasonable and the food is acceptable.  We decided we will come back again and bring her kids so they could experience teppanyaki too.  We were both satisfied with this place and would recommend it to others.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2013-09-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'A4Q3HyUIPTIluzKTSWGgOw', 'review_id': 'v1MfxWMHkDLMaW1tRIwfIQ', 'text': 'Food is good. Huge portions. Been here a couple of times. Quiet place during the week. Except that someone who owns or works here had their kids come in. They sat them directly next to us and were as loud as could be. No consideration for their paying guests. It would be nice to be treated as a patron and not an inconvenience. Was very close to asking for a different table. Literally no boundaries or supervision.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2013-09-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dEMm29V7ktNHndxwXzhPfA', 'review_id': 'ypA8of9b0Ram7ZN7LaH2fA', 'text': "Great place to bring the family or friends. Teppan is very good but sometimes too salty, so just ask if that concerns you. What I like most is the consistently good sushi. Always very fresh. One of the only places around to have super white tuna. Several great rolls that focus on the fish, especially the tuna lover's roll. Have had some great service with the occasional problems with wait staff  communication difficulties. Several good kinds of sake. A birthday favorite. Also does suprisingly good take-out.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2013-09-22', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': 'hieVDOyVxxitOi1v2m1lhw', 'review_id': 'kRQ-4yVa7mpPqRBRP3OP9g', 'text': 'they lost my reservation and i smelled terrible after.  was not impressed with service in the bar.  not going back.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 2, 'date': '2013-10-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'R4Ax3btoJ6qLXhqq6J50VQ', 'review_id': '3mVvRJ3qiZfAlvioRAVdMQ', 'text': 'I think it would have been really fun with a big group.  We went on a slow Thursday night and got sat next to random people.  The chef was entertaining, tossing food and shooting sake into your mouth.  I have been to other teppanyaki places such as the Benihana chain and other various ones in California.  This one was by far the best I have been to.  The quality of food was really good, they have the best fried rice I\'ve ever tried.  We got prime steak, chicken, and shrimp.  The steak was really good quality that it melted in your mouth.  Chicken was a bit dry for my taste.  Shrimp was cooked well, not over cooked and rubbery.  \n\nWe came here for lunch on a Sunday to try out the sushi.  As a California native I had high expectations for fresh sushi and was skeptical about sushi in AZ because come on how can it be fresh without bodies of water around?  I was wrong,  it was really fresh sushi.  We had Ono(white tuna), tuna, and yellowtail, absolutely delicious! I was feeling adventurous that day as well so we got the live uni, when I tried it previously it was pretty "ocean like"  but this time it was really good.  It was my boyfriends first time trying it and he thought it was good.  \n\nIt was kind of pricey but all teppanyaki and Japanese places seem to be.  \n\nExcited for the next time we go!', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2013-10-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9-tlmBl6IMKINhJHfSrP0A', 'review_id': 'vGBZauGfo9HnEOeL98u3qQ', 'text': 'Great happy hour sushi and drink specials. Great service! Loved the rainbow roll, crunchy roll and spicy shrimp!', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2013-10-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fFPRdWLsHB9fZtSlyeJnRQ', 'review_id': 'OzoEHl2TMKwGEws0fiG-zw', 'text': 'Great.addition to the east valley. Bar area need some more additional table seating for more than 2.so we can havens drink waiting for the rest of our party to show up. They could.have made another 100 bucks. Great food, friendly staff.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2013-10-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'yg819CgXe8v6CQaWEyypnQ', 'review_id': 'PFuuocvbQLy2qvKW6-F0lA', 'text': "Took my Dad and his wife here during my visit with them last weekend.  Dad had said he hadn't been to this type of restaurant since he moved to Mesa. I used Yelp to see if there was someplace close to his house and to my surprise, it was very close.\n\nDinner was great.  Graph to select a sake was extremely helpful.  Our chef was great entertainment and did a wonderful job.  I was not so successful catching his throws.\n\nAll the food was fresh and cooked perfectly.  No complaints.  We had varied selections of chicken, steak and seafood.  The lobster may have been a little overcooked, but too bad.  Everything was flavorful and yet not over the top.  Nothing too spicy. \n\nPortions were very generous.  Since I was traveling, no leftovers for me. But I heard the next day the leftovers were every bit as good.  I know that Dad and his wife are already investigating lunch options looking for both a smaller meal and a little less expense.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2013-10-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': '9PgN8QuQ6jhuLV6RfdLwdw', 'review_id': '19CNE0e7Hn8vrRC5xU1BZA', 'text': 'Every time we go here it is EXCEPTIONAL! The Sushi is amazing! The teppanyaki show is great, better than most other places we have been to! Prices are great, especially during happy hour! This is our favorite place by far for date night or family dinners!', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2013-10-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'g9lf21-BUkdCGe2wA_tANw', 'review_id': 'M2K9_kJs769Q3ZhEarOAuw', 'text': 'We brought our son here for his 12th birthday a few weeks ago and again, sat on the teppanyaki side of the restaurant.  We had a reservation, so we got right in no problem.  He had a WONDERFUL time!  He said it was one of his best birthdays ever!  The waitress recommended a melon flavored Japanese soda to him and he loved it.  He thought that the giant birthday heads and the song played was great and even got up and danced (gotta love kids right?).  \n\nFood was awesome as well.  Our son had scallops, I had the terriyaki chicken, and my husband had the shrimp and scallops.  We were all very happy with our food freshness, how it was cooked, amount, etc.  \n\nDefinitely going to be a birthday tradition, so much fun, staff is so friendly, food is great, and the price is comparable to other restaurants of this type.  Very happy!  I do however, recommend that you make a reservation as some folks that came in after us with no reservation were going to have to wait 45 minutes.  Very simple to do though and makes the wait 5 minutes at best.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2013-10-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_ua7fp2GH3fuHUwqN76KqA', 'review_id': '-CVL7V4gouutVtSSUpWKcQ', 'text': 'Without question the best teppanyaki place I have ever been to. Our chef was very entertaining, funny, and over all enjoyable. We had a blast with the sake countdown and thoroughly enjoyed the atmosphere.\n\nOur whole group had a wonderful time and greatly enjoyed our meal. Food was cooked well and again the chef put on a good show thru out. We ended up being the last ones to leave and our server was great at keeping water cups full way after we had paid our bill.\n\nHighly recommended for get togethers and events. What a blast!', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2013-11-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qOi75vaYk--2medq7DJSmQ', 'review_id': 'X41Z5ab0IP2NAbJZFeQVFg', 'text': 'Really enjoy this place.  Staff is super friendly, food is good, sushi is fresh and tasty.  Nothing negative to say, definitely recommend.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2013-11-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'YuNp7wWB8uAirrzhFpbVIA', 'review_id': 'z0G-BmEhdH6-kvWt6rQk6w', 'text': 'This is my FAVORITE  Japanese restaurant, the staff is friendly, very attentive, the food is good, the Sake Squirting is a lot fun! I have gone with a big group, and also with my boyfriend for lunch. We have celebrated several birthdays here, and have had a  great time :). I definitely enjoy the experience!', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2013-11-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'V4jstpqZhRt2Aqm3OR2HgQ', 'review_id': 'DsYqVcSMaaIGYDT4F-hZEA', 'text': "If you look at my past reviews, I can be very critical. But there is just nothing not to love about this place. The staff is great and the food is just awesome. The Hibachi cooks are a lot of fun. Extremely agile, talented and funny! I can't recommend Osaka enough. Tip: There's not much price difference to get the Filet Mignon over the regular steak but it is so much better!", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2013-11-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fEhMkBhHhQkWXpwAq5jJvg', 'review_id': 'sl5NkXNMZP3Ldwu2x81wlw', 'text': "Had a great family dinner over thanksgiving holiday. Service was great and the teppan chef was really fun and entertaining. The food was reliable I would have never tried this place without yelp and it's great reviews. Thanks everyone for taking the time to review.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2013-11-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3tQzKNgn3zOeLA2AV1nu-w', 'review_id': 'QynUZhjlck4YazGtiYwQTQ', 'text': 'This place really is as good as it gets.  The food is spectacular, the fried rice is amazing and we always get the filet and it truly is melt in your mouth.  Great fun and close to home.  The east valley is lucky to have Osaka here!!  Go check it out', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2013-12-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'EAo5q7hgtGH2kujEUE9NfA', 'review_id': '4vvPKVzQjpzhVfoGtDMk4w', 'text': 'It was Birthday night at six other tables.  Fun, fun, funny with their head hats and crazy poses.  The food and chefery was terrific and not totally loaded with butter and salt (as elsewhere).  The prices are acceptable, especially when there is an excellent savings coupon.  We shared our extra coupon with our tablemates and everyone was even happier.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2013-12-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0Qnw5HtyI7QSmqda-y1aGw', 'review_id': 'RvjvUkaPmf1EeMEibAuOvA', 'text': "Have been here now several times for dinner and it's always amazing! Great show with excellent food. Highly recommend for large group or birthday celebration!", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2013-12-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '5VZzh7SAnbPIhB2n8OKOHQ', 'review_id': 'OEFjm1bfAxoBYWCT0hhKiA', 'text': "Mediocre. That sums about everything up. Service was Ok. Ambiance was poor. Food was bland. Sushi was pretty meh. I sat in the non-teppanyaki side but frankly I don't see how that would change the food. It shouldn't matter who cooks it. The reviews for this place are suspiciously high so may want to take that into consideration before you come here.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 2, 'date': '2014-01-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QX-xv-TUbSfkJs7PAwMnJQ', 'review_id': 'Iv6JNHByXztvvXiiruEj2g', 'text': "I loved the saki shots and I am not complaining.... however.... they should card some people because I was told I looked 18 and then I got a 30 second sake shot!  It was delicious, but still, they should be careful.  \n\nMake sure you make reservations and maybe get an appetizer. For some reason the soup and salad and meal didn't fill me up.. Birthday paqrties were kind of annoying, but we had a great time!!", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2014-01-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WXhh6fsUPNrdpcnfkHiDhg', 'review_id': 'c0kEfJKSU5gydIkSBVrrNA', 'text': 'My husband and I have been here numerous times and have never been disappointed.  We like to bring family and friends and we all enjoy the free entertainment at the teppanyaki tables.  The food is always tasty and, of course, extremely well presented.  My son has ordered various types of sushi, which he reports is excellent!\n\nMy only complaint:  some chefs utilize heavily-laced garlic butter while some chefs use plain butter (my preference).  \n\nWater, tea (hot or cold) are kept filled at all times.  \n\nWhen I have placed to-go orders, it seems to be a bit of a challenge for the hostess, as when I arrive for pick-up, the orders are never correct.  \n\nI would give five stars, but since there are continuing issues with our to-go orders, and a lack of consistency with butter v. garlic butter, I can only give three stars.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 3, 'date': '2014-01-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'juv7-6HXgvO8r7eRvUARCA', 'review_id': 'AaM4LCXkXEX-JBtR8XaZPQ', 'text': "The best all around. Great teppan,  awesome Sushi, and good drinks. We eat here regularly and are never disappointed. Try the filet mignon, spicy tuna roll, or veggie gyoza. You won't be disappointed.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2014-01-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ade1FiyJMrT8uf_nVhgQEg', 'review_id': 'RSkuEuhEqRneA-OKDqrW8w', 'text': 'When I came here the first time, I had sushi albeit skeptical about having "fresh" fish. However, it exceeded my expectations. The sushi tasted pretty fresh AND checking in gave me a free tempura ice cream, which is so yum. The second time I got a chicken teriyaki meal. It was pretty good except the chicken was a little dry. The only negative is that it is a little pricey for dinner and on weekends. The weekday lunch meal is a decent price.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2014-01-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'l9AN-8YsSbH-gwndyg7INQ', 'review_id': '8HRQn-jI1QP3heTHO6TTew', 'text': 'Great food and even better service.  They fit us in on valentines when they were packed.  We had a great time and the food was amazing.  We will definitely be back.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2014-02-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nMHu8rkh1wkKn5Md0MzNHA', 'review_id': 'm7jYV5M4MOckCCDRj5Vohw', 'text': "First time at Osaka tonight, celebrating Valentine's Day. We arrived 1/2 hour early so we could get drinks and the hostess said they were running ahead but we could head for the bar and she would come get us. \n\nWe waited 10 minutes at our table in the bar but our server passed us up 5-6 times while avoiding eye contact. Even the bar, which was 'cleared' by patrons leaving for their tables, never got cleared of dirty dishes. Seems they need to add service in the bar area (the only reason I gave this review only 4 stars).\n\nWe were seated at our Teppanyaki table with two other groups: a couple and a party of six. The party of six knew a worker at Osaka so he came out and brought them bottles of bubbly sake. He then saw us looking longingly at the bottles and brought us some as well-nice touch. It was very good. \n\nOur chef, Leo, was excellent. We asked for Gluten Free soy sauce and he cooked our meal on one side of the grill, while he cooked everyone else's in the middle and other side. That was cool since he had ten meals to serve. \n\nMy wife got the Teppanyaki Filet Mignon and Scallops and I ordered the Filet with shrimp. We got a cold house salad and hot broth soup, fried rice, grilled veggies and the entrees. We were stuffed!  The filets were cooked perfectly and the scallops and shrimp were excellent as well. \n\nI recommend Osaka for any occasion but make reservations like we did, that place is busy!", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2014-02-15', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 1}, 'user_id': 'y7sq26EXGz7XG7DSo8TOuQ', 'review_id': 'SPy4GimQfjGnJlf5VoC35Q', 'text': "I don't know what it is with this place but my gf and her family love this place. For me once I've seen the show I've seen it a thousand times and it is old. Of course, the kids love the show and love the [irritating] birthday song of which they will sing every day until the next birthday that is held there. \n\nI have tried the grill and the sushi and neither has truly impressed me. The grill is hit or miss and probably depends on the chef and how much seasoning they put on the food. The sushi was OK but a bit on the expensive side. I think I would have enjoyed it more if I had come starving instead of arriving already content. Normally I will eat 3-4 rolls and this time I couldn't even eat two - the rolls are the larger diameter rolls BTW.\n\nThe servers do keep your glasses full and are poignant on checking on you without being annoying. This is a big kudos to me as this is a fine balance of feeling forgotten and feeling annoyed.\n\nI judge for what it is worth and this is a place for parties, not gourmet food served under candlelight. Chances are you will hear that annoying birthday song and see someone running around with an paper-mache Asian-face helmet on - that is just how it goes. It is good for this but I do dearly hope on a regular basis that the GFs family picks something different for the next birthday because going there every month is too much for me.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2014-02-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 4}, 'user_id': 'f4CExFYr3GTMSBD4BccDQw', 'review_id': 'aO4VdJDTSK8R5ttDsKPy-A', 'text': "This was my first Teppanyaki experience! I have to say it was quite entertaining! Our chef was very energetic, nice and a lot of fun. I really wasn't sure what to expect so it was fun randomly getting food thrown in my mouth, sake shot at me and watching my food be prepared right in front of me. I wasn't completely impressed with the taste of the shrimp or chicken, but the rice and the steak had great flavor to it. If you want to mix it up a bit, they give you a few different sauces you can try with your meal too. The staff was very nice, professional and accommodating. We had arrived late and didn't have a reservation, but they were able to sneak us into a table with another family. It was fun meeting a random family and having a meal together!\n\nOver all - A-OK place. Im interested in trying it again!", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 3, 'date': '2014-02-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bgHX1_3EhTUrWR3K995-5w', 'review_id': 'VO48FnqowSJzYcKs4JYxfg', 'text': 'Awesome venue and atmosphere. This is a great place for a celebration or birthday. Yes they play a birthday song for every birthday but that makes this place unique. Its fun and the face masks are hilarious. \n\nWe ordered the Calamari rings which the portions were little (but with the rest of your food trust me you won\'t be hungry). As for the teppanyaki, we got two orders of the Steak and chicken to split between 4 people. There is a $7 share fee but this is so both people can get the salad, rice, and soup with the grilled meats. Well worth the cost. Everything was delicious. I suggest you try everything with their "Yum Yum" sauce/ White Sauce (even though they tell you its for seafood). Over all very entertaining.\n\nIf I had to pick a negative, I didn\'t like that they pressured you to take the sake. We had to pretend we weren\'t 21 to get out of it. It is a fun thing for the restaurant but no means no. But on a positive note, it\'s cute they do the same for the kids, but in a baby bottle filled with Mountain Dew.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2014-02-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Y9TEALh0Gwd5eemXU1tTxw', 'review_id': 'ZcBnWLsCDmFwAV314CrQYw', 'text': "Really happy to have found this spot in Mesa. The rice was done well and the FILET MIGNON (cooked medium) was by far the dish of the night! Be ready to down some saki and take part in a birthday chant every 15 minutes- it's going to be a fun night!", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2014-03-04', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': '-8BqfYouq3o_UoazAQWwNw', 'review_id': 'V_-No_mCGP_568tYoN82LA', 'text': "I'm gonna start off first that I haven't been here for the teppanyaki yet. I usually come for happy hour which is amazing. I mean you can get three rolls and an appetizer which would be good for two ppl for under 15$. Plus if you come on a Tuesday they have 1$ sake and they r actually pretty good I would recommend the cucumber one. The service is always good and the place has a nice vibe.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2014-03-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'YO-1teydwPZZs2ZgApYd0Q', 'review_id': 'vlNfyO3L60LtDlrg5SLG0g', 'text': "Wonderful place! Went here for my birthday, be sure to sign up for their VIP to get your birthday treat. I personally think this is the best teppan. place in the valley. The quality of the food was outstanding, the chef was so much fun and made sure we had plenty of sake! I love the birthday song, although it seems like a popular spot for birthdays because you hear it just about every 10 minutes, despite that the whole restaurant is engaged and having fun. Can't wait to go back and do it again. By the way, our party ordered steak, shrimp, scallops, lobster, and fish...every single dish was incredible with a ton of flavor (the scallops were my favorite!)", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2014-03-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8qbd5FkDfqQofiOAOKXKDw', 'review_id': 'BqZF-ft8QPu8RIacKIyKSw', 'text': 'I have been coming here since they opened and love the food. It does get rather loud later at night so if you want quite and casual come in the afternoon. Group parties are better at night for the hibachi grills. My wife loves the California rolls and the tempura veggies are my go to favorite.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2014-03-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6Qde0SIlVCTsSrXWirFyMQ', 'review_id': 'kSR61lMY6c8jNIZFwqJ9Ag', 'text': 'this place was awesome it was too busy to eat at the teppenyaki section but the atmosphere was still awesome. it was a bit loud which was perfect for our kids since they are noisy. We had delicious seared ahi tuna for an app, my wife ordered a sushi roll and octopus salad Yumm Yumm it was so delicious. I had the sashimi dinner box which was filled with all the wonders of Japan. Service was good for how busy it was (it was filled to capacity with a lot of people waiting to be seated). I will definitely return and make a reservation next time. I can still taste the awesome sushi!', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2014-03-15', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 0, 'cool': 0}, 'user_id': 'uXqH210X4ExwhKbmWUWXZQ', 'review_id': 'NQzccdPgYXfTnP02fL9lcA', 'text': 'Very good.  Consistent.    Good sushi.   Nice presentation.\n\nSecond dinner this trip.   Totally dufferent.  Terrible host staff.    Manager was even worse.   They do not care about taking care of the customer.   We Would have consistently came in the future.   Now we will need to find a new Japaneese restaurant option \n\nIf you like to be treated appropriately Dont stop here', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 1, 'date': '2014-03-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1R9Xd8_HmBPM8nVakWOsGQ', 'review_id': 'pDxdrgNSFos4hEAI8CPwMw', 'text': 'love this place our server was joe he was so funny my sister enjoyed her birthday first time visit', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2014-04-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Mb0psF4WQF7gZSuZafVr-g', 'review_id': 'QlhoKgWe44zbFnyNW5TeJA', 'text': 'This is a teppanyaki joint.  I think there\'s some ordinary seating in the bar area, but otherwise it\'s a teppanyaki joint.  The first thing you have to understand is that you are paying for the show.  There are 8 people to a griddle/chef.  You get the chef all to yourselves for a couple of hours.  Our reservations were for 7pm.  They didn\'t really get started until 7:30, and we didn\'t leave until after 9pm.  I\'m pretty sure they didn\'t have another seating after us, so that was it for the chef.  He prepared 8 meals.  So, of course, it\'s going to be expensive!\n\nThe other thing about teppanyaki, a lot of the enjoyment is heavily dependent on the personality of the chef.  They all are skilled with their knives and utensils.  But some are more "fun" than others.  Ours this evening was OK.  I\'m not a frequent teppanyaki goer, but I have had chefs that were more fun.  But this guy wasn\'t bad.\n\nThe food itself was prepared well.  Teppanyaki is not fancy.  Simple fried rice with soy (or maybe oyster) sauce, simple fried meats (including beef, chicken, salmon, scallops, and shrimp), and simple fried veggies.  Seasoning is minimal (mostly just salt and pepper), and sauces are probably just soy, hoisin and oyster..  I\'m honestly not sure which he used.  That\'s all there is to it.  As I said, it was prepared well and was very good.  Simple, but good.\n\nOne criticism, he did the mixed vegetables last.  I would have preferred them right after the rice (which he did first).  By the time the vegetables were put on our plates I was almost done.  I would rather they have come right before the meat.\n\nOne tip:  get the filet mignon instead of the steak.  It\'s only slightly more expensive, and is MUCH better (more tender, etc).  I had the filet and the salmon.  Both were good.\n\nIf the show had been a bit better I likely would have gone with 5 stars.  I\'m paying for the show, so that has to factor into the rating.  And I have seen better shows.\n\nIt\'s not steak au poivre, but for what it is it was very good.\n\nOh...and if you like sake...bring a designated driver.  He has a squirt bottle full of it and likes to squirt it in people\'s mouths.  Apparently the "record" is a count of 137 (they count while they\'re squirting).  I think they relied on that a little too much for the "entertainment", but folks seemed to like it.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2014-05-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pzEwFmKI0cPccJpinJElBQ', 'review_id': '-EXTYyHq7mlNy-H3Lh1IOQ', 'text': "We sat at the bar with a bunch of people we didn't know, but by the end people from different groups were chatting. The chef made the night very exciting and lively. I did notice that not all the chefs gave it as much effort or were as excited as ours; we must have gotten lucky. The food was delicious. The fried rice was yummy as well as our main course. We chose the dinner for two, so we got to pick four meats. We chose filet mignon, shrimp, sword fish, and calamari. Everything was great! Although I was a bit confused when out chef served us the calamari, I was expecting a tiny intact squid, it looked like a slab of fish, but it was delicious none the less. It did seem however that a majority of the crowd was getting extremely drunk, they were shouting across the room and talking very loudly. There was a couple of families there with young children, which might have been more appropriate at a table instead of the grill because the chefs play with fire and squirts saki in your mouth. The prices are a bit high, but you get what you pay for, I was barely able to finish all the food they have me!! Overall it was a fun night and yummy food. I am looking forward to going back.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2014-05-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JzquzDwFDL-X2UpjBpOhqw', 'review_id': 'x0aTCr7fNN48Y7BatiReLg', 'text': "This is my family's go to Japanese restaurant. The sushi is great, the teppanyaki is top notch and the staff are friendly. I have never had a bad experience whether sitting at the sushi bar, dining room or grill.  The shrimp/lobster teppanyaki is great along with the filet. The yoki noddles are amazing as well. Great food, friendly staff and always an enjoyable dining experience.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2014-05-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3gIZkyfXtKKzd1RtdBjzkQ', 'review_id': 'LQ2XJZUBZYxjq0rcsfkjmA', 'text': "This is our special occasion placed to go. We came here tonight for Mothers day. It was awesome as usual. We always get Peter and he always entertains us! The food is great and we even got gift cards and flowers before we left. If u are a small party don't worry about it they will seat u with other people. We have always interacted with the other guests and have always had a great time. Thank u for once again showing us an enjoyable experience!", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2014-05-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'YTaKOf9KuedF1EZ5R7CuzA', 'review_id': '7_ZHARPyyzSAlmXtyvlvVg', 'text': "teppanyaki with a good a maki selection...\n\nbenihana started it [i think] and everyone else followed suit.  the same ole song and dance (literally) at the fired grill but out of all the teppanyakis i've dined at, this one had the most personal service by the servers themselves - constantly checking in, cracking jokes along with the chef, etc.  i'm reviewing to rave about the pokeman roll - i.e. sweet potato tempura maki.  i'm quite the sweet potato roll connoisseur and this was one of the best - topped with mango and dried cranberries and perfectly battered potato - not too heavy on the breading or oil.  i would go back just for that!", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2014-05-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FUvdmkCWtWctq_mvVbAQ5w', 'review_id': 'zkrLhQ0YHGUZw73d9vbhxw', 'text': 'Been here twice, once for dinner and once for lunch. Dinner was at the teppan which was great! I was with a large group (8 people total) and we were taken care of very well.\n\nThe lunch another time was similar. For that we sat at the regular tables by choice. Just gotta note that the host guy for that day was very strange as he kept hovering around and staring at people as they ate. This was on a Saturday around 2.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2014-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JDDPniDGFXPE8Fo-Xpyt9Q', 'review_id': 'XmzZHBVead9FWVJMABPzvA', 'text': '1st time here. Absolutely great.  Awesome food.  Love the atmosphere and decor. Waitress was fantastic. Very helpful and friendly. Happy Hour  has a great selection and great prices.  Found a new favorite place.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2014-06-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'q4Yx4PcrA0obZTAn2uCP0Q', 'review_id': 'Ody6B0t80YCNdy0V-vobIQ', 'text': 'Not only does this place have amazing food,  but the atmosphere and staff make it one of my favorite restaurants. Always a fun time with great food and not too expensive for what you get.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2014-06-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'T5TeLBETUXg4VXhjHskCrw', 'review_id': 'ajP9u66OIBtZYniT-zj6Lw', 'text': "Great Time. Took my parents here and they had a blast. They do the standard show here for this type of place but it's done well. Food was good the roll I had was great. If you are looking for a good interactive dining experience this is a great place to go.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2014-06-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Q2YVjh3nLQaFXepR6gL-Dg', 'review_id': 'YZX8bILnqGqxtIKQQw3dfg', 'text': "Excellent meal,  great entertainment and the chef was a lot of fun.   The sake is very good too.   This place is easy better now that it's not hooters any more   we'll be back to this one.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2014-06-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Z44yQHWO4EfCzgxHmG9UAA', 'review_id': 'b_vk4_trSXp55LJwC53u-w', 'text': 'Amazing. This is the place you take people to show off your Japanese knowledge of food. The sashimi is perfectly prepared. Tried the makeral, octopus and sea bass. Great atmosphere and drink specials. I tried the sake. They have a comprehensive list for beginners to understand.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2014-06-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '07pUh-U0FXJ9XYhQbZoJIQ', 'review_id': 'h1jR6EIOCrwMhm1OYNfbhw', 'text': "Even though the service is hit or miss, this is still one of my favorite places to go. However, because the service seems to be terrible when they're busy (I don't like long wait times when I have a reservation!), I like to go during the week for lunch. The shrimp and sushi can't be beat.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2014-06-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_vOhCBQ12JBHGcQudtn6Bw', 'review_id': 'ztSzvqtwy9TS-Ot3ZW2VUw', 'text': "We've been here multiple times and always sit at the Teppan table.  We have always had great service, sometimes it faster then others but we have always left feeling deliciously full and entertained.  We love the fun atmosphere and table comradery.  The most recent time we went we took our son and he said it was the coolest restaurant he's been to.  This place is very busy on the weekends so make a reservation and expect to wait about 10 minutes.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2014-06-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'JCW7sPdi626OdRLrRN9ziw', 'review_id': 'piA535UBXD1PiYC8rNYCWw', 'text': 'Very good sushi and a very good price during happy hour. 2:30-6pm (mon-fri I think) \nThe Godzilla roll was fantastic, something I will get again. \neverything we tried was very good but I think I will continue to go during happy hour.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2014-07-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'H-MuI1SRN3z2pHQmK7jvwQ', 'review_id': 'yhQzRLNAEUYyBUIlaFxCkg', 'text': "Food was good. We sat on the dining table side. We had the calamari app and the tuna app. The tuna could have had a little more spice. Calamari was hit and miss. Some were good, some were mushy and some rubbery. The happy hour menu looks good. I'll have to come back and try that. The atmosphere was nice and relaxing. I'm going back for dinner. I'll update my review after that.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2014-07-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LTbrv2FUYXLPwAt3AGBvXA', 'review_id': 'dDlQpdshFCTnFEv3RnfEVA', 'text': 'Excellent service, atmosphere and food. Will definitely be eating here again. Everything was well priced and all three of us walked out of the restaurant in food comas, the food was just amazing!', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2014-07-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UCUgOMsWMVo45CnmyiMBtw', 'review_id': 'x8VAZq-89xy8iA7k21uBaQ', 'text': 'After reading Yelp reviews about this place, I decided to take the family here for my wife\'s bday and teppanyaki.   We LOVED IT!  Our waiter was very friendly. He tolerated all of our antics and played along with anything and everything we dished out to him. Needless to say, I have a very friendly and outgoing family. \nBack, to the review. The ambiance and the staff were great. The food was also delicious. A little salty, but still tasty.  The teppanyaki chef was awesome; he scared my son with all his screaming, but that\'s a personal issue my 4 year old has lol!\nMy family and I had a lot of fun. We were able to be as loud and as silly as we wanted to be!  It was my wife\'s bday and they sang for her using Japanese masks. My wife was "twerking" with one of the staff members!  It was hilarious!  \nAll in all, great place, great food and great experience!  We will definitely coming back to this place!', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2014-07-27', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'plAU1jDM0q_Hqm-GF8TdeQ', 'review_id': 'h20LVsnE0upcO6ANsmMJxw', 'text': "I went here based on the Yelp reviews, which are usually perfect for me!  \nI was surprised at the lack of flavor.  The rolls seemed really greasy and tough.  I like rolls that are healthy, but my sister wanted to order one that was fried.  One other one did not say fried on the menu, but it looked like it had been fried.  My husband ordered the Teppan steak, and he said the meat was not tender at all.  \n\nMaybe we went on a bad night?  My favorite place is a hole in the wall at Power Rd and Main St called Sushi Kee.  We've gone to Sushi Kee for years, and they are usually wonderful.  However, on our last visit, it was just ok, so we thought we'd try a new place.  I am going to stick with Sushi Kee since usually their food is the best.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 2, 'date': '2014-08-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': '5NCwhoG7xWmxfR3ciWr-RA', 'review_id': 'AoKll8l5lkCxsJxU73wT2w', 'text': "First off this review is for the sushi bar, and not the teppanyaki.  I think the teppanyaki is ok, but I am also not a huge fan of teppanyaki so yea....  The sushi, on the other hand is pretty decent, but mainly on the weekends which is when they get their orders of kumamoto oysters, urchin, baby yellowtail, and scallops.  These items are always fresh and delicious, but run out within a day or two so you have to come Friday-Sunday if you want to make sure not to miss them.  During the week, when they run out of the kumamoto oysters they have the bigger, freshwater oysters, also great to try.  The sushi chefs are  really nice and always give us a free sample of something, like the salmon belly, and I am typically not a fan of salmon but their's almost melts in your mouth.  My one small complaint about this place is their salmon skin hand rolls, which I have had a little overcooked on some occasions and cooked perfectly on others, so try at your own discretion.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2014-08-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5NCwhoG7xWmxfR3ciWr-RA', 'review_id': '86AwPIOkE0B9SMjAbcPUMw', 'text': 'Came here the last couple of times for sushi and just wanted to say that the oyster quality was not as good; they did not taste as fresh and they were served to us warm two times. On one particular occasion we ordered sweet shrimp for the first time, and it also came warm. We told the manager and he was nice about it and had them make us another order, but those also came warm.  The rice on all the sushi was also subpar and kept falling apart. In the end, the manager ended up taking them off our bill and giving us a gift card, so I have no complaints about the customer service. Overall, I have noticed that I only have bad experiences here during busy hours, such as at dinner, but whenever I come for lunch I rarely have a complaint.  So just be aware of this if you ever decide to come on a Friday or Saturday at dinner time.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 3, 'date': '2014-08-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CuVTy-_S1IknzeUzow_B3A', 'review_id': 'sdLO0uVl4EzuRlnJ1sBY9g', 'text': 'This place is tasty. Reservations accepted. Fun for kids/adults. Friendly staff and most important, great tasting food. \nOur teppanaki chef was great with the kids and catered to the adults as well. Everyone is trained well here. \nBirthday mask is trippy, but funny. \nIt is reasonable priced and an overall entertaining and fun experience.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2014-08-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'co9K8_dsVR32I9XaUel28w', 'review_id': '4pMrKhjoqa_lOp3iFNS8-g', 'text': 'Pretty good food, service was great, and had a blast! So glad to have had good company while enjoying the entertainment of our cook at the grill. Only complaint was that the food had a little too much soy sauce or whatever sauce they used that made it salty... But other than that it was amazing! Definitely will come again :)', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2014-08-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'JqgGdxATUp77BAObDYBPqQ', 'review_id': 'GVYRm7jlxz3o3R42GT8-8g', 'text': 'Better than benihanas for sure. This place has a live ambiance and they constantly squirt sake into your mouth like its some food porn movie. Our server was very attentive and great. All in all, this place is legit and for what you get for the money, I would definitely come back and recommend this place!', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2014-09-03', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'hzgIByn9lIcfsugW3zwU4Q', 'review_id': 'c_Fe2hMy7gSRUHJIGlj5sw', 'text': 'New happy hour menu start today. Everyday Monday - Sunday 2:30 -6pm\n\nTuesday $1 sake all day with original, strawberry, cucumber, vanilla, or peach flavor. Also 50% off premium bottle sake', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2014-09-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 2}, 'user_id': 'oN-upmHL_CoPpBeoC8D55g', 'review_id': 'Tom1SmRjMFJbRlk4lxsnnQ', 'text': u"Went with a group of people... Drove by this place so many times and finally decided to try it! We decided to do the teppanyaki. My fianc\xe9 and i ordered the teppanyaki dinner for 2 and we were able to choose 4 different types of meat.. We choose the sirloin, shrimp, calamari, & swordfish... Our food was amazing! The sirloin calamari & swordfish was out favs!! It was $52 for both of us which isn't too bad.. We expected to pay more for the teppanyaki.... Definitely better than Benihana!! Will probably come back!", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2014-09-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'gLWA_hxaFRFQJWDTSGgGOQ', 'review_id': 'LkS-Is03cXPHe2Jtfwi7Jw', 'text': "The hibachi was pretty good. The sushi was pretty good too. Not anything amazing, but it's fun for a group of people. The wait staff was very friendly.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 3, 'date': '2014-10-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bKSYD5gxPOO5g1ribAxuyQ', 'review_id': 'F_OdsLEqLJBPKLWAmlSS2A', 'text': u'Muy divertido y muy rica la comida. Trato estupendo. Merece la pena ir. Eso si... Con sentido del humor y no os pong\xe1is la mejor ropa porque podr\xeda mancharse cuando os lanzen comida o el sake!', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2014-10-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8XDB8ny-kbhuWNt3kac_FA', 'review_id': 'jSJNaa7vWZE7bXRhj20Srw', 'text': 'Great food,  fun and entertainment! We enjoyed all the great food,  the ambiance and the servers were very nice.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2014-10-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BJiLuI4Uf2Xz7vtt4WA1KQ', 'review_id': '_Fv1phlBgpqw0MxX7AwvBA', 'text': 'Great food and ambiance. Great service.\nShrimp Tepan was awesome and our chef was very friendly. Clean place.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2014-10-19', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': '0u7792OCNqYO_v8YNTteaw', 'review_id': 'Z5yb3CJz6iuVfRkXBLhbKA', 'text': "Sat on the dining side and while we were seated promptly (to a dirty table that we ha to stand there while she cleaned) it was all downhill from there. Appetizer was undercooked. Drink tasted like straight NyQuil, which I didn't get until reminding her I ordered a drink, and filet mignon was brought to our table COLD. Will not be back.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 1, 'date': '2014-10-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5PpbQ0xpy2-pL-lG962fxg', 'review_id': 'qazcjUJiTHS6iFJDSjTgZQ', 'text': 'Had a friend grab me some sushi to-go (citrus roll and spicy tuna) It was super fresh with lots of flavor! I would definitely order here again.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2014-10-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'x0VrFb_M48CvQvF3GAjjGQ', 'review_id': 'HmhxkME6RlYM_bBhWLrGSQ', 'text': "I have been here several times, but today it was like walking into a whole different place, the windows were dirty, wanted to sit outside and the table were dirty, umbrella faded...very in inviting.. I didn't know who is managing this place but they don't have a handle on it.   The sushi chefs..Top notch, food was good, server not good, very disappointed. \n\nIt all good now..someone is listening", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2014-11-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FEJt4rZgikhJqPXnnyld_Q', 'review_id': 'Y_zKgTqJ5G6WzNuFjGeATA', 'text': 'Excellent service. Happy hour food menu tasted great and fresh. Got the chicken omurice, edamame, stuffed salmon mushrooms, yellowtail roll, and eel avacado roll. Also tried a little bit of hard cider, their Angry Orchard, which was really good.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2014-11-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JeGx7EGFFYgxzpBc0x_Wqg', 'review_id': '6RnwDu4nV9cUkYnaf3nErw', 'text': "I've been to the place 3 times, the first 2 were for family birthday parties.  The teppanyaki dinner is fun to do with the family especially with the nieces and nephews in tow.  The 3rd time I visited the place was to try the sushi.  I must say the sushi was prepared rather well and the happy hour prices made it all that much better.  Compared to some of the other sushi establishments I would say this place does a good job of still providing their better rolls during happy hour.  If you're going with a group/family then definitely try the teppanyaki otherwise I would definitely recommend choosing from the normal menu.  Of course if you can make it on time then aim for the happy hour, it's a very good value.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2014-12-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pOP_87eaKfgE0bMdORmweQ', 'review_id': 'YuAB6EQjvp1vxBUrUIBHmw', 'text': 'Not to bad of a spot. A bit on the price side but the food and sushi is good  full bar with out side seating. Happy Hour is nice, a good selection of items.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2014-12-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-YjUsHxBeVMwGHKiQ8OZCA', 'review_id': 'HYFHKccZk2iX5GrOTKwtXw', 'text': "Went for the first time with some friends, who are regulars here, and had a blast! It was my friend's wife's birthday. This is a popular birthday spot, since they did the birthday song about 8 times in the 2 hours we ate. The show was good, and so was the food! They make everyone have fun by taking a squirt bottle of Sake, and shooting it in your mouth. One guy at our table went to the count of 60, good thing he wasn't driving.\n\nIf you go as a couple then do the dinner for two. It's the best deal on the menu for the grill. You get 4 meats for $26 a person. We had the Filet, Scallops, Salmon, and Swordfish. My wife who usually is not a Scallops fan loved them the most.  \n\nWe'll be back for Sushi, and Rolls. They build some GREAT rolls.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2014-12-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'EBg102nonK2uK41cUlfUIw', 'review_id': 'u8fQI7MSovFJQkFPCA4nOw', 'text': "Some of the best sushi I've had. Both of us enjoyed it. The fried rice had pineapple, which was different but surprisingly delicious. The prices at first seemed a bit high, then we found the happy hour menu and were very happy with the prices, especially with the quality.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2014-12-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5kjnMlCrhMW04P12D5_Oog', 'review_id': 'KBjOx51Q4lA69cw2KrU7Fw', 'text': "Went for happy hour. Did not disappoint! They have quite a good selection for happy hour. It was great presentation. It's huge sushi rolls lol! Great service! I will def be going back!", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2014-12-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LLSaUpzLpBrgYi8DC1nBpQ', 'review_id': 'zh9ghYAz1AwPGYWYfUXBZQ', 'text': "First off, it took around 10 minutes for anyone to take our drink order and another 10 for the waiters  to come back with our drinks and take our food order. Bestie and I sat for what seemed like an eternity, I'm sure it was actually about 35 minutes, for our food to come out. I was pretty excited to come here cause I've heard such great things... from start to end we were there for about an hour and a half.  Food was delicious . Needless to say, we won't be going back because the service was really bad.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 3, 'date': '2014-12-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fU_YBNuoM9cOZdAcEKsJGg', 'review_id': 'fU9qX3YOQ_q0ENUgnHOqcw', 'text': "This place is a great time with good food. My experience has only been with the Teppanyaki tables for dinner but it's always been good. Prices are reasonably priced compared to other Teppanyaki places I've visited (Sapporo, Kobe) and food quality is comparable for the price. The atmosphere and experience is top notch, staff and cooks are very attentive and friendly.  If you're going out for dinner with a group, you won't be disappointed by going here.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2015-01-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QMihRlffq05FB0UwAkD4KA', 'review_id': '999NBjEFl74Vh2FsAz6M8w', 'text': "Not that impressed.\n\nIt may be because it was a holiday (New Years) but our service was slow as molasses.  We were told a 5-10 minutes wait for the teppanyaki but it ended up being about 45 minutes.  When I was about to bail for another restaurant they finally seated us.\n\nThe food tasted alright.  Rice and shrimp were good.  Chicken was so-so.  The chef at our table was just OK.  In general, I don't plan on going back but it wasn't horrible.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 2, 'date': '2015-01-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'z9v2iD7wJZMHo9JkrAYExg', 'review_id': 'qiQI0ppb4Weyh5Qr6K4KSg', 'text': "We've been here for Happy Hour Sushi before and loved it! They have great rolls w/ some nice flavors! We've been wanting to try the Teppanyaki so decided we'd give it a whirl! lol So glad we did it so much fun! The family we were seated with was so nice and even shared their Geisha roll with us :) I did the Mahi Mahi, Kevin had the Filet mignon & Chicken and my son had the kids steak. The chef Dan was a hoot and really great with everyone and his performance while cooking. My son loved the apple juice in the baby bottle for the kids! I didn't try the saki but the group had a lot of fun with it lol It was a little expensive but for all the food you get and the fun time with strangers and dinner it was something we will definitely do again!", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-01-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BiOusA6fpIyN_JMdGm6kvQ', 'review_id': 'p3kX5ZpwaJYyiAuzaN4m7Q', 'text': 'Love the service, prices.  Wonderful presentation and quality of the sushi.  Happy hour is longer than usual, which is nice.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-01-31', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': 'yjhLF2uxrDlMcgTBkixR0Q', 'review_id': 'Gf0nK91RlCQPNn6-_bJmPA', 'text': 'We came here to celebrate my daughter\'s 7th birthday.  We purposely arrived around 3:30 pm.  We had the restaurant to ourselves.  We took advantage of the Happy Hour specials and family day Sunday (kids eat free with paying adult).  The food was excellent and fresh.  Our chef was fantastic.  My son said that this was the best lunch ever and is already asking to come back for his birthday.  Well worth the stop!  My son also got a kick out of the chef spraying "lemon juice" into his mouth from a baby bottle.  Check it out!', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-02-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Pgamdv29BI4e6l6uA2Ditw', 'review_id': 'vFpfPiJFvOrpMSDrl14Isw', 'text': 'Great Night Celebrating Valentines, 17th  Wedding Anniversary and 5th Birthday. We had a group of 8 people. For such a busy night we were seated about 15 minutes later than reservation and we though that was really good we had a cocktail in bar area. Once seated our server immediately got drink orders and appetizers going and took our entree orders. We sat at the Teppanyaki table and our cook Alex did a great job. We have eaten here many times but this night the food was the best ever. Alex seasoned and cooked everything perfectly.  Not too salty and everything was fresh and yummy. The show was great and the birthday singing was lots of fun. We had a great night. We would highly recommend for any occasion.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-02-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'Q6dhZu02vU8z-zIv5hNb_Q', 'review_id': 'yMOD5DosCvlp2GA8YQm_GA', 'text': 'Our waiter was very attentive and polite. Happy hour on weekdays is 230-6 and weekends is open-5. We got 3 rolls of sushi at $6 each, an appetizer for $4, a crab salad for $3, blue moon for $2, and a free tempura ice cream( I unlocked the yelp deal) all for only $30! We were too full to eat all the sushi but this place was awesome.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-02-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'K2Tml6vK2hy1RRAiRFrXZg', 'review_id': 'LRJ5fjwr1eHuIxCzVZQYfw', 'text': "My absolute favorite restaurant overall. Amazing staff, highly entertaining, delicious food, great service & good times. Enormous menu variety for both food and drink. I recommend going in a group, the more people = more fun! Weather it's with family, girls night, or a group of friends! It's always a blast! *Making reservations is highly suggested*", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-02-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jWpbwcHxQtggzIISVmDGvg', 'review_id': 'QEJ7fWfsGB4J702lVi8H6A', 'text': "Great teppanyaki! The filet was perfectly flavored and cooked. The shrimp was fresh and large.  The chicken was just average, but hey that's chicken. The fried rice was perfect and the vegetables were great, I only wish they used less onion.\n\nOur chef was so funny and he really made the experience a lot of fun.  Beware though- if you turn down the sake bottle, they will pull out a baby bottle for you instead! \n\nMake a reservation, especially on weekends. Seems to be a very popular birthday party spot. They even give you and your guests free coffee flavored tiramasu if it's your birthday.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2015-02-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zDCuy2vs_0vDQv8HRM5Peg', 'review_id': 'f6yKN2IElrwnxLBbwQTc7w', 'text': 'So we went to Osaka for a great friends birthday dinner.  There were 9 of us at the teppan table.  We all were enjoying our time.  The ambiance was great for birthday occasions since they play the birthday song like every 5 minutes it seemed.   The Chef came out and performed his routine.  He over cooked 2 of our parties steak and said he would make another one and NEVER did.  We were eating when clean plates arrived for the next party.  Upon getting our dessert an employee walked over to me and said "I really shouldn\'t be asking you this but I am going to" then proceed to say "could your party please take your conversation to the bar?"  I looked at him and was like your kidding right?  Oh, no your not....  We had only been at this table for less than  an hour and half before they were chasing us out.  Whats sad is the teppan table across from us had 2 new people at it with 7 open seats.  It gets better!  So our group proceeds outside to then be chased by the waiter,  Chris, who approaches one of our group and says "you don\'t leave tip."  "You don\'t want to tip me?"  After reviewing the charge slip it wasn\'t even his tab it was another person in our group that left a cash tip.  SERIOUSLY your going to chase after a table that you just ran off inquiring about a tip.  YOU HAVE TO BE KIDDING!  This was my first and last experience at this place.  I have NEVER been asked to leave a restaurant in the many years of eating out.  Things probably wont change as it seemed to be a busy placed.  Good luck!', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 1, 'date': '2015-02-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'lFuuyO2gM4_9pCcPdUNRmA', 'review_id': '7mmm-Xxi1Ok9l4hPRCi28g', 'text': 'Came here for dinner as we usually goto the other sushi place in the same area.  We wanted a nice dinner and cozy table.  We got in and was seated right away.  The place has 2 dining areas, 1 tappenyaki side and the other has dining tables and a bar.  \n\nThe sushi was good, i would give it 4 stars.  We ordered 4 different rolls and some calamari.  We had mochi ice cream and it was good. \n\nI would have given this place more stars but our server made a huge goof.  We ordered drinks first, he put them in then took our orders.  Then a little while later our food showed up.  He ask was there anything else he could get us?  I was like huh?  What about our drinks. ..  He forgot to bring our drinks.  \n\nWe will likely visit again and i will update my review of the service is better.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 3, 'date': '2015-03-01', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': 'LjgM_aoOLbkA7ePOnfo8Fg', 'review_id': '95TnbpTxIeoXALD9kFmxdw', 'text': 'We enjoyed their happy hour specials so much, we went back three times while on our vacation!', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-03-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JW4iRjIP4gGgl-A8mhCKGA', 'review_id': '7ZbxNfuqit04uX_53dNK4w', 'text': 'Ok let me explain why I give this place 2 stars. Where do I start...... We sat at the bar and and the bartender was good came to get our drink order right away.  Now we didn\'t realize that the other bartender which looks and acts like a teenager was trying to get out of the dog house from his girlfriend because the whole time we were there he was trying to please her. It was annoying and distracting from my dinner. Now enough talking about the staff lets get to the good stuff or the lack of. We started with the tempura combo which was ok. It only had 2 shrimp and 4 pieces of random vegetable for $5. Then the sushi. We got the spicy tuna nigiri which look really weird, it looked like it had red food coloring and was really unappealing. Then the tuna nigiri and it needed the red food coloring because it was brown and looked old. Worried about getting sick I passed on that. We ordered another beer and there was no cold glass so I liked that "good" bartender actually got a glass iced it down and gave it to us. That is why I gave a extra star.  Now I had to laugh when I was paying my bill the "kid" asked if I wanted change from a $51tab when paying with a $100. Now I still left a good tip cause the other bartender actually was working. Would I go back?   Hmmmmm no thanks I\'ve eaten way better sushi somewhere else.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 2, 'date': '2015-03-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_V6Oof9NXK1r2nHCDOE-Vw', 'review_id': '1SglkJP7Pz9xOYFRKKnJfA', 'text': 'Great place great food.  The food was fresh, properly prepared and a great value for the price. We highly recommend it especially the happy hours.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2015-03-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'urReOFqTZ0uNzDHAFiLKBw', 'review_id': 'g59U1AsO6U3HVB527zECHg', 'text': 'Best sushi I have had in AZ! Super fresh and very reasonably-priced! I go here all the time!', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-03-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'bABCAlKA7wT55B74Iufg8Q', 'review_id': 'NgrZKBCf4OUTB4DEX_w8gw', 'text': 'The most fun and entertaining dinner! Thus was my 3rd time to this location and it was even better! We had a friend in from out of town and wanted to show him a good time, so we got a reservation here! \nOur chef was amazing and funny and kept the sake coming! It was our friends birthday,  so he got the royal treatment!   The food was so great. We all enjoy sushi beforehand -the Rockstar roll is my favorite!  \n\nA friend said "I didn\'t have one bite that wasn\'t awesome " :)\n\nGood times!', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-04-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'xIxGBGHM5BqCJs2zs__rcg', 'review_id': '0mkERKu5A4cqy6HaGXdnFQ', 'text': "I love going here for happy hour (2:30-6) on the weekdays. It's never very busy and the rolls are large - three usually fill two of us up. We enjoy the Mesa, citrus and Las Vega although we haven't tried one that we don't like. Food can come out pretty slow (30 mins on a weekday) but I think it's because they plate all the rolls together. Otherwise, it's great!", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2015-04-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'FjDJcEFfPa9eHxmU32vcLw', 'review_id': 'XXczasYSXJNmb_q8nS7Tzw', 'text': "A former colleague of mine at the last engineering company and I worked at took me here to enjoy sushi.  It was really delicious and wonderful.  Not a lot of people there when we went, which was probably about a month ago.  Our waitress, which I now can't remember her name, but she's Chinese, 23 yrs old from China, with pretty decent English, was really awesome.  \n\nIt was a lot of food, but we came here for lunch.  The ambiance was nice for us to catch up in, though, dark.\n\nHopefully sometime in the future, I can bring my husband and kids here so we can do Teppanyaki, as my husband doesn't like sushi, nor more daughter.   But, my son loves sushi.  \n\nGreat place.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-04-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '29WpNjdDQ-CAyoVtNRaZrg', 'review_id': 'LM2NcTXsDaNbr9IomXWK5Q', 'text': "Firstly the service was absolutely terrible. We had a table of seven people and our waitress forgot about us. We had to go up to the bar to get our drinks because she forgot about them and she didn't even deliver our food to us. She took the bill and didn't give us back our change assuming it would be her tip. Secondly, my boyfriend has been throwing up and has had terrible diarrhea for the past 8 hours. We went to the health center and the nurse practitioner concluded that it was definitely food poisoning from the sushi. Two i.v. bags later and some zofran my boyfriend finally stopped throwing up.  Don't go here unless you're looking for terrible service and the shits.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 1, 'date': '2015-04-27', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'Mb0psF4WQF7gZSuZafVr-g', 'review_id': 'AGER4XhPE8eCWu2jrOnB0A', 'text': "This time we did not do teppanyaki.  So we are sitting in the restaurant/bar ordering dinner boxes.  The dinner boxes feature whatever you've ordered (steak, sashimi, etc) plus a standard variety of California rolls, tempura, gyoza, and rice.  I opted for fried rice for an extra charge.  The fried rice was good (just like at the teppanyaki tables).  The rolls were fine, the gyoza were fine (I'm not a fan, but I know what they should be), and the tempura was OK (mostly I tasted the breading not the item that was breaded).  The main course was variable.  \n\nI had the sashimi, and I was not impressed.  It tasted old.  Not spoiled, but old.  I know, we're in the desert so it's hard to get fresh.  But at these prices they should find a way.  I wouldn't order that again.\n\nMy wife had the steak/beef, and that was tasty.\n\nI preferred the teppanyaki on my last visit.  The food there is simple, but good.  The steak dinner box was pretty good.  I won't do the sashimi box again.  I tried to steer clear of the teriyaki because it is so 'common', but maybe I should try that sometime.\n\nSign up for the email club.  You get $25 for your birthday, and that makes it much more affordable.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 3, 'date': '2015-04-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CuiLmQpUszzhLqGifzKHiQ', 'review_id': 'KnBIhGTbWvz1DwjqQdeN3w', 'text': "Happy Hour is the time to go.  The prices and sushi are very reasonable.  Moving to Arizona, I wasn't sure how the sushi would compare to LA, but I have to say I don't see a noticeable difference. I am looking forward to visiting this place again and indulging my love of seafood!", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-05-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'V6axWAF3-xOvUgjOKLNy-Q', 'review_id': 'onJzfpUmUzXZS8QUxWMbEg', 'text': 'My wife and I go to Osaka about 3 times a year and the "show" they put on is usually identical from one visit to the next. The food is normally just ok. Tonight we must have had a new guy because the "show" lacked most of the elements that it normally had and he was not as proficient with his tools, however, he was the best chef we have ever had there. Every bit of the food was the best I\'ve ever had there. I can only assume that all the other cooks where focusing to much on the show and not on the food.  I was very happy because I don\'t really care about the show. I only go there because my wife likes it. Tonight the food was the best I\'ve ever had there. I had the lobster and the filet Mignon. It was very good.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2015-05-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'OiDuxCxCBkc3_gPDSf_28w', 'review_id': 'u7fGE4cr09PbZivfZt0Opw', 'text': "Godzilla roll! It's amazing. They also have a killer happy hour. It's m-f from 2:30-6:00, open to 5:00 on sat and sunday. Their yellowtail appetizer is also great. The spring salad is HUGE. Very fresh, ask for the ginger dressing though!", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-05-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BvrUaReHo43ae7z7qE8Paw', 'review_id': 'E1l8UUjkIsyw5PFJX1yqtQ', 'text': 'Had dinner there tonight. Great atmosphere. Wanted to try their sushi but was once again sucked into the overwhelmingly fun promise of teppanyaki. Filet mignon and lobster set my carnal urges to rest. Thx Osaka', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2015-05-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'aWJClqmAAgd5S1fMlphZ_Q', 'review_id': 'OTKZsGA40yUwwqy7XXvugQ', 'text': "Awesome! Will definitely be back! We did the   Teppanyaki for my daughter's birthday. Great atmosphere and excellent food. The reason I gave 4 stars is the drinks are only so so. We had several kinds amongst our table and they only tasted ok, were weak, come in a plastic soda glass, and there is no draft beer.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2015-05-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'x0VrFb_M48CvQvF3GAjjGQ', 'review_id': 'vHN-wyzaFcxVKpfhuWOdtQ', 'text': 'I have been here three times the winter, excellent on all accounts.  Fixed everything I complained about! . A+', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-05-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'i-8jVgyJUkP6eolJJk7GtQ', 'review_id': 'IlGSRrKmw6aPLbo8e-Vqhg', 'text': 'What a fun and delicious experience! My boyfriend and I went when we wanted to have a good time in the middle of the week, and man did we! It seems like a place to go when it\'s your "birthday". We sat at the teppan grill and both ordered the sesame chicken and some sushi. The sushi was surprisingly delicious! The rest of the food was also very good. Be prepared to spend some money, but it\'s worth it to be in such a fun atmosphere. The cooks are hilarious and play fun games while they cook your food. I made a lot of special requests to my food and they gladly accommodated! I will definitely return!', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2015-05-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HM7izo_8g3BiNEFdXcheaQ', 'review_id': 'hi5hi68y939jjf_0_XoTcw', 'text': 'I have been to Osaka several times and every time has been a pleasure, except for this last trip. My Son and his Wife and I went there at my request because of my previous experiences that I had. This time was not the best. We arrived slightly before dinner rush. We ordered drinks and took a moment to figure our appetizers. No problem. We ordered and they were delivered in a reasonable amount of time. Appetizers were good. Then we waited a little longer than we thought reasonable. I admit it took a while for us to get our order together. When we did order the dinner crowd had arrived and was fairly busy. After we ordered we did see others getting their orders before we did even when they were seated way after we were. Once our was in it was over an hour before it was served. During our wait my son decided he wanted a beer and saki. He had to go to the bar and order. I can not complain about the food! It was great! This is the first time that the service was bad. Still recommend unless, I get another service like the last.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 3, 'date': '2015-06-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'V9FeTVQyyF4kdqYBjnaZXw', 'review_id': 'NS2XIIizgf1Tnw8RWUWQ2A', 'text': 'Our favorite tempanyaki place around. Good chefs that put on a great show. We love the white sauce and free saki.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-06-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '5ZrLpvJLddHk1Z1ihWM63g', 'review_id': 'y9Uw6XIHFhwP6K5h-dczMQ', 'text': "Went for the first time for my birthday and had the teppenyaki.  My husband and I both thought the meal was wonderful.  The soup had a lot of flavor although a little skimpy on the mushrooms.  The dressing on the salad was something I had never tasted before but I loved it.  Then came the cook.  He did the usual tricks with the eggs and the spatula and lighting the tabletop on fire, but what I wasn't expecting was shooting saki in everyone's mouth.  I'm sure it was watered down but who cares!  It added a whole new element of fun to the experience.  Our steak, calimari, shrimp and scallops were cooked perfectly.  \n\nLooking around at some of the different cooks at the tables, some have better personalities than others.  Ours was fairly entertaining but there were other tables that were REALLY having fun. Was kind of wishing we'd had a different cook only because of that.  I had no complaints about the quality of the food he cooked.\n\nWe will definitely return in the future.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-06-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'm-vP73LC01EBPu0qb8Ddlg', 'review_id': 'ueagI0m-qS8yOrhO8OvNwg', 'text': "The happy hour is awesome! Mango Mai Tai's are excellent. I also really like the Beef Omurice. The happy hour sushi rolls are all great tasting; I always get the Las Vegas roll.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-07-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9ZQLB3g2VIcMleokFM26gg', 'review_id': 't8mO9kN9Tm40EjoV53avLw', 'text': "The service, food, and the chef were all good.  I'm a tough critic and a picky eater so they must've been good.  I've been here twice already and I will definitely be back.  The second time I brought my parents here when they came to town and they enjoyed it we laughed with other people at the table and that makes the time even more enjoyable.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-07-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nBwj7cj52nAbRydMaL9pVQ', 'review_id': '8U2jzTZd88JBzURg_daS4g', 'text': 'Server David was awesome. We sat at the sushi bar and both chefs were beyond great! My #1 sushi by far and we drove from Scottsdale.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-07-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8JRWtb_dCXMkI3D_uKiYUQ', 'review_id': 'bjWAUtOMzIpfeojsFsEjRA', 'text': 'My wife and I eat here regularly. Prices are good, and the sushi is delicious. They have recently added more items to their happy hour specials.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2015-07-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'Y9TEALh0Gwd5eemXU1tTxw', 'review_id': 'TMk-xvEbRz0u_OYgnqfF4w', 'text': 'Osaka did it again! Thank you for making my sister-in-laws birthday bash a memorable one. We will definitely be back for future family birthdays and celebrations. *****5 Stars for good food, great service and a top notch show.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-07-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4ajMZ4mIHApV1bMWuY748Q', 'review_id': 'LcQQyBi7CKKVC0EI0ZGIYA', 'text': 'Not worth it! Go somewhere else. I went later in the evening but did not feel overly welcomed. Got the Phoenix roll and the las Vegas roll but was disappointed to see they were mostly game crab meat and the Phoenix roll was too big to eat because half of it was "crab". Only reason I\'m giving 2 stars is because it was fresh. Been eating sushi a long time and u was greatly disappointed with what I was served, I took a lot of the crab off.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 2, 'date': '2015-07-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'SMMLrgRHf6Wz6OQWTITjKg', 'review_id': 'jJRqa2pPyEPvvDppwAdzdA', 'text': 'Happy hour rocks!! Fresh seafood and fast! Friendly and clean!\nDefiantly coming back!!', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-07-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7hMZsHSPGXmwfv-thyav4A', 'review_id': '49uvHc8J7hslN7G9h4kwPg', 'text': 'This is the best Tempenyaki I have had in Arizona. The show was fun and the food was mouth wateringly delicious. I loved the atmosphere, you really can get involved in the whole room. I will definitely be returning with more friends.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-07-30', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 1}, 'user_id': '4CgusCZkipvUhvBZrRD46w', 'review_id': 'GYoRYvP6YPQBawxMQwlFvA', 'text': 'Wanted to treat visiting granddaughter to japanese teppanaki meal.  She had been to Benihana\'s in Scottsdale and while we had a good experience there, I wanted to surprise her with a new place. Spent over an hour checking out Yelp reviews and came up with Osaka in Mesa.  Had fairly good reviews and a nice drive never hurt anybody.  So instead of driving 5 miles to Benihana, I drove 20 miles to Osaka.  \n\nEnvironment:  Osaka is less dingy, more brightly lit and cleaner than Benihana.\n\nThe Soup:  Miso type soup with mushrooms.  It was more of a holograph of mushrooms.  Not bad tasting but not good either.  Not hot, lukewarm.  Benihana wins on their wonderful hot soup.  \nSalad:  Iceberg lettuce, one grape tomato, one slice of cucumber.  About the same size as Benihana\'s but Benihana\'s ginger dressing is delicious.  Osaka\'s dressing does not have a flavorful ginger dressing.  Kind of blah. \n\nCondiments/Sauces:  Benihana serves a wonderful, strong mustardy sauce along with a ginger based sauce.  Osaka served a Ranch dressing type of sauce and a diluted, sweet ginger sauce.  Benihana wins.  \n\nFood Preparation:  Osaka seems to be off on the order in which food is prepared.  Fried Rice was done first so everyone had fried rice on their plates.  One couple who had a toddler with them ( parents paid for a kiddie meal which I will never understand why), ended up with a portion of fried rice which was twice the size of my teenage granddaughter\'s portion.  Literally.  Does that make sense?  \nThe chef  then put on the meats, fish and shrimp.  Cooked steak for those who ordered steak and served it to them.  My granddaughter who specifically asked for "bloody" and emphasized rare steak, ended up with medium to medium-well steak.  Does one send steak back at a Teppanaki table service?  I wanted to but my granddaughter did not want to create a fuss.  What a nice temperament.  I would not have been so nice.  So now everyone has fried rice and steak on their plate and I have only fried rice and the shrimp entree I ordered has not been served to me.  The shrimp are sitting on the grill while the chef does a few tricks including cleaning portions of the grill which had scallop residue on it.  Yes, please, go ahead and clean your grill.  I can wait some more.  I can graze on the fried rice and the ridiculous sauces you served with it.\n I asked him if I was ever going to get my shrimp. And suddenly a light bulb went off and he realized I was the only one with just rice.  So I am served my shrimp but only after everyone got their 2 shrimp appetizer on their plates first.  Did I say appetizer?  Doesn\'t an appetizer come first such as before the fried rice which was getting cold on our plates while the chef did his endless number of tricks??? I\'m for the tricks don\'t get me wrong.  I\'m no scrooge.  But you can\'t keep me from having anything substantive on my plate while you do your tricks and everybody else is eating their fried rice and steak.  He finally puts shrimp on my plate.  Hot shrimp, cold fried rice.  Oh, did I forget to tell you that the veggies haven\'t been prepared yet?  Oh, yeah. Go ahead.  Serve the vegetables at the end.  Alone.  After we have eaten our rice and protein.  Are vegetables a dessert so that\'s why they are served at the end and served  Overdone like mush?.  Benihana knows how to present food in such an order that everyone is eating their dish at the same time.  They serve the soup, salad, then the standard shrimp appetizer, veggies (while the meat/fish is cooking) and fried rice.  All lovely like a ballet.  No ballet at Osaka, more like breakdance on the D train in NYC.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 2, 'date': '2015-08-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'e7BK6PwjQxTw6TkvGRy03A', 'review_id': 'vVESrvKvWaLsEZiD6Kda_g', 'text': 'OMG! Go for raw fish appetizers! Everyone is super friendly and helpful. The finish the meal on the high note, get pineapple upside down cake', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-08-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mwFFIj5Nnogk44ihB5XgTg', 'review_id': 'fiUvuOohoPOaTfmQi9OkDw', 'text': "Best place to go to for lunch or dinner! They are so welcoming and great to customers, the bartender is wonderful and makes the best drinks. Overall it's mine and my husbands favorite place!", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-08-11', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'TpsZYNTXHF1quU_MBkBYrw', 'review_id': 'uJWEaujqSCssfeatxZc7-w', 'text': "Can't beat the happy hour prices!", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-08-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0dU0TTxkJ_Bul4sur5U2zQ', 'review_id': 'rClCLfwngjpYKD0CirRFpg', 'text': 'First, I am unhappy with the service as they forgot my drink. Second, the sushi took a long long time to come out. I had the sushi with eel, tuna, white fish and sweet shrimp. The only thing that tasted fresh was the yellowtail. Do not get the sushi shrimp...it was gooey to the touch and tasted unthawed. With all the great reviews I had really hoped for more. Do not think I will be back :(', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 2, 'date': '2015-08-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-Z2zjPiqxxLrV1KCRQLTiQ', 'review_id': 'ljA1C_n_8m_abeTGvwSoeQ', 'text': "We were disappointed based on the rating. I believe the ratings were based on the tepanyaki side of the restaurant. We had sushi only. The sweet shrimp, tuna and eel were not fresh. The service was poor, the bar staff was less than professional loudly talking about the woman at the bar. But bottom line...if your a big sushi only fan...i would avoid. I would've rated 2 stars, but the redeeming value was the prices were cheap for sushi.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 3, 'date': '2015-08-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DCaK8dcLcbku9eKUhrJmFw', 'review_id': 'MUc8oyRmcNo_v5oWBfT4Ig', 'text': "This was my first and it was awesome a little pricey but we didn't hold back either oh we will be back at least a few times a year because it was so worth it.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-08-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '9sG715oh32RubG2HhXXCTQ', 'review_id': '_b68qIXAneY76Pjynkw6fQ', 'text': 'Their happy hour is like no other. Great drink specials, amazing speciality rolls and tasty appetizers. Definitely recommend.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-08-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mwFFIj5Nnogk44ihB5XgTg', 'review_id': 'RRcVxKb8q1BNqY-fbxdCvg', 'text': 'As always I had an amazing experience I love coming here! Today was extremely busy but they still made it so pleasant for me!', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-08-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SMu2Qxy3yN8LXod_s366HA', 'review_id': 'LfVUXOPwoK9rulgo1hRiug', 'text': 'Had a great time with great food.  I will definitely go back for some sushi...just had the teppan this time. Scallops and the beef were great.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2015-08-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'iRrm79lV-OW2Plybl7H_bg', 'review_id': '-7VdeBEWJCWJxr9_yZMr5g', 'text': 'Staff is great, Jonathan is nice and professional. Highly recommend the Osaka quesadilla and mozzarella tempura. Atmosphere is intimate and quiet. Great for a date.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-08-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GeHBsEobnvuwEwB56UZ1Dg', 'review_id': 'Lt4CNsQMNadsp3p7XjsuxQ', 'text': 'Very good food.  After living in China and Japan for several years, I can always go here for very authentic food.\n\nThe down side is that many of their servers are not native english speakers.  This makes it easy for mistakes in orders to happen, which is fine.  My real problem is that they will not work with you to make it right.  They won\'t give you a discount, they won\'t give you a free appetizer, or a free coupon for next.  Just, "sorry, that\'s not what I heard you say."  Luckily this doesn\'t happen often and their food is still good.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2015-08-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'gU5U6yCv_kNglC2tWOWp7g', 'review_id': '3cnzsMMz9twmMB4CuMubkQ', 'text': 'New favorite sushi place! The rolls were amazing. Maybe could be a bit smaller (they were huge) but so delicious!', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-09-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'X_ovWIZyBnfGRQhO4vCH2g', 'review_id': 'INSkKPdBEqOwyOpvbI8zvg', 'text': 'Friendly, fast service. Everything came out delicious! We loved that you can choose to be seated at a booth rather than in front of the grill for teppanyaki.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-09-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1qpwPTK_w6G2auFUVhODtg', 'review_id': 'zpZChuTTTS81nn-yKwpm8g', 'text': 'The food was outstanding and the chef was very talented.  A great experience, will definitely be back!', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-09-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Y102_xYGCkKMPgNbyYJUAA', 'review_id': 'Hu__ueGcXsuq5-Pv7i3shg', 'text': 'Went during happy hour and it was slow.  Had a lot of staff but they were all eating and talking with one another. The service was terrible.  Seemed like they had no management or even cared. The food was good and once were helped food came out fairly quickly.  Took so long to get service but they had so many help doing nothing and having a good time. We would have ordered more but no one would take an order.  \nI would not go again cause of the service. If you want an easy job and free food I would try and get a job there', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 2, 'date': '2015-09-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0G7fYXlgNb5qz2mGa4venA', 'review_id': 'xZql19MGaRDFMG3wX1zy7g', 'text': "Best sushi ever! Very fresh and really beautiful display! Definitely won't be going anywhere else for sushi beside here anymore !!", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-09-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vCY-P9T8a6PeSKDkaTGNHg', 'review_id': '5FRH5YJUq-goS_sOiYKofw', 'text': "The food was ok, and we were never offered any silverware to eat our meal. We did have chopsticks, but  not everyone knows how to use them.\n The green tea icecream was phenomenal but I had to eat it with a fork. I'm not sure if this restaurant has spoons.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 3, 'date': '2015-09-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Usd3M54XuaW4rim8WDXfnA', 'review_id': 'Y15t8nVQldF5dgIujG34xA', 'text': 'Great food and service every time we go. Our fav for sushi is the Osaka Roll great presentation and absolutely delicious.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-09-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TvZkQUkNk-KBbrr6mpmWsA', 'review_id': '9_T8n9b0XJLKeaLa0uEoFQ', 'text': "The food here is absolutely delicious, and I have been angling to go back since experiencing it for the first time. We sat at one of the teppan tables with two other families. One family was a husband and wife; every time our chef pulled out his plastic bottle to squirt saki, the husband took it upon himself to set Olympic records on how long he could make the chef count and pour the saki down his throat. Pretty sure the restaurant lost money on their visit! Haha\n\nThe other family included two little girls. The chef pulled out his kid friendly version of the saki (apple juice), and everyone laughed as the older of the two girls tried to beat the husband's record on time. It was kind of a bonding experience.\n\nMeanwhile, I had the chicken and steak, which I thought was pretty safe for a first visit. I was NOT disappointed. The sauces provided were everything, I wanted to keep eating long after my plate was empty! And I could live on the fried rice forever. Our Tappan chef had awesome personality and almost always was able to fling food into the waiting, open mouths of the people beside us (I declined, as I usually don't need help wearing my food). ;)\n\nThe only downside is the obnoxious music when it's someone's birthday. They bring out parade faces that the birthday girl or boy dons over their own head. I would be so embarrassed over all the racket, and apparently there were a lot of people with birthdays at the restaurant when we were there. I cringed every time the music started blasting. But then I got distracted by the next round of food!", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2015-10-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BJiLuI4Uf2Xz7vtt4WA1KQ', 'review_id': 'p06zlkKA8st6A3QkyXSSjA', 'text': 'Went there again last week with my family everything was good only issue is that all those who ate sushi rolls got sick with a stomach issues!', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 3, 'date': '2015-10-05', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 2}, 'user_id': 'FDo6Ib06F0hzQ1ua03KVoA', 'review_id': '1RGHjSGTTwoEIXzxCZZrhg', 'text': "We celebrated my son's 31st birthday party here last night with some of our very close friends and the experience was amazing! The teppenyaki chef was very animated and prepared our food with the finest precision, the bartender Alex and our servers were all on point! All in all, our experience with the delicious cuisine, the ambience, the excellent customer service was something that needed to be commended!! It was so good, that we returned the very next day to be taken care of by our awesome server David. \n\nMost definitely, my friends, family and especially myself, will make this a required destination in the near future!", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-10-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wsz-9nkBdr1YNX7HKm6HEQ', 'review_id': 'r7Mce4yzH9CO6bNuJynVOg', 'text': "I've been coming here for over a year but haven't done a review. I don't normally do one but I have to because Tony, David and Alex are the very best! They go far and beyond to make you feel welcomed, and taken care of in every way! We love Osaka, however, these guys makes us pick this place every time  it's a special occasion or just regular days because of their outstanding service", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-10-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'r8l54TX2kCb8xpZsHYa_rA', 'review_id': 'YZgrDkAY27yej-zu5pmvOQ', 'text': 'Celebrated my birthday with my family tonight and we had a blast!  Food was delicious and the chef was really talented and entertaining!  always been a favorite of ours! Thank you!', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-10-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'GHScRZaE5zv6V6WlSBQLfA', 'review_id': 'FKh2BaXDgs11-JLxAqebuQ', 'text': "Came here to have dinner with the family. Our waiter is awfully nice but there does not seem to be enough wait staff to even give an average dining experience. Plenty of management standing around though. We had to ask the hostess / management for chopsticks, on another occasion for napkins and yet a third time for a menu. I am still here and bet I'll have to hit her up again. Food is average, dinning experience below average. Truly dissapointed.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 1, 'date': '2015-10-13', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 3}, 'user_id': 'wqwHih7XF1BPSdFyK1U-fw', 'review_id': 'PS671g0xKVmEwR6VnpTfZA', 'text': "This is mine and my colleagues fave HH spot! Their happy hour is awesome and the drinks are yumm ( at least the two kinds I have ordered ahha)\n\nBut yes! I've always wanted to try this place and finally tried and love it!\n\nHappy hour prices are pretty good and service is super friendly... It does take a while for my food to go out... Or am I just super impatient? Lol I am always starving when I come here..\n\nAnyways... Sushi is great and taste fresh.. Pretty good flavor.. Today I ordered Rainbow roll $6( my fave) and ocean roll $8 (yumm)! Inlove that their sushi rice is not super thick so I don't get super full.. I finished two rolls with no problem!\n\nI wanna try the other ones when I come back too... Maybe time to try their Vegas next time...\n\nThe drink I had today was yummy too and it was only 5 bucks! It's called Katana - coconut rum pineapple juice and melon liquer\n\nAnyways... I can't wait for the next get together here! \n\n\nDef gotta remember the checkin offer coz the pics on here makes it look bomb!!!\n\nFree ice cream at check in!", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2015-10-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'eYQRLJ5I9JaCWUbrJUAtzw', 'review_id': 'L0qw2G6lqIKWZTgEVmUbQw', 'text': u"If you're in search of teppanyaki and good entertainment, look no further! I would recommend calling ahead to make a reservation as this place fills up on the weekends. Osaka is a great place to celebrate a birthday or anniversary (whoa, that birthday song) and drink a ton of saki while doing it- you'll see what I mean when you arrive! The service is amazing and the teppanyaki chefs really know their knife and food throwing skills. I normally order the chicken and shrimp combination which is about $25. It comes with soup, salad, egg fried rice, vegetables and of course the meat. It's a ton of food so come hungry! I personally love their yum yum white sauce which is served on the side of every entr\xe9e. Definitely give this place a try!", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-10-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'C8hEYOAtTmppzhO8ftAUng', 'review_id': '5iIyCXo770COSuuixMet7Q', 'text': 'This is by far the best teppanyaki restaurant I have ever been to!!  Yelp has helped me find a hidden gem. The teppanyaki chef was OUTSTANDING. This review really can\'t put into words how entertaining that man was. He\'s throwing zucchini and making onion volcanoes in style! The food was great but the entertainment was even better. It\'s really cute for birthdays. They put a funny mask on your head and sing Happy Birthday super loud! Don\'t forget the sake. "More sake more happy!"', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-10-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'EqHLota09W3y0gF7KkH9ew', 'review_id': '6yMYUjtT0Eu3yzxXfoQoUw', 'text': 'Went here with a big group of girls for a bachelorette party. We had reservations, but were about 10 min late and found that our table had been given to another bach party. Go figure! No worries, we were patient and seated in 15 minutes on a busy Sat night. We were at the teppanyaki table and our chef was hilarious. I wish I could remember his name, because he had us all fired up, doing Sake shooters from across the grill! I ordered 2 sushi rolls--both delish. Food was definitely yummy, but again, our chef is what made our night and had everyone pumped. Nearby tables had birthday parties and they made the honored person wear a creepy dragon mask or boy/girl head and sang an Asian inspired Happy Birthday! The whole place was lively and the food was great. Loved it.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-11-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wBl40prH1tWmtvjtoPGcaA', 'review_id': '432ThqEfyigrqJRFniETdQ', 'text': 'Food is excellent. Service is okay. Make sure you check in to take advantage of the ice cream tempura check in offer. I had the pink flamingo roll and is was wonderful!', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2015-11-07', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'hdZ3rlgFXctCOUhzoOebvA', 'review_id': 'M6Ko66OL1QFI0ynJ30R7uw', 'text': "I've been to Benihana so I was expecting a similar experience and was totally blown away by the fact that I could order happy hour as well as nothing on teppenyaki menu if I didn't so desire. Plus they shoot Sake into your mouth if you want!! I did not want teppenyaki so I ordered 2 sushi rolls, the Fuji and the Crazy Roll both were delicious!  I also ordered the Jalapeno Poppers and the Pepper Ahi.  The pepper ahi was light and refreshing and really delicious with the ponzu.  But the Jalapeno Poppers were the shining star of my meal, I wanted something creamy and spicy and I was expecting what you normally get, the little balls of some sort of pepper and cream cheese, however these were actual jalapenos with cream cheese and crabbed plus fried, but since the jalapeno wasn't over cooked there was a nice crunchy fresh feeling to the whole meal, I haven't stopped talking about them since lunch on Saturday!  I can't wait to go get more! Then we finished it off with tempura ice cream, which is one of my favorite things!", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-11-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WONjXzGoURd_J-bGA6pbZA', 'review_id': 'bw2gLwGf9eonxWRJGfcchw', 'text': 'We come here all the time for happy hour. Great food and low prices and the servers are awesome!', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-11-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6Cj6w3y6WkLPh7YJ4u1QOg', 'review_id': '-Wi6m6t0F0SKwpb92Dp1JA', 'text': "We love going out to dine and when I find an excellent place to dine I want everyone to know, I've been here before and had great food in the past but until now the service had been somewhat slow.There has been a definite change in personnel and you can tell because, the customer service is definitely better and the new GM Chad even came over to our table to make sure we were being taken care of. The hibachi chef Sam was awesome & funny and the food was to die for, the bartender Daniel served up some fantastic drinks,and our waiter Michael was right there whenever we needed something, this is definitely going to be our new place and invite friends, so if you like good Asian food or sushi this is where to go. We had a wonderful time. Thanks guys !!! see ya soon.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-11-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'T32qe9HyxQQROrIYsZFFCQ', 'review_id': 'FVZETpF0_jwZqc-wxQEddQ', 'text': 'Always a good time when I bring the family to Osaka Tempenyaki ! My two children under 8 Years Old Love this place!', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-11-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VZ4aKgSThCDids8u-S6uXg', 'review_id': 'QnLnl-Hw_wxkrJQ5i4ydCQ', 'text': 'Had a fabulous meal at the cooking table. Beef melts in your mouth. Chicken flavor was perfect as well as the shrimp. The veggies were flavorful and excellent fried rice. What a fun meal, too. Our cook was entertaining as well as a great cook. I did order the free dessert and it was a large portion and very tasty. Lots of fun-one of our favorite places.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-11-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'Fn3LVa1VmUSriQ_Wy6HYIQ', 'review_id': 'psppD28t1qbivoIXlYb6-g', 'text': "Worst sushi I ever had! I literally didn't eat most of my sushi and didn't bother with a to-go box....it was that bad! Was in a large group doing teppanyaki. The group didn't seem to be wild about the food either. The drink\nI had was really good though. By the way the food wasn't cheap.....after 2 rolls, a drink, and the 18% included group gratuity, I was out $36 :/", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 2, 'date': '2015-12-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TgjrCy3E8dVzF8lqGVOAnQ', 'review_id': 'IfhJNMxS9kkHLLmyVdTnXg', 'text': "Addicted to sake Tuesday's! Great food on happy hour. We are weekly customers. Some awesome waiters will rock your socks! However, we have had a few AWFUL waiters too. Stick to the sushi bar if your waiter does not speak a lot of English, he puts in the wrong orders and demands tips before he gives you your card back.", 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 4, 'date': '2015-12-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'eWUm5IWvA8tXECoWZdjptQ', 'review_id': 'Ofh90nyqCEhNSve2zeh9gA', 'text': 'This is a a fantastic traditional sushi food place with all the fixings. Great bartender Alex and great food from teppanyaki to sushi, all fantastic.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-12-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tULLv1xkkG2jZcpAEC9GAw', 'review_id': '4DWwnQXSMuuhwJvOAiznOg', 'text': 'The food was splendid and fairly inexpensive for a good restaurant.\nWow!!! This place showed me what eating out was all about: great ambiance, amazing server, first class food. \nI ordered their squid salad and it came out in a huge bowl which the server gave me a heads up but forgot to mention how delicious it was which was great.\nI proceeded with a bowl of fried ice-cream desert and it just made my day complete.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-12-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BiNJmzSiJQkLWSjfAj2DAQ', 'review_id': 'QiMjA4PN7vWUCHzdw1k4Mw', 'text': 'We have been coming here for years for teppanyaki and sushi roles and have always had great food, entertainment, and overall experience.  The teppanyaki tables are fun for the whole family and you are certain to hear the drums for birthday celebrations.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-12-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JiBLS1AvXTKpkwWeCFycuA', 'review_id': 'YjRcSCj0-vBFbUjze7z2bg', 'text': 'Our first time here and we were thoroughly impressed. Great service and atmosphere. Very reasonably priced food and drinks. Oyster shooters are a must. No complaints. Everything was great. The Pineapple Upside Down Cake is delicious! We will definitely be back.', 'business_id': 'FX7YsjrfxXkat82yoj9Aeg', 'stars': 5, 'date': '2015-12-18', 'type': 'review'}
