{'votes': {'funny': 3, 'useful': 3, 'cool': 3}, 'user_id': 'TQ5eVGOFr_qB5_BbEd3Sow', 'review_id': '473T0oDGUlvgPKY-zevXTg', 'text': u'Woo-hoo!  They\'re open!  Now I can get my Detroit food fix in Arizona!\n\nFirst thing you see when you walk in is the decor and employees are all in Detroit colors, orange and blue.  You can buy the t-shirts too I think.  The menu is pretty simple, burgers and dogs. Pita sandwiches and salads, fries, chips and drinks.  They have several flavors of Faygo soda pop for $2.25 and bags of Better Made Potato Chips.  There is no Sanders Hot Fudge or ice cream of any kind.  No desserts that I saw at all.\n\nI ordered the regular Coney Dog, $3.95 which came with Chili and onions, an order of the hand cut French fries to split, and Faygo ("Which way diddee go!?") Root Beer.  My daughter got a Breaded Chicken Tenderloin "Hani" Pita Sandwich and also a root beer.  The minute I bit into a French fry and tasted how delicious it was, I walked up to the counter, told the guy, "I\'m not sharing those so we\'d better get another order!". They tasted like my Mother\'s homemade ones!\n\n The Coney Dog looked a little small on first view, but I bit into the hot dog and it almost audibly popped! Scrumptious juices exuded from it.  This is no ordinary hot dog.  Warning: It\'s messy.  \n\nThe root beer bottle was kind of tepid, not ice cold, maybe just because they had such a rush of business on Opening Day that they couldn\'t keep up with the demand? I took my water glass, filled with ice and poured the drink over it, solving the problem.  \n\nThe owner is very nice.  He and all the employees are all from various parts of Michigan.  I\'m from Livonia, suburb of Detroit, myself.  I had heard about this Grand Opening at another Detroit themed place, Sunshine Motor City Cafe, and I think it is great that we ex-Michiganders have more than one place now to go get that back-home feeling, even if it is 113\xb0 outside!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2013-08-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'kp-acDKLSeC6h4nPjcaLpw', 'review_id': 'ngOB-S30IACimmUuyLNVhA', 'text': 'My dad and I were highly anticipating the opening of this place, and we were not disappointed!\n\nI would say 4 stars for the food, and the extra star is the way they nail the Detroit nostalgia factor - they carry tons of Faygo and Better Made Chips! Yes please!\n\nAs any brand new place (they opened today) they have a few kinks to work out but the customers were pleased and the employees were enthusiastic, so consider my dad and I some of their first regulars. We can only make it back to Michigan so often, and this place will help keep us satiated in between visits.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-08-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'd0sCE2oufgdNtfqmPey28g', 'review_id': 'rOaj3wKMIQKc5ad_boBcfw', 'text': 'Great Coneys hand cut fries on site. They have a good Greek Salad it would have been great with a few slices of pickled beets and a half of Pita. \nReally enjoyed the coneys and the dogs that snap!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2013-08-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': '8-2W5CmkDl9vrkxRpkiPRg', 'review_id': 'kBKktiGNpp3srPu-5jqByw', 'text': "Damn good burgers, freshly-ground beef every day, damn good dogs, and Faygo. If you're missing your Coney fix, these guys are doing it right. The fries are great, the food is fast, and everyone is extremely nice, even on the crazed opening day we came in for the tail end of. Do yourself a favor and swing on by.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2013-09-02', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'z95JqrEgmC6_4hXsMgkwGg', 'review_id': '_pdYpWHNDCFYd0UA5wpyIQ', 'text': 'I went today with my co-worker from Walgreens. We both enjoyed the food and the prices. I felt like I was back in the "D". \nIt\'s wasn\'t crowded. The atmosphere was nice and cozy. Thank you for opening less then 3 minutes from me. Thank you for bringing Detroit to Arizona.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-09-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': '68sf6hDqko8gb_bRh7KsVA', 'review_id': '0C8Z-IGaMQJFyJ5GpA2R7Q', 'text': "I was waiting for this a long time! Coney fixes on Christmas Eve whilst visiting family doesn't  always fit into the plans. The food is just like coney back home. Location and decor is great too. The owner is super friendly and excited to share a Detroit fave with Phoenix! Must try =)", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-09-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jkdBnYeVyWj1cU8_MJ2qWA', 'review_id': '7L760Mgayc5HTw71EjpFHQ', 'text': 'Finally Detroit in AZ! Loved it!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-09-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'ofPkm7BTBJeaD0OkmZNdNQ', 'review_id': 'D_Xkxmv61m43WkVsNQGd0w', 'text': "Great coneys! Chili , mustard and onion - just the way I like 'em. Very friendly staff. The fries were great also. Will definitely return.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2013-09-04', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 4}, 'user_id': 'rL3dPeKDTybG_ct9OCXGAA', 'review_id': '76pBmihex8h5e1QyoCPIew', 'text': u"Move over Ted's there's a new Hot Dog institution in town! This place is the real deal for a genuine Coney Dog. Detroit Coney Grill  is seriously  a direct vortex to Detroit. My husband is from Highland Park and he couldn't stop raving about this place and how much it reminded him of home. Although this place is newly opened they already have a devout following compliments of all the Midwest implants that miss Coney Dogs. I love that the kitchen is open and you can see the employees prepare the meals freshly in front of you. They also offer freshly cut fries, burger, gyros, and salads. On good days you can even get a Faygo Pop and Better Made Chips create  an authentic Detroit experience. The restaurant itself is a little small and warm but you'll enjoy all the Detroit d\xe9cor and the friendly staff. This place will absolutely be a part of my lunch time rotation!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2013-09-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fVmt0x2llYDYB13ihv3Ztg', 'review_id': 'j1uUZkzY68wfB3fOGqtvwg', 'text': 'Amazing!!! I felt like I was back at home. Only place besides Detroit that got the chili and the ranch right!\n-Scottsdale', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-09-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'qeCFgOo8kOhd7c_Hp8qlxg', 'review_id': '6WohI_fJAGXu2o64ditEAA', 'text': "Best coney and cheese fries I've ever had!! Fries are made from fresh potatoes. \n\nExcellent service!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-09-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'i4L1PGfYS1kX4MQPINkk1Q', 'review_id': '8AUYHv6mkAr9ijZDHBFypg', 'text': 'AWESOME......No other Coney place will come close to Detroit Coney Grill....Everyone can say they are like Lafayette or American but they are no where close. This place tops them all. The only thing I would change is the location......Bring it North David!!!  We will see you soon....cannot wait to cater my first "coney party" with Faygo and  all.  Good Luck and we know you will be successful!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-09-08', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 6, 'cool': 6}, 'user_id': 'KcI2VGSvRhLAmw6vZrc8WQ', 'review_id': '_Sx27D3_vAj2WdDDESjLpA', 'text': "My fellow Michiganders,\nRun, don't walk.  This place nailed it on the head.  It was a simple formula that no other Coney in this state was able to do.  Take everything that people want from a Michigan Coney Island and mirror it here in the desert.\n\nThe coney dog and baby greek were spot on.  If I closed my eyes, I would think I was back in Michigan.\n\nKudos Detroit Coney.  This place makes me homesick.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-09-12', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'ia1wcMHWZWZu2ZArB98jwA', 'review_id': 'OogKRzdHfljwjdB9OTaQZA', 'text': 'This is the real deal! I won\'t even say this is the most authentic Coney Island in the valley, this is Detroit Coneys. The way everything tastes, looks, I\'m back in the "D" every time I go there. If you\'re from Michigan or enjoy a good coney dog, this is the place you need to be. Make sure you grab a Faygo pop and a bag of Better Made chips on your way out!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-09-12', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': 'Q90fH3zVaxRyXBTdFCJtOA', 'review_id': 'Uf1VtTVqjLIC__e0BmSM_w', 'text': "Temporary fix for a Midwest staple. I've been here in Arizona for a little over 5 years . Moving from Detroit I stayed eating at a Coney Island at least one meal of the day. So when I heard of the Detroit coney grill I was very excited, an to find out that they were getting their chilli from one of the best if not oldest coneys in Detroit, made it Mir appealing. When I told my wife that there was a coney in the valley we decided to check it out. When we made if to the location I knew I was in the right place. Several people leaving the place with their Detroit tigers fitted I felt at home for a quick second. The vibe inside was nice, some photos on the wall of certain Michigan team an a few other things Detroit. So now we get to the food which is really the reason that we came. Unlike most of the other people who have given reviews I was somewhat unimpressed by the menu as well as pricing an hours. Understand this, I am Detroit in every way shape an form. I've said on many occasions that if there were a coney out here that was exactly how we have them back home you would have a winner. Although the food is nice here, it's menu is missing so much that would make this a great place to go. I don't want to just go to a spot because its reminds me somewhat of home. And I think that this is what's happening with this place. So many people from Michigan have moved out here to the valley that anytime that you hear of anything from home you want to check it out. Coneys are a 24/7 grill with sooooo much to choose from on the menu you sometimes stand at the counter trying hard to make a decision on what to get. Burgers an coney fries are nice however just a scratch of the surface. And 2 bucks for a faygo is highway robbery, especially when you can go to certain qts or circle k's an get a 20 oz for 1 buck. The guy told us that they charge that much because it cost so much to send them out here. I know some may see this as a raggin rant, however it's not. In order to stand the test of time with a business you have to look at everything your patrons are saying an try to make adjustments. If not that same thing can turn around and bite you. Hopefully this is just a start to a great establishment in the valley. I'll be back to see if anything has changed. #whatupdoe", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 2, 'date': '2013-09-15', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 4, 'cool': 4}, 'user_id': 'Cp-PV8rsypbO-xBrQ6KmQg', 'review_id': 'jqCxG9UqVJeg-nwHy2cpPQ', 'text': "Best thing to come out of Detroit since Robocop.\n\nThis new fast-casual burger and dog joint looks like it might as well be a seasoned chain, but it's a new concept in a formerly failing strip. This and the neighboring restaurant, Hummus Xpress, have resurrected this location from the dead. \n\nThe food here is fantastic. Everything seems fresh and high quality. Even though the prices are fast-food low, you're definitely getting a lot of bang for your buck. The owner is pretty nice and has a lot of experience running local restaurants. He's usually there and he is very proud (as he should be) of his place and happy to tell you all about what you're eating and how they grind their own meat for the burger patties. That's always a good sign for me - an owner and staff who give a shit about their restaurant. \n\nI ate a double cheeseburger with bacon and avocado and paired it with some curly fries. It was one of the best burgers I've had in the Valley. If you're a big fan of In and Out Burger or Five Guys, you should really give this place a try because it's not only better, it blows those places away. You can get your burger topped with just about whatever you want, and after you order you can watch them disassemble a whole potato and toss it in some hot oil for you. \n\nDon't be intimidated or discouraged if you see a long line out the door at lunchtime because it moves really fast, and the register is up near the door so that's gonna happen. Rumor has it that they might start offering delivery soon after lunch. Makes me wish I lived a little closer. With the kind of detail and thought that went into this concept, they might have plans to open more locations eventually - looking forward to that.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-09-19', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'rFQdUe00LLZA2XljnyYX6g', 'review_id': '43pndhwHQ2rmGSaWhyo1nA', 'text': 'Finally! Detroit coneys in the desert!\n\nThis is the real deal! The chili is perfect and, my favorite, the hani was simply perfect! Thank goodness I only work 5 minutes from this place because I would be making at least a weekly trip here if not! \n\nThe opening of this restaurant might save me a couple trips a year back to the Mitten state! Woot woot! \n\nDetroit food and drinks = A happy Michigander!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-09-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '56Las15AH8xzwyybjUSE5A', 'review_id': 'qEdz5qXvmm8vxhwkwCCeLg', 'text': 'I am from Detroit and these hot dogs are the real thing.  I was so excited and have been back twice.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-09-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 4}, 'user_id': 'ijtFKeUCD0x9O2H98zSz0g', 'review_id': 'WoRdfE138I0nyepY3BH8EQ', 'text': "UNLESS you are in Michigan, you cannot get the TRUE Michigan Coney Island experience and flavored.....EXCEPT FOR DETROIT CONEY ISLAND IN TEMPE, AZ!  This place IS the real deal.....\n\nThe chili is absolutely authentic Michigan coney island recipe chili....the one you crave if you lived in Michigan and relocated....realizing they don't make it anywhere else likely they do in Michigan.  It's a state signature!  \n\nDave and his team have brought AZ an amazing restaurant where the Greek salad,  coneys, chili, pitas and service are excellent.  \n\nIf you aren't from Michigan, but want to see what the hype is about...try this place out.  It's delicious, sparkling clean, and has great service.  We have tried the other coney islands in the valley....and none of them even get close to the real deals when it comes to matching the flavor and texture of a Michigan Coney Island chili like this place does.  They make it from scratch daily.....so awesome!  We will be back!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-09-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TufpzAnIO8WWCLfTJOZ5sw', 'review_id': 'FQnTgAUEVrglVMoSm3wPjw', 'text': 'If you know what real coneys should taste like this is the place to hit hands down. They have everything you would get in a coney from Detroit from faygo pop to better made chips.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-09-28', 'type': 'review'}
{'votes': {'funny': 5, 'useful': 5, 'cool': 4}, 'user_id': 'L5ydEYqAt96RShDIrq6ocQ', 'review_id': 'rEytsXA-d5CqpsLo8EJlMA', 'text': "So happy that this place opened. I'm almost embarrassed to admit how much I've missed hanis since I moved here from MI 5 years ago.  My husband and I got the hanis, chili dog and chili cheese fries with Rock & Rye obviously!  Everything was just how we remembered it to be.  Oh and BTW  to all the cheapy reviewers I could not care less if they charge $2.50 for a Faygo.  If you can't afford $2.50 then you shouldn't be going out to eat in the first place, this isn't a soup kitchen it's a restaurant if you don't want to pay the price drink water, kay?\n\nThe owner and his staff are super nice and all from MI - I would expect nothing less.  If you are from MI and miss the Coney Island staples check this place out you won't be disappointed...if you're not then try it for the first time, it's worth it.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-09-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 4, 'cool': 4}, 'user_id': '394ECIL6M0w8S-nJypi7Kg', 'review_id': 'wyAlTqwRALQvGkeN9ykuyA', 'text': "Yummy! Yummy! Highly recommended.\n\nThe decor is fun and lively. The owner is friendly. I'm from Chicago so this is my first taste of a coney...delicious.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-09-30', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'yhZxCcGyhltqsJN6foL_Wg', 'review_id': 'K5gLxG6NIaWakaRFmD5lBw', 'text': "This place gets an extra star because the inside was so CLEAN!  Other than that we were rather unimpressed.  The food was pretty good, but the portions were all pretty small; the chili tasted great but the fresh cut fries weren't cooked enough and were pretty mushy.  I'll probably come back sometime to support a local business but I don't get the rave reviews.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 3, 'date': '2013-10-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Pu8H7JymTuBmro0ciEFP2g', 'review_id': 'Lgfg5aPGVW4uxMMyhKMtKA', 'text': "I'm from Michigan and they definitely nailed it for me. The loose was not up to my standard, but overall was happy and excited. Can't wait to visit again to try out the other items on the menu.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2013-10-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xsq2uST0rhcCz30k94bCaw', 'review_id': 'Sg_75xMmBAPQkIUYItQrqA', 'text': "First time here at Detroit Coney Grill. Here's my review.....\n\nService: 5/5 the staff is VERY friendly and accommodating, everyone went out of their way to greet us and make us feel welcomed. (:\n\nFood: 4/5 my mom got the gyro and I got a coney no onion, and we shared fries. The hotdog really does have a great snap to it. Fries are hand cut and fresh. \n\nGreat neighborhood spot, will come back again.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-10-07', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'A2DzTQjzBCqud_cTPEGTrQ', 'review_id': 'IK3CMvNoNetiVhiKM7QMvQ', 'text': "I've been living in Phoenix for 18 years. That means I've spent 18 years having coney withdrawal. Finally, Arizona has the real deal. If you are from Detroit you have to come here. I've been here 3 times. It's been great every time. If you aren't from Detroit you should still check it out. Have a type of hot dog that is different (and better) than any dog in your life.  And rumor has it that the burgers are very good too but I cannot confirm as I haven't tried it yet. \n\nJust one complaint: time to add MSU photos to offset those UGLY UofM photos on the walls.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-10-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'WdpjLmfyOOZ8Az11WBPqkA', 'review_id': 'ZUuKN2D_mGV5dHEX5u1Jig', 'text': 'Decent coney dogs, friendly service. Hand cut fries a bit undercooked but overall very satisfied.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2013-10-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 2}, 'user_id': 'gg_OKjOAl_vVmdh5ZETuiw', 'review_id': 'ErBjbfSJUAbFfUUVtTcm4g', 'text': 'There is a sign by the cash register.  It reads, essentially, as follows: "If you order a SODA, we\'ll give you a POP."\n\nAt this point I knew I was in good company.  Ordered two Detroit Coney Dogs, fresh cut fries and a Faygo Root Beer.  Pure Michigan right there.  The dogs were first class.  Meat was quality and the chili top notch.  The hefty batch of fresh cut fries made for the perfect side and, needless to say, Faygo delivered with their quality root beer.  \n\nIf you\'re a Michigan transplant, this is the place for you.  Even if you have to travel a bit.  A taste from home is well worth it.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2013-10-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nz0Q5d4fOJY2tosqLPmxeA', 'review_id': 'WhOzMPw_CWtUxouPFs2Zyg', 'text': "I am a west coast girl through and through despite having ridiculous amounts of mid-western influence in my life. Many friends and family members from Michigan always talk about Coney Island this, Coney dog that and let's get a pop. When I saw Detroit Coney Grill the other day I grabbed a friend from Detroit to find out just how authentic this place is.\n\nApparently, it is the real deal. From the Coney Dogs to fresh cut fries to Faygo (which way did he go, which way did he go...) to the Hani the food was pure Detroit. The decor is simple and fun. The owner and the entire staff are great. I will definitely be going back with my Detroit born and raised step-Mom in tow. She's gonna love this place!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2013-10-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'EgmVpe6GpB_gR8iVJbWSjQ', 'review_id': '2zb1ggLYBmNHKLzlb4vZCg', 'text': "My husband grew up in the Detroit area and we were back at American Coney (Detroit, MI) two weeks ago.  Back home in AZ, we discovered Detroit Coney Grill and LOVED it! A bit pricey but well worth it because they have to fly in the good snap dogs. The hand cut fries are delicious! We'll be back over and over.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-10-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'M4OiteFtJQX2WyYGA0lq6Q', 'review_id': '1meStOnJfuoZpnJhDuSohg', 'text': "It's so nice to have some of my favorite foods brought to AZ! I loved the burger and the owner is so friendly, it's great to see him interact so enthusiastically with his customers about the food.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-10-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'clERuF_8Jck0Y1KNd0aTDA', 'review_id': '7Dshn0gO92yv2NA2i-raEQ', 'text': 'I drove 30 miles to try this place for the first time. The decor is minimal but celebrates the Motor City. I had 3 Coney Islands and Faygo Rock & Rye and Vanilla Creme Soda. Very good meal and I would highly recommend it for Phoenicians who need a taste of Motown', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-10-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '99LIm2vc71Bd8ztF8psZbQ', 'review_id': 'UMRMZtiVX2Aprfug8dgh2A', 'text': "Can't tell you how long I have waited to have a Hani and a coney in AZ. Well folks the time is now. Great atmosphere, good people and food that reminds me of home. Do yourself a favor and visit Detroit Coney grill. You won't be disappointed!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-10-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DdBeY4oC6dbnckEjtRZiRg', 'review_id': 'WBYjG1l3LiphLy8dkib2TA', 'text': "Overall the food is good but I am actually from Detroit and they're prices are not like this. I mean 3.95 for a coney? That's crazy high! The coney island my family goes to in detroit has coneys for 1.85 and on Wednesdays its 99 cent! The fries are a very small size and the last time I went, the chili cheese fries were salty. Really? Salt on fries that's gonna be under chili and cheese. And SAVE YOUR MONEY ON THE FAYGO! Their faygo is like the old time Coca-Cola bottles and their like $3. Here's a tip: faygo is at ajs fine foods and QT! Again good food, crappy hours and prices", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 3, 'date': '2013-10-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 5, 'cool': 4}, 'user_id': 'ca2Sa9Enqg2GlWFQ95p8bw', 'review_id': 'guJXKLrZo26HTxQBkUe7GQ', 'text': "Finally an AUTHENTIC Detroit CONEY restaurant in Arizona.  \n\nAfter I left Michigan back in 2005, I thought that I would never have this experience ever again, unless I went home to visit.  But Detroit Coney brought the actual Coney experience to me....and I couldn't be happier.  The Hani is exactly how I remember it...and the chili is the real thing!  (I may be wrong, but I think they ship it in from Detroit....) \n\nThe best part, besides the food....is that I am with all of my Michigan peeps when I am there.  There is always somebody to gossip with about Michigan....and in the end it comes to be known that we either know each other or we know the same people.  It is so much fun.\n\nDo NOT go to any other places in AZ that claim to be a Coney Restaurant.  They aren't.  You need the Middle Eastern flair along with it, btw.  And bring your non-MI friends....they will thank you forever for it.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-10-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'RYeDxozTmLDcmTjNnb0pOA', 'review_id': 'ySseDSyF9UkivbjpMbdi_g', 'text': 'Wow best coney and loose since I was in Detroit, maybe better!\nOwner Dave is very nice guy!\nAnd yes I got a faygo POP!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-10-29', 'type': 'review'}
{'votes': {'funny': 5, 'useful': 7, 'cool': 8}, 'user_id': 'ky9pQ8AKufvZ63IxR41jGg', 'review_id': '3r5tq3W4N10o0CeyanbNNg', 'text': "Well the name of this establishment says it all for me. Detroit Coney Grill is awesome and the owner Dave is the TRUTH......wohoooo. The wife and I went here for lunch this past Monday and when I walked in I IMMEDIATELY loved the place. Dave was wearing a Detroit Lions shirt.....another staff member was wearing a Tigers Visor.....and we showed some mad love to each other over that thrilling comeback by the Lions over the Dallas Cowgirls.\n\nEnough about that though let me talk about the food.....first of all since I don't eat red meat.....I decided to try there buffalo chicken pita. Let me tell you people it was the BEST buffalo chicken I have EVER tasted. I mean it was soooooo goood because they use Franks Hot Sauce and that makes all the difference in the world. Now for those of you who haven't spent anytime in the Midwest there are 3 things you must try if you ever visit that part of the country.\n\nFranks Hot Sauce\nBetter Made Potato Chips\nFaygo Soda Pop\n\nThey sell all of these items at the Detroit Coney Grill.....I was truly in heaven on Earth. This is establishment has been open for only a couple of months.....but I am really hoping Dave can get a spot open over here in the East Valley. So I need all of my fellow yelpers to pay Dave a visit in Tempe.....enjoy the food.....even if your not a Detroit sports fan.....LOL!!!! Then get your fannies back here on YELP and show Dave and the Detroit Coney Grill some love so we can get one here in the East Valley......wohooooo!!!! Eat, Drink, and be Merry my Friends!!!!!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-10-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'HEyYvBKddyqxedIuFVVDng', 'review_id': 'zud75Ey-tpdPvtyg_HTc3g', 'text': 'Found this original Detroit style coney island, its just like Home the best anywhere in az. It taste just like being back in detroit at the coney islands, its a must have, must go if you are from Michigan!!! Friendly owner and staff they make like your back in detroit!!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-11-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'InkNJVQvpj7NKvB8KjPVew', 'review_id': 'tNirqvh-mjUzd_vsN8HXeg', 'text': 'Best place ever! If u really like the foods, come here. If u like Detroit, come here!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-11-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'h8ciV92vcuqB3tET_qcNCA', 'review_id': 'L8ZVVofM-JGL08X2Z3NCbg', 'text': 'Best chili dog in Phoenix. Products are flown in from Detroit with exception of fresh cut potatoes and Faygo!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-11-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Kn7U1ADT7cr5DhPUonrEqw', 'review_id': '9nR0zZJ0vSfQpmpRiKSbog', 'text': "So you're from Detroit and you want a coney. This is the only place to go. \n  Fresh ground beef, house made chili... That oh-so-important snap of the dog.  It's all here. \n\n  It's worth the drive, no doubt about it. We will gladly make the drive from east Mesa again and again! \n\n Oh, glass bottle Faygo and Better Made chips are icing on the cake.  You interested be disappointed!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-11-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '6mCkz3xIaG9xI7D-GQaHow', 'review_id': 'Lw6h9D30pyE904IHfWflhQ', 'text': "I'm lucky enough to work near the strip mall where this place is located and the food is fantastic! Not only is everything on their menu great, it's fresh and the staff is super friendly and it's always a pleasure stopping in for lunch.. Try the Rib Eye Philly Cheese-steak, I promise it will not disappoint! Their coney's are no joke either, if you love coney's then this is the place for you... I come here for lunch around three times a week, which considering there's 5 days in a work week - that's a lot!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-11-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'sEoL31H8R4YcLI6SlimPUw', 'review_id': 'UDyKewGBELL25UBHEEOeoQ', 'text': 'I just want to say first time tonight and the food was awesome!! Sure did miss faygo pop so nice treat to be able to get that.we drove from mesa to try the detroit coney that we have been craving kudos to you!!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-11-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '5bp3yypTJHYhxEATTql2QQ', 'review_id': 'T8IUn7QjZA3epgaIaH1Z4w', 'text': "Growing up in Detroit's I would go to a Coney Island a few times a month. Having lived in Arizona for 20 years I've never been able to find an authentic Coney Island hot dog until yesterday. Both my wife and I said after taking our first few bites this is exactly how I remember it. Hot dog, the chili, the atmosphere it's like being in downtown Detroit all over again", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-11-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'A809MXzzzalEYsY_aFp5Ww', 'review_id': 'OI93jYY81LuFJSM6NnOH_g', 'text': "AMAZING!!! I love this place! Great food,great people,great experience! I love the food here, it reminds me of home so much! The workers here are so courteous and offer a very warm welcoming. Of course the food is great and you get a lot for your money that's for sure! I LOVE THIS PLACE!!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-11-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '0GwRFle4LHeYXVNZjQwq5Q', 'review_id': '6Hhbu9nhjm2zOspF5CKnBg', 'text': 'Being from back east, myself Chi-town and my husband Detroit, this was a must try for us.  We met my Father in Law there last night for dinner (he is also a Detroit native)  \n\nThe food was great!  I had a Detroit Loose meat sandwich, my husband had the Coney with Chili Cheese fries, they even cooked 2 all beefs special for my 4 year olds as the Snap may have been a bit much for them. \n\nI was super impressed with everything we had.  Look forward to going back again and trying some other menu items.  \n\nWould love to see a location open on the East side, Mesa, Gilbert, area.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-11-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CQryHf1KswuucpFKzsw7Xg', 'review_id': '91c73wk4bPUXgOrk7bMjXA', 'text': 'I work very close to Detroit Coney Grill.  When driving to find a place to eat one day on my lunch I saw the sign that DCG was opening soon (I even went up to the window to see how far along the construction was to gauge to timing).  I waited with anticipation and the day finally arrived.  I took some of my co-workers with me because they did not even know what a coney was.  Being from the Detroit area myself, I had come to appreciate the finer things in life, such as a true Detroit-style coney.  Needless to say my co-workers were very impressed and simply loved my little slice of home.  DCG not only serves the authentic Detroit Coney experience with the hot dog/coney and hand cut fries, but you can also feast on Better Made chips and wash it down with "real sugar cane" Faygo POP. Great food and staff make eating at Detroit Coney Grill the highlight of my work week.  Thank you to the owner who finally stepped up and brought a "real coney" to Arizona.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-11-27', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'AUJZssKWjikUA26BvacqUg', 'review_id': 'zOc7CeZ8yGwQNfa9e51NAQ', 'text': 'If you are from Detroit, you don\'t really need the reviews.  Just go.  It\'s the real deal.  I\'ve been here since 1996, don\'t really care to go back to Detroit but there are some things I miss.  Well, there is one thing I don\'t miss anymore because I don\'t have to. WOW!  Detroit Coney Grill has done what so many others have tried and failed so miserably at.  Even the other so called "Coney" places in town that are open currently...not even close. Not even in the same ball park.  It\'s like comparing food from Ram\'s Horn to Machus Red Fox.  Detroit Coney Grill is that much better than the others.\nFaygo Rock & Rye was like the sweet nectar of the gods.  I might become an addict.  Forgotten how a good pop can be!\n  \nI\'m out in East Mesa; Ellsworth & Baseline. I sure wish there was one out this way, but I\'ll drive to Tempe with no complaints for this.  \nGO WINGS!!!!!!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-11-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yAIllEXFRu4crVBhS6MoFA', 'review_id': '3rbu7LsgaZs8yoBkEBnSUw', 'text': 'Exactly like the Detroit experience! Enjoyed the food and excited about the restaurant being in Tempe!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-12-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'ROvUlk_hA1fp41gIrKkpQA', 'review_id': 'hyW2A-0eZnZCdxVqSjB-1w', 'text': 'So lucky to have a place like this in Arizona, not only should people familiar with the coneys from Detroit visit this place but people all across Arizona should come give it a try. I know the owner is now catering events which I know would be a big hit with even the toughest critic. This place will make you think very differently about what a Chili Dog should taste like which will keep you coming back over and over again. Looking forward to watching this concept grow in Arizona.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-12-03', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 3}, 'user_id': '-cYIVD0EJgv_-0omxXOZlw', 'review_id': 'SnV7i8SH9pWFdSMz6dEIHA', 'text': 'One word....LEGIT!!!! Being a Detroit native I had my doubts about how "authentic" this place would be. However it tasted, looked and smelled like home :) This place is the only place that has authentic Detroit style coneys in the Phoenix area. Other places in the area advertise Detroit style coneys but don\'t even come close (many use hormel chili and skinless hot dogs....yuck)!!! This place is the real deal and even get their products shipped in from Detroit!! The owner is a super nice guy and came out and talked to us for a few minutes! So if you\'re looking for a REAL Detroit style coney look no further this place is the real deal!!!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-12-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '8T0evnkvRaTomru7ghPGeg', 'review_id': 'nQl4Srqz-wDcNHAaf3VHKQ', 'text': "First the quality of the dog was pretty good...probably one of the best I've come across recently.\n\nThe chili was ok...not great, not bad.\n\nLike many places that cook fresh cut fries they're just a tad underdone.  There's a right way to do it (pre cook and then a final cook) and the not right way...this place like most others opt for the not right way.\n\nOrdered the fries as chili cheese fries.  The cheese was that cheese like substance that you get at the movies...not good.\n\nOverall good, but improvements are in order.  With all of the above I'd still go back, albeit no fries.\n\nUPDATE 12/5/13 -- I've been told that there are different cheese selections for the chili cheese fries other that the liquid type (shredded and sliced).  That information makes a big difference (in my mind) in the quality of chili cheese fries.  That piece of information warrants an upgrade from a 3 star to a 4 star (they were on the border before, but help doesn't go in half point increments).", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2013-12-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '5kIo1qYtTVQzzABCkm32xA', 'review_id': 'nA1asCjMusIMen184brsUA', 'text': 'I have tried almost everything on the Menu and I have not been disappointed.  I never visited the state of Michigan, but if this store comes close to the taste the state has to offer, I might have to pay me a visit up there.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-12-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9qPCjPazvJB4CWK_ZqaEhQ', 'review_id': '7Wk4Yno5RLLxweReNXiszw', 'text': "This place is awesome! Not only do they check in on you to see how you like your food but also engaged in conversation about Detroit. So my mom, my boyfriend and I went here after we saw it when we went to Hummus Express (which is also great). My mom got the coney combo and Cajun fries (says they are really spicy just to warn ya), I got the loose burger which is a burger that's kinda in the witness protection program as a hot dog and it was super juicy and delicious. My boyfriend got the quad burger which he polished off pretty easily without complaint (picture included in my check in) he was so happy that he got to build it himself basically.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-12-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WybEyEqCOqC6Kayau_wGOQ', 'review_id': 'RkBj-ZQpP9Brwp-aW-V8OQ', 'text': 'This place is the real deal for coneys.  Best in AZ and in a blind taste test I bet you\'d have trouble telling which chili was "made in Detroit" and which was made in Tempe.  Even better they do not short you on the chili.  They provide enough to where it overflows just a little bit with each bite.  Additionally, they also give an ample amount of chili on the chili fries so that you don\'t have all the ones on the bottom without chili.  \n\nMy only complaint, if you can even call it that, were the fries themselve were not exactly like you\'d get at a coney in Detroit.  This is not to say they are not good...because they are very tasty...they are just different.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-12-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'd0sCE2oufgdNtfqmPey28g', 'review_id': 'ksc8nUKbUkxZl-6Q1e8Exw', 'text': 'Yay Detroit Coney Grill listens to their customers! Sliced beets on the Greek Salads! Great service great food!!!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-12-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SJ3-cO8CtVZeUQ7v9reAeA', 'review_id': 'fNUUmIwaD2Wjx45O0cJW5w', 'text': 'Found Detroit Coney while attending an offsite training in Tempe. Amazing food and management!!  We need one in North Scottsdale, specifically by Frank Lloyd Wright and the 101 :)', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-12-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'DXWzfsWOiF6RN7cgNrdLsg', 'review_id': 'j3TMKVNbjGtrW4H7lSQ33A', 'text': "My god why did it take me so long to find this place? With all the flavors of Detroit this is just like being back home. I love it! Stopped and got a Coney after I had already eaten because there was no way that I was going to let this opportunity pass me by. I ordered a coney and a Faygo rock-n-rye. It tasted just like I had ordered from duly's on w Vernor and junction. A true taste of Detroit indeed. Definitely going back for more. It's a must for true Detroiters wanting that true Detroit taste. The best part was meeting the owner and finding your he knew my neighborhood in southwest Detroit. I will be supporting this spot for years to come!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-12-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZB8FeGAI9jrMkyK2_cAdaw', 'review_id': 'qeB2d9F8oyh1bKPG6T_ZuA', 'text': 'Just moved here from Michigan a great find from my home state. Great people, great food, and great weather what else can you ask for???', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-12-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QCNrH5twOB44p8FFKonhLg', 'review_id': 'MBi9sElAMenoglyWaQBxPA', 'text': 'Great Detroit Coney. They have vernors, faygo, better made chips, home away from home. Its worth the drive. Chilli dogs are the best.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-12-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': '0kJsDgpDaFF6nRrMXH-hOw', 'review_id': '4KEkJzPBLFAe-UPRcCW6Iw', 'text': 'Now that I can get an authentic Hani in Arizona, there may not be any reason to visit Michigan!  Tastes just like the real deal!   And LOVE the decor! Really makes you feel at "home."\n\nHope you open a location in Scottsdale soon!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-12-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fgituHI7DqQVf1k00V5NjA', 'review_id': 'kNzNpCPEEPUEC-Sb-9LtBg', 'text': "Of course, Detroit Coney Grill has now become the Go To place for ex pat Detroiter's who live in the Phoenix area, Detroiter's who are here on vacation or business, and Arizonans who want to enjoy this original taste from Detroit.  Af t first, we we went for the Coney Dogs and fries that have that taste of back home.  So great!  Now , we've tried the Burgers  and they taste very similar to Greene's, Hunter House.  PLUS they have Faygo and Mexican Coke!  OMG!  The dilemma has become which to order so we order both the coneys and the burgers.  Keep up the great work David Najor and crew.  We ate there for lunch recently.  Couldn't be happier you are here.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-12-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'l_tPwqUwCcY2acxuWCs-jQ', 'review_id': 'TOgsEKtw7KeK5GMW9L3qDw', 'text': 'THIS IS THE ONLY LEGIT CONEY ISLAND RESTAURANT IN ARIZONA!!!!!!!!!! THIS PLACE IS THE BEST!!!\n\n\nThere are so many fradulent  "coney islands" around town, and it was getting very annoying going to so many and being let down. \n\nThis place is truly authentic! The Coney Dogs come just how they should, with amazing chilli, loaded with onion and mustard, and most importantly...NO KETCHUP ON THE CONEY DOG!!!!!!!!!!!!!!!! lol. Love them, reminds me of home, any time I have a coney dog craving I go here.  Definitely a part of DETROIT\'S FINEST!\n\nthey need to open more locations, especially in MARICOPA!!!!!! ;)', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-12-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'WbPVEFPcVb4pv7wi-vBu6g', 'review_id': 'K8MRQpIQFSem0tGD-E0R6Q', 'text': 'Thank you for bringing a real coney dog to AZ!!! I feel like I am at home! Love all the articles about Detroit and the map where we can pin where we are from! The dogs are great because he gets them shipped from home. Will be back very soon! I hope they can bring one to Maricopa!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-12-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Jd54tYMIG9_86a3aJMRyBw', 'review_id': '3J6Z6dLGt4fW9Pr5PWdBfw', 'text': "We just heard about this Detroit-style restaurant, so \nwe drove from N. Scottsdale to try it out.  We are glad we did.\nWe had the coney's and the burger.  Both were delicious!\nThey use the chili made in Detroit and even stay true to the experience\nand serve Faygo pop and Better Made chips!\nIt has to be expensive to ship these products here, but it is\nkey to making this place authentic, nostalgic and true to the food!\nThis one should be on your list of places to eat!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2013-12-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': '-OB-Co0xGVO0hHtKpBkhkw', 'review_id': 'gLnVUTs0YTN1xtFISoG-Iw', 'text': 'Awesome...a taste of back home...been out here 28 years....now we need one in Tucson...Go Wildcats', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-01-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fxCRT_sf5PJdOClRW8PiJQ', 'review_id': 'V5ak_nkW7ABQucT3KnorCw', 'text': "Friendly service and great food. Just like Detroit Coney. Love that you guys sell Faygo Rock n' Rye. We will definitely be back soon.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-01-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CRa4i13Jd2TIAY7M2CIxXQ', 'review_id': 'Wut4HbrtXJU2g5gG7r6AQg', 'text': 'Very good. I got the coney dog without onions and I really liked it. The hotdog has a good snap. The owner is very nice and there is a 10% check in on Yelp which is awesome.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-01-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IFtZmQXOIWCOBaUsrI_A7w', 'review_id': 'AROsAOp20WBO7MX0nAWDOw', 'text': "If you're familiar with authentic Coney Dogs from Detroit, these are EXACTLY on par.  They even have BetterMade chips and Faygo soda (although I'm personally not a fan of Faygo).  \n\nOne of the truest tests of authenticity is that they even have the Hani on the menu.\n\nThere are claims of opening a new location on Bell & 35th Ave soon.  Would love to see something along the Tatum corridor nearby PV Mall for all of us Scottsdale/N. Phx folks!!!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-01-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xl6PerjP9NNeB1eznBjCSA', 'review_id': '-R4Q7L_U7n3tGTs99xZ0ew', 'text': "I had the coney dog...it was delish!! The only mistake I made was getting it to go, next time I'll eat there.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-01-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'o1_XGLgDbNqUUO7OSszShw', 'review_id': 'W5yk78EXjdvsh61MMsp2eg', 'text': 'Make sure to get a Fargo or a Vernors.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-01-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-HsftTrCwXs3wWCJCm2VwA', 'review_id': 'x-3ThOMYNFuFG_Rzyyc6qg', 'text': "Welcome home! Legit Detroit style coney with damn good chilli, hani's, faygo and better made chips! Feels just like home except the coneys aren't 99 cents and they close at 7pm. Eat here, its worth EVERY penny! Fast, friendly and most importantly BOMB.COM. I seriously cannot believe how good the chilli cheese fries are... and they're not stingy with serving size :)", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-01-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lCflBh7uHdqPUDScghnbcQ', 'review_id': 'cN9qQ_gFo3GPZVTJvHWjeQ', 'text': "Have spent over 9 years looking for A good Detroit style Coney Hot Dog in Arizona, and here it is. Great Chili but the Hot Dog lacked the snap i'm used to. Still A 10 in my book.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-01-13', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 0}, 'user_id': 'bTTbF6aRwsQ0WIX_VE3daw', 'review_id': 'oyhZoHJfFNiNZgJhBnKY1w', 'text': "This is the best place    I am from Detroit so it's great to have a place that I can go to when I need some comfort food from the motor city!!   Love the coney dog!!  and faygo... I have sent most of my friends by to get a coney!!!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-01-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'VKLqnMxYk-DO2MgLVRBo2g', 'review_id': 'fxo8qvM8ADMfo-jmN9upeQ', 'text': "I moved to Arizona about two years ago from Michigan and every time I would visit home I had to go to a Coney Island to get my fix... Now it's not as necessary since we finally have one here!!! And let me tell you, it's the real deal. We met the owner our first visit; he's an awesome guy from Michigan with a real love for what he does. He imports the coney dogs straight from Detroit, along with Faygo & Better Made chips! \nI got the Hani, which I usually get in Michigan, and it tasted exactly the same!!!! I can't tell you how happy I was! I've been to restaurants who try to mock the Hani or imitate it slightly... It's always a let down. But the Hani at Detroit Coney Grill: LEGIT!! I overheard the guy at the table next to me (also a fellow Michigander) say how awesome the coney dogs are too. How could they not be, though? They're straight from the D!!! I plan on trying everything on the menu and I plan on being extremely satisfied with it all as well. ;)\nThe atmosphere is fun & filled with Detroit pride. It's also very clean! There were tons of Michigan people there too, which is always fun to talk to fellow Michiganders with that Midwest, humble mentality. The service was great - everyone who works there is super nice!! Quick too! The owner was chatting with us for a while when we were there which was really nice. You can tell he just wants to see his customers happy. It's nice to finally have a little piece of Michigan here in Arizona! I can't wait to come back!!! I'm bringing all my friends too, to show them Michigan knows what's up when it comes to good food! :)", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-01-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '37hr4KvX64n-OSNOUluosA', 'review_id': 'x9N0ShJWuvl0QGyMJMcgBw', 'text': 'Great burgers and cheese steaks.  We go about once a week for lunch.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-01-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'dS7sR9LSkQ-iGBgVxmFSsw', 'review_id': 'X2f6SOqFibhQnyKM6TxjiQ', 'text': "If you've experienced A Detroit coney, you would understand. Arizona has needed a real coney for a long long time. The dogs are shipped from Michigan and they serve a mean hani. \n\nThe owner is great and makes sure everyone has a good experience there. I would highly recommend this place anyone and everyone, especially if you're from Michigan.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-01-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '7HUZzph147fBtF1U2QOWQw', 'review_id': 'qg8XMFIjXUyS6gYORkjiQg', 'text': 'Stopped in for a burger. It was tasty, fast, and juicy, just like I like it! Fresh cut fries and a soda, around $7 and worth that. Staff extremely nice and encouraged feedback. Working nearby,  I will def be back for lunch another time! Also in the same strip mall as SubFactory which is my all time favorite lunch spot so this makes it perfect for me and my coworkers. Also, check in on yelp and get a discount!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-01-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'KcI2VGSvRhLAmw6vZrc8WQ', 'review_id': '6kIV7_3esJANshpFWu567w', 'text': 'I\'ve been here at least 10 times now.  I try to bring someone new every time.  CONSISTENTLY, this food is excellent.  What blows my mind more than anything else about Detroit Coney is the staff.  From the big chief to the crew that cooks the food.  Everyone is wonderful and treats you like family.  I\'ve never felt that an employee feels like an "employee" I think they feel like they are part of something bigger.  As a business owner myself, I try to make my employees feel the same way.  They are bigger than just one of my employees, they are part of this business.......  \n\nThe man in charge treats everyone like he\'s known them for years.  Whether he genuinely remembers me and my family when we walk in those doors, he sure makes us feel like we\'re a long distant family member that he hasn\'t seen in years.  It feels good to walk into an establishment and get that kind of attention.  He\'s upfront, honest and OPEN to any and all suggestions.  He wants nothing more than the spirit of Michigan to creep into this desert town.\n\nAs for naysayers who may bitch that this establishment isn\'t the real deal, that it doesn\'t serve breakfast, that the prices are higher here than in Michigan.... use some common sense!  It\'s a small place.  All roads that lead to Phoenix have signs that say "steep grades"  To a truck driver, that means higher price of delivery.  To a business owner, that means, cost of goods go up.  Ever wonder why huge bands NEVER play Arizona?  This restaurant is practically importing 50% of it\'s menu to give his customers the food they are unable to get ANYWHERE else in this state.  It\'s going to cost more.  As a business owner, I wrap my brain around their price on goods and salary vs profit.  \n\nDetroit Coney Grill I would imagine is just a stepping stone to a bigger picture.  Something tells me one day Arizona will get the full blown Coney it deserves and it\'s all thanks to Detroit Coney Grill.  If I was a millionaire, I\'d beg DCG to let me invest.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-01-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'PPSlls11r2I6I_AXGTkxVg', 'review_id': 'U4xLcKQgd_ZTL7Mc68RL9g', 'text': 'Man, This is the real deal.  I discovered this last night and then took my entire office out for lunch there today.  These are the REAL hot dogs!  I grew up eating these things.  The owner is super energetic and friendly.  The fries were outstanding, but for me?  A Coney Dog is a taste of "Michigan Soul Food" and DCG has it.\n\nIf you grew up in South East Michigan you will want to get in your car and head over there now.  I can\'t believe I am so lucky that this is right down the street from where I work.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-01-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '2yTjgf1bMCtYiRWicNqjnA', 'review_id': 'ec3Tu8R-jcvkUw-Pzqm93A', 'text': 'Food is great, Customer Service is just as great... glad I found the spot... Props to you fellaz...', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-01-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pFMvMOynS5RQuym8KLSMjw', 'review_id': '6S8IyWeVt8uuqH5Pjyl_oQ', 'text': 'Great dogs just like back home. Great people always in the house. Great owner always willing to go above and beyond to make his customers happy', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-01-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '5gIsM0YidRQqEVen55Hsqg', 'review_id': 'dvOViRvL1ZT1u2cRw2lOnw', 'text': 'Man...This place is a block from my office and I never knew it. I got the Detroit Coney combo. Loose ground beef,  chili, dog, mustard and onions. It was so good. And the fries were amazing.  For $7.77 (after yelp discount) it was a great deal.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-01-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'itn1IcuJSiFb8z34Zv5yGQ', 'review_id': 'Hn8-Mtpcv2SAwC_brJ820w', 'text': 'This is probably the only good thing about Detroit.  No wonder these owners moved to Arizona.\n\nDetroit bashing aside--this place is top notch.  You can even get beets with your burger.  I know it sounds wild, but it tastes more amazing than it sounds.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-01-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'xl6PerjP9NNeB1eznBjCSA', 'review_id': 'BP1DFnRQApd4eM-vD4V__Q', 'text': 'The second time was even better!! I had their fries in addition to my coney dog and will definitely be back for a third time. The owner is extremely nice, the service is great and the food is incredibly tasty.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-01-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'jXtfvTfMBPkmWSmOPQewfw', 'review_id': 'S1_s-GWEUDR8L3vo9Ceqpg', 'text': "Love eating here!  We grew up in the suburbs of Detroit and miss our Hani's from National.  We've been waiting a long time for someone to come out here and open a restaurant like this!  Excellent service and good food, what more can you ask for!  Hope to see them closer to my home in Chandler/Gilbert in the future!  Now all we need to do is find a good pizza place to replace Buddy's/Loui'.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-01-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'wpdS3F6VQ_ngxOJ0c3Nb-Q', 'review_id': 'w-YVlS5fBYOJMfO5BhF7fQ', 'text': "This place was awesome! The food was fanatic, the service was amazing, the atmosphere is fun and I totally can't wait to come back. Open up a place in central Phoenix! The staff were super friendly and the price is really good for the amount of food you get!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-01-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'ijtFKeUCD0x9O2H98zSz0g', 'review_id': '2EvfBysTsQu4i0y2Z5fBFg', 'text': 'Since my original review, I have returned to Detroit Coney Grill several times---(I\'d go more often if it was closer!).  It is excellent every time---and the owner is as kind and friendly as can be.  We LOVE our "local coney island" and are SO glad they\'re here. \n\nWe tried the burger today--it was awesome!  Our favorite "standbys" of coney dogs and chili fries were also awesome, as always.\n\nWe\'ll be loyal fans forever---and are grateful that our favorite flavors from Michigan are here in Tempe!  The chili here is one for the record books---and is exactly how it tastes back home!  Well done, Detroit Coney Grill!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-02-01', 'type': 'review'}
{'votes': {'funny': 12, 'useful': 17, 'cool': 14}, 'user_id': 'IDHrwv_RCildFvmfWTkj5Q', 'review_id': 'tIfkPPSy3a-SlnfG108Ayw', 'text': 'What is a "Coney Dog?", you ask.  "Definitely not a chili dog" is what has been told to me.  A real Michigan Coney Dog has an all-beef casing hot dog grilled to perfection and placed in a steamed bun.  This hot dog is topped with, and this is where it gets the distinction from a chili dog, an all meat chili, onions and mustard.  \n\nSince I LOVE to try the most I can in one order... I ordered a "Combo Coney Dog".  This is the Coney dog I described above (I got my onions grilled) with "Loose" meat on top of the hot dog.  What\'s "loose meat"?  Well, that\'s just grilled ground beef crumbled up...  They put the loose meat on top of the hot dog and then put the all meat chili on top of that.  Just dang delicious.  I really liked the taste of the hot dog itself. \n\nNot to be out done by the hot dog, the fries here are fantastic.  I litterally watched the chef cut the potato and put the curly fries in the fryer.  The fries are just that fresh.  Oh, by the way, they grind their own meat daily for their hamburgers.\n\nI stopped in Coney Grill to have a Faygo pop and to try the hot dog.  I grew up drinking Faygo pops when I was a kid.  Grape being my favorite flavor.  Detroit Coney Grill has Faygo pops in the bottle.  There is something about the taste of a soda out of a bottle that makes it taste 1000 times better.  I savored every cold, sweet sip.\n\nI like this place.  I\'m going back.  I\'m taking some of my ex-Detroit family when they come in town.\n\nYummy.  This place is great!  Get there early, they close a little bit early.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2014-02-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jqf-Q4a12JKW4uU8MweQ2w', 'review_id': 'NAwqgTnvkrnHHrNk_SjLVw', 'text': 'First time here burger, fries and orange Faygo were great and the staff was friendly.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-02-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': 'uPrslp8V3sP1_pZlH_3XQw', 'review_id': '6rStHD7MJhGehK82yyU_tA', 'text': 'This place is the BOMB!!. A little slice of home. The owners are down home, greet you with a SMILE and make you feel like you are one of the family.  GREAT food and service!!! We will be a life long customers. Best place in town to get a coney!!! Ordered the "Combo Coney Dog" today. Reminds me of home. Thanks GUYS!!!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-02-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'V8qvbNjXMVyUh4sLyIdptw', 'review_id': 'ghIcayzbPpq4Z7lQVfECKg', 'text': 'I live in Chandler, Az.  My fiance has been raving about this hot dog joint for months now. Finally he took me here earlier this week.  First thing I noticed is how friendly and upbeat the guys are that work here. (Owner perhaps, super nice. Even came by our table to make sure everything was to our liking) I ordered a double cheeseburger and my guy had a Detroit coney combo. Man, they were both awesome! I loved the crunch the dog had and also the chili was amazing! The burger was delicious too! We will definitely be coming back. Hopefully they can open a new joint up in the Chandler area. Enjoy!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-02-07', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 1}, 'user_id': 'bBmE9KS2cOaBMA1oqRwbMA', 'review_id': 'VzGroeCPL8b3MwjmP7Tygw', 'text': 'When i found this place i couldnt believe my eyes! REAL coney dogs right in Tempe. They got Faygo pop, bettermade chips, and that Detroit personality that i love and miss. Ill be back here again and again', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-02-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bkC4Agy7KZiYLLGAp7wT0A', 'review_id': 'GUcJGvYqmtDeUQ5YTEyH2A', 'text': "Absolutely excellent the owner was awesome the food was just like home A++++++   definitely will be back. Had My usual 2 coneys chilly cheese frys. The food was perfect haven't left yet can't wait to come back.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-02-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'TG1ph6yWOTBWk2ZOjJyuAQ', 'review_id': 'Iseh9WA0Z6W5NIRBSJNofw', 'text': 'I stopped in on a recommendation from a colleague, I generally love finding the small "out of the way" places because the staff tend to be loving their work, and it usually shines through in the food.  \n\nDetriot Coney Grill easily lives up to the ideal, the gentleman at the counter was talkative and friendly, food was exactly what I expected. \n\nAnd dont be afraid when you see that the burgers start at a double, the patties are on the thinner side so a double comes in just about right.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2014-02-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'YTy_q6odI5XKQF2YUa73Ug', 'review_id': '_KJPv6_-dwS5oYYUR5M89w', 'text': 'Top notch food and service..wife and I drove from uptown and well worth the effort! Will definitely be back!!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-02-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fT3wz0EP7XyudaB0T7f7BQ', 'review_id': '1VIUz91irc3H2hgQ6d44UQ', 'text': "Great coney's! Just like back home. Been coming since we found out about it and we're never disappointed. \n\nStaff and owner are wonderful and welcoming.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-02-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': '_JHs2fAdeWf0Wp_rAAg4iw', 'review_id': '83XOu9upa67my0r3hOdbeQ', 'text': "Every time I go back home to Michigan I make it a point to only get food that I can only get in Michigan. It's still weird not to have Coney Island on that list but I'm definitely not complaining! Plus, the owner is SUPER nice!! I hope he opens more around the valley since I'm in central Phx. Plus, ASU downtown (where the cool kids go) would totally eat it up! Rush hour traffic pretty much stops me from going M-F, so that really only leaves Sat:( I could probably eat chili cheese fries everyday. Let's be honest, as a teen I totally did;)\n\nAnd to the few people on here complaining about the prices, seriously??? We go here with my other friends from Michigan and the 4 of us for $24. Pretty cheap for such deliciousness!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-02-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 5, 'cool': 0}, 'user_id': 'x5MtSDPP8VC2pTlTNF4Tnw', 'review_id': 'Mn5Ckb6RW76_a1ikbJY5PQ', 'text': "If you are from Michigan and you are trying to get your Coney fix, this place is exactly what you are looking for. I lived in Michigan for a year and had my share of Coney's and Detroit Coney Island hits the spot. I live in North Phoenix and make it a point to drive into Tempe once a month to get my Coney. \n\nThe owner is super nice and his staff shows excellent customer service. I can only hope that he opens a store closer to camelback and central so I don't have to travel so far to grab a Coney;)", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-02-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nwJ1tmReleYlaFPWXn1Mlw', 'review_id': 'R8ADkX0SaEdie1n2NPmEPA', 'text': "Moved to Chandler, AZ from the Detroit area a few years ago. Found this place through a friend. All I can say is Awesome! Real Detroit style Coneys, homemade fries, Better Made potato chips, and Faygo. The even hade a couple flavors of Towne Club. I have been dying for coneys for the past few years. This place is incredible. Hopefully they open one closer to Chandler but Tempe isn't too far. Definitely going back!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-02-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ppmPsIjj53PerwwdkEquhA', 'review_id': 'nuu0FAB0WNxXP2CQcJ07xg', 'text': "Went here on a recommendation plus awesome yelp reviews, and we didn't regret it. Good food done right, with a friendly and passionate staff made for a great experience. This is what a burger stand should be. We'll be back. For sure.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-03-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'V8-1xx4EUp0fVrBz_VWiTg', 'review_id': '01Rghr9OtHR82vcRXYJdQg', 'text': "From the second you walk in you feel like family. The owner knows everyone who has been in before, even if its been a few months. The best hot dogs in town and damn good messy burgers too! Honestly just wish they had one in Mesa. But the drive is worth it for those perfect hot dogs with a snap! You can always tell the good places by the line out the door during lunch hour. But dont let the line scare you, they'll get your order out quick and it's still worth the wait.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-03-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'LoSifdxmrOj-a8xcDrRJDw', 'review_id': 'NA_RnrKCYK-qhLiX8BWriQ', 'text': "Awesome! Great food, friendly service, quality products. I love this place & I'll be back & refer it to my friends! Love the chili coney & Faygo soda. Fries are delicious and made fresh. Try it & you won't regret it!!!!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-03-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'SmstYKapW3qQy1x9bsn54g', 'review_id': 'mISQQNgRGLa1dwSUoG4GqQ', 'text': "if you are from the Detroit area you will feel right at home at this little piece of heaven!!  Just had their Coney and a bottle of Vernors! Talk about their is 'no place like home!'  I have had some 'coneys' here in the west and they usually miss on the 'dog' not Detroit Coney Grill  they appear to have the natural skin casings  that give you that 'snap' when you bite into them, fresh onions, great coney sauce  everything that is great about Detroit you will find here!!  I plan to be back soon and try their burgers they look great as well.  And did I mention FAYGO?!?!  in the bottle  nothing like Faygo!!  great spot  hope they expand to the westside soon!!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-03-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'iZn42zYGdyEIMXiWbLvQKg', 'review_id': '5-fvNfr6zQnu9sgEqLMAWw', 'text': 'I love this place. Reminds me of Coney Islands from home in Detroit. The staff here is amazing and friendly. Feel like your home here!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-03-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ijtFKeUCD0x9O2H98zSz0g', 'review_id': 'oE3J6qR1DHUGWwMG6IOV6Q', 'text': 'Another fabulous lunch at Detroit Coney!  Hoping someday we will be able to eat at one in Scottsdale!   Adore this place....and it is absolutely the REAL DEAL!!  The chili is wicked good and absolutely authentic!!!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-03-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'KAEoaafZnnl2mqURMF3aBQ', 'review_id': 'z2rHdJ0sDTM0hjzHwLRT1Q', 'text': 'Sally Z\nGreatest Coney I have ever had - Faygo pop was amazing and the French Frys were awesome!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-03-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uvGgTfRzRaEYbEFIoEiF9g', 'review_id': 'eYo3-qEJLMzwfGGBZtkV8A', 'text': 'Great Coney\'s.  Something about the hot dogs themselves they have a great "snap" to them.  Had the cheese fries too, they did not dissapoint.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2014-03-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DpFjHR3ZzWVwjxtE9ZD3jw', 'review_id': 'O9naOmS4zHr6Mks_qgvgog', 'text': 'The food was awesome here! Not only the hotdogs but the hamburgers are fantastic!!! Also the staff are super friendly. :)', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-03-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'gEYTqxD8HKC9FigbF8uhmQ', 'review_id': 'IefhENx5wzRVGimD7xAwQQ', 'text': "Anybody who knows what a Detroit Coney Dog tastes likes... needs to check this place out. I've been out here for years and now for finally found the right place. David (owner) welcomes all as family. A little slice of home... here in the valley!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-03-12', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'e9Q9nFvflhDDS7sSRPr-ug', 'review_id': 'BdZf5Lm-V_dZ6RH3YsP3RA', 'text': "The coney dogs here are decent, the buns are simple store bought ones so nothing special, the chili is pretty good though. The fries were pretty disappointing, they are fresh and hand cut but greasy and soft. I guess if you grew up near Detroit I can see this place's appeal but there are plenty of other dog joints in Phoenix that do it better, this place isn't even the best dog in Tempe. Stick to Ted's or Dave's or even Lobby's if you like Chicago style.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 3, 'date': '2014-03-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UgHAovflNPhJdfd-NDLH0g', 'review_id': 'WOpAfmCMpS20fmTrEXWyHw', 'text': "I no longer have to go to Michigan to get my coney fix, FAYGO pop, or better made chips (which I normally have mailed). Now I only have to go back for my Tubbys submarine, Chinese food, and Max & Ermas chicken tortilla soup. Anyways, this place is AMAZING and worth our drive! The food is always good, the coney is a REAL coney with the snap and chilli with no beans! Not only is the food great but the quality of service you can't beat. He personally goes around and attends to every guest...even when they're BUSY! Try them out you won't regret it!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-03-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'I0AieMAr9RSXsTR14sBCrw', 'review_id': 'XkkeOzjUVQt-vvRGc1b7yg', 'text': "Lots of flavor. great quality food better then chicago junk. The cheesesteak pita is amazing reminds me of new york best i've ate in az so far go there!!!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-03-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ijtFKeUCD0x9O2H98zSz0g', 'review_id': 'QvZJQagdXlKn8JbYdzJuZA', 'text': 'Fabulous as always!  Back again for the irresistible chili and great Coney Dogs!  Service was perfect and so was our meal. Chicken salad was also yummy...,added feta for extra Zip.  We will be back!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-03-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'hXl7D00brbd-9E8XxF5GTg', 'review_id': '8t8VQZemjrzFy4vFOSVuTw', 'text': "EAT HERE! Amazing, genuine, authentic, memorable, and just outright great! If it's an Original coney you're after, this place will exceed your expectations by far. The best tasting coney dogs, hand cut French fries, Vernors, and get this; Faygo Red Pop in glass bottles! It's a dream I tell ya! I bought the T-Shirt!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2014-03-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': '_PfzyJIqUsn-X6q77ywjEQ', 'review_id': '45phQXpjAUfF96BFrJC3Fg', 'text': 'Come here for an excellent hot dog or burger experience.  I found this place on Yelp as I was headed to the Phoenix airport and needed to grab a quick bit before turning in the rental car.  This place is about 5 minutes for the airport, so worth a stop if you want better than the captive airport food options.  And the price is super reasonable.  The chili on both the dogs and burgers is excellent, and the hand-cut fries are tasty when they are hot.\n\nThe staff are super friendly and helpful.  I highly recommend trying this place if in the mood for a good snappy dog/coney.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2014-03-19', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 0}, 'user_id': 'CKQG21PTF4i3YRaOAOSdJQ', 'review_id': 'Nozu_o6VRKrQbvZouJtM3w', 'text': "I wanted to like this place. I'm a huge supporter of great non chain establishments.  I got a chili coney dog fries and as folks in the Midwest call it pop. The coney and fries weren't terrible, they just weren't great. I saw that this place had 5 stars and was expecting more flavor. I'm an Arizona native so maybe I have different taste then Detroit cuisine.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 2, 'date': '2014-03-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '88HvCpqpGkQyIhUTbgzzwQ', 'review_id': 'cdS2sjMdoDxu7tFiN6qlug', 'text': "This gem made me feel like I was back home eating a coney! It's been\nA few years forgot what I was missing! Owner and staff are all from Michigan and seem excited to be making good Michigan food in the heat of Phoenix. Guys need to open a place in flagstaff!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-03-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '3R5-Hz6taBBrLLPeZCLsSw', 'review_id': 'Nu93caDIGOIBguZY49tnWA', 'text': 'Homesick, yeah I get homesick!  Love this place ... Other than the sunshine outside I feel like I am back at home.  Everyone in here is from the D.  Food and company is amazing!  Would love to see a event for MI ppl to socialize.  People who will know what I am talking about when I say I am running to the party store to get a pop :-)', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-03-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '8bQkWqPKXyIPhqe5e2jNpw', 'review_id': 'V7rigzjbSe6m6x30pAM3HA', 'text': 'Everything was great! The staff is so nice and friendly. We happened to find the place on Yelp and thought what the heck we are always homesick for coneys being  from Michigan originally. We were in heaven! The food was just like being home. The Faygo pop was awesome! We left grinning from ear to ear.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-03-23', 'type': 'review'}
{'votes': {'funny': 7, 'useful': 12, 'cool': 8}, 'user_id': 'vnvOyN8Jcw9Y-D4ugMD9zA', 'review_id': 'RAUSiLMJ0J8p65xrFXs5qQ', 'text': "In the state of Michigan there exists a particular type of hot dog known as a coney. Why is it called a coney? No one knows. As far as I know it's not named after Coney Island in New York. It's not named after the SNL sketch turned 90s movie the Coneheads either, and it's not named after Joseph Kony the leader of the Ugandan resistance movement. \n\nWhat is a Coney hot dog you might be asking? Well it's a hot dog with a chilli, mustard and onion. This differs a bit from a regular chilli dog due to the mustard to balance out the chilli flavor. \n\nAnd this brings me to Detroit Coney Grill, while in the metropolitan Phoenix area I checked around with local yelpers to help me track down hot dog places to review and this was one of those recommendations. So one afternoon I set my sights on visiting Detroit Coney Grill and giving it a try.\n\nThe restaurant itself has a fair bit of seating available with one long counter encompassing both where you order and where your food is prepared. I went for a coney dog and water and within a few minutes my food was ready and it was time to dig in. The hot dog had a lot of very nice tasting meaty chilli on it, the combination of the chilli mixed with the mustard was nice and the sausage itself tasted good. This was a skinless sausage on a regular seedless bun. There were a lot of diced onions on top that added to the mix. Overall this was an excellent combination of ingredients and a very satisfying hot dog. \n\nIf I had to complain about anything it's that it was a tad pricey, it was a little over 4.00 for the hot dog and a cup of water. I will say that this was a far better tasting hot dog with chilli as the primary ingredient than the one I had at Ted's also located in Tempe Arizona, but for the same price roughly I got a footlong there. Overall I'd say my food was excellent but the value was a little lacking. I am going to give Detroit Coney Grill a solid four stars and a recommendation.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2014-03-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '161ZPpvifgOCUKsFW-TGbQ', 'review_id': 'xXcRWdk4qrCQksPr0HOFfA', 'text': "This place was great! If you're in the Tempe area, you should definitely give this place a try. Next time I go I'll definitely try the chile cheese fries.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-03-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '077H-VKas8myY_L4rFuGTw', 'review_id': 'uK2XeinaFK-W15BIina5XA', 'text': "I am SO incredibly impressed with the service here. My boyfriend and I visited on a Friday evening. The owner was working and greeted us immediately. I showed him my check in on yelp and he gave us 10% off our order. I truly appreciate that he went over the menu with us, explained the history of the Detroit Coney Grill, described what meat cuts they use and type of dogs they order. He also sold me on the Faygo Rock & Rye soda. Let me just tell you.... YUM. It's a soda made with pure cane sugar (my favorite). David even let me try it before I purchased it just to make sure I liked it. \n\nThe food was really tasty as well. I had a Coney Dog and it was delicious. The guys that served and delivered the food to our table were also helpful and made sure we liked everything. It is not every day that you see an owner and his staff take such pride in their work. I am typically so disappointed in the customer service in most retail and restaurants anywhere I go, but it is such a breath of fresh air to see that David is doing his best to remedy that in his establishment. \n\nIf only there was a Coney Grill out in Chandler/Gilbert. :) Soon hopefully!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-03-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'fl_9hotN0iy7u2-fk6q_5g', 'review_id': 'zeowjh89QZ7IgI8JOgYYgg', 'text': 'Like being at Lafayette Coney Island in the D.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-04-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Bgyv-X3yTL4XjPzqJP-QxQ', 'review_id': 'KKJn2cM4aJPO9FsJ3nFMPQ', 'text': "This is the current spot that takes care of my 'cheat' day. The combo dog with chili and loose meat is fantastic and the cheese fries are also really good.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-04-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'Xl0FN79k_UfBhyMBJ_kt5g', 'review_id': 'LwspNPC-zoipeVQI3I1EQw', 'text': 'The food was great, as advertized. It was a little dirty inside but not a deal breaker. I would recommend to all. I will go back.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-04-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'wQYzNRLl-4_pc1ucMweWlA', 'review_id': 'YD0TEHGH7uO14aIDiAflFQ', 'text': 'Uh-maze-ing!!! Originally from michigan now living in Seattle visiting family in phoenix. Came in, to visit family and HAD to come in to check it out. Great service friendly welcome line out the door the entire experience.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-04-09', 'type': 'review'}
{'votes': {'funny': 5, 'useful': 8, 'cool': 6}, 'user_id': 'WxeD74JGiwjljzHndYSvmw', 'review_id': 'MNE7Lwq008q6zYPR1ZDgeQ', 'text': 'I\'ve been reading all the reviews about this place, and had it bookmarked for months.  Well, on Saturday Mr. M and I felt like goofing off and driving around aimlessly and I decided to go on a hot dog tour.  \n\nWe started here and decided to adopt the attitude of "when in Rome" and ordered what appeared to be the house specialty, The Detroit Coney Combo with the hot dog and onions and mustard and chili and the loose ground beef all in one big pile of goodness.  \n\nFirst, the dude working the register has more patience than I ever would because first timers have no idea how to order here and it can be a little overwhelming in the beginning.  We got to listen to him explain things a couple of times to the group in front of us, so when he got to me, I was ready.  \n\nWe shared the Detroit Coney combo and the fresh cut spiral cut fries, which come in a huge serving by the way, and I\'m pretty sure they sprinkle them with crack because those are totally addictive!  Fried perfectly and absolutely delicious.  I was a little nervous that the onions and chili on the combo would come back and haunt me later, but they did not.  Everyone played nice in my belly and the whole experience was thoroughly enjoyable.  Combo, fries, and fountain drink was $9.18 with tax.  I\'ll be back for sure.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-04-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': 'TDS_kVLn7BJ4ZoQuooTveA', 'review_id': 'GyCWO0-lWTeT_m1Hr3zeow', 'text': "This place was legit! I'm from Canton but live in Long Beach, CA now.  My boyfriend and I just got to our hotel in Pheonix and seen this place pop up on yelp.  I was skeptical at first but after a quick conversation with owner and tasting the coney dog I was hooked. It reminded me of all the good times in Detroit eating coneys with the family on Sundays or my drunken nights with friends that ended at Leo's.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-04-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'GRC3qz__P56pK16dZhzm2Q', 'review_id': 'Aw9eEqCYN1FDnSCbCYI2cQ', 'text': 'Drove in from the west side (Avondale). This place is authentic Detroit! Faygo pop (not soda!) and Better Made chips to boot. A little bit of what I miss about Detroit. :-)', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-04-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'V58X1LUZvwhJUF9VSqKnZA', 'review_id': 'xNwLqIzL28GCieJJ428QpQ', 'text': "3.5 stars probably just under 4.  Very good dog with great snap and the Coney Style is awesome IMO.  Had never had a traditional Coney but I'm a fan and will go back.  The fries were pretty good and the Faygo soda was a nice touch too.  The place was a little dirty but probably because they had just gone through a rush.  They were out of Ketchup but gave us some packets from behind the counter.  The cashier didn't know the product which is fine but since we'd never been here and aren't from Michigan we need some help.  The cook which I think is the owner stepped up and guided us.  I hope to go back and have them earn that extra sliver of a star.\n\nKids both had burgers which looked good and they said they were good but I'd go Coney all day.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2014-04-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'IpFUfPUZ8Be3izP5G_avoQ', 'review_id': 'Q-Ktl3dB5djBv6n-5sIcHw', 'text': "I thought a hot dog was just a hot dog until I tried this place. Owner operated, great staff, great food! Faygo too! I feel like I've been to Detroit at least in spirit after eating here.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-04-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '8XxEfYk74V4bY4GLXKUyIA', 'review_id': 'yqOxR0KQwD_0OtrDj_t7gw', 'text': 'I was born and raised in Flint Mi just outside of Detroit so I was thrilled to visit this place, we drove a ways just mainly for the Faygo pop ( or soda as AZ folks call it)\nThe Detroit Dog was great, fries were awesome...but the Rock n Rye Pop took me back to my Childhood, \nIf your originally from Mi go give them a try and welcome them to AZ\nThe owner talks to everyone like they are friends and family\nThey are thinking about opening another location in the East Valley either at Gilbert and the US 60 or in the San Tan Valley, and they need YELP reviewers to help decide\n\nI VOTE for Gilbert Rd and the US 60...1 mile from my Home', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-04-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': 'CLm_4K26bREeA_wcoo3qwg', 'review_id': 'Xpvg8pXiAdBr-iZWJuinYA', 'text': "Finally got here and had a real live Detroit Coney Island hot dog!!  The Dog and Fries were awesome.  Will be back.  They just need to pay a little more attention to cleaning.  The front door was filthy and greasy.  Tables and bathroom just so-so.  Cleanliness in a restaurant is everything.  So stay on top of it boys.  You've got the magic going!  It was so great to get a taste of home.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2014-04-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'TCrKtDX_WuXUZJijV4dZwA', 'review_id': 'F1j7SnLwdQ_3Hd__3gpK8g', 'text': 'Seriously, when I walk through the front door of Detroit Coney Grill, I feel like I am back in Detroit. From the smells, the tastes, the menu offerings and everyone\'s friendly demeanor, from the staff to the patrons. They need a sign on the wall when you walk in that says. "If You\'re From Detroit, Welcome Home!"\n\nI\'m originally from Oak Park, Michigan (a suburb of Detroit) and two of the things I miss the most are the food and the general kindness with which people treat each other there. Found out the owner (Dave? David?) is also from Oak Park (and used to live about 5 blocks from where I used to live!). They have regular hot dogs there and they have Coney\'s. The Coney is a hot dog with a natural casing, so it \'snaps\' when you bite into it. My wife and I have driven to the famous Pink\'s hotdogs in Hollywood and had great chili dogs there, and this place stacks right up against them in every way!\n\nThe coney\'s are amazing. The fries are made just the way I make them at home myself. The people that work there and eat there are all very friendly and love to talk about reminiscing where we\'re all from and if you remember this place or that place back in the day back home (Detroit).\n\nWhat a great place! Good prices, hours are kinda weird (closes at 7:30pm on weekdays and closed on Sundays) and it can be a little difficult to find as its smashed into the middle of a crowded strip mall with a medical marijuana license distributor a few stores down.\n\nWe made the trip from Glendale to try this place out and I was so impressed! I wish it was closer! But I predict I\'ll be making the drive again soon - and often!\n(Update - I\'ve been there four times now and it seems like it just keeps getting better every time I go. Food is consistently great and people are consistently friendly and the service is consistent as well).\n\nLoved having Vernor\'s in the glass bottle, and looking forward to trying the burgers next time, as well. (Update - we tried the sliders, which are a menu option only offered on certain days - they were amazing!)\n\nThey also just started offering Boston Coolers on the menu on Friday\'s and Saturday\'s. For those who don\'t know or remember, a Boston Cooler is Vernors blended with French Vanilla ice cream (almost like a root beer float). It is so good - and if you\'ve never had one, I guarantee it tastes like nothing else you\'ve ever had (in a good way!).\n\nTrivia - Why is it called a Boston Cooler when it\'s from Detroit? It was named after Detroit\'s Boston Boulevard where it was reportedly first served. The history of the Boston Cooler has some conflicts. One story says that Mr. Sanders invented the drink at his store on the east side of Woodward Ave near Boston Blvd. The other story, and the one I like better, is that the drink was invented during Prohibtion by Grandpa Vernor for his grandchildren. According to legend, there was a milk man who delivered to the Vernor household. In his wagon he carried Strohs Ice Cream (Strohs had to give up brewing beer and changed their fire-brewed kettles over to ice cream production). James Vernor Sr. lived on Grosse isle but would visit the grandkids in Detroit. During one summer visit in 1921 the milkman and Grandpa Vernor delevoped a friendship and between the two of them they concocted the mixture of Strohs vanilla ice cream and Vernors Ginger Ale. It was called a Boston Cooler because the house was on Boston Blvd.\n\nDetroit Coney Grill is a great place! Highly Recommended! Hidden Gem!!!\n\nAlso, I just learned they are getting ready to open another location on the west side of town (maybe 35th Ave and Bell Road?) That\'s a lot closer to my house, so I\'m sure I will be eating there more often!\n\nDisclaimer - I am not an investor, I did not know anyone who works there or runs the place (though I am getting to know them) nor do I have anything to gain (or lose) by posting this review.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-04-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xFYRmUBdWnFoZ-rXgmeJ7w', 'review_id': 'VTvXF63xWEjJZ7kxav6P9w', 'text': 'Growing up in Detroit for the first 21 years of my life I can say this place rocks! Its like the transported Lafayette and American Coney Island right to Tempe! Chili was on point, Coney dogs had some snap when you bit into them. And of course a great touch with the Faygo and Vernors. My only suggestion to first timers is order anything with the chili on it and you will not be disappointed.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-04-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'Gyj4JrP6uOMLjYjuOqfXYA', 'review_id': 'Fh6QzulEwYMDIqgGrS68Hw', 'text': "My first time here. Food was excellent as well as the service. The restaurant was pretty full only 1 open table.  The get a lot if regulars because I was the only one that didn't know the owner. Every person that walked through that door while I was there the owner knew by name. I will certainly go back again and maybe someday I will be on a first name basis with him as well. Go check it out", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-04-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'bwmXfjwrogAaGqV33kSVpQ', 'review_id': 'WjX7C-LWFU6LkbEXky7pAA', 'text': "The guys who run this place are great but the coney itself didn't blow me away. It's pretty small for the price and I actually enjoyed eating the fries more than the dog. Check in on Yelp for a meal discount. I guess i'm more of a $1.50 Costco Polish kind- of-guy.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2014-04-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kuzLoDec_5pBrCoJ2CxtlA', 'review_id': '0P4nXbkz69dujGnINJLowQ', 'text': "It's all about the quad cheeseburger, both cheeses, all toppings.  Seasoned fries on the side.  AMAZING.  Their hot dogs are good too, but the cheeseburgers are just heavenly.  David, who I think is the owner, is such a nice guy.  We've become regulars and he always takes time to ask how we're doing and checks to make sure the food is perfect.  This place makes THE best cheeseburger I've ever had.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-04-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'XlVWRYPMpocZr0T9SgLtIw', 'review_id': 'nUHzwMdeUE8Ny_SRXLzdmg', 'text': "First time in AZ I had the owner of a restaurant  shake my hand the first time I've come in.  The hot dogs are the best I've had in a long time.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-05-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FUvdmkCWtWctq_mvVbAQ5w', 'review_id': 'U1efvM0mbmRizckqmBxyiA', 'text': "The place was good as far as customer service. The owner is a nice guy and treats you like a friend. Its funny...he had a restaurant called WIndy City Cafe and claimed to be from Chicago...now he's claiming to be from Detroit.\n\nHonestly didn't like the food. We were still hungry and wanting a hotdog that we drove over to Wiener Schnitzel.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2014-05-02', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'qXVd6mhzk61RZXHkB8Mlpg', 'review_id': 'vVlFsc6IYG5hVoIfq27lsQ', 'text': "I've died and gone to DETROIT. This is it folks, finally...Lafayette style original old school Detroit coney dogs like I remember it, right here in Tempe!!\n\nBetter Made chips, Faygo Rock & Rye, snappy dogs, and incredible service by an owner who's dedicated to keeping it real. If you love dogs, you have to come. So. Damn. Delicious.\n\nNow...just open one in Ahwatukee at 48th n Warner! Please? ;-)", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-05-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': '8oCLS2TZRtDZwrK8G4ENrw', 'review_id': '3fIVv1dv--9S22k9tP9oIA', 'text': "I'd have to say that I love this place. I'm from Saginaw Michigan and when I come here I feel at home. Michigan tradition, Michigan friendliness. \nThese guys are doing it right. Thank you for the wonderful feel of home. I drive from Laveen just to get me some coneys and some FAYGO.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-05-05', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'IIlDWrM-AJWtvax8SQpzoA', 'review_id': 'MStfeFoJpyEmHVGdYkMo6A', 'text': 'I just had a religious experience. 2 Loose Burger, plain & barbecue Better Made. \nWalked in & it smelled like Detroit. I never noticed at the "other" coney places in the Valley, but walking into Detroit Coney Grill feels like I teleported to downtown Detroit. Something about the seasoning is just right. Makes me feel like I can put off that trip to see family for a bit!\nPLEASE add a South Mountain location, specifically around 24 St / Baseline!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-05-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '0mAc8UHXfRszLqfXOb5zcg', 'review_id': 'nvTjLB0bMmjhEuevCyG-7w', 'text': 'I had a double burger, and seasoned spiral fries. The fries were DELISH, the meat was a bit smaller than the bun, a pet peeve of mine, but the fries made up for it. They were also out of Diet Coke in their fountain machine, which is all I drink. The food was made quickly, and all staff was very friendly.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2014-05-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'BeysQJOrTVDfNhKVAZ7-HQ', 'review_id': '9UvMWSwFsEk9OyyBK9derw', 'text': u'This place is so bomb!! I had the chicken philly with jalape\xf1os and it was everything I wanted for my cheat day! Not only was the food on point, the customer service was as well. The guy at the counter was super friendly and gave me his recommendations for the menu. It was my first time there, and I can promise that I will be back!!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-05-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': '2vqlvaZw1G_iaDyP6VnGoQ', 'review_id': 'ywl9Q-2BZWS7c-1zSlSu_w', 'text': "This place over all is really good love the loose burgers and the coney dogs.  Never had food from Detroit nor experienced the attitude of someone from there but one compliant and the girl who works there is so rude not professional waited a minute before she or the other workers even came to the front.  I've always come in when the owner guy is working he's awesome.  But not sure if I want to come back when she's there.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2014-05-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UM6ARMpyqvM2aJ3Wnzwcog', 'review_id': 'S0AgsjEtttqPSFuXFbUULw', 'text': 'I come from the heart of coney land.  I have probably eaten a thousand Koegel hot dogs in my life.  I love coney dogs; hell, I love hot dogs.  Staff is super nice in this place.  My hot dog was over cooked which was a bummer. The coney sauce was off just a hair.  There was a dominate spice that I could taste predominantly in it.   The fries were great.  I will probably give this one more try.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 3, 'date': '2014-05-19', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': '7brf9WC0Gr_7bUBXEHs9FA', 'review_id': 'uxwlfjvlh9a4c91NXn7exQ', 'text': 'Here is a place you must visit if you are from Detroit and live in the Valley of the Sun.  When you walk in the door you feel like you have arrived back in Motown.\n\nThe first order of business is the map and pins.  Here you are able to place a pin on your home town.\n\nThe Better Made Chips and Faygo are a must along side the Coney Dog.  I am especially fond of the "loose" which is a bun, onion and chili.  I honestly did not expect to find it here and was pleasantly surprised.\n\nIf you are in the mood for some home town cuisine this is a diamond in the rough.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-05-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'RMo9ojp0LHA_LSow4LcEmw', 'review_id': 'jqaToNhgn_e-JjJ2yxOLrw', 'text': 'Native Detroiter...well done Detroit Coney Grill!  Had coneys which were outstanding, burger was excellent, whole family loved it!  When we walked in my wife said "smells just like home!"  This place is 100% legit!\n\nGilbert by 202', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GeNUGCbMgNW6YMDvnuEJrw', 'review_id': '9mtm6cQZdY9bnTBaatOYsA', 'text': 'Hubby has been craving coney dogs since we moved to Chandler nearly 20 years ago. Craving was satisfied tonight. I had the hani pita and we split a Greek salad and fries. Yum! Way to bring Detroit eats to the desert.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'Daz7vORlh6_GtwVmHJzcUA', 'review_id': 'FZPWxeI9h9Nr5y_rciEraQ', 'text': "I used to live in the Midwest and had more than my share off Coney island hotdogs. This place is the real deal. Great frankfurters with a snap because if natural casings, great chili, and the right type of onions make for a great experience at this place. \n\nOnly one problem with this place: it's too far away. Come out to Avondale!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-05-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'eryLfrk7fabe8G1HPBkNAg', 'review_id': 'j_QrXdcQc4JxYCctRkZ6AQ', 'text': 'Hot dogs are ok.  Not exactly what I would get when in Ann Arbor but still not bad.  Prices are on the high side for a hot dog.   Not sure if I will be back.  This place definitely does a good lunch business though.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 3, 'date': '2014-05-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'L2FqkGXRz6-H19_EtzWl1A', 'review_id': '3gmRQPAtnL340ntbPoYJ7g', 'text': 'The owner will go above and beyond for you. He is so nice! Exactly how all businesses should be ran. The food was absolutely delicious. It has been at least a year since I have been back to Michigan and some coney was exactly what my baby bump was craving. So happy to have them here in the valley. Put one in North Scottsdale!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-05-28', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': 'WAEuKfVuuowLBh0EH0NXkw', 'review_id': 'cGi_Dh81RTkZU5TY0pjjmg', 'text': 'I always either have a friend bring me  a brick of chili or I buy it when I visit  Michigan. I love coneys.  I enjoyed going to the DCG.  The owner made it a fun place to visit.  Had a Vernors which was great and two coney dogs.  I downgraded them only because the coneys were in a basket and not on a plate.  By the end of eating the second dog I was eating the plastic paper.  Please get plates and silverware.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 3, 'date': '2014-05-28', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'k15l3hCd3_vQrZt__QMVug', 'review_id': 'dD8FH3wd5yM-yKJUERvwJw', 'text': "Is there such a thing as 5 stars plus, plus, plus? Well, then this is the place you cannot miss for Detroit, not Detroit style, real, homegrown Detroit Coney's.\nWe sampled the food at this Tempe location of Detroit Coney Grill and hired them on the spot for a party we were giving.\nNot only is the food oozing Detroit, but, the hospitality that David exudes makes you feel as if you grew up with him in Detroit. Our party, catered by DCG even made the vegetarians grab a dog. The greek salad was outstanding as well.\nDetroit chips, Faygo pop, and you'll think you're back in Michigan.\nDon't miss this great hometown treat....Detroit or not, everyone loves a good dog!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-05-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'm05_bI5dXiQb-o_k--KeWQ', 'review_id': '6aca9SvW7uUxcLqD6xbt4g', 'text': "Haven't had a coney in nearly two years!  He valley is now complete with a Detroit Coney here!  I live near Old Town Scottsdale, please open one there!!!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-06-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'opuK8bxb5Ty4EA5hGUFrpg', 'review_id': 'kn528_r7g82A2b71_4N8Qw', 'text': "Love everything about this place and I'm from Chicago", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-06-02', 'type': 'review'}
{'votes': {'funny': 10, 'useful': 18, 'cool': 15}, 'user_id': 'wFweIWhv2fREZV_dYkz_1g', 'review_id': 'bsq8COjZQdAdLilQRdsUWA', 'text': 'Within the restaurants of a 5 mile radius from where I work, Detriot Coney is one of the most delicious, cheapest and offers the best service.  I went there for a dog but I saw someone eating a juicy burger so I changed my mind.  Drink, fries and a delicious cheeseburger for all under $8 bucks.  The person who took my order explained that my burger order number will be called out and then they will ask me what fixings I want "like subway" he said.  I thought that was a pretty cool feature and they had a nice selection of burger toppings.  The guy who cooked my burger, served it to me at my table and then cleaned up my table when I was done, what a superstar employee.  I\'m giving this place 5 stars because it was clean, the service was awesome and the food was very delicious.  For a hot dog stand this place is a cut above the rest!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-06-03', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 1}, 'user_id': '4D4UzEOu-QG4-jkyfynhPQ', 'review_id': 'ZMcGM-TKWDqiSg98Vt5Yyg', 'text': 'Let me start by saying I am not from Detroit or anywhere near the Midwest: I am from New Mexico :)\n\nDCG had been in my bookmark list ever since it first opened up, which was a while back... Today I had some time to grab a bite and on an impulse, DCG was my choice...\n\nI was super excited because I knew it had 4-5 star reviews but I was thinking "All these reviews are from people who are from Detroit" so of course I had to check it out and see for myself \n\nWhen I first walked in, I think the guy at the register knew it was my first time, he was extremely nice and gave me the run down of the menu and the history of his shop... He wish the owner, Dave. He told me all about the process of cooking and the ingredients that go into each menu item. Of course I had wanted a coney, because that\'s what was in the name (DCG) but Dave woo\'d me into getting a burger because it was their daily special... I liked him immediately because he was saving me money! He said I could try the coney on my next visit, tomorrow, Wednesday... Because they have a special on coneys! I really like how he was very nice and he didn\'t try to rush me or let me try something I might not like... Honestly everything on the menu sounded good so I\'m pretty sure I will go through all of it eventually... \n\nI opted for the Faygo pop just because I felt that it would make my dining experience a little more special... I got the orange one... I have to say Faygo is really sweet... I see that it is made of a pure cane sugar and I could taste it... I enjoyed it though...\n\nMy burger was delivered to me at my table by the guy who made it! \nThe burger was cooked brilliantly... The seasoning in the burger is what made me like it... I dressed mine up with lettuce, onions, tomatoes, mayo, and pickles... \n\nAs I was eating, Dave and his wife were sitting at the table next to me chatting and nibbling on something as well... It was very kind and thoughtful of him to look over and check on me... He asked how I was enjoying my food. As a small business owner, it is things like that which keep customers happy and make them feel welcomed in your establishment. I felt very comfortable eating that quad burger and I think he was a little surprised my little frame finished everything...\n\nAll in all, my visit to DCG went really well and I can say that I will be returning again and again... \n\nSo for all of you non-Detroitains (probably not correct) check this place out, meet the owner, and have a yummy lunch/dinner...', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-06-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'RT63z7wn8Y64eCWYDagw6w', 'review_id': '9Huwu_hvp5mD8hXw2drKUQ', 'text': "This is authentic Detroit Style Food, It made us home sick :) .  Dave was very nice and the Cook was very nice also. Real Detroit style hospitality. The food was really good I had the Double Cheese burger with Fries which were the best I've had. My Husband had the Gyro Pita and a Detroit Style Coney with a popping hot dog, thats a true test of Detroit Style.  We would love to see a location somewhere around Baseline between 16th street and 24th street with a patio.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-06-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-Fbz2bVORKPaBJrufdeROg', 'review_id': 'MZtnVyomyIbDYlNtf50NkA', 'text': 'This place is amazing! The food tastes just like it was made in Detroit. And the service? Completely friendly! I would recommend this place to Michigan natives and anyone who has never had a coney dog before. You will definitely be back for more!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-06-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'CTFMWQ8Ttjhl90ah-rZhaw', 'review_id': 'gocbq_ieNslW6Ya1dFEcrA', 'text': 'Next best thing to being at home in DTW.  Only way it could be better is if they served breakfast like back home...', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2014-06-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'Z8FpOLPZx9DTm56JFTV5cw', 'review_id': 'y6jDv_zzFR7mwUQq2u0LaQ', 'text': 'So glad we made the trek from Gilbert to DCG tonight.  Having family from Detroit & visiting the area we are familiar with the food.  Dave was so kind to explain this menu!  We had almost every item b/c we are a family of "6" so we tried the burgers, coneys, pitas, and the salad...\n\nThe chicken salad was great we actually saw the cook pull it out from the marinade & grill it right in front of us!  It was tender & very flavorful!  The addition of beets to the salad was great as was the homemade dressing.  My 15 year old son had two trike burgers...he\'s an endless pit.  The chicken & gyros pitas were great as well.  Their taziki sauce was tangy & scrumptious.  The Coney had the perfect snap with the right amt of condiments! \n\nThe family tried for the first time a "loose" meat dog.  Wow!  It turned out to be one of our favorites.  Now the fries!  They cut them right on the spot and reminded us of our mom\'s homemade fries.  We vote for the next DCG to be in Gilbert near the 202.  It was great getting to know Dave.  It great to see/hear the passion one can have for "home."  We will definitely be back & can\'t wait for the new place!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-06-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZGnqquDCOR9gR8YIAZKZ6Q', 'review_id': 'j4ycn1NKJgxYJ4IVHdDOPg', 'text': "Best burgers in az, real talk. They grind their own meat and cut their own fries. How can you lose with that combo? Everyone that works there is nice and friendly, the owner always checks in to see how everything is. I've been going there about once a week since they open and he still does it. That shows his dedication to a fine product and I respect that a lot. I always recommend this spot to people", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-06-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lAYxzTT_nAx8FF5TVDy59g', 'review_id': 'BmgaUC6XOf5GrSWlWN5xgA', 'text': 'I came here and had a triple burger with some amazing fresh cut fries and a Faygo root beer pop. I originally ordered a triple burger which included three patties and it was so good I had to order another! On top of that, the food was out in an instant, the food my family ordered looked very good but I was too full to try any. I vote to put the new location near the 202 at Santan. The owner was very nice and was welcoming to the restaurant. I recommend to check this place out as soon as you get the chance!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-06-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'nmpkOQfdLD78Igg_TssqoQ', 'review_id': 'Jmio-ORfzkwMj9ZgpdH8mw', 'text': "My husband treated us to DCG last night and now I can't stop telling all my co-workers about it (boo for working Saturdays)! We met Dave while out some months ago and he said to come check him out after noticing our boys in their respective Tigers and Lions gear. It took us awhile, but we finally made it in and now I'm wishing we had gone sooner!\n\nWhen you first walk in, you're greeted like family! Dave was so warm and welcoming and even the guys working the grill were great. He came and migled with all his guests and knew MANY on a first name basis. Before leaving we exchanged hugs after showing him what I wrote on FB about his Vernor's float (its AMAZING and I would've never thought to try it)!!\n\nThe food speaks for itself. I was sure I would need a second helping but barely made it through my coney and fries (which was enough for two people). Prices are considerably decent and we will be back often. \n\nWe live near Dobson and Main and I can almost guarantee good business at Mesa Riverview where the new Cub's Stadium is. \n\nThanks for making our experience a memorable one and we WILL see you all soon!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-06-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'Vp9R_pypJ_OFs909dzBD7A', 'review_id': '_1ohrDnXkql-acztwbbo4g', 'text': 'My hubby is from Detroit and this is AUTHENTIC. Highlights: The food is fantastic, staff is friendly;-  David makes you feel like family, place is clean, prices are more than reasonable. Get there before 7:30pm. I never write reviews but I want his location to be in Mesa!!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-06-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': '3qdID47hLPArAQ8z7MIkGw', 'review_id': 'DKfDYLzcoEaKmEZ-O8hHzg', 'text': 'Great food! Owner personally talked to all customers! Clean and great A/C for a 108 degree day.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-06-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'l7SI9G9K-bQc569xzDhtCw', 'review_id': '3ho8u3ret5Icip3w3OV3IQ', 'text': 'Original Detroit Coney Dog...and Faygo...', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-06-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'YJv4BQmAEmnkzCj0LLIqhQ', 'review_id': 'QloMSGKDSk2HmNfuwvnWyg', 'text': "By far the BEST DETROIT EXPERIENCE in the Phoenix area! Been living in Mesa for 28 years, best coney out here! Let's not forget the Faygo orange soda! And the fries are fresh cut too. Love everything about this place. You gotta put one in Mesa near Val Vista and Baseline, but I'll drive out here till there's one closer!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-06-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bFOc253WVkYG4MF1gHRD3g', 'review_id': 'gEopZU4R_xdjcs6Fq2lgTg', 'text': "I'm from the D :) and this place was always special to me . Glad to see this place so close to me . Home away from home . I got the Detroit Coney with a Vernors and better made chips.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-06-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'f2fFSXiFX-EQ-rb4g0Ru2w', 'review_id': 'tx9vbUQ9Bvh1iP_8Sx9A-A', 'text': 'This place is fantastic. The guy who runs it purposely imports the food and Faygo from Michigan even though it costs more. Totally worth the money. \n\nChili dog + cheese fries + Faygo = perfect', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-06-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'lA6n2GmHSDK23Yr5Zf46Og', 'review_id': 'lbZ8YVDxHq6TalNJBa_U1w', 'text': "Read the review in the Arizona Republic and had to try it.  Real beef hot dogs, chili was great on top, fries were perfect.  The show stopper was the Burgers! Patties are thin, so the triple was about right.  We live in Queen Creek, so until they open one out here, we'll have to drive to Tempe.  Definitely will be returning!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2014-06-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': '59zMOQ-kBRGS5iJv9Ga0uQ', 'review_id': 'wXsMDJWecsWox-bsMtt7Og', 'text': 'Good food, Detroit loose burger was great, the Detroit Coney Combo was outstanding, fresh cut fries was very good.  Prices were very reasonable.  Granddaughter had the double burger thought it was super.  Owner was very hands on and made the experience even more enjoyable', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-06-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '17fvu0Bupu6Io7r2B14FiQ', 'review_id': 'GgGRYJ7ITI1K72hEZgZlzw', 'text': "The best coneys in town, even better than Portillo's and I normally like Chicago style dogs but can't beat my hometown version....owner is great and treats all his customers like his best friend, old school personable service!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-06-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'ZnR8pEf1ULutAGUzA1p9HA', 'review_id': '8fu1erCz9eyli-Nidv37_Q', 'text': 'My husband is from Michigan and gets homesick often and I FINALLY found a place that brings him back home!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-06-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '8JEjQJuCWjtnEeMpGz8Qag', 'review_id': 'Vh8F9WAWicXRNbzdx17pJg', 'text': 'Right as I walked in, A very friendly owner made me mark on the map of metro Detroit where I\'m from, got jealous of my 248 area code, gave me a rewards card and right as I started ordering said "you know what you\'re doin." Needless to say, we have found our new regular spot. This place is a perfect slice of the Dirty D with all the brands and flavors from back home.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-06-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'sLJbb1CWfnNbxIQW5KA7kA', 'review_id': '8teJwKsv7uBps6-aWOfiNQ', 'text': 'Absolutely amazing. Being from metro Detroit I have been longing for a true loose coney and chili cheese fries. I FOUND IT!!! Whether you are from michigan or not, come here and indulge in these heavenly coneys. I came all the way from Goodyear. PLEASE ADD ANOTHER LOCATION OUT THERE!!!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-06-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'PZMBPCMzO2kOu68ZGemfVg', 'review_id': 'tRY20-YpRUfWY1YcICWi2A', 'text': 'Omg I thought I was back in Detroit.  So delish! The owner was very personable. Did I say that the food was delish!!!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-07-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'f3YqOTMFajsunWntm_Em5Q', 'review_id': '5ZpcrH9vkD-gBNqG6QijNw', 'text': "Found DCG by accidentally and LOVED IT! The coneys are great, but  the burgers are amazing. I've been bringing co-workers here for lunch, and it's become an office favorite. Now, we try to come at least once a week.\n\nThe service is impeccable. The owner, Dave, truly seems to care about the food and his customers. He personally takes the orders, makes recommendations and greets every table. Plus, they are FAST! At times, my order is done fresh before I even get my drink.\n\nIf you haven't been, make a point to stop by. You won't be disappointed!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-07-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xtBjXzEbwMrOjhJO7qGs8g', 'review_id': 'sI2Vmo3IfVm4GUcic0dHzw', 'text': "Excellent Coney's. Too bad they are not opening the location on 35th Ave. and Bell. Too bad that they will not comment on future expansion.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-07-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'AncVDK7eNz6c0pxLxAl42w', 'review_id': '53LWZOBPFTZ1wgoyg1TIag', 'text': 'walk in and BOOM you know your in an authentic Detroit run place. The manager or maybe the owner (im not sure) was ringing people up and you can tell he is definitely from Detroit. They have a cool map of Detroit and some push pins with a sign saying "put it where you come from" I dont think he would of liked it if i asked him to pull out a map of Ohio haha. O-H. but moving on. The place is small but has good seating and pretty good prices. The food itself was AMAZING. I got 2 Detroit Coney Dogs -onion. Simple i know but its easy to mess the chili on it up, and they sure didnt. The guys were awesome who were making the food. Very polite and everyone seemed happy to be there. I live right around the corner and ill absolutely be back. oh and btw they have a 10% check in marked off your bill. I just threw the difference in the tip jar. I consider this to be a nice hidden gem. I hope they expand and get some more recognition.\n\nThanks guys.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-07-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'aJFWU36ycNhxJzf2Lqh2oA', 'review_id': '-oYVIariR7ABfjzXBqlIVg', 'text': 'So glad we have a little slice of home here in Arizona. The hani was amazing, the chili was great (even in the heat of the summer) and the pop (not soda) hit the spot. And best part was the owner and his employees. Classy Midwest manners at their best. Keep up the good work boys!!! Go Tigers!!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-07-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'uZbTb-u-GVjTa2gtQfry5g', 'review_id': 'mGm0nYN6u7ToVXSJuYLbsQ', 'text': 'Great service, inexpensive prices, and nicely prepared meals. For those yearning for Detroit coneys, or like me, curious about what one is like after seeing them on TV, Detroit Coney Grill has exactly what you are looking for.\n\nThe menu consists of burgers, hot dogs, pitas, and salads, with some chicken and 3 vegetarian options. I decided on a Detroit coney. The hot dog had a nice "bite" to it from the slightly elastic casing, adding a nice textural difference from the rest of the hot dog. The chili was somewhat reminiscent of some Cincinnati style chili I\'ve had from Skyline Chili, except with more of a savory flavor to it. It went well with the onion, mustard, and hot dog. \n\nService was excellent, and the owner was very friendly and came by to make sure everything was tasting OK.\n\nHours are a bit limited for those that tend to dine later in the evening since they close at 7:30. Overall though, a great place for some inexpensive quick eats.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2014-07-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'uGCVrStveTPwK7RreVDsyQ', 'review_id': 'o2DsmlvqeMMz5DXTsPphQQ', 'text': "A true authentic coney grill, and that's coming from two Michigan girls! Everything was quick and delicious! And the owner was so sweet and attentive :) we will be back!!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-07-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'EQZjeyvQRe0xnEYcV_eK0A', 'review_id': 'MLghajUratrxYwKPfMI3jA', 'text': 'This place is great for everyone but a must if your a Michigander. The dogs are the real deal from Michigan, meat sauce with middle eastern spices, white Spanish onions, yellow mustard and a steamed bun. They have Faygo pop! These are the best coneys that you are going to find in the valley, period.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-07-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'IWQnB8woWMg5e7mSORSPQQ', 'review_id': 'Qdij9Gp3Tf_2hjjzUp7_gw', 'text': 'Best rendition of the "d" coney dog! Salute to the owner for bringing a little piece of home to AZ. FOOD IS AMAZING! Recommend a coney dog, chilli cheese fries and a rock and rye faygo to wash the goodness down.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-07-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UIn5YbjNZQeDNB3ZqyO5LA', 'review_id': 'KxSgvBjuonTYr7qPuC-54w', 'text': 'Very good food! Our table ordered hotdogs, hamburgers, and fries (plain fries, cheese, and chili-cheese fries). The service was quick, the owner came to the table and was super friendly (definitely not annoying) - they made it clear that they were grateful for our visit!! Great place!!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-07-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uJ1yEhbiGYhnxRliRqU5uA', 'review_id': 'EehT4P24udhf6R5fRu_nNA', 'text': "Detroit Coney makes you feel like you are home. The fast, friendly service is unlike most businesses out West. What really sets them apart is the 1st name basis/memorization the owner has for every customer who walks through the door. he converses with everyone, makes sure you have everything you need, and that you enjoyed your meal. He has the true midwest respect that is hard to find out here. The food tastes like it was made fresh and sent here in a matter of minutes straight from downtown Detroit! coney's taste like coney's, burgers/sliders taste like something out of White Castle, and the best part is they have Faygo POP! I could go on and on about this place and the feeling of home you get walking through the front door!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-07-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JAF4yoMVO1gYajKEzxTWKQ', 'review_id': 'DKfjMtHRCAU25nciBM-MJA', 'text': "Awesome food, awesome atmosphere, awesome service. If you're from Michigan, you will feel right at home. If you're not from Michigan, you MUST come in and see what you're missing.  These are the best burgers and coneys you will find anywhere. Wash it all down with a cold Faygo pop or Vernor's in the glass bottle.  So for a excellent meal for a great price, this spot is best is Arizona!!!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-07-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tTZMcys-D0e-ui63epKLaw', 'review_id': 'R6HGrAvwoxSgAJlbuANt1w', 'text': 'My husband and I visited over the Fourth of July weekend.  Having both been born and raised in the mighty Motor City, I must confess this place does it right!  The coney dogs and loose burgers transported us back home.  Love that they also serve Faygo pop (NOT "soda"!) and Better Made chips.  Owner David is friendly in that great Detroit/Midwest way.  Keep up the good work...and go Tigers!\n\nDavid:  Please consider a location in Old Town Scottsdale.\n\nDebra', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-07-22', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 2}, 'user_id': 'Ob_9JbL31wkSJxYseEVk-w', 'review_id': 'WbSMDps31cZZGha6n0tT3g', 'text': "While not from Detroit, I'm familiar with this style of Coney. In Scranton, Pa they're known as Texas Weiners. Slightly different from what I grew up on, but very good 'comfort food'. \n\nOnly reason I can't give it 5 stars is the Penn State joke on the wall :-). \n\nIf that's not there next time I go, and there will be a next time, it will most likely earn the coveted 5 Star Rating!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2014-07-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': '6bLMo_pumOm50OBflxFdBg', 'review_id': '3lBZBkxMY05-Bf6aJV_tVA', 'text': "I love this place.  From the first visit, I knew this was a joint I would frequent whenever I come to town for work.  In fact, I have my coworker addicted to this place now.  We decided that since this place is so great, it's on the short list of places to go with the company cool kids secret club.   \nThe customer service is great, like really great.  The owner is helladope.  He always has an exuberant greeting, handshake, or hug for me whenever I come in.  The guys behind the counter are always super friendly and helpful.  Didn't know you needed a spoon and ketchup?...don't fret, they knew you did and they'll bring it to you.  The prices are low.  You can fill yourself up to bursting for less than twenty bucks.  There are quite a few things on the menu; but why would you get anything other than the Detroit Coney?  The hot dogs are great.  You know you're eating a good dog when it snaps when you bite into it.  The onions could be a little bit more oniony for me with just a little bit more bite to 'em.  The chili-fries are so so good.  I can feel my arteries clogging with every delicious bite and if I have a fat-girl heart attack on the way out of the door, it'll be worth it.  They also carry a bunch of Faygo, but you need not paint on your ICP face to have any.  I've had a few other things, but it's really all about the hot dogs and fries.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-07-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'v3YjpLZ44xc9ZL6i6u_lIw', 'review_id': 'f835w52dkvlfA1edR3RTYg', 'text': 'Excellent Dog just like Lafayette Coney in Detroit...Consistently great food and service.\n\nThank you for coming to Arizona!!!!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-07-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3N1fLLISzGcbLZr8r8o62Q', 'review_id': 'tszAi0ttEWiNEfwAAUrJLw', 'text': 'Amazing food, good prices.  Would love a location near frank lloyd wright and the 101!  Thanks!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-08-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TJygi1NrgnbzQrYO_--I3Q', 'review_id': 'vWIt_NrYujpSgZVvuWzDsg', 'text': 'Finally!  A real Detroit Coney.  A hot dot with a snap, perfect chili and real Vernors and Faygo to boot. Now we have to get them to open another farther north for all his many fans that need a fix.  Taco Haus, 7318 E. Shea, has closed and would be ideal for us hungry fans.  Add your voice to a new location!    \n\nLinda K.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-08-06', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 2}, 'user_id': 'ibyyVvseLOK4sSHVhJgEjQ', 'review_id': 'I8wGYkmquVSy54pBD-ytNA', 'text': "Authentic Detroit Coney Dogs!!!....Tastes just like Lafayette Coney Island....Faygo, Better Made, Vernor's..!!!!.....David, the owner, is a really good dude.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-08-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_S8kN_BPj2mtU4rzpLuo9Q', 'review_id': '3i_rip2BagDYjJwx6ojeYQ', 'text': "Best coneys, burgers and salads around! It's like a piece of home for me and my family! We love Dave(the owner) and all of the employees!!!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-08-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'qKqvVFP6PmxlS7-u0xjs3g', 'review_id': 'V3zo2oopBk783zeK4b7lCQ', 'text': 'This place Rocks!  I was expecting another "Coney knock-off joint" being from the D myself, I\'ve tried most every "Coney" place I\'ve found in AZ. I figured I\'d stop in at the recommendation from another Detroiter in the valley and I\'m glad I did!\n\nThe food is as authentic as it gets right down to the taste of the chili and the "snap" of the dog when you bite into it (ya\'ll know about that snap) and the checkered table cloths. Remember its "pop" in here and they have Fago and Vernors and the infamous "Boston Cooler." \n\nThis place is a slice of Detroit Heaven in Arizona, highly recommend!!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-08-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'VhkT_WMpo775WJFy99-8Mw', 'review_id': '26Y5Iagn0b2uMvoIekLOrA', 'text': "I crave these dogs! !! Been here many times since first visit and the experience just keeps getting better. When ya get to know the staff,  it's like coming home. ... great people,  great food, great ambience. I LOVE THIS PLACE !!!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-08-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'qaxSFbY4CJ0nmDVjOqsFrA', 'review_id': 'V2hezMO-rTFHpCJNUR1osA', 'text': "This place is AWESOME!!! Great food, friendly staff, good value. Only knocks I have are the place needs to be larger and the self service area could be better. But that's a problem in a lot of places.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2014-08-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'k_hSdQ2dAYyYnzmATyG_2w', 'review_id': 'pmJ_FvFGacqExpzp7U6TYw', 'text': "First time visiting today. You want a good hot dog? How about a great Coney Dog?!\nThis place is legit and reminds me of places in Detroit and Toledo. I used to work at Charlie's Coney Island in Toledo. Absolutely awesome flavor and snap to the dogs. I ordered the special with hand cut fries. Wow . I ordered two Coneys to go and ended up eating them there. Today I was a pig and I cried on the way home because it was so good. Best Coney Dog I've had in 25 years!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-08-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hsZQLg2D4zvrgpRv2YcKzQ', 'review_id': 'SE_SJkw6Q2RJYXUdsfIpdQ', 'text': "We moved to Arizona from the Detroit metro area 10 years ago and have been waiting for a place like this. It was delicious!! We couldn't decide what to get, so we got a few items to split. The coneys were great - rivaled any coney joint in michigan. The chicken pita was fantastic- get it with feta! My favorite were the fries. They make them fresh right there and you can really tell. The owner was friendly and welcoming, and all of the staff was helpful and had smiles. We live in Queen Creek and would LOVE one of these in the south east valley!! We will definitely be back- keep up the good work!!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-08-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nRvHTNnfM4QzATZxGtDDMw', 'review_id': 'a3vJGweDH9TrAv6YK5Ilrg', 'text': 'We love this place. The coneys are authentic. The chili cheese fries are a total upgrade with the fresh cut fries. And beets on my greek salad? Yes please. Super friendly staff.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-08-19', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': 'wZofKKoECBLrsBCCss56lg', 'review_id': 'Z6ybAiXdplBbq_5YlcjJpg', 'text': 'The Real Deal!! not Hormal ...\nThe only place in Arizona that reminds me of Detroit !!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-08-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1quZ0zyBF4GcliFqwPeHiw', 'review_id': 'CR42FbSsPh-vNLo9OaY8Mg', 'text': 'Yum.....better go and eat up', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-09-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Sjc7Dq2R8p4NUP5oDH9z8A', 'review_id': '63pyjAXtpLmYSiha4Yx1Qw', 'text': "Originally from Detroit, was feeling homesick and this is the only place that has authentic Detroit coneys. Anyone else who makes a coney and says they get their ingredients from MI doesn't mean they know how to make a coney. Coney Grill is Lafayette style straight from Detroit\n\nHands down, my most favorite restaurant. If you're thinking about going, you're overthinking it, JUST GO!!! IT'S AMAZING!!!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-09-06', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'UKN9SMhTgyC5ECsGNK7EWA', 'review_id': 'a4Up81c5L7_l-efzAqKQFg', 'text': 'As I walked in, immediately a familiarity washed over me. The smells, the sights of the blue, orange and white. - David introduces himself to me, and I am proud to say I live in Tucson by way of Clarkston. He gives me a white push pin to place on the map on the wall. - I feel welcomed. - normally a gal from Clarkston would be laughed at and never accepted as "from" Detroit, but not here. - here we are all Detroit. Here you can tell by the passion of the way David speaks on how he had to deliver the coney to these parts, if you even know someone in the mitten, you are Detroit. - I ordered 3 chili mustard onion coneys, and regular fries. -David seems saddened as I tell him it\'s to go because a sleeping baby and a husband in the car. - he wanted my first bite reaction in person - I order a faygo grape and he immediately opens it and allows me to have that sweet 100% cane sugar pop before I pay. A robust smile as he is satisfied by my reaction. - I am in the car, I open my dog. The aroma is right on. Reminds me of home, Kirby\'s, Pete\'s, National, and every Greek restaurant coney in between. - I notice the softeness of the steamed bun. - I bring it to my lips and the taste of fresh diced onions, sweet chili, and the snap of the dog. I question, is this a kowalski? No, maybe a koegel? Deliciousness ensues. And then it\'s gone. - perfect. Just like home.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-09-06', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'Rq4Q_o5kf2Tvo4Qezi8tvg', 'review_id': 'pU29U9zfcDAJ1ipvBrJ5QQ', 'text': 'I am from Detroit. I moved to Tempe two days ago and this place is a little slice of HEAVEN!!! All my local home food...they call the pop, pop and not soda...better made chips, Faygo pop....I will eat here more than once a week.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-09-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'H9cL63YXvbyAnNhQmprrrg', 'review_id': 'OfboOAuFAHW0dbjzDkcuvw', 'text': 'This place is amazing. Super excited to find a real Detroit coney island here in AZ. They had Faygo Red Pop and Verners! Owner, employees, and most customers are all from Michigan so real friendly atmosphere. Will continue to drive here all the way from PV but crossing my fingers for them to expand and have a closer spot.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-09-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7igkbKzhTxgRwDGh6dBR0g', 'review_id': 'I9XsmR9xsyQffe3izKg2yw', 'text': 'This place is great!! My favorite is the fries!! The hot dogs are so good (I recommend getting two if your hungry) I also LOVE the gyro. I highly recommend this place!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-09-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'yUtlyIG_4hJNsdmbe-BhbA', 'review_id': 'LJKND8CoMTpv7zcAUp5Ynw', 'text': "I love this place! My boyfriend and I stopped by before I went to work because he's been eyeing this place. The philly cheese steak in a pita is basically everything I love in one meal. The staff are super friendly and Dave definitely tries to make sure EVERY customer is happy. The chili cheese fries... I would definitely drive all the way back up here to get some more! Ah and the cooks are great! They do such a good job and are as nice as the owner. Will definitely come here again, no doubt! :)", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-09-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'C3VpWgCsdwyYs6Xoy1JcJQ', 'review_id': 'nbjEICbwZvKLxiRuymceMg', 'text': "Had to check it out last week for lunch being from the D! Not bad dogs.. coney is good., they have Fargo rock n rye !! And Vernors in the bottle !!!  Enough said -  great little place guys are working hard to do a great job!  prices are decent , I'm coming back got to support the small guys brining something new to the valley!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-09-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'G_hzJ0byzxfxVL5dafAevg', 'review_id': 'wHVzuRmURVIvIIjFCwRHQw', 'text': "Detroit Coney Grill makes a legit coney! If you are from Detroit you won't be disappointed. If you aren't from Detroit you need to give this a try!\n\nThe only thing better would be a location in Gilbert! Please make it happen!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-09-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'QiT4EhIKyxfGsSL6g_fkRQ', 'review_id': 'fUgxfzd4tRvcn8x1pGB1lQ', 'text': "Best dog hands down in AZ popping deliciousness in to every bite!  The dog literally snaps with the same freshness the hand cut fries have.  Highly recommend the Detroit Coney combo with some fries , either spiral or regular cut (even recommend the red hot fries;) Service was as authentic as the food, which is bonus points with how funny the owner is, and we were served with 'Detroit' written in mustard on our coney! Word to the wise to those who wisely chose to eat here, you never ask for ketchup on a coney!\nhttp://www.detroitconeygrill.com", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-09-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'cCg4XkCkHsuMR4yJna-4qg', 'review_id': 'NoZ7cGB45jFULoJH8Pr5gA', 'text': "Amazing food and excellent service! They even have sodas and other Detroit native foods! Whether you're from Michigan, or just a fan of great food, this place MUST be on your list. Definitely check them out!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-09-19', 'type': 'review'}
{'votes': {'funny': 5, 'useful': 6, 'cool': 5}, 'user_id': 'diDUDx82VePOC1hObkHwMw', 'review_id': 'WHNa7Z8OZZ8C9pS8ZgMveQ', 'text': "The guys here at DCG have some serious passion for the Coney Dog and the action they have going on is pretty cool as well. Inside is full of fun items to make you feel like you're back in the Detroit area and then some. Take your time and check out the walls.\n\nI've never been to Michigan but do love THE DOG. Been here a couple times and usually order a couple of their famous Coney Combos. Even broke down and had to test out some of the Chili Cheese Fries. Nice!\n\nReally like the way the Dog pops in your mouth as you bite into them. The Hand Cut Fries are made fresh to order and you can definitely tell the difference. They also have Burgers, Pitas, Salads and boneless Chicken Wings as well.\n\nThe food is pretty good and most people seem to rate this place rather high. I'm inclined to go with an A-OK since the Chili or Coney sauce just did not have much of a thrill factor or flavor profile for me and the hotdogs are little on the pricey side.\n\nGive them a try and see what you think. This is one of those regional flavors that you are going to enjoy more if you are from that area. I tend to lean toward the Windy City when hankering for a special treat. BEEP BEEP!\n\n3.5 STARS", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 3, 'date': '2014-10-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'cIJzKFwvBSnh0rmP7m_i7Q', 'review_id': 'WFILGBtQLxF6KEqnlCHamQ', 'text': "After a lovely day of training in class for the private TSA friends introduced me to Detroit Coney Grill - Being a Detroit native I was excited to go there for my first time.  I enjoyed the best priced and quality Lamb Gyro I've ever had in AZ.\n\nThank you Detroit Coney Island, Tempe, AZ - I'll be back SOON!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-10-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MhpmGvuZgms_336BDdsdmQ', 'review_id': 'ONJZfQKG5lpcC6XKZLH4FQ', 'text': "People have been telling me to come to this place for weeks but I figured it was just another five guys type joint but that is most definitely not the case with Detroit Coney Island. As an avid burger lover....let me rephrase that, as someone who eats a burger for every other meal and never met a french fry that she didn't like, I gave Detroit Coney Island five stars. The owner told me that I could have my burger any way I wanted it, he encouraged me just to tell him exactly what I wanted versus looking at the menu. The burger was juicy, the seasoning on the fries was zesty and most importantly I didn't leave feeling sick like I often do after eating greasy food. I didn't think anybody could do it better than Inn n Out in terms of a good, fast burger but this place is my new go to - hands down! Even if you don't like the food, the owner (whose name escapes me) is super friendly and very intent on making your dining experience unique. I wish Detroit Coney Island the best of luck in its plans to expand and I know I'll be first in line when theres one in Scottsdale!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-10-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MArVrvthRMKAPFwYySnZew', 'review_id': 'Z75E5JJseln5RzKG-RPdeA', 'text': "The coneys, fries, greek salad and the Vernors, of course, taste just like back in the 'D'. If you're from Detroit you you'll want to visit.  Coneys are discounted to 3.13 (313 area code) the day after a Lions win, like today!\n\nWe definitely need a Detroit Coney in North Scottsdale, preferably near Pima & Pinnacle Peak so I can walk there :)\n\nKeep up the great work!!!!!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-10-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'GA59VNuPp9XKdIB7fknylw', 'review_id': 'W6l9BGYPCO8-3m_D9a4hvg', 'text': 'Wow!\nFabulous ambiance and service. The food was amazingly good. I will keep going and going here until I am too fat to fit through the door. Yup! It is that good.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-10-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'VIHhmBcFYuM5r4sd9ycxYQ', 'review_id': '7Ojt0XlLhr1c2RMabtPesA', 'text': "If you're from Michigan, you must try this place.  Great food, Faygo pop, Better Made chips and Detroit t-shirts.  The Mackinac burger is to die for!  The employees are very nice.  I'm hooked!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-10-19', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'YtsGnr9GH3kA2UbgVBFFZw', 'review_id': '0M_kPTm7EM0FI92Ixgh3Xg', 'text': "All I can say is WOW.  This restaurant delivers a little taste of home in the desert.  Being from the Detroit area, I was skeptical of how well they would portray this Detroit tradition.  The chili was spot on.  The hot dogs were just as good, if not better, than what you get back home.  And the 'Hani' was better than most in Michigan.  The owner (Dave?) was very welcoming and passionate about the business.  Overall, great experience.  They surely brought Pure Michigan to the Valley.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-10-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'ozGnH8HX7mII3a30sF6zZQ', 'review_id': 'Fc0e9jm1VBN-Ej0CrVjHFg', 'text': "AH-MAZING! Haven't had legit Detroit coneys since I moved here in 05, they were SO good. We drove from Glendale to come eat here,  that's how good it was. Also the owner came back while we were finishing up, said hello and shook our hands, super nice guy. I recommend this place for sure!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-10-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': 'f5CqKZlqK9Sox9z9wuooCQ', 'review_id': 'LC-6h2ChKzuriW9-zFM89g', 'text': "Great place.  More of a 41/2.  Came in a couple days ago and had the special of 2 coney dogs and a drink for 8-9 bucks.  Also ordered the loose meat sandwich and chili fries.  Everything was awesome.  The natural soda brand from MI they carried was outstanding stuff too.  Of course, they call it pop.  The owner and staff were super nice guys and we look forward to going back.  They're thinking about opening another location so hopefully it will be in Gilbert near San Tan Mall.  Hint hint.  We live right by there.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2014-10-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uWr21MBjmfojZ4MFaVlong', 'review_id': '6iinE0OPH4595QMoK7ZSxg', 'text': 'I\'m quickly becoming a big fan of this place, and the guys behind the counter. They\'re always super friendly, and willing to answer any question you might have. Pretty sure they\'re all from Detroit, and they\'re not shy about it. \n\nOne key thing about this joint is that they make their own dogs and grind their own meat, and they\'re proud of it! As well they should be. Their dogs are awesome, with that *snap* you look for in a good coney, made from real meat (no "lips and assholes", as my partner puts it). I had a burger the last time I was in, and it was damn good. The patties are small, 2-3 oz, which is why their burgers come in double, triple, quadruple, etc sizes. The only complaint I had was that my bun ended up kind of soggy within a few minutes, which is a pet peeve of mine. The fresh cut fries are great, and you can throw toppings like chili and cheese on them. \n\nIf you\'re looking for a good, authentic Coney Dog, with some Faygo Red Pop to go along with it, this is your place! It\'s definitely our go-to hot dog joint now.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2014-10-27', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'NjtSvsZTJ6WP7uXYn6o0IQ', 'review_id': 'A4rpwtNtc2X6JBcDzYtPVg', 'text': 'What is it that makes this place so special? I had the Combo Coney Dog, that isn\'t chili dog..  and it did nothing to me. Hot-dogs are substandard food no matter how much you pay for it. And the chili on top was no culinary experience at all. it made my hot-dog bun soggy. It had no great flavor, nor was in special in any fashion. \n\nThe service is good though.. just a little too much Disney over the whole "we\'re so genuine". I find it parodying true home pride.. and not in a good way. It looks clean but it is a fast food place, and I am trying to figure out what it is that people like with this place. The food isn\'t anything special. There is no ambiance to speak of. So what is it? They are nce here, they are. But it becomes a theme park kinda thing. "We have all this Genuine Detroit kinda hot dogs and stuff"... Ohyeah, looks and taste like normal hot-dog to me.\n\n(I was leaning to the cheese fries. in my mind it would be fries slightly overdone, a hint of vinegar and topped with some interesting hard cheese flavor. But instead it is same fries w nacho cheese (you know the crap you cannot legally refer to as cheese). I didn\'t try it. I saw it. So happy i didn\'t go that route.)\n\nYes, they sell some stuff like Faygo that is good and all, but all-in-all you pay for a meal that\'s suppose to reflect something that doesn\'t really exists. It\'s a hot dog stand with a gimmick.  A gimmick that I can\'t even grasp. That is it - and promoting the emperors new clothes is not my thing. \n\nBest part of my meal - overpriced Faygo. I will not suggest to come back here.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 2, 'date': '2014-10-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'V16DzH5BC3ldngWU7leZUA', 'review_id': 'fEIPwIaKjqI9ICg1T0dEvw', 'text': "Great place to eat, stopped here while I was in the area was a little skeptical but boy was I wrong very good flavor... I am a very picky and plain eater and they have a very simple menu and can whip up almost anything for you, amazing customer service Dave is the best I can already tell. \n\nLive in Mesa let's get a location out here!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-11-19', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'NjtSvsZTJ6WP7uXYn6o0IQ', 'review_id': '-U5qbzvUro_-E8N1LsZLhQ', 'text': "I need to correct my review. My old still stands, but As of lately I did have a double burger and now I will review it for you all:\n\nTwo thin tasty patties are placed on a bun. Between the patties and on to of the top one is a slice of cheese, and the cheese sucks. I don't even think its cheese, it's probably a foul cheese product and I loathe foul cheese products. But enough about the cheese - the final compilation of break, patties, foul cheese and stuff made a surprisingly tasty burger. I actually enjoyed it. \n\nIf I come back I will go for the burger instead of the dog. Yeah, that is what I will do. I can't go 4 stars because that I do to places that I will see out... but they definitely should be partially redeemed from my previous hard judgement. \n(If real cheese, we might even be able to see four stars here.)", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 3, 'date': '2014-11-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'OtrENb_TBwuTPHJwZUXW7Q', 'review_id': 'Br57LMpMPw9_CUE-8oBpIg', 'text': "Incredible food that is as authentic as you can get. My boyfriend and I went for the first time tonight and after finishing dinner we ordered a second dinner each lol. I am from Detroit and the food was just like home for me. Hands down this is the ONLY place I would recommend outside of Detroit for a good coney. David, the owner, is as welcoming as you can get and so passionate about the food and making sure  it takes like home. If you're not from Detroit you'll still find this place to be the best you ever had.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-11-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'bm51ybWC47z1i_kfCqdy8g', 'review_id': '4wMp2934qYEaPd5CkJr0yw', 'text': "We're from Southern California so I'll start by saying..were used to extremely rude people and very basic food. This place gives me hope for society. The workers are very nice and the food is good. \n\nHospitality? A+. \nFood? A+.\nPrice? A+.\n\nThere were 6 of us and our food took less than 10 minutes. Their boxed water is to die for and their faygo pops are great as well. Detroit feeling in Arizona you can't beat it. They gave us some chips to try as well that were great. We would definitely come back...unless they opened one in CALIFORNIA!!!! Hehe. Thanks guys!!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-11-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cexJ5BzD2yXatfsKHhFoLw', 'review_id': 'i5yTsrDuGJPzf1qYNrfcwA', 'text': 'Having been to Detroit many times I know good coney dog . This place is flawless in bringing the true flavors of Detroit to the Tempe area.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-11-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rn0M9Edfc5SRUEIyPtCgdg', 'review_id': 'J3j562GSDqzSgufwO7swHg', 'text': 'Awesome employees, great atmosphere, top-notch food, and fair prices. No doubt that these are the elements that set Detroit Coney Grill apart from other restaurants in the area. I hesitate to use the word "competitor" here, as the Coney Grill has no clear competitors. It\'s just an old-school vibe that makes every visit feel like time well spent. When combined with the quality product, there might not be a better casual dining experience than the one to be had at theDetroit Coney Grill.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-11-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 2}, 'user_id': 'i0A-c2yoHySmFhRV2sDR1g', 'review_id': 'BT7BUFgh8xd4jFamPmrRtw', 'text': "One of my Facebook friends posted about this place and I really had to give it a try so I cheated a bit on my diet and headed over. The Coneys here are really great, I only ordered one because of my diet but I REALLY wanted to eat about 3 and add some of those chili cheese fries. \nWhen I get back in better shape I'll definitely be back for more!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2014-11-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '0rHB4O70bvLcKiQ52eRj2Q', 'review_id': 'L-z5WGC-gn-kZeyGOmpfxQ', 'text': 'Drove up from Tucson. Great Coneys and Faygo too! After finishing off the Coney dogs, we had to go back and try a "loose", which is a hot dog bun filled with loose hamburger meat, and topped with chili, mustard and onion. It\'s a Detroit specialty!\n\nReasonable prices. Worth the trip.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-11-28', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': '2GGr7pozUcY99CGFCx9xKg', 'review_id': 'pWwrU17jIHy_z6D9agjc2g', 'text': "Staff was friendly, prices were reasonable, and the food was quick and delicious. The meat is ground in house, and the patties are thin and layered, with cheese between each slice (or so it seemed). Do yourself a favor and add avocado. \n\nI loved my Cajun fries, while my husband thought the regular fries were good, but a touch soggy. I didn't notice that at all, though it could be because I dumped a ton of malt vinegar on them. \n\nEither way, this is one of the best burgers either of us have had in Phoenix.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-11-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HyaqtQEKiy1w8BR3NTOpYA', 'review_id': 'U5FJDbqs8hC190CxLIZqIQ', 'text': 'If you every had a coney dog from the Midwest then you will be right at home here exactlant food good staff.... If you can over look the fact that they are wolverine fans its a really good place', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-12-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'U616JSw2tZuvBJ2GFHOC2g', 'review_id': 'REy5NJEY1u0LibM4_RH9iw', 'text': 'Love the owner, has the east coast persuasion! lol Food-Fast,Fatty anddd Fabolous! Had the quad cheeseburger love the meat plenty of it and chesse melt beautifully! Partner had the philly on pita! YASSS! Hot food, great service, MUST TRY! Thank you I will be back soon when I need a burger or philly! Only thing-stay open later I know the college kids will come all hours of the night!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-12-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WT8NRPTXaeA5NU9oEdNH4g', 'review_id': 'f08lfbRjw78AE2UBmFgtng', 'text': "Better Made chips, Faygo pop (not soda!), coney's, chili cheese fries! This is a fantastic taste of home.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-12-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dIIR0bbp-B5ZvTSFgcGu0w', 'review_id': 'e0P9kq85kBjiEbKrd4FvXA', 'text': "Faygo Soda brought back memories. Chili dog was great. A few onions go a long way. Don't over do it unless you really like fresh chopped white onions.  The curly fries were just ok. I was expecting Cajun seasoning with a little more flavor and bite. Not happening. Nothin special. The hot dog was good. Nice snap when you bit into it. Trust me on the onion thing tho. Oh yeah. I'm from Cincinnati and nothing beats Skyline Chili so take my review with a grain of salt.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 3, 'date': '2014-12-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '6_oIBE1IwWxMYqU1GWk7uQ', 'review_id': '8-4ppL_Nc3ELi6yeQ78Sfg', 'text': 'Thank God for the Detroit Coney Grill! David, the owner, is super friendly and is on top of his business. My wife & I ordered 3 Coney dogs with mustard, fresh cut onions, and topped with a sweet chili, that was a nice bean less meat sauce. The hot dogs were hot, expertly grilled, not steamed! The buns were warm, fresh and steamed. The Detroit dogs were excellent! When you bite into them, they have a nice snap. Everything was just like what we grew up eating back east in CT & MA. \n\nWe also had a bag of Detroit Better Made potato chips and 2 bottles of Faygo root beer pop. We drove down from North Scottsdale and the trip was well worth it. We do hope David can open a spot up north, closer to our home. We give it an  A+. We will come back again! Best of luck to David, the owner. Keep up the good work!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-12-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'gg_OKjOAl_vVmdh5ZETuiw', 'review_id': 'X0QycQqQfFSbIuMyWtlIfQ', 'text': "After my first visit to Detroit Coney Grill, I was hesitant to leave a 5-star review. I wanted to be more objective and wondered if I wasn't wearing homer goggles. After multiple visits it's clear that Detroit Coney Grill is legit. Everything I've ordered has been top notch. The coney dogs, the loose burgers and the classic burgers and, of course, the fresh cut fries (go Cajun style!). They do it all and they do it greatly. You will not find a better coney dog in the valley. It does not matter where you are from, the food is fantastic. Detroit Coney Grill has become one of my favorite dining spots in the valley. This is also the only place I know of where I can order food and wipe my feet on an Ohio State rug (the homer in me loves this).", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-12-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3sNKZBCy85HAiWSGtqnR4w', 'review_id': 'khnWwMhr7ygs9IEum-hhAg', 'text': "Awesome food - I'm from Michigan myself and I enjoy a classic Coney meal. David's Detroit Coney grill did not disappoint. The girlfriend and I had the chicken hani, loose hamburger, coney dog, French fries, Faygo root beer and boxed water! Amazing!!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2014-12-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'N2e2Pu9CFv92MziKYSdwWQ', 'review_id': 'rktXHhBvdgS9ocd9r8WrNg', 'text': "Where do I start. The coney dogs are great!  The hot dogs are very good and the chili has great flavor. I did the Coney Special and it included 2 coney dogs, a boat of fries, and a drink for $8.88. Tons of food. Super cheap. \n\nThe Better Made Honey BBQ chips rock. They are soooo good. I love them. I looked on the package and they are made in Detroit. \n\nMy husband had a Philly cheesesteak pita. It was freshly made and tasted so good. The meat was cooked perfectly and the flavors commingled together very well. \n\nMy only complaint is that they didn't have tea. Said they didn't have tea bags. I already purchased a drink and had to go and purchase a bottle of water too.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2014-12-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BS5pcU92GiS96cH4sY7ypw', 'review_id': 'Ur9MQxf3yPIp7Q6q4x5w9Q', 'text': "Went to the place on a whim. It was excellent. Best coneys I've had. Owner was great to talk to. I would certainly recommend and will visit again when I have the chance.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2015-01-06', 'type': 'review'}
{'votes': {'funny': 5, 'useful': 9, 'cool': 5}, 'user_id': 'NjtSvsZTJ6WP7uXYn6o0IQ', 'review_id': 'b_mFGes4Zd6AijcVKXo8WQ', 'text': "I have had the burger again, and last time I was wrong. I assumed things about their cheese, and as it isn't my favorite they are more particular about their quality than I ever could expect. I learned that the cheese is local, a fact that I love, and made by Shrieber Cheese. But enough about the cheese - the final compilation is still a tasty burger. And i have enjoyed it. \n\nI have come back a few times and at first it against my vote, but I fell for single majority. I had to give them a second third and a fourth chance and they have started to grow on me. I do still favor the the burger over the dog. That has not changed. \n\nMy hat is off for the persistence and the corrections. After each review I have been contacted by the owner, not requesting me to changed my review but correcting my wrongful assumptions and guesswork, and having a decent attitude while doing so. For this I am truly impressed, this is the way to go and the way to treat your customers. this is the kind of business I want to support.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2015-01-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'F4talvMzW3mVpMxyQxapUA', 'review_id': 'yoMF8ivDa2nU6CqEZD4lLA', 'text': 'Great homemade food. Great service. Awesome coneys, gyros and burgers. All burgers are ground on site, incredibly fresh!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-01-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bNQltJD03OrULD7LGISqNQ', 'review_id': 'taqLMN30NiQcQmtDdxiYcw', 'text': "A great place to visit whether you're from the mitten and missing home, or wondering what the mitten has to offer. Fresh food - Amazing service - Tasty Food - Fast service. Defiant return will be in order.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-01-12', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 10, 'cool': 4}, 'user_id': 'IGkoathSlJmIOBDGo9vUZg', 'review_id': 'jR0JqB0SV2Ij2ZPGiSrFkA', 'text': 'With all of the hamburger and hot dog places clustered in Tempe, it takes a lot to stand out.\n\nDetroit Coney Grill has that special something.  The patties in their burgers are thin, but they offer a "quint" or five patty burger that is like a double burger elsewhere.  Absolutely fresh, delicious, and juicy.  Order it any way you like and you\'ll get it to your table quick and with a smile.\n\nWant more food?  You can get more patties--order 18 if you like and eat \'em if you can.  ASU students please take note--wanna do your own "Man vs. Food?"  Here\'s a delicious spot to do it!  Fries are fresh cut and tasty, and drinks are bottomless.  \n\nOne of the top burgers in Tempe--TRY IT.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-01-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IdBWdv6I6gn4M5ZDMQ_cVg', 'review_id': 'ZM7A5QDQmRLBnrR0qsajKw', 'text': 'Good place to get a Detroit Coney dog in phoenix!!!! I even placed a pun on their board to show where I am from. Yummy!!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-01-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SzKslA2UKeVZT-jTqnxFiQ', 'review_id': '-OKttNueyKh6ntpEL1z4nA', 'text': 'Felt like I was back home at the Lafayette Coney Island - and that to me is heaven.  I ordered "2 on 1, lite onions" and we were speaking the same language.  The fries were good.  My husband had the combo with the loose meat hamburger and loved it.  With Faygo POP, not soda, and Better Made chips, how can you go wrong?  If you are from Michigan especially, you will love it.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-01-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'Ra0hWQr8WM3rKC5raett7A', 'review_id': 'ZOiQoGF9H9YlclVYHshvXQ', 'text': "The owner is awesome.  Always friendly and makes sure you get what you want.  Great, fresh burgers and coneys.  You won't regret going there.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-01-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '8sRHoVdFLrOgE9O61Pwt3w', 'review_id': 'X_1cE-qAl9XvP76JPVSuFA', 'text': "Chili dogs with mustard & an insane amount of onions with a side of fries.  \n\nIt's alright. It's a good hot dog, but at the end of the day, it's still a hot dog.  Better than weinerschnitzel type chains, but that isnt saying much now is it.  \nPrice was fair.  \nService was adequate.\n\nThe restaurant is filthy.  The tables needed a cleaning.  Small pieces of trash randomly all over the floor.  \n\nAs a Detroit lions fan I appreciate that they have an attachment to the teams of Detroit.  Maybe if they started selling beer & showing lions, tigers, & pistons games this could be a spot for sports fans.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 3, 'date': '2015-01-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 4}, 'user_id': 'rR9JQw7pigdKcStrRDcoQg', 'review_id': 'AyCiynFbRqTirYBuUntqdg', 'text': "I have been waiting for a piece of Detroit here in Phoenix. Anyone from the 313 knows that coney's make the world go round! This place delivers! Lafayette's chili is the best chili in Detroit, and that's what they serve. \nBetter Made chips, Faygo POP ( yup! That's what Detroiters call it!!)\nThe owner is a down home Detroiter! This place delivers what we've been praying for.\nAND.. He is trying to open a place in the old Whataburger on Bell and 67th Ave. If you live in Glendale call or write the city to help get him on West Side. You have no idea \nwhat you are missing!!! Detroiters UNITE!!\nBring coney to our side of the city!!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-01-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Dkbm7KWrg01U0We4aVCKqA', 'review_id': '_TXFjHF19BQcO2fYMkTRBw', 'text': "I've been here several times, and you cannot go wrong here. the food is fantastically done in the MI coney dog tradition. the staff and the owner are extremely friendly and helpful. and they offer faygo. also you can wipe your dirty feet on an Ohio State floor mat.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-01-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'b2DKC4kC8-QeSeGZ_MF3XQ', 'review_id': '6aExnmVWwSp587shonuyzQ', 'text': 'After seeing this place in the Yelp top 100 we had to check it out.  I find it hard to believe it made the top 1-- but whatever.  The dogs were good but the owner was constantly yelling at his wife/girlfriend who was taking orders.  Place is in a strip mall.  Most of the food is a big mess, a tasty mess but a mess nonetheless.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2015-01-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'RaOTeIn1dzFfqlhsyO4hzQ', 'review_id': 'm-6msiMRvVO2QCldOQCvIQ', 'text': "This place is LEGIT. Exactly what we were looking for when we came from the westside  (67th Ave and 101). Coneys, hanis, chili cheese fries, loose burgers, Faygo pop, Bettermade chips... Everything was fantastic. I'll definitely be telling everyone I know, whether from Michigan or not! The only downside - no Sanders hot fudge cream puffs!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-01-27', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': '5kIo1qYtTVQzzABCkm32xA', 'review_id': 'cmW8G6GufwAYZtnlwVKurA', 'text': 'Still come here often and still haven\'t been disappointed.  Guys always ask how I like my fries and they haven\'t failed to deliver on the goods.  I still make the mistake of calling the pop "soda" but it is a learning process.  Great service and food all around, hope they will stick around for a long time.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-01-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hlakJKjeDQO6nH0Nexnv0w', 'review_id': 'iMufekIwWkXn7QbrQHPINg', 'text': "There is finally a real coney dog in Arizona. Order the chili cheese fries with shredded cheese, The Big D and a Fago. Done. That's it. Boom check it off the bucket list. Say hello to Dave for me.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-01-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PBnuwcMtboKG2oo2pcxawA', 'review_id': 'KGK9MAcMTKevDrXs1oO8ag', 'text': 'After all the reviews we decided to try this place while in town for the Super Bowl! Delicious chili cheese fries, coney dog, and a good price! I recommend!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-02-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'RfFM9KYfQTtZv8X45TiANw', 'review_id': 'q9uCY6EOlcGvvkToN3CWZg', 'text': 'Had lunch here today after reading this place on "Yelps top 100". They were rated #30 on the list and after eating here I see exactly why! So much flavor in the food. I had a chicken philly pita and would recommend it to anyone! The owner suggested a coney dog and I had one too. First time trying a coney but it won\'t be my last.  The food didn\'t take long and the price was just right. I would recommend everyone to give this place a try! Two thumbs up!!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-02-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'vUuY6vbzBrzbvEkgBM-qPw', 'review_id': '0lfd1TBm664jbMB9UiBqcA', 'text': "A diamond in the rough for this Michigan transplant.  There's nothing like a Michigan coney and these guys are the real deal.  Prices are good and the food is amazing.  The owner is a great guy and loves the talk about the quality and he backed it up.  Will definitely be returning again and again.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-02-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'h3ypP_YbPEKaL0Z-sOY3qQ', 'review_id': 'lYRulJbH5BmLXMbMp70QuA', 'text': "Just ate a great dog with best fries ever, Detroit coney, I wish I would have got a burger they smash them thin thin, a triple with cheese is four bucks and they have spiral fries, it's ranked number 35 on yelp out of all the nation. Ours was 16.00 and the owner comes around talking to you great guy..", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-02-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7KKaRB1E7T3y_oeGW1pSGw', 'review_id': '_sBEwzgB9E-nuEQ2t8ZJmA', 'text': "This place is IT!! If you go anywhere else for hamburger/hot dog/just great food, you're making a mistake. You REALLY really need to check this place out. Outstanding food, outstanding service, the best place going in the area. I've eaten here a few times and brought new friends with me each time after the first visit. None of them were disappointed. Give it a chance I'm sure you'll love it as much as I do.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-02-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-0tYWv5LxCIdWdaf1jUkzA', 'review_id': '9DimL_tAznnCbrNVa_DOwg', 'text': "We took our sons and a friend for a 16th Birthday dinner by request from the Birthday Boy.  My son really wanted to go because they are the only place that serves Faygo that we have found in the area.  We all walked in to a very packed whole in the wall.  The place has a great atmosphere and the gal at the register greeted us immediately.  She was very patient as three teenagers and two adults ordered half the menu.  We had a great time, the food was delicious, and everyone was completely satisfied when we left.  The boys even got to take home extra empty Faygo bottles.  Don't ask me why, I didn't bother asking them why....lol", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-02-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'P6sChQLfM9BKhFYdP7D88w', 'review_id': 'yglTSZ1tgNeQ2VhKg6qwHg', 'text': "Had late lunch there Thursday with my wife, a native Michigander, and 2 friends.  I deferred to my wife on the quality of the food as she has eaten many times at Lafayette and American Coney in Detroit.   She felt the chili was lacking in spices and the burger meat was bland as well.  The fries seemed to be too dark brown in color, not sure if the cooking oil needs changing?  There was a placard on the table asking for feedback on expanding to new locations.  I concurred with my wife's assessment of the meat and chili, but also observed that the restaurant can use more attention to cleaning and could also use some touch-up painting.   The food was not bad, but does need tweeked slightly.  management should focus on setting standards for quality of the food as well as cleanliness of the facility before rxpanding.  We do wish them well in their endeavors.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 3, 'date': '2015-02-14', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 3, 'cool': 3}, 'user_id': 'X5jwnR6S4-xc4sNSIk77pg', 'review_id': 'bFg-2FsRSgUUiWZSVx45aQ', 'text': 'I really enjoyed this place. Ive had many Detroit coneys and this place took me back there.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2015-02-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'ycLR0RVVs1m_kXvauZZQkA', 'review_id': 'TMNrWpI3gnj84WlN-oZmSg', 'text': "First time visiting Detroit Coney Grill. \n\nWhat a great find. Admittedly, my family likes Teds, but this place is awesome as well. Detroit, MI type of hot dog style with lots of great flavor and freshness. Service is the BEST! This place has the best customer service. It's like walking into Cheers. Owner is your cashier and everyone seems to be having fun. \n\nSome foot notes, this place is not a vegan/low carbs type place. However, if you want a great dog or burger and a great atmosphere, you should consider this as your goto place.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-02-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '9vHeMk7OFIx-HQmardDgRg', 'review_id': 'Y9iGb48idOTLY81P1pzYXQ', 'text': "Top 3 best chili cheese fries I've ever had \nBurgers are amazing \nChili couldn't be better \n\nStaff is always super cool.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-03-02', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 2}, 'user_id': '4cDgpRhAzgRjD1F88v_f7w', 'review_id': 'mhd3PgCyioYIyxML1s9QdQ', 'text': 'First of all, I have always loved Yelp because it never lets me down! So when Yelp says it\'s good it usually is pretty accurate.\n So I came here because of the "Yelp Top 100 restaurants" lIst.\nThis place was voted #30 in the nation!\nLet\'s just think about this for a second.\nThis is the 30th best place in the nation to eat!? Wow, I gotta go.\nAfter looking at the pictures on Yelp I was a bit sceptical I must say, but Yelp has yet to disappoint!\n\nI just went to the #10 place on that list "Little Miss Bbq" and had to wait an hour to get in, but it was worth every minute! Amazing! Best food I\'ve ever shoved down my face!\n\nSo around noon, an excited and optimistic me walks in to a relatively small place with lots of Detroit memorabilia on the walls and a very friendly girl working the counter. (Her and the staff are the only reason it gets even 3 stars)\nOne person in front of me in line.  (Not a good sign)\nShe said the Coney dog and hamburgers are what they are know for, so that\'s what I got. I also threw in some chilli cheese fries. \nDogs and burgers are cooked on a flattop and cheese out of a can. Kinda disappointing for the 30th BEST restaurant in the nation, but Yelp has to be right, right? Anyways, food came out fast and correct.\nSadly, it was what I thought it would be. Just normal chilli dog and the burger was good but extremely average. My friend made the comment about the chilli, "reminds me of Sonic chilli". He was spot on and that\'s not a good thing.\nRemember I\'m coming to the "30th BEST PLACE TO EAT IN THE NATION"!  This isn\'t the 30th BEST PLACE TO EAT on Broadway, let alone nation!\nAverage might be a stretch, but the service and friendly staff gets it there.\nIf you want a normal strip mall sorta lunch, are from Detroit, have lost all your taste buds in a horrible fire breathing accident from those crazy circus days, you happen to break down on front of this place, only have a few minutes to eat before the tow truck gets there and are really into extremely average food. THIS PLACE IS FOR YOU!\n\nI\'ve lost all faith in humanity and Yelp if this is the "30th BEST RESTAURANT IN THE NATION"!\nI\'m now questioning everything I\'ve ever been told in life.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 3, 'date': '2015-03-02', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'qOsfwkrizljHP3HDfiDLyQ', 'review_id': 'hLATn1-k5_x4hr-VpHHJBA', 'text': "This is a good place in theory, it looks and smells like a coney island back home but the taste fell flat. Not to say it was bad because it wasn't, but the flavor was a little bland. The coney dog didn't give me the pop of a good hot dog, the bun was good, the chill was alright and the onions were fresh but every thing together was just okay. I think I would go back for the chili cheese fries if I was craving them, I liked those better then the coney dogs. Overall I would say, good effort.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 2, 'date': '2015-03-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'TPJ1AcHIaKZX0mRviEojQA', 'review_id': 'ZEyZUFPSjhzm9FzgE7YkJw', 'text': "Let me say first of all that it takes an Oakland A's fan some time to wind up the ability to speak highly of a Detroit Tigers fan, but this place is awesome! WARNING! The Coney dog is addicting...you've been warned by me and several posters around the restaurant. The owner Dave is colorful, approachable, and loves to greet his customers and he makes sure personally that your order was higher than expected. I enjoy an owner who involves himself in his work and wants you to experience the same bliss that he has while cooking it. Remember that Detroit Coney Grill was voted #30 in the Top 100 restaurants in the United States!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-03-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'wU1-l1rOlQ0gHzYFnFv-8g', 'review_id': 'wcpTr6sTJJRvAGvVQ5qscg', 'text': 'Its great to see people that genuinely care about the food.  Hand made dogs, hand cut fries, in house ground-ground beef.  Well done Detroit!\n\nWill eat for lunch here often, for sure.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2015-03-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'AmW6pqc25WmZrXKgfdT0zw', 'review_id': '09bDYfPCP1rhD6gtcx_0Ig', 'text': 'Best tasting hot dogs, reminds of back home in Michigan. I eat at the Lafayette Coney island all the time. These guys here in Phoenix are right on. Having Faygo pop and Better Made chips knocks it out of the ballpark.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-03-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'keWP5Ewpbz-3JgdZEWJMuQ', 'review_id': 'gKoSGvGenotLxBFzG5eBDg', 'text': 'Good service, nice enough little place, lots of cool Detroit stuff on the walls, but in the end the Coney sauce was just not the same and the dogs did not have the skin crunch like back home.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 3, 'date': '2015-03-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '662KFTpbG8-JuVWGLLirMg', 'review_id': '_TAhS5-BMpHHav5PT6pQsw', 'text': 'Excellent service.  The owner is worth dropping by for, he was personable and cared about us having a good experience at his restaurant.  This is the real reason why we\'ll be coming back.\n  The Greek salad, and the personable nod from the charmng owner, is worth the trip. \nWe will be back.  Loved the salad, but the owner said there were beets on the salad (yay) but when we actually were served the salad...no beets.  Still loved the salad, tho.\nI\'ve been searching for a decent Greek salad for years, and this place really served it up good. yay! \n\n  Coney Islands were overpriced and unimpressionable.  $3.95 a  small coney island. They resemble "Sonic" chili dogs that I can get down the street for $1 or less.  My family paid, for a party of 4, $44, ($50 w/tip), which included, 2 bottles of Faygo, and a small bag of chips we brought home., We can do that just about anywhere, so the incentive to drive 30 minutes is just not quite there.\n\nKudos for this place for serving, Better Made potato chips, they weren\'t what I remember.  Better Made, changed their oil to the \'non trans fat\' stuff, just not the same. However, we ordered the Fries and they were fabulous, the real deal.\n\n I\'d buy a lot more Faygo from this establishment,  if was sold sold just a tad bit less expensive.  Faygo, is the BEST,  My family paid, for a party of 4, $44, ($50 w/tip);  which included, 2 bottles of Faygo, and a small bag of chips we brought home., We can do that just about anywhere, so the incentive to drive 30 minutes is just not quite there.\n\nOverall, nice experience and I hope to return there', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2015-03-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'L9R2GC0fIZZVA0kaABPG0A', 'review_id': 'mGdTDMLst4J_8hWyMMXXHQ', 'text': 'I thought the food there was average. We got chili dogs and mine had the burger meat in it. The wiener itself was super average and most disappointing were their fries. I eat fries maybe once every two months so I was looking forward to them. They were real friendly so I gave em an extra star.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 3, 'date': '2015-03-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Oe8OHMGraPTT7gWhSIcOuA', 'review_id': '-odFIZj5IcaI0hDXR8VFFA', 'text': "One of my favorite burger places. If you haven't had the big d, you haven't lived. Great burgers & fries", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-03-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'SxZV-iqRoO1ERfrQvKbpkA', 'review_id': 'lVAMTN0ny5VqjJucU9ii3Q', 'text': 'The coney dog here is excellent. I love the combination of chili, mustard and onions and their chili is excellent. Their loose meat burgers are also really good and all their french fries are handcut and excellently cooked and seasoned. Even their chili cheese fries are solid. Solid diner stop, A+ all the way and a friendly owner who chats with you.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2015-03-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tyNAWERVmWwgBN8rpXPzeQ', 'review_id': 'ziIWxJ8KqIU33kT4i__RQQ', 'text': '#30 restaurant in America.   You gotta come and get a coney and coney fries.   Indulge in some Faygo and Vernors.   They grind their own beef.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-03-21', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 6, 'cool': 10}, 'user_id': 'EYGD022jcNecmj15IHNDrQ', 'review_id': 'XRljYh3KishwQpx5RMUrqw', 'text': "Outstanding Coney Island!!!\n\nI'm from Detroit and live in the SF Bay Area, and while in Phoenix I stumbled upon a GENUINE Motor City Coney Island restaurant!!  Various Michigan teams were well represented with sports memorabilia everywhere and very cool t-shirts for sale.  The service was incredibly friendly and the food absolutely delicious.   I had a nice Vernors Ginger Ale, too.  Ah, it was just like home.\n\nTo top it off there is a floor mat at the register, and when I looked down to see what it said, I laughed out loud as it was an Ohio State Buckeye floor mat, all nice and dirty from being stepped on by many Michiganders!!  GO BLUE!   :)\n\nIt was nice to be with my People!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-03-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'JlxyAi3Q0ZTSMSvbPw-jPg', 'review_id': 'rIDIXnc2GwCg1HnP8_6hgA', 'text': "So many wonderful reviews on here, and I expected differently. The atmosphere of the place is a very welcoming one, but it does get a bit too hot with so many people and the kitchen being right in the entrance (which is fine because usually what's done in-front of you tends to be so much better). Never had been here before but decided to try it out, and I ended up getting the daily meal; drink, two hot dogs, and fries. Fries were unsalted, hot dogs were too chewy, and I didn't get my drink. I'm almost thinking maybe I'm not the at ordering at this place, but from what I experienced it want that great anyways. .", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 2, 'date': '2015-04-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'um1KNqT4oj5muY7kaH34pg', 'review_id': '15Kzcy8JB4liSYLGlD76CA', 'text': 'Felt like I was back in Detroit!  Great food, great service!  Expand to South Mountain!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-04-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'tmFKnsf1AIovJiR-TiOiMA', 'review_id': 'hnQW0AALBtGunbt5y_ef2A', 'text': 'This place is Da Bomb! It reminds me of the great food back home. We now live in Maricopa, originally from Livonia MI and will be back here often.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-04-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4N6OZwBKsmTEs3GLnosMaQ', 'review_id': 'emw8ErKLgzlD45DSyEXpRw', 'text': 'Dave, the owner, is worth going in for. He is has the guest focused mentality that is lacking everywhere else. He came out and talked with every guest in eating and was genuinely concerned with how they liked their food and what they thought. The food is out of the world good for a hot dog and burger place. It is worth going to Tempe, AZ again for! The food and customer service is top notch! So glad we decided to stop by on our way back to Grand Junction, CO!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-04-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JsV8TC-eA-N3kYv2-CRhKQ', 'review_id': 'jrSmgGfVSsA7VIjYnTeT8w', 'text': 'We had the Wednesday 2 Coney Dog special! It was good and the lady was very sweet and helpful since it was our first time visiting!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2015-04-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'GJC9m1EqfKrXmoJmNrEUjQ', 'review_id': 'itSVlHxXvck7Marn8wuYvQ', 'text': "The food was delicious and the staff so helpful and friendly! Can't wait to come back!!!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-04-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kemf4_osfrDs3onZIDYHGg', 'review_id': 'IWKOZp5xBEHapAJxbo3z6A', 'text': 'I drove all the way from Gilbert queen creek check out the hype... happy to say its all its said to be. Will come back for more', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-04-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pSOoFSZCm2LhGoMBFO2W5g', 'review_id': 'nlvWId_hE7AU8UOnrYRUKA', 'text': "I've never been so excited to eat in my life. This was so delicious! The owner was so sweet and it was super packed. Which showed that it definitely is a good restaurant! And it's around the corner from me:)", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-04-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'OhFPna6UwRPsqZNrFHll0A', 'review_id': 'eGuF_i4W0UB3wbmJloO3cg', 'text': 'I have been eating coneys (with) since I was a wee lad getting drawn into Lafayette with a wrapping fork on a glass pane window. However I have never gotten the advice to give a Loose Combo a try, which the congenial  owner of DCG (Dave) did.  Since that day Coney and Loose Combo is the only thing I order.  States volumes about the owner, who is pedaling a quality product, but wants to maximize every customers experience.  Great food and service.  Nice to have a bit of the taste of home here in Arizona.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-04-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'Zpf7YsyLB7rmUm7fTyNp4g', 'review_id': '9hvV97A7vS1ChAz9a8OJ9w', 'text': "Reminds me of being back in Detroit with the family! Great food and great service! The dogs are a lil different than in Michigan but the chili is good and the Greek salad was perfect! It didn't come with beets but you can ask for em and they'll provide them. They have Vernors and all kinds of Faygo and Rock N Rye is my favorite! \nIf you're from Detroit this is a must visit and if you're not from Detroit, then give it a try and if for whatever unforeseen reason you don't like it, at least enjoy some Detroit Love!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-04-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xXeMlRc_Hcfg-xjPmUKCbA', 'review_id': 'lF1UzNwI-qqmKbH71CXWNw', 'text': 'This place has super bomb food. The buyers are legit. I love the fries. Try their steak gyro. Get one of their frequent customer passes too. Awesome', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-04-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZBimZwp6LA0VDedKGo-jnA', 'review_id': 'uCtkL9J0cib6kuByEiW3dg', 'text': 'the owner is awesome. i think with his precense the food taste even better !!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2015-04-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'qa05pUVNapADHZXpHMPMeA', 'review_id': 'WRRR6wNfLJdkGftNHcbadQ', 'text': "Incredible service, very friendly and kind. Tasty and quick food for cheap, a must for all dog fans, especially if you're a former Michiganer.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-04-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SCK1ZcZojlecrbb54q7KnQ', 'review_id': 'MtVoNYiPA0HH7ljiuDpCXA', 'text': 'This place is great. Coney dog was on point and the Faygo and Better Made were an added bonus. The drive from N. Scottsdale was worth it.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-04-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'hXl7D00brbd-9E8XxF5GTg', 'review_id': 'iKJHrtbUYfYhPIH7TrspDQ', 'text': 'Eat Here!! Just the best coneys! The place has character, great service, and great Coney Dogs. It\'s like brig back in the "D"  -  DETROIT!  Always a favorite..', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2015-04-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'F8zSwTNz1MlDca1GLHyVbw', 'review_id': 'pByRLblczQVYtFMFLp_kbw', 'text': 'Showed up during an off time. Only one other couple in restaurant. \n\nI ordered the 2 cony  combo special with upgrade to chili cheese fries. I will admit the dogs were pretty good, chili was solid as well. But the star of the show is the fries. I usually do NOT like fresh cut fries, but these are AWESOME.\n\nSuck on that IN-AND-OUT. \n\nThe meal was a bit on the pricy side.. $10 for 2 dogs and fries with a almost $3 up charge for chili and cheese. I guess they have to charge extra to make up for the 50 napkins that are needed LOL.\n\nI am looking forward to trying other menu items.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2015-05-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4eSa5uOYF1pOMYz1FiBLNw', 'review_id': 'cUeVeYi2U8LkIB_ubyQ7yA', 'text': 'Hands down the best cheese fries in Arizona. The staff are extra friendly and attentive as well :)', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-05-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'RQMpBRgYX68IsxyrMBZGQQ', 'review_id': '3IeWB2zWSaREAKnFJl0WWA', 'text': 'Delicious! \n\nFriendly staff. Quick lunch service. Good Food. Good price\n\nI got the gyro. Flavourful & Juicy', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-05-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dopAPHj_d1LGF5XNk1PqCw', 'review_id': 'OWFPsxsGODxaHen9c0F0XQ', 'text': "Had two coney dogs and cheese fries. It taste just like they do in the D! Coming from Scottsdale and I'd definitely recommend it to anyone who's used to the coneys in Detroit and surrounding areas. Food was amazing!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-05-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Fe6Cf3AiCH5EAmEuxXn4mQ', 'review_id': '_d6rLDYhMUD22yxgzJaJbQ', 'text': 'Food was everything I remember it to be-delicious!!!! It was wonderful!\n\nBathrooms and restaurant were as dirty as an old Detroit Coney restaurant. Could have done without that memory. \n\nI will go back to get the loose hamburgers and go down memory lane!!!!\n\nYes come to Glendale!!!!!!!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-05-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yGls3UGseI4hSQcdAlBjlw', 'review_id': 'Lp0jJm103yM8Yf3EcM_OEg', 'text': 'Thank you guys for bringing the great taste of Detroit to Arizona. I was in Phoenix for three days and ate there twice. I felt like I was back home on Lafayette Street. Please bring one to Tucson.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-05-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DXLhJ_bucXRT-nSrbcvgGQ', 'review_id': 'Ch1Dt_0KgmIvZyVCak49cw', 'text': 'Awesome service the owner is extremely friendly and makes sure things are done right! Awesome coney dogs and burgers. Definitely check this place out when in the Phoenix area.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-05-12', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': 'hk1MNNaa4kHHdkGCiD9APg', 'review_id': '2rmoB4aPc8G-coiKVaMFHg', 'text': "Wait. \n\nYelp told me this place had Faygo AND Vernors.  It's TRUE!  They have a fridge of Faygo.  \nConey and chili cheese fries were delicious! Love the atmosphere. It's like a little bit of the D transported to AZ.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2015-05-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'KVQJjMaCcheA-FL_kl2CSA', 'review_id': 'Lv48NzJ02ox7b6KFTQD8xQ', 'text': 'Good hotdogs I from New York we know our food. Friendly establishment would bring my co-workers to dine in among mostly male client tel. Clean got food fast fresh made fries.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-05-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'sC7ASUpcaZIxlOM_Dpjvuw', 'review_id': 'KSs3Rk-071iU9jPnvVRplg', 'text': 'love your coneys and fries.        just like being back in the mitten.    love Detroit but grew up closer to flint so im used to flint style.  next time im close to downtown will stop by.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-05-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mYi8ZWAjBXKZLpt7bb1sPQ', 'review_id': 'qLXASybgBOrkwnVAnOM20g', 'text': "I'm a proud Michigander who has lived all over the country. I'm always in search of Detroit style coney, and rarely have I found any place outside of the great mitten that can even come close. Luckily, I've stumbled across Detroit Coney Grill in Tempe. I ate here for the first time this week and it's the real deal! Faygo pop(not soda), Vernors, and Better Made are all well represented here, but the story is the coney dog! First off, they get the chili right, and if you're a fellow Michigander, you know the difference. The dogs have natural casings that snap but aren't chewy, and the buns are steamed. I had a coney dog, chili cheese fries and Rock N Rye, spent less than $10, and came away with my faith in humanity restored! I plan on becoming a regular and brining my family soon.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-05-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2zRxVpcvfoVBUVJVEsuj8Q', 'review_id': 'niSGi3_BwnjYLseezlQIYQ', 'text': "I love this place of coarse it remind me of home I hardly ever get to have a coney dog an since they are in the valley I been loving it ! They have better made chip vernors  and Faygo pops! I'm so excited I'm trying the double burger first time here for the burger! I can definitely recommend the coney dog and coney fries!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-05-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8Fhyi6U9-3OZC0j8DY3TPQ', 'review_id': 'EzvdHPb_wWc0_nTS-l1f8g', 'text': "Legit Detroit Coneys. Eat with Faygo Rock N' Rye.  Detroit Coney's are legendary in D town. Hot dogs are good quality with Detroit's own take on Coney chili. Fast and friendly service and a great way to get in touch with your inner Midwestern. Casual fast food environment.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2015-05-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'bICbSpZyL-ftJICUB7WAyw', 'review_id': 'mdpAHKfsb6F_eb-Kjtfh3w', 'text': 'Words cannot express the sheer joy I felt with the first bite of the Detroit loose burger! I\'ve been in AZ over 10 years and I\'ve tried other "coney islands" that have always been a disappointment.  This place is the 100% REAL DEAL AUTHENTIC CONEY ISLAND!  We came on the recommendation of a coworker who is also from Detroit. SOOOOO worth the drive from 83rd Ave/Cactus in Peoria!!! The staff was super friendly (including the junior in training). I felt like I was back home!!! The owner even came out to check on us and we had a great chat!!! Looking forward to the next location in P83 (83rd Ave/Bell Rd)... at least that\'s my vote... it would be the perfect addition to the neighborhood! See you again very soon!!!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-05-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ju9EFDjfPup44YtzgeJ1Bw', 'review_id': 'LiKt7M81ZGo_ZSjIixlvNg', 'text': "Excellent burgers. Chilli cheese dogs are the best I've had. Extremely friendly staff. Faygo Pop. Live on Ellsworth and Southern. Worth the trip every time.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-05-20', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 5, 'cool': 5}, 'user_id': 'F5NvOP5YeKetvkYo1W4t3A', 'review_id': 'GJrn-hct_WBuhvElGi4mEg', 'text': 'Tempe=Hot Dog Paradise!  3 great hot dog joints all within 5 miles of each other.  Decisions, decisions!  How would Detroit Coney Grill stack up?  Pretty damn well as you are about to find out!\n\nI had driven by this place a few times but was always on my way down the street to Ted\'s.  When I woke up this morning, I was craving a hot dog (Twice in less than a week).  I decided to drive on down and see what Detroit Coney Grill was all about.  I had never had a "Coney Dog" before today either.  I was browsing their website and noticed that they had a Wednesday special which was 2 Coney Dogs, Fries and a Fountain Drink for $8.88.  Sounded like a plan.  I drove down, parked and walked in.\n\nRight when I walked in, I was greeted by a couple of the workers.  I also noticed that the owner (one of the owners?) was behind the counter talking with the staff and shootin the shit.  I went up to the register and placed my order for the Wednesday Special.  My total was $9.40.  I paid the lady my money, grabbed my cup for my drink and was on the way over to the Coke machine.  While I was making my way over to get my drink, the owner guy walked up to me, asked me how I was doing and shook my hand.  I thought that was really cool and it shows that he appreciates his customers!  I grabbed my soda from the awesome Freestyle Coke Machine and took a seat.  While I was sitting there, I noticed that the owner was talking shop with every single customer in the joint.  He was explaining how they grind their own beef for their burgers, make their own chili, giving recommendations to customers etc etc.  Really personable dude!  A few minutes later, my number was called and I grabbed my stuff.  Here is how it was................\n\nConey Dogs-  These dogs come topped with their homemade Coney Sauce aka chili, onions and mustard.  This chili is ladled on top of a natural casing dog and nestled inside of a steamed hot dog bun.  The chili kind of reminded me of a Tommy\'s type chili (CA folks know what I\'m talking about).  It had plenty of spices in it and had a great flavor and texture.  I really enjoyed it!  The mustard and onions worked well too and the bun was super soft.  Great snap to the dogs, too!  These 2 dogs were mighty fine!\n\nFries-  Fresh cut fries!  They were salted perfect, fried perfect and flat out some of the best hand cut fries I have had in quite some time.  Decent sized portion, too!\n\nAfter I was done with my meal, I was going back to the Coke machine to get a refill for the road.  I ran into the owner again and he asked me how everything was and gave me a fist bump.  I can\'t remember a time when I received such great customer service at a place...seriously!   I will be back just because of that!  Great dogs, great fries and amazing hospitality make this a joint I can definitely see myself coming back to, soon!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-05-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 4}, 'user_id': 'H_JsAwjiGEOr_RlZmwfNsA', 'review_id': 'bTK0fOg5HHSuosgBGIGAdA', 'text': 'I went to lunch with my friend and he suggested Coney Grill. I loved it! Great service, awesome food and a fancy soda machine! I got a Double burger because the pattys are small - 2 ounces and the burger was perfect for me! Also the fresh cut fries are super yummy! Definitely worth a try.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2015-05-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6KxsHmk7KvULewuuA2AX_w', 'review_id': 'viIR8E167hILYb5VSrz5fA', 'text': "I've been here 2 days in a row... I'd like to thank the big man upstairs for guiding me to this place, your the real MVP!! The AZ Big Mac I created myself, I posted pictures, it's SOOOOOOO AMAZING!! Cheese fries, Chili dogs, Chili Cheese Fries, the list goes on!! Hands down most amazing place for these things in Arizona.. If you haven't been there, you really haven't accomplished anything in life, this place is why we are on earth, TRUUUST ME!! See you guys tomorrow!!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-05-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'L3R3gJMNk1BG8U4avpjqUw', 'review_id': 'oDkqRzhEhmtzgiZlldoQdA', 'text': "If you're from Detroit, you will love this place. Nothing like two on one, chili fries and a Vernors!!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-05-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'PbmrioXNi3lcSFPJzNYyDQ', 'review_id': 'ZSyQ_Vv2nMXfZ3ZEffiwWg', 'text': 'Just like heading back home... My kids and I love eating here, I highly recommend it to anyone who misses the snap of a real coney dog. The staff is excellent and the owner has true Midwest hospitality. \nI drive from Mesa to enjoy this place but would gladly travel further. \nMaybe you can open one on Dobson and Southern!!!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-05-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'evsOnIfNyronJe_Z5NMwKg', 'review_id': 'GSRDwJVTCyyKNMRcJOnk1w', 'text': 'Awesome atmosphere with very friendly staff. Great to have Detroit food out here in AZ, especially coneys and Faygo pop. Coneys are BOMB! Fries dont look great, but are tasty. Havent tried anything but the coney special so far (2 coneys, fries and drink for $10).', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-05-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '09r40LAWn3s_ZTnijAlakQ', 'review_id': 'kqctGT9I8kPEUDIwojR5Bg', 'text': "Detroit Coney Grill is amazing! I work right down the road, so it's becoming a staple -- especially when I want a fresh, delicious burger. They'll make it anyway you want. I highly recommend a triple with both cheeses -- top with lettuce, tomatoes, onion, and ketchup! So good! The Hani Pita is also delicious.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-05-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'i27uzu0UEr_y7k1PSk21lA', 'review_id': 'bATrLdszT-n0IMd6twBcVg', 'text': "All Love thanks Dave u know we'll be back I love this place any and everybody come on in YUUUUUUP", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-05-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4CkK5-KrLX8vLg6QdaFuWw', 'review_id': '-26ylmUTt2T79U4vgIb5lg', 'text': "My girlfriend is a Canton, MI native and I've heard plenty about local delicacies. Detroit Coney Grill delivers: the coney dog was great, and they have a wide selection of Better Made chips and Faygo. As a current Tucson resident, I would love to see a location open in our University area. We both think it would be a hit, and I would have a place to fuel my growing Rock & Rye addiction.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-05-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'i0e9FmpbakmNVt18cgZx0Q', 'review_id': 'E0z9HognhCEU7rUj3sTLAw', 'text': "The food and service here is amazing. This place is a must try if you're in the Tempe area", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-05-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'D2oTAu62_Fn27M1CTqTkQg', 'review_id': 'kxOd1E1ynUIjncRwlxidwA', 'text': 'The Big 3 of coneys......American Coney, Lafayette Coney, and now Detroit Coney Grill........thanks for bring the D to the Phx....\n\nWe need one in Northwest valley', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-05-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6KxsHmk7KvULewuuA2AX_w', 'review_id': 'EnIpYH1hw2mvpmpF00weHg', 'text': "Back again, I think this is the 7th day this week and they are only open 6 days out of 7.. I feel like this is a home away from home, but the food is better (Don't tell my mom please) The customer service here is literally better then the service at any other establishment in Arizona, and that alone wins my business no questions asked.. I drive about 45 mins every time I eat here, multiple times a week, and I have never left hungry or unhappy.. If you like amazing, you will love Coney Grill!!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-05-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'cpE2ulIoc-1yhjLAmfnE2w', 'review_id': 'EizDMWgh9AP4fjJFMhFVtg', 'text': "From Mesa on Higley and Brown. Best damn dogs you can find outside of Michigan. Worth the drive, wherever you are from! You won't be disappointed.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-06-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'BvfRyzXMzj6eVONsp81HyQ', 'review_id': 'ijfIGSXEXGRG7Y2yt4IKSA', 'text': "I can't say that I'm still hungry, the portions are large and the taste is good. This did in fact taste like a fresher, more meaningful Big Mac. The thousand islands has become a postmark to MCD. The fries are great and will definitely go there, the meat on the burger was thin, (it must be something to do with the custom) in not a big fan of that. But over all it was a great experience. I can wait to try the hot dogs.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2015-06-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'NLU3fk6ZrMai7_0l3hk8AA', 'review_id': 'JZmslHYtinvTyTWz9Bd8mw', 'text': "Instantly transported 2K miles back to MI as soon as you walk in. From the decor, to the friendly Detroit hospitality, to the authentic eats. Would love if you decided to expand out further East. Even if you're not from MI, you will love this place. Oh, Faygo in a bottle, need I say more.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-06-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'gBx_5ZRZxlDcsRS7cAum-g', 'review_id': 'gXGP_0mb4UedQ4g6w6d0tQ', 'text': 'A great meal and an even better experience. Nothing beats the Coney dog and chili cheese fries, except adding some Rock & Rye Fargo! I feel like family when I come here! \nThe only thing that would make it better is a location in Gilbert! Then we will really be family!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-06-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SBLZnBii5PSmv_RpM2O8Kg', 'review_id': 'oV-VS82LpEv-KNDaXimRJQ', 'text': 'This an awesome place!  Hot dogs snap when you take a bite! After 16 years in the Valley I found my hot dog spot!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-06-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'gAEDkW0ANZA50YdIY9OavA', 'review_id': 'Ot2edlq0r__yRhyqxQHX4g', 'text': 'Detroit What! Might as well close your eyes bite down feel the snap and go into the "D" it\'s very good. If you can\'t be in Detroit you might as well come have the best dogs in the WEST. Nothing is better. Chili is great. The place takes Detroiters back home.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-06-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-dndfk1goOEC2sYxklf3yQ', 'review_id': 'YMd2fErpm2ESPyJf8MQGDA', 'text': 'Love this place the burgers are so good & the fries are some of the best in the valley. Try the big D next time your here I highly recommend it.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-06-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ezhqr-gW_AFgdLXT11nS7Q', 'review_id': 'SN3C2m6jCWdFPqLJWrx_Mw', 'text': 'Their coney dogs are the real deal! Washed mine down with a delicious Faygo--the owner is so nice and chatted with us while we watched a Tigers game. The chili cheese fries are hand cut and really good too. I only wish they had a location in Mesa!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-06-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'opl-WM9sFCOC5ew1ktdGzA', 'review_id': 'cAMxwmmm8HrnEWlHEKvF5A', 'text': 'I was in town for a couple of days and looking for something new to try... I found the Detroit Coney Grill on yelp and was very impressed by how good their hot dogs and burgers were... very good hot dog and really good fries... friendly atmosphere... nothing fancy but really good food!  I went twice in the same day... :)\n\nSan Clemente, CA', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2015-06-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZXbyLSGKh7id0Q6cqX8XKg', 'review_id': 'NnfA79t_EI2-lxXxg9OT9Q', 'text': "Honestly, no complains. Dogs cooked to perfection. They had great flavor and a very nice snap to them. Fries were very tasty and it was easy to tell they were fresh. Steamed buns so we're good there. Saw a few people eating the burgers. The patties looked really thin but the people eating them seemed to be enjoying them.\n\nI enjoyed my Detroit dog (chili, mustard and onion), fries and creme faygo. Babygirl loved her dog, fries and grape faygo. They passed the princess test so there's something to be said for that. At 3 years old she's plenty picky! \n\nWe'll be back for sure.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-06-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xsVgGEJeJFBMstSM2iZbmA', 'review_id': 'jxtanzdFSWKn3uP5IyYEqQ', 'text': "We used to live in the Detroit area for over 35 years before moving here and were just at the Detroit Coney Grill;  it was truly a taste from home, in Detroit!  The staff is very friendly.  The food is authentically Detroit!  The coney chili sauce is really good as are the crunchy seasoned french fries!  And the salad...I had the chicken Greek...is very generous and flavorful with the made to order grilled chicken and yummy Greek dressing.  We don't get to that part of Phoenix often, but when we do, make it a point to stop here.  We also took all of our kids when they came for a visit and they, too, loved it!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-06-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'dvHlciZ30683j4Jt4kXm5A', 'review_id': 'tcUkVYqibpmvaax4Jv-DAg', 'text': "This is the best hot dog and burger joint in AZ.  A must visit.  This place makes the hot dog gourmet.  And the loose meat burger is outstanding.  Fresh cut fries, can't be beat.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-06-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Gku3WvnMLuiH0M6ou9uSQw', 'review_id': 'i44X9SzwVTX2k11EyTldIA', 'text': 'Reminds me of going back to Michigan and seeing my family great place and environment!!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-06-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mP8BOVIlTMwFsHJZb9hmNg', 'review_id': '_N3CGB_PnSQVzA4GfJehZA', 'text': 'Amazing food with amazing employees. I went to school in colorado and this needs to get there', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-06-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pFA61DiABmypeJN0M2Ckbg', 'review_id': '7aatj7OWpdkrMSF6EJbY5Q', 'text': 'Really liked my triple burger with fries, super nice employees who even say hello and goodbye', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-07-02', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': '5nBfnnIqNh1cK7_nScrIcw', 'review_id': 'uNTl68SA4GKmararxsXc0g', 'text': "In terms of fast food, I really enjoyed the service and food options. However, because of the cost and yelp reviews, I had some pretty high expectations for the portions (yes, that is very American of me to complain about). I split a coney combo (2 chili dogs and fries) with my husband about $10 total). While that's a pretty great deal compared to other places, I am spoiled by the $1.50 hot dog combo at Costco. Accordingly, I expected a hot dog that was Costco-food court size and I expected more chili. The hot dog itself was fine, but again, compared to Costco, I found it to be higher on the processed-food taste than I expected. That said, it was PACKED with happy customers and I still plan to try out their chili cheese fries soon. So, even though I didn't rate a 4 or 5, I would still recommend experiencing this place!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 3, 'date': '2015-07-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'c3SHU63hfN5kJV-ekUrp9A', 'review_id': '_wGU6UaFGQiyYvT-3TAoAw', 'text': 'As always Dave served up the best coneys and had superman ice cream today!   Great burgers and made to order frys.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-07-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jgf8iMXFUvosfENVjMghwQ', 'review_id': '-105bvGEdfm0li_Nl-MfFA', 'text': "Native Michigander living in AZ. I love, love, love  coney dogs. I miss coneys, purple cow, better made, sanders, etc. I live in Glendale, AZ. I saw DCG on  Facebook Friday night and decided we would head over there for lunch the next day. I've tried coneys before from a restaurant that sold itself on food from back home. We tried it and weren't impressed. So, I was skeptical. I ordered 2 Detroit coney dogs, a Rock n Rye Faygo and coney fries. I also knew  (from  Facebook) there may be Superman ice cream in the near future...if it wasn't already all sold out. The coney dogs tasted a little bolder than I remember. But, I also tasted memories. So,  these coney dogs passed the taste test and ripped my skepticism into teensy shreds of nothingness. The Faygo pop was awesome as always. To wrap up my time in coney heaven, I ordered Superman ice cream and a Faygo pop to go. The ice cream is exactly as I remembered. My better half had never had this ice cream so we shared the ice cream. He loves it.  Btw, customer service is top-top-top notch. This place is worth the 30-minute drive each way. Perhaps some day it will come to the West Valley. If/when it does, I'm a be a regular. I  DCG.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-07-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'cEdzkv5sNT7NOuvWw6GOng', 'review_id': '9md55jgAGxYAKgK-ldRfJg', 'text': "This is the 2nd Monday in a row we have come here. We get the coney dog and chili cheese fries. It's so delicious, especially if you want a quick meal that's not a typical fast food joint! The service is really great and you can tell the owner truly does care if you enjoy the food! We will frequent this place again!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-07-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'NZbi_JKRxVV2eWJzToaQGA', 'review_id': 'QVZCUt5jOInbfJDmqw5ZKQ', 'text': 'Excellent food and great customer service. I have tried this location and the one in Phoenix so far and the atmosphere of this location is like walking into a relatives house from the moment you walk in. I ordered the Gyro Pita and a Detroit Coney and throughly enjoyed both. The staff was engaged with their customers with casual conversation as well as asking for feedback. Definitely will be a place I return to!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-07-16', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': 'o9IyWBd81w_l2-jNcKrNOg', 'review_id': 'uq3KlXP9wx86rPU0qlmlKg', 'text': "First time here.. seems like I got old refried frys.. not very appealing. Was nobody here.. so that's probably why I got crap frys. Front person was interested more into his phone rather than helping me... I'm here eating my meal... i feel I got cheated with crap fries.. lol.. not happy. Paid 10 dollars for 2 coney dogs . Crap fries and small drink.. only thing that made up for 2 stars are the coney dogs... it's good... \n\n\nCrap fries.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 2, 'date': '2015-07-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1ZzKk8vFMTmdbld49u1xmg', 'review_id': 'HLhtRJ-ZRGKg9qZSF8TWcw', 'text': 'Taste like home. The coneys are awesome, then add a Faygo and some "Better made" chips, how can you go wrong.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-07-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'v26k4Bzy9GiLLlSmDk8LfA', 'review_id': 'TMM5NaLS-OZ3xkdrAt6lHw', 'text': "The food was pretty up there with like a Kerbys Coney Island. If you know Michigan you know what I'm saying. It was good not Lafeyette good but good.  I wanted to give the food 4 stars and the price 3 stars. 1 coney dog with tax was like $4.35 for 1 that seems a little aggressive.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 3, 'date': '2015-07-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': 'YUS8YMVM8p2NB9KaSwygFA', 'review_id': 'o5YtiYNSyRUtHwTvunPXKQ', 'text': "Finally made over today. Excellent coneys' just like home.\nPlease come to the west side.\nPlease come to the west side.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-07-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 2}, 'user_id': 'ifbbj5rKnMXhooXGDJK3Tg', 'review_id': 'oPZisP7X9Ju-mPnAbcnJiA', 'text': 'moving to tempe just to live closer to this joint. loved the food! top notch burgers and coneys. get the red faygo', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-07-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 4}, 'user_id': 'GBJNcSd5zD0KLyt2KZWwQw', 'review_id': 'vUn7vRBrooe9uvuoO6KPiA', 'text': "Went for our first time today man I felt like I went back home for 30 min! The coneys, better made, and Faygo hit the spot!! To top it off the owner was there to make sure everything was on point and even told us about the superman ice cream they have! This place hit home brought back my childhood memories for sure!! Please open a west valley location we're in surprise/ el mirage!! Thanks again", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-07-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FWXndi_cGRmZe3eBTmbRmw', 'review_id': 's4gBsc46tRvE9LiMWV6Tgg', 'text': "This place is the best!\n\nOk, for starters. Anyone who has lived on the east coast, knows about Penn Station Subs. And you know how YUMMY their cheesesteak is. You also know, that there is NOWEHRE in the valley, that makes a cheesesteak that tastes remotely close to Penn Station...\n\nUNTILL I tried Detroit Coney Grill.  While they don't make the sub version, their cheesesteak pita is a fine substitute...and the cheesesteak tastes JUST like Penn Station.  My ex-wife has been in the valley over 4 years, and was unable to find a cheesesteak like Penn Station.  Im glad I found Detroit Coney Grill!!\n\nNow, as far as everything else goes..YUMMY!!  I have been trying to find someplace around that makes a chili similar to Tommys...and this is it.  The burger patties ARE small, but that's ok.  Get a triple, with chili..and you are SET!  The dogs DO have that familiar snap when you bite them.  I love the cheese sauce the use for the chili cheese fries...and the psudeo-Maid Rite loose meat they use for some of the menu items is delish as well!!  Imagine a tray of fries, covered in loose meat, then smothered in chili, then topped with cheese sauce.\n\nGOOG GAWD MAN!\n\nThe owner and employees are super nice.   I had ordered a chicken philly pita with no mushrooms..but after the rest of my family had ordered, the owner, who was taking our order, had forgotten to subtract the mushrooms.  So when he saw me picking the mushrooms out, he apologized. Later, as we were finishing up, he came out from back with a bowl, that had 4 scoops of their Superman Ice cream...free of charge!\n\nIt kinda sucks, that now I have found this amazing place, I have to move up off of Happy Valley Rd.  Its ok. it wont stop me from coming back.\n\nThanks!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-07-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'xQmTZPoWzaYWwlK3oti14g', 'review_id': 'cOCxQcsD2L0QZ_dQDAyBIA', 'text': "My daugher and her boyfriend brought home a menu and I HAD to go and try the loose burger. IT WAS THE BEST. Also stole a taste of my daughter's coney dog, which was excellent. And I would drive all the way across Tempe for the fries! Great atmosphere, great people. I admit to loving the opportunity to wipe my feet on Ohio State.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-07-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ow2bRySwb6ykdYQ5snm0zQ', 'review_id': '5LzJSMX-PZT2Jovb-mTBTg', 'text': "Decided to stop by after seeing that this place was #30 on yelps top 100 of 2015 list. I'm not sure if I don't appreciate a good coney dog/I've never been to Detroit, but I didn't find the food here that special. Perhaps it's because I expected the food to blow me out of the water and had high expectations, but I didn't think the coney dog to be out of this world good. The fries I had were pretty good and the interior decorations do give it a nice homey feel though!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 3, 'date': '2015-07-27', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'rXAsu58VASGQmFemkw9Lwg', 'review_id': '58l2BAPyzOdP-Ae3vk1oAA', 'text': 'Super friendly staff! Coney dog was awesome and the chile cheese fries were amazing. Highly recommended this place.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-07-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'SUBdwtyDKJt_T_yQuCs-BA', 'review_id': 'rs5hvdgCteXSwWt70D4NiA', 'text': "Well I didn't realize the review was separate from the picture post.  I'm from Michigan and I know my Coney Dogs.  While there are definite differences between the Flint version and the Detroit version they are both terribly missed since moving to AZ.  Thank you for brining a little but of home to the desert. I mentioned it with my pic post but you should definitely build in east Mesa", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-07-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'OYGZnLncybQn_DzWpU_7Mg', 'review_id': '1vvwl95q1FMpBop76LLImw', 'text': 'Excellent quick hot food. I had the coney dog, fries and a pop. Excellent customer service.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-08-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '0C6hrbRCxnh-i-Qqxzu-sA', 'review_id': 'nE4hWtXnRc2YKk1JpVtKjw', 'text': "I had my favorite Hani. Tasted just like from MI! Loved it! Hubby had the loose burger, we shared Better Made potato chips and RC pop. So good, it made me homesick. The owner and cashier were so friendly. Now, if they just had something Sanders for dessert....\nCan't wait to get one of these in the West Valley, preferably in Surprise. There are Michiganders all over here!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-08-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'XC0yExGwByUraNdbIYe8EA', 'review_id': 'ujtW0c8Jf7FkiluCvdmmrQ', 'text': 'Awesome Michigan food in Arizona!!! Friendly staff and great food :)\nWill be eating here again', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-08-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'QELSBPfRiIhAcm3S7H8XTA', 'review_id': 'wUEcMrQMpzoKu0lKjYY1dg', 'text': 'This place is the best. The food is great, I had the "Big D" and it was the best burger I ever had. The fries are delicious, Super man ice cream and vanilla float are out of this world. The atmosphere is just like walking into a friends house and watch them cook for you.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-08-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mMh-BAcy-hUQL1A6DtXRZw', 'review_id': '2gxL_JnRAc1mjpNm4Svoaw', 'text': "So delicious, great price, and quick but doesn't taste like fast food. The coney dog was perfect not greasy, good flavor and they are hand made! Burger has great flavor, and well balanced. The cheese sauce is AMAZING! Love that they offer rewards. The staff was super friendly.\n\nAlma School and Southern", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-08-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dDysaOAt0rUXfAX3r5Qyww', 'review_id': '-_H-sR0AsKO3glykuxAGEg', 'text': "LOVE this place.  I'm fortunate to have one close to home and another close to work.  Great food, always fast, and Faygo Pop?  Wow.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-08-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'kp1ST0muQhGwo-N_361BSA', 'review_id': 'L7a0UqytvQjnNho0jda4Sw', 'text': "A taste of Motown in the desert.\n\nA Detroit Thanksgiving tradition in our family...head down to Woodward for the J.L. Hudson parade, stop into Lafayette Coney Island for our coney fix, watch the Lions lose and then the turkey and all the trimmings.\n\nSo glad to have Detroit Coney Grill in the valley! Every bit as delicious and tasty as Lafayette or American's coneys. Wash it down with a Faygo Rock n Rye or Redpop interspersed with some BetterMaid chips and with the airfare I save from flying from Sky Harbour to Metro Airport, I can indulge frequently.\n\nPerhaps Detroit Coney Grill can get a beer/wine license and serve up a cold fire brewed Stroh's.\n\nLooking forward to a north valley location closer to my Anthem home.\n\nDetroit Coney Grill rocks!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-08-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jN9rYUyZ2LmxnEcDP1sJGg', 'review_id': 'B9uRJF_7LetB7pV__N8XQg', 'text': u"Everyone is super friendly from the cashier to the cooks. The prices are very reasonable as well. The food was awesome, I got the Big D burger and my fianc\xe9 a Buffalo Chicken Pita. Both were on point, and were served within a few minutes of ordering them. Both were cook perfectly and put together really well. The Big D burger could have gotten really sloppy really quick but surprisedly didn't at all. Overallawesome place, will definitely be back!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-08-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'SEjYxEV_Y723uyTq3ADBvw', 'review_id': 'bfgNoL7itUn_oeEAGy201Q', 'text': 'Enjoyed the chili dog, but the chicken in the chicken salad was really tasty and moist. The best part was the staff - so friendly and helpful! Reasonable prices for yummy food and great service? Yes, please!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-08-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XZFgEy7fc_8NbIsof1QfUQ', 'review_id': 'cb26kHdlip57mUL66fLB-w', 'text': 'Ok so I have never had a "coney dog" and it is this places saving grace had chilly dog burger and chilly cheese fries. Chilly dog awesome very good. Burger was very small pattie with no patty flavor. Chilly cheese fries worst part of the meal the fries were almost burnt and cheese sauce was flavor less I could not even eat them. I would recommend for coney dogs only', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 3, 'date': '2015-08-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CMBzhJ9ntNS_r-awkaY_zg', 'review_id': 'M0pCmxUpLpbKfZGydb-bfQ', 'text': "Fantastic dogs and chili. You can't go wrong here!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-08-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'AyZ3L1cGACAB2ZWOo2fDLg', 'review_id': 'N9KjjA0110wEQFv4dvRAaA', 'text': 'Yum... Yum.... Good food friendly service. Coney combo ...sooo good. Fries......? Sooo good. \n\nThe food was good.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-08-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qaqP9qx0Pe22vPXriPyT-Q', 'review_id': '09aQNQjqS6TBcmGK7ifHHg', 'text': 'Real, "michigan style" coney dog!  From the chili to the vienna style weeny.  Havent tried anything else on their menu, however i dont really see a need to.  \n\nSuckin on chili dawgs\nOutside the DCG....!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-08-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'aG2fm4fzXM9UFoRx5Xra3Q', 'review_id': 'EKZO3cEQICPVkUQvLkrPbg', 'text': 'This place is easy to overlook. Little burger place in a strip mall, like thousands exist all over the west. But man their burgers are amazing! Each patty is only 2oz but seasoned to perfection and cooked to sizzling and cheese dripping deliciousness. I can only imagine how glorious these burgers would taste drunk!\n\nDefinitely give them a try!  Great customer service, east coast Pop available, great family owned feel.\n\nEdit: after receiving a message from the owner I decided to up my review from 4 to 5. I never give a 5 unless the combination of quality, service and ambiance is just amazing. The dedication and personal touch this place brings deserves it.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-08-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xe02WG9W8ff0Zf491BA9Gw', 'review_id': 'HpbvDQr0NvohfmlL0XXUnw', 'text': "I tried this place for the first time yesterday. I'm originally from Detroit and I love real Detroit Coney dogs. Only place I could get them was back in Michigan or to bring the ingredients back here to Arizona when I travel up there. These are real Detroit Coney dogs it was just like being back home. The food was excellent the service was great and the people are very nice. I had the Coney dog, Chili Cheese Fries and Faygo Rock & Rye it was so good! I'm so glad they are in town and I'm hoping they will open one in the East Valley. I live in Apache Junction and would love to have one closer to home but will definitely drive to Tempe if I have to. It's worth the drive!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-08-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-Q3QRnpJoT6-XTc_1yTyGQ', 'review_id': 'dN64_DpeGZZLzZPwh9yi8w', 'text': "Never been to Detroit or had a Cony.  Walked it and was greeted by a Dave.  Very friendly and helpful.  I told him to place my order for me to give me a taste I'd Detroit and he hooked me up with the 2 Coney meal and a Fargo Rock&Rye.  The food was excellent.   Tasted better than normal hot dogs and the frys were very good.  I'll be back to try the burgers next.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-09-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'elY-q1mw3PnYUkWxDHM2Ow', 'review_id': 'dR4iNYbMltxDyQY3kAGgQQ', 'text': "Phenomenal would be an understatement!  The food transported me back to Detroit and was delicious.  We have lived in Arizona for 4 years and have missed having real Detroit Coney Dogs until we found Detroit Coney Grill. David made us feel like we were back in Michigan and truly put a huge smile on my 16 year old daughters face when he sat a bowl of Superman Ice Cream in front of her.  We live in Avondale and it was worth the drive and will highly recommend Detroit Coney Grill to our friends and family!  Can't wait until David opens a location closer to us!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-09-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rA9vvvJwAbv71lf26MMm4Q', 'review_id': 'VXFsaJPfmRz2pn21BTnQaQ', 'text': 'Being from the Detroit area when I moved here in \'99 I cod not find a "Good Coney". Until today, this place is the real deal!   Best Coney Island in Phoenix hands down, add a Faygo Rock n Rye I was back home. Two on One all the way with fries and a rock n rye, so good, no great. I just wish there was one closer to Pima and Frank Lloydd Wright. But until there is it\'s worth the drive.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-09-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'RA03y79ghGTd7qlyQ3urYA', 'review_id': 'SBPcrkFMLwvU1oHQ_Uwxxw', 'text': "Dave is amazing! He brought the authentic coney dog to Arizona!!! I'm at McDonald and Scottsdale Road and would LOVE an Old Town location! Also, please bring the Sanders hot fudge cream puff to the menu!!!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-09-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'bZWeyRPxCzUOGDWUh0jgYA', 'review_id': 'y4nbEhSHdcg_Xk37lmvUyQ', 'text': "Being from the Detroit metro I've always missed having true Detroit style coneys when not at home. A friend told me about this place and I decided to give it a try and I was ecstatic to find a place that reminds me of home. The chili and the snap of the hot dog skins taste just like back in Detroit. I wish I would've  known about this place years ago!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-09-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '0gFy1xuZi6wI4ZPsXwrNUw', 'review_id': 'ddl2rONwi0whEU-2oua73w', 'text': "This place felt like home with the greeting to the end of our meal, service is friendly and made me feel like I'm back home in Michigan. I ordered the loose hamburger coney and I ordered my friend a coney dog.. He loved it - considering he is a native in AZ, and he fell in love with the cream soda from Faygo!! I had to get my Vernors !! Everything tasted fantastic!! Hands down - love this place - wish their was one closer to me in North Phoenix.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-09-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rA9vvvJwAbv71lf26MMm4Q', 'review_id': 'YA4OIaw3dBfJge-RIXJw6w', 'text': 'Being from the Detroit area when I moved here in \'99 I cod not find a "Good Coney". Until today, this place is the real deal!   Best Coney Island in Phoenix hands down, add a Faygo Rock n Rye I was back home. Two on One all the way with fries and a rock n rye, so good, no great. I just wish there was one closer to Pima and Frank Lloydd Wright. But until there is it\'s worth the drive.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-09-15', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': 'L9R2GC0fIZZVA0kaABPG0A', 'review_id': 'P4vaAIkeDQLnQYV1ib-ZOg', 'text': 'I thought the food there was average. We got chili dogs and mine had the burger meat in it. The wiener itself was super average and most disappointing were their fries. I eat fries maybe once every two months so I was looking forward to them. Maybe I shoulda tried the Faygo drink... They were real friendly so I gave em an extra star.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 3, 'date': '2015-09-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'lMS5hMMOCK6iv7zN7i4EUg', 'review_id': '14qKehIfSMrWdjE7hDhx5A', 'text': "Best dog in the West\n\nI'm from LA but I came out to Phoenix for a football game. I'm sure glad I decided to eat a dog before the game. Their hot dog is all beef imported from Michigan (which sounds unnecessary but based on the taste is worth it) the dog itself has a nice tact on the outside but is totally juicy on the inside. The chili and chunky onions are simple and perfect. Also, their owner Dave is badass and rotates between their locations daily.  \n\nBetter than Pink's DTLA", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-09-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '-26Vk4JvE0Xr1Qh5w5TG5w', 'review_id': 'YytLReV_CSnR4XTo4rFgfQ', 'text': "Was welcomed as soon as I came in the door, real nice guys.  Really good hot dogs that look as good as they taste.  It was a nice touch that they followed up to make sure I was satisfied.  I'll be back for sure.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-10-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MQqJFa0GzM2IjBS2GG1OMA', 'review_id': 'wp264SQ2epK2RHCj-XYKIQ', 'text': "Amazing!! I got the Detroit Coney w/ fries, and the Superman ice cream. All of it was so, so good! Definitely the best hot dog place I've been to around the Phoenix area.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-10-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'fHiOUSoDJge-WTcZFb89MQ', 'review_id': '20QgEfySJOCSQo8ari5UhA', 'text': "I ordered a burger, fries, coney dog, and chili cheese fries. The burger was delicious!!!! The chili cheese fries needed seasoning ...homemade fries...no seasoning. The chili cheese dog was nothing special. I'd come back for the burger for sure though.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 3, 'date': '2015-10-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'WLZCEJAYADEDs_MZltFW3A', 'review_id': 'hbwOaboSnTMjiEmwy2VF5w', 'text': "I tried the Detroit Coney Grill today, I was born in raised in Detroit and lived in MI until a few months ago when I made the trek down here. I give the place three stars because I was expecting to be blown away and almost homesick by the time I finished, but that really wasn't the scenario. I had a 'hani' and chili cheese fries, my staple coney island order. The chili cheese fries really didn't do much for me, something about the type of fries they used and the chili/cheese blend was off, not bad, but different enough that I was aware of something being amiss. The 'hani' was okay as well, it was what I expected as far as the chicken tenders and slices of cheese, although I wouldn't say it was great. Something else I noticed was that everything tasted salty, like it was all sprinkled with sea salt before served. Honestly, that could just mean that my taste buds were off today, because I doubt they sprinkled my pita with salt. Maybe I was dehydrated. Overall, it wasn't bad, but if I had been in a random AZ restaurant, I probably wouldn't go back. It just wasn't what I was craving. Because they were very nice, and genuine, and I've heard great things about the owner, I will definitely try again, I'll go with chili dogs next because according to yelpers, they get those right every time!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 3, 'date': '2015-10-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '-jVQEGYjTdKbDOz5VhJ2tA', 'review_id': 'q6dUQMtdZjANK5LpICe1bw', 'text': 'Excellent food, and even better customer service. I would recommend it to anyone and everyone!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-10-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'gUB6lMG8Bbizw9IYbXgjRA', 'review_id': 'yuovjdFyNI7LfLyStTgSGA', 'text': 'I worked in Detroit for 20 years,  while there I became a fan of Detroit Coneys ...... This is as close as the come next to being in Royal Oak', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2015-10-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'nEQflkPvz04Vq-IAwC2G0g', 'review_id': '3TKT9Vjvyq6ypj02nhkimA', 'text': 'Perfect Coney...Perfect "DE-TWA" Coney!  The guy even sells Town Club and of course Faygo pop. Yes...pop...NOT soda!  \n\nThe owner was nice/friendly and proud - I love to see that sort of sincere passion with someone and their business...it transcends into their food!  \n\nThe coney was about as legit as it gets.  A Detroit is more savory than other coneys...which can be Good but different. The Greeks like to add a pinch of cinnamon - not bad but good. \n\nAnyway, a true coney isn\'t for everyone...but, in my humble opinion everyone should try one! :)-', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-10-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4zQ4da9FQXSLHJy3QOyumw', 'review_id': 'AXofV6_ofVTEpo-dlbHHzQ', 'text': 'Best coneys in Arizona hands down! Way to represent the D!!\nAlso give their burgers a try...you wont be disappointed.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-10-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GYCvGHDwAzYvNi2EHC8VcA', 'review_id': 'U6Eb1f2rPvb1DH-ZiOPOdA', 'text': "Love the Detroit Coney Grill! Food is great! I really get the taste of home (Michigan). I live in North Phoenix and it's worth the drive to both locations! Hope to see a coney grill in my area soon :)", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-10-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wptrXQddwU8dKryJKHeHgQ', 'review_id': 'hFDHSgcl8wA9GX2PSSONSg', 'text': "Good food. People were really nice! Customer service was great. Food was pretty good. Never been to Detroit, so I can't really compare.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-10-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'AQBQf_5lkHPSyUQ3Vo8jGg', 'review_id': '1sr6LyT8D49n8wQikIzoEQ', 'text': 'Amazing burgers - but avoid the gyros.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2015-10-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'TEaNky0KP0goJE3CuRSvLw', 'review_id': 'Y6f3ObhCq7LPd9V4Pwo8XA', 'text': 'Let me start with i love this place the food is great and as a detroit native i love the fago and bettermaide but i feel since they opened the new store the service has gone down the people at the front counter are rude and dont talk to you just today i went in and the guy asked me what do you want i looked at the sign for the special and he said the special and started putting it in before i said yes then i asked for chilli cheese on the fries he said nothing just took a deep breath and yelled out 11.45 i said i had a five star card and he just looked at me i pulled it out he snatched it scaned it and dropped it on the counter i asked about a rockin rye fago he cut me off and said "I aint got none" i gave my card to pay he swiped it through the recpit down with a pen and turned to talk with some one behind him i singed it he turned took it and thats it didnt say a word to me i was going to stock up when i come in i get 4 6packs of fago but i felt like i was being pushed off if anyone reads this i hope you do some training or something i have seen alot of places die out here for these reasons and i would hate to see this one go away', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 2, 'date': '2015-10-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': 'SZ0__cr7Czk_D-AAHW-Ajw', 'review_id': 'y8qXywn3LHYDKX8IK41z6A', 'text': "It's awesome give it a shot. I drove past here everyday for a year thinking it would disgusting despite the food reviews. Hot dogs were good and i don't even like hotdogs. Like i said its worth a shot.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-11-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'BW30jQWA1yEr6QHuwZcCCw', 'review_id': 'cM7D4xE2H1f0_Ehii4_3Ow', 'text': "First time here. Fries were good. Coney hot good was so so for me. I admit it's a different flavor and maybe I'm used to an all beef type,  but it did not impress me. Chilli was a real disappointment. I did not finish half of it, just did not like it. 2.95 for a snall bowl and again the flavor was unimpressive. Service was good and friendly. \n\nI would drive 5 miles further to go to Teds Hot Dogs in Tempe,  but some people here obviously are repeat customers. \n\nOverall I would rate the fries and service good. The chilli  poor and Coney dogs as so so at best.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 3, 'date': '2015-11-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'bt-eYsjf5LosljjwZukDiA', 'review_id': 'DEessDpVgp8TM9Lekaq0iA', 'text': "I'm from Arizona and my boyfriend is from Michigan.  He of course is in love with Coney dogs when we went back to Michigan we ate at the two famous places there American and Layette.  I loved them both but for me it is the Better Made Barbeque Potato Chips.  I have always loved potato chips and I thought that I had my favorite until I tasted a Better Made so for me its all about the chips:)", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-11-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'clTYUJCL-rHnVIS2WePRwA', 'review_id': 'L-MU6RuG8x_dS5HgGR-Kug', 'text': 'The owner of this place is a hell of a salesman.  He believes in his product and obviously cares about the place and its origin, and I respect the hell out of that.  Recommended a flavor of pop (not soda, I learned) and was spot on.\n\nThe dogs were fantastic, the burger was small and simple and great, and that chili is killer.  This place is awesome.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-11-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'aL3twjz8GSRBaMiCPPDrlQ', 'review_id': 'tkPUkcNfiMcuWJlUZ2v2Fg', 'text': "Good stuff and a great place to go one week after the wrought loss challenge weigh-in! Sense the sarcasm there as this burger (quad burger with grilled onions,  mushrooms,  bacon, American AND Swiss cheese) tasted great, which generally means it's really good for you, right?! Really want to try a coney next time here.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-11-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 3}, 'user_id': 'uBp2Jmip2qXQ0iWHUDY9sQ', 'review_id': 'iXc6AfgCMtR6k0Z089dJEQ', 'text': "People who haven't been there probably don't realize that Detroit has its own type of hot dogs known as Coney's. It's basically a chili dog served with or without onions and covered in a specific type of chili that tends to be a little less meaty and a little more watery than you get in places like Texas. Other Michigan specific items include Better Made Potato Chips and it wouldn't be a fair representation of the Wolverine state if you couldn't wash it all down with a Vernor's Ginger Ale or a Faygo pop. While it seems like the Chicago foods tend to get all the love in the Valley, Detroit Coney is a nice change for anyone who's ever spent time in the Motor City.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-11-19', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': 'JZoIR3Q2wzou24BfrIY2Xw', 'review_id': '2B7PVefHa6ZYz5uodR7ByA', 'text': 'As a displaced Michigander, flying in from San Jose, Detroit Coney Grill was a perfect piece of home, away from home. Coneys were ON POINT! Service was friendly and fantastic, and for the kindness of the owner alone I would return. The fact that the Coney Dogs and Chili fries were spot on drives home that this place is excellent. \n\nThe SAP center may be the shark tank, but it could totally use a Coney. Coneys and hockey go hand in hand. \n\nThanks Detroit Coney Grill!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-11-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'b2DKC4kC8-QeSeGZ_MF3XQ', 'review_id': 'U6lHIdgKn-zWcfhpBGfY1g', 'text': 'I revisited recently. Must say it is much more pleasant without the owner yelling at his wife.  Also like having multiple choices on the pop machine. Still good tasting food,', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2015-11-30', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': '6Ug_qh1dML4QlzzX8ohaVQ', 'review_id': '9zwG4PchP4pVMuAyxE1xeQ', 'text': 'Very very good , fries are damn good to compliment some very tasty dogs and burgers. Gotta get the hot dogs I think they are unique and have a different taste compared to traditional Vienna', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-12-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 2}, 'user_id': 'obTixVBziFCH0e-EUnAvtg', 'review_id': 'Qw4rj8pg98LwNuV69CquwA', 'text': 'So darned good we had to order more food. Wish I was still hunger so I could eat it all over again', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-12-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'UgHAovflNPhJdfd-NDLH0g', 'review_id': 'jSGf-I88zvLzYhakdutb1Q', 'text': "I've been supporting Dave since the very beginning! He is personable and exudes customer service. He makes sure you leave happy and full :) I switched it up today and got the Hani! Reminds me of Kerby Melt (all my Michigan people who know Kerby Coney Island) but better! Well that'll be my new fix until I need my authentic coney again! And there was a line today because of 50% off don't be scurrred it goes fast (and your food still comes out hot)! Check in and get 10% and get the five stars card so your points add up and get a free coney! Look  I'm telling you all the hook ups! Try it you won't be disappointed!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-12-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '3v992z7jD9ao-HHherEcVg', 'review_id': '1183fUWqJ8p58df5cgVrOw', 'text': 'Great Food, Great Service, and very easy to drive by it. Slow down and look for this spot on the north side of Broadway in that little strip mall and life will be good.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 4, 'date': '2015-12-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oXRg-3F7hoDLqy2BADigfQ', 'review_id': 'q1kLOdF_GXXE-KZfVKHPcQ', 'text': 'This place is legit! Real Detroit coney and awesome fries! Love everything about this hot dog joint!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-12-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'aBDu7WwUhpAQeQduvLvDpA', 'review_id': 'PJXjLk4Duo_Uw6uTMRN4vw', 'text': "If you're from MI, this is going to bring you back! Stopped in for lunch and left very satisfied. The chili was spot on! The cheese fries were really good too! \n\nI dug into my lunch and forgot to get a pic, but I've added a pic of my boyfriend's coney combo. \n\nThe owner spoke with us and said he gets all his goodies straight from MI. We'll definitely be back here and plan on recommending it to all our friends from MI!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-12-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'eI8qbxtqcKtVBLHGfgwqXQ', 'review_id': 'CAQn170LxNnL9qvZX9ZS0A', 'text': "I was having major hot dog cravings this week. I was let down by another local hot dog place and was about to head to Sonic for a freaking plain dog. Good thing I was at a work conference nearby. I yelped locations close by for lunch\n\nI was excited to try this place after the disappointment I had earlier in the week. I was so satisfied and happy with my experience I might go back tomorrow! I don't know much about the Michigan/coney culture behind the place but even just as an average customer I would return again. \n\nI got just a plain coney with chili, onions, and light mustard. Hand cut fries and a drink. All of it was simple and tasty as f**k!! My dog was great; a little messy, but still great. The fries were fresh, hot, and salty! YUM! It was perfect and it was what I wanted, and it was cheap. I was also greeted warmly, and had three people check in on me to make sure I was enjoying the meal. And thanked as I left. I felt super taken care of.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-12-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'EgmVpe6GpB_gR8iVJbWSjQ', 'review_id': '_2SZ_La8Nv8_mifZ1QlJ4A', 'text': 'Just left there with a full tummy and a giant smile. Those native AZ ppl have no idea what a coney really is. This place is the best and is a must to experience!', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-12-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': '60i9h-gPKH1f0YC_bZXDhg', 'review_id': 'dbj-IsQ1nk_BFxmBQHXYLg', 'text': "Time for a Detroit Coney Dog Run\n\nI love these gems: restaurants in Phoenix where people bring the flavors of their home towns to you. What's more, they do it with so much passion, that they shine in a crowded sea of foodie options. \n\nAdding DCG to my Yelp! list after seeing it highlighted for its top reviews, I noticed I was nearby after a morning meeting in the area. Decided to drop in for lunch. \n\nStaff was super friendly from the moment I walked in the door. The owner (I think) was engaging with folks and teaching a new employee as she helped me-- totally friendly and supportive of her as she figured things out, which was cool to see. I wasn't going to order my dogs Coney style, but they prodded/teased me into it. Glad they did. The chili, mustard, and onions isn't normally something I'd go for, but it was a great combo with the hotdog. And their fries are good!\n\nDogs and burgers aren't haute cuisine. And that's the point. The only things that matter are if its tasty as heck and if you have fun while eating. You'll get that, here. \n\nA cool place to visit and revisit...", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-12-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GJ88Um7aIh6drv4aHigSbA', 'review_id': 'RYKet_mTi1xc_B0RTqyZUg', 'text': "I've been here twice, and both times, I just don't get what the fuss is about.  Maybe it's just a matter of preference when it comes to certain things about hot dogs, but I'm not sure I'm a fan of the Coney dog served here.  To be fair, I've never had one before anywhere else, so I can't compare to other establishments.  The cashier was very friendly and she even read my name off my work badge somehow and called me by name the rest of the time I was there.  I think that's a really nice touch.  The owner too, he's such a super cool guy and I really want to like the food because of it.  I got a Coney dog with french fries that I added the option of putting Frank's Red Hot all over them.  I saw the new menu item, the big-mackinaw and had to try it also.\n\nThe dog - the onions had a really off putting smell to them.  I don't know if they were old, or if it was the way that they interacted with the chili, but every time I brought the dog to my mouth, I was grossed out by the terrible smell of the onions.  It almost had that B.O. smell of old onions.  The snap of the dog, I love a snap, but this was REALLY snappy, kind of felt strange to me.  This chili is OK, I would add more mustard personally\n\nThe burger - huge!  Cooked to perfection, melty cheese, and then....the onions!  Nooooooo! There were so many onions on this burger, it completely destroyed my palette.  All I could taste was onion.  While I was in line, I was listening to each person's order, and it seemed like they were all ordering with  no onions.  I remember thinking, if you come to a place, order it the way they make it, they know what they're doing.  By the end of my meal, I realized why.  Maybe it's not why THEY ordered with no onions, but I certainly would order with no onion next time.\n\nThe weird smelly onions on the dog, and the way too abundant amount of onions on my burger were enough to wonder what the hype is.  If you love onions, come here.  If you don't, order without onions.\n\nThe burger and the personality of the owner and cashier were enough for me to some day want to go back and order with no onions.", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 3, 'date': '2015-12-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7AF9_mFCjjnvDFd0S6K2KA', 'review_id': 'xRoGrgrweUyOSekcRJbkcA', 'text': "A five star Coney joint is noisy, crowded, and full of smiles. The food overflows the baskets, and the fries are hand cut. The staff are like family: they tell it like it is, and sometimes they know what you need better than you do. Detroit Coney Grill is the place to go if you want the flavor and feel of the great Coney joints in Motown! Don't forget to wipe your feet...", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-12-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wUbT-ZUpyMwLEKx0Bmq0HA', 'review_id': '3JMtV16laiRC_L_CBNQ7xA', 'text': "I lived in Detroit for many years. I haven't had a coney in years!  This place was well worth the trip to Tempe.  It tasted just like I remembered as a kid living in the Dee.  They close at 7:30 and we got there at 7:14. They let us eat in despite the fact that they were about to close. The place was clean,  people were courteous and nice. I will come back!", 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-12-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jyogXa8TT2t5eXhBCkhkig', 'review_id': '0IYoKgS4GEdrwOQI0hSPMA', 'text': 'Coming from a born and raised Detroit native, this place here touches home, love it hear just wish there were a location in the West Valley.... please come further west.', 'business_id': 'gEAB85-Zcm8Qs5JQPC_PHg', 'stars': 5, 'date': '2015-12-24', 'type': 'review'}
