{'votes': {'funny': 4, 'useful': 6, 'cool': 1}, 'user_id': 'jEZwCcQktMqoXXLbpHR4yw', 'review_id': '5AjaBkF_ENjf6pw5rFCvdQ', 'text': "Okay the only reason this place gets the extra star is because I've eaten here before and the food was decent.\n\nI came here the first time after a night of raging and I was sooo hungry our group decided to go cray at kbbq. The food was good, we were drunk punks so my taste buds can't be too accurate but it was satisfying.\n\nThe second time I came here, I didn't even get to eat here, or step inside the restaurant. I came here again this past weekend after a weekend of drinking of course and we wanted to eat and Pho Kim Long line was pretty long and its chilly.\nWe remember we came to this KBBQ place from last time and we decide to go see if theres a wait. They have pretty large windows so we're looking inside and there is literally like 3 tables there. So I'm getting hella happy like yay! we can eat here without a wait. We go up to the door, the lady doesn't even let us IN the restaurant. We tell her we want to eat, she just nods and mumbles something and PROCEEDS TO CLOSE THE DOOR AND LOCK IT IN OUR FACE.\n\nwhat. the. hell. I swear I was not being a DAB, I was sober and cold and hungry. AND I CAN SEE PEOPLE EATING IN THERE. what the heck is going on??\n\nwe kept trying to think, wait why would she not let us in? we are all changed into our regular clothes, pants and jackets. But that can't even be the case because last time I ate here I was straight up in my rave clothes. \n\nNeedless to say I will NEVER EVER be going back here. I have never ever had such an experience with a restaurant where the employee closed the door and locked it IN OUR FACE. \n\nThe logic of her actions escape me, and I just really don't know why she would do such a thing.", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 1, 'date': '2014-11-04', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'DigEe2R64HxP9cMBXlPW7Q', 'review_id': '_QJz12Vc5GXwcVqzKodCjQ', 'text': 'Roaches roaches roaches !!! Do not eat here !! I informed the waitress and management and they started laughing about it and said its only on the floors who cares you still ate the food. So unsanitary .', 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 1, 'date': '2014-11-06', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 0}, 'user_id': 'x8T0Jg8qLfaD_QjGUobZ-g', 'review_id': 'Q7rtZocHk84rnmU5_hKzmA', 'text': 'Worst. service. ever. \n\nNow don\'t get me wrong, I never expect the service at Korean restaurants to be friendly, but the woman working here went above and beyond my expectations of rudeness. \n\nMy friends and I came here halloween night after hitting the clubs. Yes, we were drunk, but we were not being excessively boisterous. And if a place doesn\'t want to serve drunk patrons, they shouldn\'t be open at 3 AM. \n\nMy friend asked the waitress, "I can\'t decide, what\'s good?" "Anything. It\'s all the same. Hurry up." What in the actual F. Seriously?\n\nTo top it off, the food is mediocre and incredibly expensive for small portions. Never. ever. coming. back.', 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 1, 'date': '2014-11-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'aHXPODtZlyDFawelbyPGJg', 'review_id': 'pu4uPBjmOLa4uHBiABG_TQ', 'text': "The food was bland. The Korean soups we ordered were bland and the prices were higher than other Korean restaurants I have been too. The service was the worst!!! When we walked in no one greeted us. We seated our selves. When the server come over she didn't greet us. She didn't ask what we wanted to drink. She just put hot tea in tall plastic cups on the table and left. When she came back to take our order she just grunted. I said thank you each time she came to the table and she never once said anything to acknowledge it. I am half Korean so I even ordered in Korean but nothing. The server never came back to the table to check up on us. When we needed something we had to wave people down. They weren't even busy. We were the only ones there. When we paid the bill she didn't say thank you. She just handed the card back. I am never going back! The worst service!", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 1, 'date': '2014-11-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nPMYA0v2nx-CZ_A1jr4a_A', 'review_id': 'AKCLI-rGIJXYnd0nkOBIaQ', 'text': 'Everything here is good. I guess we\'re all going to like our mother\'s kimchi so tastes do vary but for me this is like mom\'s kitchen. They never give me a hard time about "looking white" or speaking Korean with a perfect accent despite having blonde hair. If you are in Vegas and want real Korean food, imo this is the only option.', 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 4, 'date': '2014-11-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9B3cFb4GobS0nRbvJ-yWLQ', 'review_id': 'Yq3HsWAOhSneafyWwyH0Fw', 'text': 'Its 24 hrs open Korean bbq restaurant. Good service good food but they r little expensive. Best time to go between 2300 -0800 because they have 20% off from total bill. Other than that, clean, friendly, good food...', 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 4, 'date': '2014-12-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SjMPPht1XYNvnYDjmQ23vg', 'review_id': 'JNA1K06rg6YS1GNZ9QS4hA', 'text': "Decided to check out this Korean joint in Chinatown of Las Vegas. \n\nThe good news, they are open very late into the night. The bad news- their meat isn't seasoned and flavored all that well. \n\nMy friends and I got the jack combination which is a mixture of meats, the meat quality was good but very bland and not that much for the price.", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 3, 'date': '2014-12-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Vk8KzA_KQBYnr4vAZSHYDg', 'review_id': 'nwu67jisAL7dsX9fKAAnuQ', 'text': "I picked a stew on the menu #53 it did not have a chili pepper next but low and behold it was fuckin spicy.  The servers weren't any help, they weren't very informative,  and only spoke to us 3 time. Bad service...bad", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 1, 'date': '2014-12-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MqamG9-Onl7u1KASa4r3-Q', 'review_id': 'IJdtTC8v-tiQXigoI_uHFg', 'text': "This is my second time visiting cuz I the first time was good. I took my friends here to have the same  nice experience as I had last time. We ordered the queen bbq combo. None of us can drink today so we change the soju into ordinary hot Tea pot. But we didn't get severed for any kind of tea. Not even iced water. So rude. We asked for it after paid the check and all we got was them saying you can get the soju. I mean what the hell we needed the hot tea when we were eating. That means they don't care about ur experience  or whatever. It's so unacceptable. Low score.  Don't come here ever ever again.", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 1, 'date': '2014-12-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'bJlj2mGbDYCLM0QiCN9bRQ', 'review_id': 'ySZ1sSMwON_9dc7Nn-rRrw', 'text': 'This place sucks. They charge for korean hot tea. Charge tip % of 4 or more.  Charge for refill on side dishes of 3 or more. Crap!!!', 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 1, 'date': '2014-12-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KcrgNSvO_NBwtv1rj56DUg', 'review_id': 'Uqx1V1YUugQhb6NjvgSyBQ', 'text': "Well. Service and ambience was good and traditional Korean. Tofu soup and bibimbap could be better, but the waitress was really kind to refill out side dishes. Overall good but not impressive. Personally think it's slightly overpriced.", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 3, 'date': '2015-01-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'H_tqwIx7TDY0S_np_h6fZQ', 'review_id': 'utHCsloJYTRHFwHSFIVOtQ', 'text': 'My husband and I came for dinner and BOY was it crowded! But despite them being incredibly busy, our service was amazing. They kept up with our refills and even cooking our meat for us at the tabletop! The food tasted absolutely delicious and fresh. It was clean and the waitress was really nice. We will most definitely be returning!', 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 5, 'date': '2015-01-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'dFq0qfVc275mG0i9ZzlMTQ', 'review_id': 'MsrrSjAh6gWs6sWwXbVSfg', 'text': "A keeper Korean BBQ place.  I think it is bit pricy above average but food was very good.   We had marinated Galbi but they also have seong? Galbi which is not marinated.   That Galbi is available at a good Korean BBQ place to taste real meat flavor.   Well one of us really wanted that marinated this time and it was an excellent choice.   \nAfter 11pm they deduct 20% and it is average price with really good dining I think.   \n\nThe receptionist was very attentive and we liked her service.  Table waitress is ok. \n\nWe had paejyong? Pancake also.  It didn't took my fancy but all small dishes especially Kimchi was very good.  \n\nI certainly would come back this place for tofu stew menu and other choices.  \n\nThey have a semi private dining area for a group dining.   I can use this for business dinner", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 4, 'date': '2015-01-05', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 7, 'cool': 1}, 'user_id': '6yyOaGo9FM1PPdb8R-pq3w', 'review_id': 'vxq4g829Bmed7exNy4d07g', 'text': 'First and last visit here! High prices, tiny portions, skimpy on banchan... I can\'t even. We were most of the way through our meal when I asked my mom if she\'d try the kimchi and she said no cause it looked sour, and I agreed saying it looked soggy and wouldn\'t try it... well,  she tried it and made the most awesome NOPE face. Oh and, apparently I\'m not to be acknowledged being half Korean and not being fluent in the language. Thank goodness mom is here to help me out and represent the table. We just got the check and my green tea was $5.. what? The most I\'ve seen is $2 and that\'s if it\'s not included. Usually some kind of barley or green or black tea is available by default. But the rice was $2, just random. The menu, dude the menu was $38 for kalbi and japchae was at $21. Mind blown.  The nangmyun was "okay," the la kalbi was bland and I kept finding bone spurs, very poorly cut meat. \n\nDae Jang Keum is the name of a very famous female doctor and chef in the Joseon Dynasty (some Korean history for you!). I think this place is trying to bank on its name and location (Chinatown near the strip) but the food portions and quality are low and the menu made me laugh.. out loud. The server was in the corner either picking her teeth or biting her nails and we didn\'t see her much bit after what I saw I\'m okay with that. There are more people working in here than there are customers. Maybe it\'s a tourist trap, I\'d rather drive further to better, and there\'s a lot better all around here. And yes,  I am writing this on my phone in a booth in the restaurant.', 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 1, 'date': '2015-01-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ytcGgd-SbyLMGFS3DVA7_Q', 'review_id': 'vEBl-2pjAnIn6sFsN_bTvA', 'text': 'Single worst Korean restaurant experience EVER and we normally love Korean food.  My husband ordered the bulgogi hot pot and it didn\'t even have but tiny bits of meat.  Let the manager know, he was extremely unaccomodating and made excuses.  The server never filled our drinks, the food was mediocre at best and food and drinks were pricey. "Bulgogi" is the first word in the dish\'s name and the manager tried to convince us that it\'s mostly a vegetable dish...just because we\'re not Korean, not falling for that! So, in addition to our $70 dinner, my husband had to go to the fast food drive thru...we will not be returning to this Korean restaurant.  :(', 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 1, 'date': '2015-01-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'AS2hWkvnxJeFft6-Qel35g', 'review_id': 'pc-Ol6vUJtzk5cBjX2qACw', 'text': 'Decent food. Poor service. Was told hot tea was extra. We said ok. Never got it. Water cups were never filled. There were only 5 tables being served. With better service it could have been 4 stars. Too bad!', 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 2, 'date': '2015-01-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3seHB78JZy5u0vQ8p_jOJQ', 'review_id': 'ONyc0N2ONY-dYT1TfrEtaA', 'text': "Best late night bbq! \nTry the queen or king menu's and after 11 pm 20% off\nGreat quality meat!", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 5, 'date': '2015-01-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'wcsX2oSG-JoGQuAOn08snw', 'review_id': 'TrEYUtyHOLYPIB4iu02dvQ', 'text': "Went here at lunchtime on a Saturday only because Mr. Tofu a few establishments away was closed. Bad idea. Overpriced, food not as good as other Korean places we'be tried. Their kimchi is also not very good. Last time we'll ever go here. Can't believe Mr. Tofu is closed on a Saturday!  Oh well.", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 1, 'date': '2015-01-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hMZpkiIugSmFAewk0Jz6Yw', 'review_id': 'SVfrYMdMa7p8NPud_nDgvQ', 'text': "Good food with bad service? I can still comprehend. Normal tasting food with bad service, I don't know if I'm coming back here ever again.", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 2, 'date': '2015-02-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'o70VpFS4BPCv1nZcokmv9Q', 'review_id': 'nlbwzspUcDR4wFnocD2Lfg', 'text': "The worst experience in my life. Never felt so insulted before. Food was mediocre and overpriced. I never got the food I ordered. The cashier was so rude that my friends and I felt humiliated. What's worse, she forced us to pay the tip after such a terrible service, insulting us in Korean. It was the worst experience ever, and if the owner has any sense of business, pay more attention to training your servers. DONT EVER GO THERE!", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 1, 'date': '2015-02-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': 'iRg71EvOjegzZkGgJUfW4w', 'review_id': 'fT_1c4pkcLxgArB84ao2iQ', 'text': "Thank goodness for happy hour (20% off entire bill after 11pm) or I'd never be able to afford this place.\n\nThis review is for their soon dubu and kalbi only! I've never had their kbbq sets.\n\nSoon dubu is pretty good, one of the better ones in Vegas. Nice, hot, and packs a punch. The side dishes are okay (broccoli is awesome). Their kimchi seems like it's been fermented for a lifetime too long.\n\nKalbi is a little less seasoned than I'm used to but good nonetheless. Goes great with the pork soon dubu or seafood. \n\nService used to be terrible but lately we've gotten polite smiles, yay!", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 4, 'date': '2015-02-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '9j3nWvSDP8-Ubi8EFqr62A', 'review_id': 'HbBZkx5WGk_QNcwzIjsb9g', 'text': 'After a long day at a trade show at a nearby hotel Rio, I ordered food to go. I ordered Kimchi-Chigae and Bulgoki. $47.  (In LA, same order would be about $25   (4 Star))\n\nThe food was what we needed, after eating dry hotel tradeshow food all day. \n\nThe food was ready since I ordered by phone. The parking was easy, and the drive back to my room at Rio was less than 5 minutes. Hot food delivery to my room, all in less than 30 minutes.\n\nGood for take out orders...', 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 3, 'date': '2015-02-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'qDK-y7iDBz5i6Zv6_QDTXA', 'review_id': '4-u4k8LIEDjp1RYGCo6CUA', 'text': 'worst food, horrible service, bad experience! top it off, we cooked our meal ourselves because the waitress was upset.', 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 1, 'date': '2015-03-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cCz_-IVCszqI4fVkn9h1pw', 'review_id': 'Nl5UHHP1S5Ed4ee7jA2RwA', 'text': 'Best Korean Food in Las Vegas! Of course the prices are higher than Los Angeles.', 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 3, 'date': '2015-03-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Hdz8X7n7suVgB6LTpBHMGw', 'review_id': 'uaCv_OBXv73FxItXvxuC7Q', 'text': "It's good but kinda pricy and the waitresses don't seem very friendly at all..", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 3, 'date': '2015-03-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3GTxx-wh6ezfML72XzrErA', 'review_id': '4qrmnY1UpHslfCZjBVcfTw', 'text': "Place is pretty good. Food is decent (can only say about the tofu, but not the meat). Service is on par. Environment is nice and pretty settling.\n\nThe dish I had was the spicy tofu which comes with an egg in it as a choice. It was good and filled me up quickly. Theyre generous with the sides too. Sides include broccoli, fried tofu, raddish, bean sprouts, and more that I cant think of right now. They are also willing to refill any of them if youd like. Seems like most of their tofu dishes are spicy or comes with meat, so if youre a vegetarian that doesnt like spicy things you might not enjoy it here.\n\nService was good and there was nothing to complain about really.\n\nEnvironment is nice with wifi. Its a nice place to gather friends in I think, but I dunno since I have none.\n\nThey offer metallic chopsticks which I don't like since it has less friction, but in all fairness of the restaurant they do last longer and are easier to clean.\n\nPros: good food, service is on par, wifi, generous side dishes\n\nCons: tofu is limited to either spicy or served with meat and aluminum chopsticks if you care for that.\n\nAdvice: its a place to try out really if youre into spicy tofu.", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 3, 'date': '2015-03-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dv5enUYro5T3rxBvy6jxxw', 'review_id': 'HPi8kDJXB83ZUX4Eir-png', 'text': "Just average and forgettable .  Didn't love it but didn't hate it, just average.  Not raving about it but have nothing really to complain about.  Wish I could say more but it didn't leave much of an impression either good or bad...", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 3, 'date': '2015-03-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '1aNyBVJe2hNSXrVY5zsR1Q', 'review_id': 'ya3bxBCGndgj7vhBf674yA', 'text': "I came here the other night because I was craving tofu soup. Mr. Tofu is my absolute favorite, and I had been craving tofu soup for a long time! Alas, they close at 5 on Fridays. I did arrive there at 4:46, but they already closed. \n\nAnyways, I decided to try this place instead since it was at the same plaza. Pricing is quite a bit more. For a regular tofu soup it was about $12. I got the pork flavor with a level 8/10. The soup had no flavor and there wasn't even a spicy flavor. I was extremely disappointed since the soup tasted horrible and didn't satisfy my craving. Plus it was pricier. \n\nThe ban chan was pretty tasty. They had kimchi, kimchi radish, fish cake, broccoli amongst other things. However I would have rather had better tasting soup. It is to be expected, I guess since it is a Korean BBQ restaurant. \n\nThe service was pretty great. The gentleman check on me a few times. Granted there was only one other person dining.", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 2, 'date': '2015-04-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TfwwvaRGNfOqknUY32waJQ', 'review_id': 'u1aNILJ6DCvt39Cc6bsGTg', 'text': "Got married and took my wife here to eat with the familia! We had the side room to eat because we had a really large crowd. Food was aight. But we're from Hawaii where food is really great. So yeah...", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 3, 'date': '2015-04-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'sk0ZLpS2xGfKgUKVKJVoew', 'review_id': 'imYlSStVQ80F_WhCkDhEOg', 'text': "I always visit this place whenever I'm in Vegas.\nTheir pricing a little up there but I like their food haha.\nOnly thing I didn't like is when they don't pay attention to the meat that is like going to be burnt and they wont let you flip the meat yourself please DJK I'm here to eat good Korean BBQ not burnt meat. lol\n\nThat said I'd still come back though only because I can't resist their KBBQ sets and soups.", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 3, 'date': '2015-05-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'juan4cWOhaqpQA3Rgml6Uw', 'review_id': 'Tpydv_9PfaMTD_mUS6cEwg', 'text': "I don't understand why this place has only 3 star rating. I'm korean and I go to a lot of korean restaurants. I have been here over dozen times in last few years while visiting las vegas. The food is always good and so are the side dishes. Keep up the great work!", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 5, 'date': '2015-05-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 4, 'cool': 0}, 'user_id': 'eiNQmJhnHfLFRwLlNboj_A', 'review_id': 'BZgH2ksGPKlJZ44eLTeWHw', 'text': "After five visits to DJK in the past month and half, we will not be returning again for a very long time. Perhaps never again at all.\n\nThe first visit was great. The service was okay and the food was delicious. We ordered daechang (large intestine) and traditional kalbi. The daechang was a treat due to its rarity, especially here in Vegas. It's slightly marinated, which is a nice touch and adds a slight sweetness to its rich, fatty flavor. We liked it so much that we returned four more times.\n\nThis is where the bad begins. The second visit was mostly okay but the daechang wasn't marinated properly and lacked flavor. If the dish wasn't prepared properly, the servers should have told us that it wasn't available. We could have ordered something else. Instead, they served it to us anyway. After they us served our food, we were forgotten and the food ended up getting a bit burnt. It was still edible and the place was fairly busy so we gave them a pass. \n\nThe third visit on, things get really bad. The servers burn our food AGAIN. We waited over 15 minutes for more rice, side dishes, and water. That's only after having to flag one down after being ignored for quite some time. This is at 11 PM, when less than 4 tables are being served and 4 servers are working. We had to ask for straws three times. Twice to our server who never procured them and a third time to someone who wasn't even serving our table who *eventually* brought them to us. We were annoyed, but just chalked it up to tired workers who had a long day.\n\nThe fourth and fifth visits just sucked. Why did we go two more times after a shaky third visit? Probably due to a combination of having too much faith in mankind and a hankering for marinated daechang that can't be found elsewhere in town. By now, the faith is gone and the craving for that sweet, fatty dish has all but withered up. \n\nSo long, DJK.", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 1, 'date': '2015-06-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oXRLA-4UxLs7Kyj9KUgZhw', 'review_id': 'I3Huv5VhFgLBnIAC1GWnJQ', 'text': "Don't know why this place has such bad reviews. I had a very pleasant experience both the times I visited. I usually come here pretty late at night it works out great bc we get 20% off the bill. There's only one lady working around this hour doing all the work but she does a great job. The food is fresh and very flavorful. Pretty authentic Korean bbq.", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 4, 'date': '2015-06-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DeUYfuEjDj2YeMHAP4h8Tw', 'review_id': '5-W26EQTYj6XC5HI9pxLAg', 'text': "The service was excellent, the ladies there were attentive and cooked your meat for you depending what BBQ package you order. We order the king! Really good portion for 2 people with a really big appetite. The vast selection of mini side dishes was awesome. It's a little pricey, but you get the quality that come with it. The meat was fresh, delicate, and tender. Overall a good experience.", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 4, 'date': '2015-06-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Rnjp-TLTr_2daerawq-cvQ', 'review_id': 'ffcDUSi4RybH3FRGsnDiGQ', 'text': 'Had the bibimbap this time.  OMG, the meal really hits the spot. After having a complimentary buffet for lunch at the Wynn the day before, this really redeemed.  I\'m not a big fan of buffets. I\'ve tried all the "best" buffets ranging from wicked spoon and bacchanal to bellagio and Wynn. All pale in comparison to this place. This is a must go place for me every time my wife and I come to Vegas which has been once a year.', 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 5, 'date': '2015-06-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ii3B6X-Z7092yLZkVTVOYw', 'review_id': '16iw67Gl_REPbzwG9lNBvQ', 'text': 'This place is by far our favorite Korean Restaurant in Las Vegas. Happy hour specials after a night on the town are the best bang for your buck. Healthy and flavorful! Gamsahabnida..', 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 5, 'date': '2015-07-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '7gDVr0VoP_34lYQClH2uAw', 'review_id': 'FyDFE-tzS29guI_5XZmsXw', 'text': "I LOVE THIS PLACE!!!!!\n\nAfter a co-worker introduced a bunch of us to this place we ate here several times as a group after work  (so usually between 9am and 12pm).  Food was great!  Such an interesting way to cook the meat at your table.  We loved getting the combos where you would usually get about 4 different cuts/types of meat, plus all of the different sides that come with it.\n\nWe NEVER left here disappointed, but we always left extremely full! We even got a free after dinner type of  beverage one of the times.....I can't remember the name of it....and I'm not sure I'd have it again but it was a great experience to try it.\n\nI also loved how different days would get you slightly different side dishes, depending on what they were preparing for that day. Some side dishes i loved more than others obviously and was so happy when they were on the menu for that day.   I always loved the spicy tofu soup, and especially the bean sprouts and whatever they were marinated in.  \n\nAlways had great service, never once in about the 6 or 7 times we've gone have we had a bad experience.   Well worth the money!", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 5, 'date': '2015-07-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'lTep4JroIrXYmmyeXqJmiQ', 'review_id': '3sUURh5fB3bHuVetwtQl5w', 'text': "OMG never ever come to this place. The service was so baddddddd. Once we eat there because we heard that the food was good. But when we ate maybe like 20 mins, the waitress gave us the bills and wanted us to pay immediately. Obviously we haven't finished our meal and they came many time to rush us to pay the bills with bad attitude. We were so mad and had really bad dinner and don't want to come this restaurant again !!!", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 1, 'date': '2015-07-06', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 1}, 'user_id': 'OYjTuZHJVmxslZQbyOpFNA', 'review_id': 'LHdpcfg5X8Ipwg8JbaREpQ', 'text': 'After having a super sad and unsatisfying meal on the strip,  a local recommended that we hit up this place for some tasty korean food so we did!\n\nFood: \n1. Banchan sides: \nThe usual stuff, but my favorites were the kimchi and cucumbers. I would like to point out that their version of potato salad was just sad. It was bland and did not taste very good.. it was at that moment that I was truly appreciative of all the korean restaurants in SoCal that were able to make this side right. Blessed for reals! \n\n2. Kimchi Stew: \nThis definitely hit the spot! I have been obsessed with kimchi stews lately and I think this was just as tasty as the one from home ! The stew consisted of some rice cakes, meat and of course can\'t forget the kimchi! \n\nTwo star deduction: \n1. Service: \nThis aspect of the business was horrible! Took forever to wave over a server to take our order and when it came time to get the check I had to walk to the front to request for the check which was ridiculous!\n\n2. Pricing: \nThe pricing of all the items were very questionable. The portion sizes are the same in comparison to those at home. But it is like literally $5-$6 more dollars. I guess it\'s because we are in Vegas... -_-"\n\nFinal Verdict: \nThe food is good but I don\'t know if I want to deal with the lame service again.. we will just have to wait and see.', 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 3, 'date': '2015-07-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'mvh_o8Lc1lNByh3OEkBoyQ', 'review_id': 'eZGJZJqvBZdYmc1tiCsekw', 'text': "This place is below average for several reasons.\n\nUsually Korean bbq places lavish on loads of panchan, the small appetizer dishes. Sometimes upwards of 20 dishes and I really enjoy the variety. This place only served 6 small plates.\n\nThe price for a kalbi is $38!! Back in chicago it's half that. \n\nThe server also seemed more interested in making small talk with fellow regulars than serving us...which was slightly annoying.", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 2, 'date': '2015-07-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'kYg_xXaW5nndJm0AnrR3ww', 'review_id': '1pl5h0TMfefhzUtGF2cEhg', 'text': "RUDE RUDE RUDE! Just because we aren't adults and are tourists here doesn't mean you can't even respond when we say thank you. We came here because the pho restaurant next door had too long of a wait, but we will make sure to never come here or recommend it to anyone ever!", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 1, 'date': '2015-07-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-WlMP-FWb__LSpxGhj8p7w', 'review_id': 'PY0oMyNCOpiAOTb6E5lOjg', 'text': 'A tad expensive if you are ordering Korean BBQ because the portion comes out small, but other dishes like bibimbap, udon, fried rice, etc are pretty good portion per person. My favorites were the fried rice and hot bowl bibimbap, I highly suggest them!', 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 4, 'date': '2015-07-31', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 6, 'cool': 2}, 'user_id': 'xT3nCjsC6LHtrid-0LWQ_w', 'review_id': 'emfGSCoQBZZGrRusJC72KQ', 'text': "In all honesty, it's very overpriced as it's close enough to the strip/in Chinatown area to still hike up the prices, versus local spots away from the area which are almost $10 cheaper. Plus is that it's open 24/7, cons is that you are definitely not getting nearly the quality you pay for...It was $20 just for japchae, a usual banchan (side) in Korea/anywhere else, and though presentation was...strangely extravagant for such a common dish, the flavor just didn't authentic. That, along with everything else we ate, tasted more Chinese than Korean. I'd rather go to the other Americanized 24/7 Korean joint on the strip than venture out to here. Of course, for real delicious Korean food, you'll have to go where the locals are, about 20 minutes away from the strip so take what you can get!", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 3, 'date': '2015-08-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'SVUXdeNw2uK-QO4NBobeuw', 'review_id': 'yq0kR4IrJx2l0Yfh19RiKA', 'text': 'Incredibly overpriced. The udon tasted as if it had been boiled in toilet water. The beef and vegetable bowl should instead be called "rice bowl with an occasional piece of mystery meat." \n\nWe went here because Pho Kim had a line next door, and ended up paying three times as much as we would have at Pho Kim. Next time, we\'ll just wait for Pho Kim. \n\nOverall, bad service, bad food, ludicrous prices.', 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 1, 'date': '2015-08-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6P4gSDCGfcV1IlKMA_i6Tg', 'review_id': 'S_9FVEw8_bd6LeViai8ZvA', 'text': "Food was great. Prices aren't too bad, came out to 25 a person and we were full.  I'm used to AYCE Korean bbq for that price but it was honestly the same amount of food we would get a AYCE (but at the same time if I was there with my brother who eats a lot I'm not sure it would be enough ).  One thing that threw me off was that they came to cook the food for us, I've never been to a spot that does that.  I mean they did a good job but like  I said, it threw me off. One lady did get my friend in the eye, when she stirred some onion it popped off the grill and hit her but luckily no lasting damage.", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 4, 'date': '2015-08-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'mirovoTC46LkjAoheN9-LA', 'review_id': '6xQIGz_WKJo5WjFhjHXknQ', 'text': "My son, his girlfriend and their friend went there for a late night dinner. Ordered their food and this is where the service sucked. They order a meat combo, no one came around to check on them or to see if they needed anything else. The waitress sat behind the counter the whole time. While the place wasn't packed. At the end, they get the bill charge was $85ish and they complained how bad the service waa and the food was ok. They took 20% off but demanded they leave a 15% tip! Which to them a tip wasn't worth it! First and last time going to this place. For me, never going there. Will be going back Tofu hut instead amd worth it! Gave 1 star but wouldn't have given any. \n\nIf this place waa better, would have written a better review! Word of mouth would bring business back. Just lot customers!", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 1, 'date': '2015-08-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'uIkBdGRCSwZsOe4SMpfZUA', 'review_id': 'bR4fnjR02O900sK6TzSRMA', 'text': "The meat quality is like all-you-can-eat quality but they charge like high end quality Korean BBQ in Ktown LA. Seriously not worth it! For those who come from LA DON'T EVER GO TO THIS RESTAURANT.", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 1, 'date': '2015-08-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '6jCUGLnjQdhCKdmzrMJdGQ', 'review_id': '5uhsItxAMiRLvPfUOMPfQA', 'text': "This dish was good, it could have had better seasoning. Get the warm tea with your meal, it's complimentary and tasty!", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 3, 'date': '2015-08-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'OerVoYG_MiVyHJV5pvzfpQ', 'review_id': 'GPHj_rDf_4F2M1zKd9uNgg', 'text': "In my life I don't think I have ever been ripped off so bad. A friend wanted to stop here and eat. We ordered the King platter for $85 (+/-) thinking it would be sufficient for two. When it came out we were stunned by how small the portions were, barley enough for one person. But you won't believe what happened next...it was supposed to come with 2 short ribs. They only gave us the bones with NO MEAT. Yes, you heard that right....They tried to serve us bones. After about 10 minutes of arguing and everyone pretending they don't speak English we threw in the towel and left and were out close to $100 and we were still starving and still couldn't believe that they would try and serve us bones with no meat. \n\nAfter much conversation, we think it was intentional. We think they have two menus, one for tourists or non-Korean and one for local Koreans. We can't prove it but after being served bones we have no doubt that this place is in business to rip people off or maybe the owners are racist against people not of their nationality - I am Caucasian American and my friend is from the Philippines. \n\nStay away from this place at all costs unless you want to be ripped off!\n\nDon't say you weren't warned!", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 1, 'date': '2015-09-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dXoEIpHFrNocCHlMPaccYA', 'review_id': '-0MyO0b_7kMa6Ky661aing', 'text': "It's not all you can eat but trust me when I say the quality is amazing. Some people compare this place to Tofu Hut or some of the cheaper kbbq spots but it's not comparable. In a sense they're two very different type of kbbq. This one is definitely better quality of meat and more of a professional atmosphere rather than a hangout joint. I enjoyed this place very well, went today with my mother to treat her to dinner and she loved it as well. Yes, it's pricier but it's damn well worth it. Customer service was very on point, always checked up and helped with the grill. Check it out if you're looking for quality over quantity.", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 5, 'date': '2015-09-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 0}, 'user_id': 'sk0ZLpS2xGfKgUKVKJVoew', 'review_id': 'nMJQxFGAQfTsKPGw8JCXog', 'text': "So my bf and I got here around 3am this is when I realized they're open 24hr anyways we were hungry and to kill time we decided to stop by to get some Korean grub on the last time we were here was about 5 months ago it was around lunch hour so they had more people working I guess around that hour this time we went there was only one lady serving us and pretty much the service sucks like SUCKS SWEATY DONKEY Bolony!!!\n\nOk back to the real deal; it was just us two and a group of other people there but after they left it was just us, the place was not as clean as I could have remembered (and I was sober too!) the lady came by with our food the meat was frozen when she bought them out so knowing that's not really fresh at all but whatever I'm hungry, she drop one of the meat on the table and still served it to us!!! Gross!! Who knows how clean that table is I'm pretty sure they don't clean down the table with anti bacterial spray or anything but a wet towel because I notice that while she was cleaning the other table after the last group left whatever food is food just hope I don't get sick!!! Really when you're here if they put that meat on the grill and ask you not to touch it trust me you're going to have to touch it and flip it yourself by the time they come back to flip the meat for you you'll be eating burnt meat yep that's how it is every time here so yeah I gave this place another chance and it's just sad how their service hasn't improved not only that the food wasn't that flavorful.\n\nAnyways I really liked this place at the beginning I reaaaaally hope they improve on their service and their food can be better I just know it. \n\nThe thing that gets me to come back is the tofu soup and their dipping sauces something about it which keeps me thinking that there are some positive side to this place I don't know it's a confusing feeling haha. \n\n20% discount happy hour after 11pm \n\n\nWarning their bathroom is pretty trashed along with plumbing issues; the last time I was there their toilets doesn't even flush it was super clogged and the sink doesn't work ether just giving ya guys a heads up. \n\nSo yeah overall I wish for a better experience next time when I'm in town I won't give up just yet....", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 2, 'date': '2015-09-25', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 5, 'cool': 4}, 'user_id': '22glItKiH7hQRWszhmcohw', 'review_id': 'kbe0Rz2DfJLkH0C4gwALiw', 'text': "24 HOURS 7 DAYS A WEEK!! \n\nHONESTLY this place was probably the only Korean place that I was able to eat at when I FIRST moved out to Vegas.... the place is big & they also have a glass private area if you have a large party as well.\n\nThe service is quick & yet sometimes they can be overwhelmed but they are definitely under staffed sometimes. We know most of the workers.. so they always attend to us in the best way... but HONESTLY don't expect that sweet timely attentive & conversating expectations you would get at an American resteraunts... these ladies are there to get your order & get your food out as fast as possible..... \n\nWe came here very often when we didn't feel like cooking BBQ at home & didn't want to clean up the grease mess. \n\nThe quality of meat is good & I would have to say we get very full. \n\nTHE KING $83.95- combination of meats probably the largest portion....  sirloin beef, beef short ribs, marinated beef short ribs, beef brisket, soy bean soup, steamed egg, combination veggies, soju bottle. You also get rive if you ask & all the BANCHAN is good... like actually good side dishes. \n\nThey have happy hour everyday where you get 20% off your bill after 11pm! We always eat that late too especially when we get off work =]", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 4, 'date': '2015-10-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3ItX6Ta87x_ZND0z4YznyQ', 'review_id': 'QPfBV1u6aUMbKCbY2929Pw', 'text': 'Service below par even for Korean BBQ joint. The side dishes were basic and 2 or 3 pieces of each. Food quality was ok.', 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 2, 'date': '2015-10-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3iuxp6u9E5xC0R3D-dY00A', 'review_id': '8HIDpsK_HHZ4r2Rl4oGf2Q', 'text': 'Fantastic Korean BBQ. Great staff and the meat is amazing.  Great side dishes and the beef was amazing.', 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 5, 'date': '2015-10-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'MP8Y2qXr_Htv26tuXZA1qg', 'review_id': 'Z9JfbjrnsAOLaFBennE4bg', 'text': '3 stars for being 24hrs and yes it is a little pricey,  but it\'s convenient for being 24hrs.. service is not very good and the wait staff can be more friendly to loyal customers! They seem to get very irritated when ever you ask for extra sides or anything else for that matter.. the food is good and they do have a 20% discount happy hr from 12am to 4 or 5 am... my last visit was not so good, the server charged an automatic 15% gratuity for herself for my party of 4! Which is probably illegal! When I questioned her about the check she says,  "oh you know parties of 4, 5, or 6 we will charge gratuity. " lol! Lady you would have gotten a bigger tip if you hadn\'t auto grat me! So I will probably stay clear from this place unless my drunk friends insist on coming here. ..', 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 3, 'date': '2015-10-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yMaNsuGOVlige0n2Ge2wZg', 'review_id': '0iM2Rezza-TQ_XHXtqv4_A', 'text': "Nengmyun + Galbi Combo = Happiness ... whenever Vegas hits 90+ degrees (which seems to be whenever we visit!). The noodles are freshly made (vs. store bought and boiled) and have the perfect chewy consistency. Banchan is fine and service has never been an issue. I can't comment on the other dishes because we just come here for the mool nengmyun!", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 5, 'date': '2015-10-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 1}, 'user_id': 'auVkTXPmA8o3oU8barlBSw', 'review_id': 'U-q86RgphBjiYb0l5YWayA', 'text': "It's decent Korean bbq.\nI found the combos to be a little overpriced, and was disappointed that they didn't come with vegetables for grilling. The kimchi and sides that come out before your meal are decent, nothing to write home about. \nYour combo includes a bottle of soju, which is the kind of low quality that you would only get once. I'd rather they not include it in the price and give me the option to buy a higher quality bottle (which I would). DJK is a-ok, but I'd prefer one of the many other options in town.", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 3, 'date': '2015-10-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XGnaxlE3dGFysX3I3-jerg', 'review_id': '19SPu4tYDRAwgbkInfi6Bg', 'text': "I'd like to let everyone know who loves buckwheat noodles cold soup as I do that they no longer have buckwheat noodles. Although they have written that on the menu it is not it. The price went down though (almost $10 difference) but it is false advertising. The noodles that they try to sell for buckwheat are actually starch (potato perhaps).", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 2, 'date': '2015-10-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'EEGMedqFxzZ3XpBSknnUVg', 'review_id': '7nra4miIVskGCbdEqQff6g', 'text': "I have eaten here twice and I have to say both times have been a disappointment. The first time I ate here was for the bbq, the meat is low quality and the bean paste is not very good at all and the sides are not fresh. The second time I came here I ordered the dolsut bimbimbap which is usually one of my favorite dishes. It's not very good here and the egg was not fresh and sunny side up as it should be, instead it was cold and pre-cooked (wtf?). My boyfriend ordered the beef soondubu which was not spicy and had no beef in it what so ever (again wtf?). Both times I have come here the service has been extremely slow and they even ignore you more than the other tables if you are not Korean. The only upside to this restaurant is that if you're ever low on some chop sticks, it's free for the taking.", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 1, 'date': '2015-11-01', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 4, 'cool': 4}, 'user_id': 'WjUYtHEFLzGjv6HfHTFVfw', 'review_id': 'nSXvXCZFgRl561APXuAnAw', 'text': "YUM!  Yet another fabulous Korean BBQ restaurant.  Before heading to this restaurant a colleague had informed me that it could be a bit pricey.  However, upon arriving I was pleasantly surprised they had different packages which a table of three could enjoy for reasonable price!  We enjoyed a bottle of soju, plenty of meat, and delicious sides for no more than $20 plus tip each!  Also, they allowed us to substitute one meat for another which was fantastic.  The staff was friendly and the ambience was classy, clean, and modern!  I'll definitely be back to DJK to try another combination!", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 4, 'date': '2015-11-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kTESc3shnw30Qfuv3GFBBw', 'review_id': 'ajpDJbJxYOUsIQiuMNJHSQ', 'text': "Menu is overpriced and service was awful. I'm not Korean so I can't understand what they are saying and to get a disgusted look by a lady for that. She also took the book which had a little tip for them before we even left. My first and last time coming here.", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 1, 'date': '2015-11-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6exheBEOgIWu7KmtBFFUSQ', 'review_id': 'DRPXeP8_YWDrc8X_SSU1bQ', 'text': "Staff is friendly and it's great they are open 24 hours!  I love the package meals with different types of meat plus side dishes and soups.  If you're not feeling barbecue try their wide variety of appetizers and entrees including the japchae noodles and spicy tofu soups.  The food is consistent and I love getting the dumpling rice cake soup when I'm feeling under the weather or it's super cold outside, definitely hits the spot.  My one complaint is their pricing structure as an a la carte BBQ item is almost equivalent to one of their combination meals which doesn't make sense to me.  The amount of food in the combinations is massive whereas an a la carte order of marinated short ribs was just two slabs of meat.  Convenient location, consistent food and late hours makes it one of the great spots in Vegas!", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 4, 'date': '2015-12-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uuc74jVhFrtxrYuB8FUGTw', 'review_id': '2LZcQQL3zlagz0LLQfFszA', 'text': "I've gone here over 20, maybe 30 times (maybe more?) over the past couple of years. This is my favorite place. I've tried other places like tofu hut, honey pig, kang ho dong's korean bbq place in cali, Gen korean bbq, and one other place that closed down.. but Dae Jang Keum is my favorite!! Other places just can't compare!! My husband and I usually get the Love Special! And we usually change the beef flank to beef brisket, which is always so nice of them to do. My husband and I like that it comes with so many side dishes! My favorite is the steamed eggs it comes with and the soybean soup! It is delicious! The staff is really friendly!! Let's talk about the grill.. the grill had a nice nonstick surface!! I love how nice it cooks the food, but also that the grill doesn't burn and have to be changed out. We never have to have our grill changed out. Some people might think that's a little bit expensive to eat here... and yes other places might be a little bit cheaper, but for me, in my opinion, I am paying for the quality of food!! I love going to this place and will continue to go to this place!! My hubby agrees that this place is the best korean bbq place we've been to!", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 5, 'date': '2015-12-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tddF2A6iet4m-o5qy4VKbg', 'review_id': 'U1uucj-r_08IL5IIWuLExQ', 'text': "The food wasn't good but the service was awful I don't complain often but the lady was immediately rude to us when we walked in she judged us right off the bat and kept glaring at us across the room. (I swear we aren't rude people just normal adults trying to enjoy a meal) she made us order more food than we wanted or she said she wouldnt service us it took forever to get us service and my friend got food poisoning! This place is the worst Korean BBQ place I've ever been to. I can't honestly say I've never been treated so poorly at a restaurant. DO NOT EAT HERE!", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 1, 'date': '2015-12-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'OenOT-9gu5hb2JqcJSBQTQ', 'review_id': 'hAqVy5iPWQUMa70q1DQtVw', 'text': "Quite honestly it was the best bi bim bap I ever had and I'm a pretty well sort out in bi bim bap. Rice meat veg egg sauce simple right. The selection on the veg and quality of the meat varies from place to place. The bi bim bop here is well balanced and has a lettuce added to the top at first I thought it was weird but after stirring  it up in the stone pot which is a must for a quality bap it works. As I write this review I kind of want to go back for another and at 16 bucks for a bi bim bop it's quite expensive as the dish goes but I suppose you get what you pay for.", 'business_id': 'Hb6n-TyLhEDdCyPyH3E3oQ', 'stars': 4, 'date': '2015-12-23', 'type': 'review'}
