{'votes': {'funny': 0, 'useful': 1, 'cool': 3}, 'user_id': 'l53FUDHRHLg7BQ89KgAtxQ', 'review_id': 'wk0zg0k-x9LoJUpGlkJTLA', 'text': 'I used to work in the area and some folks from work invited me along.  How sad is it that without that intervention I might have never known about the Chicago Hamburger Co?  So sad... So sad...\n\nIt\'s not a big place (ok, it\'s a dive, but a great dive) and their parking gets really full at lunch time.  Try to go during more "off" hours your first time.  Once you know how good it is, you\'ll be willing to park as far away as needed.  You walk up to the counter/window while perusing the menu on the walls.  I\'ve never not had a super friendly person taking my order.  Sometimes it\'s even the owner. \n\nThey\'ve got more of a food selection that you might think.  Hot dogs, burgers, sausages, turkey, chicken, roast beef, fish, veggie burgers, cheese steaks, wings, salads, fries, onion rings, shakes.  My friend knew he\'d love the place as soon as he saw "Frito Pie" as an option.  You can check out their full menu at http://www.chicagohamburger.com. And yes, those are current prices. Less than $4 and you\'ve got a nice meal.  For $5 a feast.\n\nAmazing hot dogs.  Standard burgers can take a few minutes because they are being freshly made - but SO worth the wait.  I haven\'t seen anyone not love what they got.\n\nI can not come here without getting sliders.  Won\'t happen.  Ever.  And why you may ask?  Because they are better than White Castle.  I know what you\'re thinking (Oh NO she Didn\'t!!!) but yes, yes it\'s true.  Their buns are amazing.  They manage to be light and fluffy, yet thick and dense.  I can\'t explain it - but I don\'t have to.  For less than a buck you can have your own w/ Cheese.  Good luck eating just one.  I\'ll get one - if I\'m also getting a hot dog.  But most folks get at least 2 or 3.  I witnessed someone eat 6.  Well, 5 1/2 - but he did better than I had expected.\n\nWe normally get one fry and one onion ring because they are both SO yummy it\'s hard to pick.  Fries are cut thin and Rings are cut medium-thick.   Oh yea...\n\nFor anyone that has ever loved a shake - you must have one here.  I tried a friend\'s strawberry shake as we were headed out the door, and immediately turned around, got back in line and ordered my own.  Since then - we have come by to get sliders and shakes many times.  And we live 20 minutes away.  They are that good.\n\nOh yea - tons of Chicago stuff on the walls, tv always on showing "the game" and there is a pinball machine and a Ms. Packman.  Waca waca waca....', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2006-12-28', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 0}, 'user_id': '4_YfcfHkCem1onJFkItxjA', 'review_id': 'yqrUwPTinmrgHhB3XAM-gw', 'text': "Yummy slider alert!  \n\nMuch better than the average White Castle barf disk, and even better than the sliders at Cheesecake Factory.  I ordered three cheese sliders for a little over $3 (I know, I know, I was HON-gry!) and although they're small it was quite filling.  Nice use of soft rolls, dijon mustard, ketchup, minced onions and flavorful beef and cheese.\n\nThe inside is tacky -- with sports posters everywhere, arcade games, real Chicago street signs (think Kedzie, Cermak, Paulina, and Southport), and old newspaper clippings and tons of Best of Phoenix awards scattered throughout.  Vinyl booths line the front of the building with plastic patio tables as well. \n\nI heard good things about their hot wings and hot dogs, so will def be back to try.\n\nSuper cheap, super Chicago divey-chic, and super good.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2007-04-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': '4zinPJ38-WxjPPomn7CPAQ', 'review_id': 'fgnMyaU-RK93GlR7emdFbA', 'text': 'Oh man, if you don\'t especially like your heart  (or at least can justify it by working out after), this is an awesome place.  I\'ve been extremely skeptical of "Chicago" places here in the valley, because most are bad impressions, at best.  This place doesn\'t *quite* get it, but it\'s the closest I\'ve found in Phoenix.  \n\nOf course, they\'ve got the Chicago street signs and sports posters.  Hey!  Southport!  I lived right by there!  In case you missed the name of the place, they like reminding you by filling your vision with schtick.\n\nThe sliders, which aren\'t really known as a Chicago thing, are really good, and quite cheap.  These are really tasty little burgers that make an inexpensive meal.  \n\nThe italian beef, which *IS* a Chicago staple, just isn\'t quite right.  I think I figured out what it is.  The beef isn\'t sliced thinly enough and they don\'t use enough spices, which makes for a store-bought kinda feel to it.  \n\nProps for the tasty milkshake, though.  \n\nI really, really want to find a place in Phoenix to get a beef sandwich.   My search did not end here.  \n\nI am Sean\'s unfulfilled yearning.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2007-11-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'Ofxlhi_HKp7myFDpwg9aIA', 'review_id': 'C-OKALZVb_3OTDCLoQ9uQQ', 'text': 'If your looking for the best sliders and homemade shakes in Phoenix this is the place to go, if you are from the east coast and you love those little White Castle burgers then this is where you want to go to find the next best thing, along with there chili cheese fries. This place can not be beat. And if your a Chicago fan you will love it the whole place is decorated with Chi-town memorabilia.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2008-02-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'tnaz6zW7sHsUhUtYYaZslg', 'review_id': 'eu86GwaBZ_0KNZx_NZ3CaQ', 'text': "At around 3:45pm on a Saturday, my bf and I wanted to have a snack before dinner and he suggested this place. Never been before this but I love sliders. I love anything mini, really. haha. The Chicago paraphernilia is a bit much, but if you love Chicago, then yay. There were I think 2 or 3 people in line before us and right before it was our turn, I noticed a sign. 10 sliders for some ridiculously cheap amount after 4pm. I can't remember the exact price. I think it was like 10-20cents off their regular pricing. So thanks to the people in line, we were able to place our order at 4:01pm. Perfect. I'm poor so I like deals.\n\nSliders was all we got. They were DELICIOUS! I thought I'd only be wanting 2 since they're a pretty big size, but I ate three!  The bread was soft  and the ratio of meat to bun was perfect! I'm all about good ratios, not too much meat, not too much bread. The beef tasted good with the mustard and onions and pickles and ketchup? I think that's what they put in there. Whatever it is, get it. It makes it yummy!\n\nIf you're in the mood for some good sliders, check this place out. I would probably never have actually WANTED to go here since it is a lil dive with nothing around it, but Im glad I did. I'll definitely come back next time I'm in Phoenix.\n\nPROS: Good Sliders. Great price after 4pm. Fun atmosphere.\nCONS: Can't really think of anything.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2008-03-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'bjyNs56h8t57FYZ7y1_1Rg', 'review_id': 'A9b0BlPV154aOW3dmMDA_Q', 'text': 'Ah, the little things I miss about living in Arizona.  For instance, the Chicago Hamburger Co.\n\nWhat a gem.  You\'d drive right past this place without blinking an eye, just another dive place branding itself  "Chicago" or "New York".  NOT!\n\nThis is the best slider I\'ve ever had.  Holy crap they are good.  Reminders of White Castle and Krystal burgers, except these are better.  In other words, it doesn\'t have to be 4am while trashed to make them taste great.\n\nThe fries???  PERFECTION.  That right combo of crispy on the outside, yet nice and soft on the inside, not overcooked, not undercooked.  The perfect fry.  It\'s beautiful.  It\'s art.\n\nWhere is Dorothy\'s slippers???  There\'s no place like home...there\'s no place like home...', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2008-03-31', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 1}, 'user_id': '-F32Vl8Rk4dwsmk0f2wRIw', 'review_id': 'H0Y_8dV6QvQeod7rxjHvBQ', 'text': "All the credit goes to Graham C. for schooling my arse in this particular foodie rodeo.  You see, there is a group of 4-5 of us who have pretty much scoured the Valley for hidden gems and blatant dumps so that we can report back at their respective grandness or offensiveness.  \n\nOne day, Graham asks if I'd ever been to Chicago Hamburger Co and I had to embarrassingly admit that I hadn't.  That fucker.  So, leads the way to the counter and orders an unholy amount of sliders, which we each put down without any sorts of problems because mother of God, they were delicious.\n\nI'm pretty sure that we would have gone back up to the order counter to request more, but the place was very busy at lunchtime on a Saturday and we also had to rush to pick up others on the way to the FBR.  \n\nApologies for more of an anecdote rather than a review, but you can pull three things out of this review:\n\n1) Their sliders are perfect, particularly the Double Burger\n2)  Its crazy busy on Saturdays at lunch\n3)  Graham C is a cocky wanker", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2008-04-09', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 3}, 'user_id': 'lPaYMDmJbAnv_3pmZH_inw', 'review_id': 'xR8wY-RDnnT8Su1HTTt9ew', 'text': "Sitting here thinking of my shitty Wendy's experience of late and wondered why I didn't go here. Also, why haven't I Yelped this place?!\n\nThe lil' bad boys are awesome! Juicy, salty and hot.. all the elements for a great burger.. plus they're so little you wont feel badly, even if you eat 6 like I did! The only thing I felt after that was satisfied!\n\nI cant give 5 stars because of their messed up hours.. WTF is 8pm as a closing time?!", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2008-04-22', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 6, 'cool': 5}, 'user_id': '90a6z--_CUrl84aCzZyPsg', 'review_id': 'vuL10RJbUeMjpjMeOqHP1w', 'text': 'The best slider in Phoenix! Screw White Castle! (we can keep living without them).\n\nI tried the standard Windy City Slider with cheese and onions - Perfection! The buns are heaven sent - nice and chewy! \n\nThe sliders are large and only $1 each (two will fill you up).\n\nYou HAVE to try this!', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2008-06-13', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'wHg1YkCzdZq9WBJOTRgxHQ', 'review_id': '6HlNOiF8kTo2PeHRqjkHOg', 'text': "Put your eatin' britches on.  You know it's going to be good when the parking lot is full at what appears on the outside to be a food-related illness waiting to happen.  \n\nI tried the Windy City Slider with cheese.  Comes with chopped onion, pickles, and what I thought was standard ketchup.  Upon further taste investigation, I think it's actually a blend of ketchup and Dijon mustard.  Whatever it was, can't wait to see it again.  The buns are perfect.  I ordered two and was more than satisfied.  Also tried the fries.  A little thick for my taste, but hot, crispy, and perfectly salted.  And last, but certainly not least, a vanilla milkshake.  Oh so good, especially considering it's a hundred fifty freakin' degrees out today.\n\nMy only wee little complaint.  The place was a little less than clean, but it was still very busy at what appeared to be the tail end of the lunch rush.  Don't look at the walls or under the tables and you'll be fine.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2008-06-19', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'szbTVEtATfn8f9GxbGGO5w', 'review_id': '8Vh5J7H5ttuW2O6GgD-9Dw', 'text': "Sliders.  I need say no more.  But I will :)\nThat is the only thing I've ever had at this restaurant.  Now, if you're a transplant from the Midwest and a fan of White Castle they are not exactly like that.  They are bigger but a good percentage of the slider goodness you're used to.  I still go to the Castle when I go back home for Christmas, really you either love 'em or you hate 'em.  I'm enamored!!", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2008-06-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'z1c8uQv7tfgrP4-sVggbTA', 'review_id': 'OtU2089YIxTTaicmA-4PfA', 'text': "Delicious sliders for a great price. Also, it's just a few blocks from work. Also, eating there makes me feel manly. Enough said.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2008-08-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': '9y7Ni5EInmU20ySEs8ymyw', 'review_id': 'GPkma624vn2ySdNjzHLcGg', 'text': "although i've eaten my way through half of phoenix, this is my first review. hi all!\n\nwent here for lunch on tuesday and since it was my first time, i stuck to the basics and had the windy city slider with cheese, a milk shake and fries. my milkshake was amazing - not too thick or overly sweet and actually tasted like milk was an ingredient. imagine that! the slider was decently sized and delicious. my favorite part was the bun. oh, the bun! now my dream is to sleep on a bed made of those buns.\n\nChicago Hamburger Co. is the kind of place where you're constantly sneaking glances at and coveting what other people ordered. the owner is awesome. he personally brought our food to the table and made sure to stop and chit chat, even during the crazy lunch rush. \n\nwill i be back? my arteries say no, but my taste buds say YES. and who am i going to listen to? the taste buds every time. i love these kind of establishments and urge everyone to support the business and ignore their arteries as well!", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2008-09-04', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 5, 'cool': 5}, 'user_id': 'zHH2Iz49wCZYYDLBTv0YOg', 'review_id': 'F1ZiB678LMuUMxO-HmrLhw', 'text': "Always on the lookout for a good veggie burger, I heard this place had one so I checked it out. And it's... okay. Good, but not great. The patty itself looks and tastes like a Morning Star Garden Veggie Patty, which I happen to like. Got a box in my freezer right now actually. But that's the thing - my favorite restaurant veggie burgers are the ones I don't eat at home on a regular basis. Bun was standard grocery store bun, toppings were fresh, but conservative in portion. Could have made it myself at home for half the price in other words. But still tasty. Might stop back by if I happen to be feeling lazy, which is a definitely possibility. Oh, also ordered onion rings, which were average in every way.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 3, 'date': '2008-09-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'K0YMZcrmKRPEQtvkxIebzA', 'review_id': 'rLlKZBc7It3dqwGbuODb4A', 'text': "I finally got a chance to try this place and now I keep craving their sliders (with cheese please) and those soft squishy buns. I can't say I loved the fries though. They were average, but the sliders made up for them. \n\nThe Chicago Hamburger Company will make you forget that you're in the land of strip malls and chain restaurants. It's feels like a real neighborhood joint. Next up, I must try the Frito pie.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2008-11-01', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'pDSMS-IW5wyZK0XBi4jnDw', 'review_id': 'd_5WToEYTN7z-7teM75_4g', 'text': "Great place to grab a slider.  Have a banana milkshake.  They're delicious.  The Italian beef is a great sandwich too.  Hot giardiniera is the best on top.  Service is always great here, but I recommend ordering ahead and carrying out at lunch time.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2008-12-10', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'XgIhw-aWaq_Fx3ZVQGjnuA', 'review_id': 'JmvBUREHDEorEVzmaqdF5Q', 'text': 'I had to laugh when I read people review the fries....do not get the fries!  GET THE ONION RINGS!  They rock.  Also, three or four cheese sliders is all it takes to fall in love with this place.  One of the few White Castle clones to be worth a drive for.  Why?  Because it is BETTER than a White Castle! \n\nThanks Chicago Hamburger Company!', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2008-12-15', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'RNSGaQSkC56tGPfKt9lHjQ', 'review_id': '3fmt2ko-k8mTFdogRpov7g', 'text': 'Awesome place. How is it I love a place with hamburger in the name for their hotdogs? Oh I cant lie, I order a hotdog and three cheese sliders every time I go, alright and fries, I cant help it this place is too good.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2008-12-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'H0nYlvGjMA9szTaqIwTwpg', 'review_id': 'zfh_PpmOyfxOJBWPlheLIA', 'text': "Great burger place. Very similar to Ted's in Tempe. Closed on Sundays.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2008-12-30', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 1}, 'user_id': 'fFoRIzbwpMiv3BvfdtdlXQ', 'review_id': '7ceH1q2lBT0EBHGbIcR-jg', 'text': 'the grilled chicken sandwich hold the mayo add ketchup and mustard and the fries - off the chain!  minus one star because it should stay open later.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2008-12-30', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': '-VAF4FC-WKd39_t_RV8XdA', 'review_id': 'CLDojCAIqP8STa89UW4kxQ', 'text': 'Drove past this place a bazillion times, and never stopped in. When I finally decided to go in, I wasn\'t alone. This place had a packed parking lot and a line reaching the door. \nIt qualifies as a "hole-in-the-wall" place.  Tons of Chicago memorabilia scattered all over the walls. \nI had the cheese sliders and fries. The sliders were good. Decent size, came with cheese, onions, and ketchup. \nNothing special, but it\'s a good, family owned place, that obviously has fans.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2009-01-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ujBFcX607swXhq4oNk0R7A', 'review_id': 'Ns5NN7Mrssb_oIauOl6hHQ', 'text': "This place is AWESOME. It's easy to miss and easy to ignore but once you venture in you'll be hooked for life. Parking is scarce during busy times and seating is limited inside, but it's well worth the wait. I regret I never had a chance to make one last visit before I moved out of Arizona.\n\nLove the fries, love the mystery cheese goo they put on their hot dogs, and of course, love the sliders. Better than White Castle and definitely better than that rip off place we have here in Orlando called Krystal.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2009-01-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'QQUlKfw-MZGuOrf-B62wbg', 'review_id': 'jXTZCdhR5Z-2iMsHIkNz1A', 'text': 'Freakin\' Awesome!\n\nI was treated to dinner here as a reward for trying to deal with a friend\'s Qwest DSL... \n\nI know, I know... You\'d think that dealing with Qwest would deserve a greater payback, but I\'d been wanting to try this place since the Weekly Yelp that mentioned their peanut butter milkshakes. It turned out that I couldn\'t have asked for more.\n\n1st - I love the CHC for being honest. It\'s a straight-up, no frills, burger and hot dog stand. It totally reminded me of the roadside burger joints that my family stopped at as a kid, and 30 years later, their prices aren\'t even that far off. A 1/3 lb. charbroiled burger for under 4 bucks? that\'s a solid value!\n\n#2 - The sliders. Everybody seems to like the doubles, but I think that the single cheese burger slider is just the right slider-ific proportion of bread, meat, and cheese. They have some options to tart them up a bit, but I just went with the onions and a bit of ketchup. I wouldn\'t say that they are a one-for-one with the White Castle sliders, but pretty close, and quite possibly better. Order two for just over $2...\n\nC. - Chicago and hot dogs, a culinary dynasty. You can argue about which city has the best pizza, but those kids up near Lake Michigan have got the hot dog market covered. CHC has the all beef Vienna dogs, the poppy seed buns, and all the right fixins (scary green relish, sport peppers, tomatoes, and celery salt...) to throw down with a nearly perfect "Chicago Dog". Comes with Fries for $4... Eat one and smile while you think about enjoying the taste of Chicago without the January weather.\n\nLastly, I did make it around to one of those peanut butter milkshakes. It was great. Thick enough to stand a spoon in, and plenty of real peanut butter. It\'s not so sweet that one can\'t enjoy it as an accompaniment to to the sliders and dog, instead of dessert.\n\nIt\'s not too often that a place lives up to its own hype, but the Chicago Hamburger Co. was everything that I was craving and more.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2009-02-03', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'xFdK5lgUdeT3bWC7_MvcyQ', 'review_id': 'lXe_MdKpVU21QGXutODJ-Q', 'text': "So the bf and I are moving in together.  And the economy sucks.  Both of these facts mean our eating out budget is, well, measly.  However, that doesn't mean that we don't eat out.  Instead we've been sharing meals and seeking out places that have good prices and don't suck.  \n\nI've lived in the neighborhood around CHC for over 10 years off and on and have never been in, until last night.  We needed a quick, yummy, cheap meal before a movie (that budget is dwindling as well) and T is from Illinois so he has a fondness for sliders.  Me, as a native Phoenician, not so much into the slider.  When I was traveling in the Midwest once, some friends took me to White Castle.  I don't know if there is anything more repulsive to me than steamed meat.  Just the phrase alone is like some sort of weird phrase that should have its own category like oxymoron, but instead of meaning opposites it means disgusting.  I digress...\n\nSo CHC is an order at the counter, plastic chairs, thin paper napkin kinda place.  And that totally works.  The abundance of Chicago sports memorabilia on the walls completely distracts you from the less than fine dining atmosphere.  There were a number of other customers in who seemed like regulars and the parking lot was packed.  We ordered six cheese sliders with just ketchup, a basket of fries and two medium root beers.  The sliders are like a buck each and come with the works including onions, pickles, ketchup, brown mustard and something else I'm probably forgetting.  I thought they were pretty good with just the ketchup, but the bf ordered another with the works and said that was the way to go.  Now, I don't know if they steam their burgers or they grill them but these were hot, flavorful and chewy.  The buns were fluffy and delicious.  The fries were crispy and salty as fries should be and I ate nearly the entire basket.  The medium soda is more like a large and I would order the small next time.  \n\nThere is one tv with sports and I would guess this would be a great place to watch a Chicago game.  Most importantly, we got out of there for about 20 bucks which is great for the wallet.  For a quick cheap meal that makes you feel less guilty than going to McDonald's, CHC is a solid choice.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 3, 'date': '2009-02-03', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '3am2PwtajoR3LIlP7XZtbA', 'review_id': 'FM236OYp14_mvUSQkvQiqA', 'text': "If you like sliders, then this is the place for you! It's certainly not a flashy place. The interior could certainly do with some improvements, but that's not why people come here. People come here for the food. If you're a health conscious type, this place won't be your cup of tea, but if you want delicious sliders at a bargain price, go to the Chicago Hamburger Company. You won't be disappointed.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2009-02-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': 'LzTtvcjciEAeb5C1Wjc-Hw', 'review_id': 'QKmOJhVfj7romkxwWbmk2A', 'text': 'Fantastic  Sliders!!  Give this girl some sliders and chili fries and all is right with the world. This is quick food done right!', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2009-03-01', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 6, 'cool': 4}, 'user_id': 'du6KeE54IFbPiXpU3LOd1g', 'review_id': 'HF9u54VUFHNOyPYZuG796w', 'text': "Do you like sliders?\nYup, I do too! I admit it, as much as l enjoy fine dining, I really do have pedestrian tastes.\nYou can only eat eat so much pate and stuffed breast of duck before you need something real.\nI know sliders are everywhere these days. I live near Stax and I like it fine. \nI see sliders on the menu so many of the other places I go, but these...these are really sliders and they are really great and really just what god and nature intended when ground beef was created! \nSmall, delightful chunks of bovine goodness!\nPlus, Chicago Hamburger has some of the best chili fries around to go with the sliders, and that really makes the drive, and the poor parking at lunch and the difficulty finding a place to sit at lunch and all the rest (I actually feel like I'm in Chicago) worth the effort!\nThe regular burgers and the hot dogs are pretty good , too (bright green relish and celery salt for the dogs, so good for them), but really...sliders are the reason to go to Chicago Hamburger.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2009-03-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'KI4sBf9jWLs4aGm_mIsFQA', 'review_id': 'OWv9gfZcg0BcKPdymjJHhg', 'text': 'Let\'s get right to it.  The smell of GRILLED ONIONS hits you before you even touch the front door.  That is the definition of a Chicago dog/burger joint.  That IS Maxwell Street.  That IS Chicago.\n\nThe Food - I ordered the fire dog, a cheese slider, and fried zucchini.\nThe firedog didn\'t let me down in the authenticity department.  Good meat, the correct and required condiments (neon relish, celery salt, sport peppers, tomato, mustard, onion. and seedy seed bun), cooked just right, and it smelled up the office when I opened it.  \nThe slider was the ex-factor.  I saw \'slider\' and immediately thought White Castles.  But I didn\'t want to compare it to that, so I slapped my head to get the thought outta there.  Its a little burger with mustard, onions, and cheese.  What makes it special is the way the meat\'s taste melds with the onions, mustard and especially the bun.  Mine had a little too much mustard...and the bun wasn\'t a player on the field at all.  In fact, the sub-par bunnage took away from the slider.  BUT, I said I wouldn\'t compare it to Whitey One Bite\'s (White Castle\'s), so for what it is...ITS GOOOOOOD!  You will find yourself wishing you bought 2 or 82 more of them.\nThe zucchini was just filler for the car ride back to the job.  They were greasy and crunchy enough to get me excited at first...but their charm wore off after about 5 of them.  They are little chips of zucchini fried nice and crispy.  The taste of the batter just didn\'t do it for me, and the flavor of the  zucchini wasn\'t quite on point.  Doh, I REALLY hate saying anything negative about this place, because of....\n\nThe Atmosphere:\nYou know what kind of place you\'re in when you open the door.  A joint.  Pure joint.\nChicago newspaper clips, posters, political campaigns, pennants, whatever you can take from Chicago and stick on a wall.  This is the first time I\'ve walked into a Chicago joint and was actually MOVED.  The place made me a little misty.  \nI miss Chicago.  \nThis joint made me remember some of my happier times as a kid, when life didn\'t suck.\nIts the kind of place you go and sit down with your team or with your buddies or with your kids or with your ma or with your worse enemy.  The SMELL OF GRILLED ONIONS makes everything just fine with the world.  Its the kind of place you go after you\'ve just had some kind of fun, or even some kind of heartache.  Its just the kind of place you can go whenever, for whatever reason.  You feel like you belong here; like the world\'s bitter and evil hands can\'t reach you here.  You feel...safe.  Sorry to go off on that tangent, but its just something about the actual establishment itself...\nWho cares about what the floors look like, or what\'s in the corners?  Its a joint.  Its got joint floors and joint corners and joint tables and chairs.  Ain\'t nothing crawling.  Nuff\' said.\n\nThe Service:\nAfter my nostalgic head-trip back to Chi-Town, I had to let the guy at the counter know they had done right by me.  Not much conversation due to the uncanny line that seemingly popped up out of nowhere behind me.  He told me that when I call in an order, "Aw, you ain\'t gotta wait in line, just come on up."  That was almost the equivalent of him saying "I love ya\', man!"  Without the awkwardness.  Oh, when I said I was picking up for \'Mike\'...they all went "Mike\'s here!  Got Mike here!  Get Mike\'s order!!!  Let\'s go!"  Maybe its a routine, but it makes a guy feel like a million friggin bucks in a recession.  Let\'s just say I walked out of there feeling 10 times better than I did before I walked in.  And lastly, an elderly lady came in, and they all knew her name.  The guy immediately asked if she wanted something to drink.  I don\'t know...that just sat right with me.\n\nThe Value:\nOn.  The.  Money.  I kid you not, you got 5 bucks, you can eat...and good.  Get a couple sliders and fries for under 5 bucks.  Or one of the dogs and fries.  You\'re looking at a little more for an Italian Beef (which I intend to trek back there for), or something like that.  Money is an issue for most people, but you won\'t hurt yourself having lunch here twice a week.\n\nThe Bottom Line:\nDespite the lack-luster experience with my zucchini and bun, I must say this:  Go here.  Go here often.  Smile when you get to the counter.  Tell them they have a nice place, even though they already know it.  Eat sliders.  Eat dogs.  Eat Frito Pie (and tell me how it was....while you stand a few feet away from me with that corn chip breath).  Sit down here.  Bring friends.  Bring people you don\'t know that much.  Bring people you don\'t like that much.  Just see how things turn out.  Your stomach and mouth will be happy.  Your heart will be happier, but perhaps out of a few years.  Write about it.  Talk about it.  Grab a few menus and stick \'em on the board at work.  \nThis place is all right.\nThis place is all right.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2009-03-19', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 8, 'cool': 8}, 'user_id': 'ZmIgP4U4Ht9CYmNX0_zP6w', 'review_id': 'TurbbVb0zN9zWOoh9Eqxdw', 'text': 'I am a carnivore.  There, I said it!  I love burgers!!  So of course when I drove by Chicago Hamburger Co. on my first week here in Phoenix I said "note to self......MUST try this place!".  Today marks my second week here in Phoenix and after a long week at my new job, I was hungry.  I picked up my daughter and we headed over.  \n\nFirst off if you are from Chicago or love Chicago, this is your place!  It is filled with memorabilia from the Windy City.  There are all sorts of street signs and things pertaining to Chicago plastered on the walls.  It\'s pretty cool.  They have two TV\'s and of course they had the Cubs playing on one of them!  Go Cubs!!  I like the sports like ambience.  It\'s nothing fancy at all, just basic tables and chairs and a few booths.  \n\nNow for the food.......Mmmmm good burger!  I had a wester burger.  For you fans of Carl\'s Jr. Western Bacon Cheeseburger....oh man, this one is far better!!  Real bacon right off the grill and cooked just right, nice and crisp, bbq sauce, cheese, and onion rings to top it off.  The burger was juicy and cooked just right!!  It was one of the best burgers I\'ve had in awhile.  My daughter had a hot dog and scarfed it down and gave it a thumbs up so I knew it was good.  The onion rings were nice and crisp and I liked the batter they used.  Not super greasy either.  Nice!  The fries where crisp on the outside and fluffy on the inside...perfect!  They have Pepsi and the other usual sodas.  They also make milkshakes.  I\'ll have to try one next time.  Oh, and chili cheese fries......omg....I love those!  \n\nAll in all this is gonna be one of my go to places here in Phoenix.  YUM!!!', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2009-04-03', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'LQ7qcT0TWlNFnLzdohhgPg', 'review_id': '7kpVbtJw5ZI5cJnaQbUnWw', 'text': "I just went tonight for the first time and I thought it was pretty good. I got the double cheese sliders and fries. The only reason I knew of this place is because I drove by there a few times. Tonight I wanted a good burger and decided to give it a try. \n\nIt's not quite like the White Castle variety, these patties seemed thicker, but still - pretty yummy. :)", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2009-04-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'V1k7XMUX4qHVUi-3IUYzhA', 'review_id': '566N-M_wFiUY8kI1AWvsGQ', 'text': 'This is your quintessential Chicago dog place.  They do a great job on all their dogs/sausages.  We also tried their sliders and Italian beef which were both good also but the Chicago dogs were definitely that thing to get here.  I would recommend this place to anybody craving a Chicago dog and sliders.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2009-04-12', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 5, 'cool': 4}, 'user_id': 'w8FNZuQSxeA48FUtp7mndQ', 'review_id': '8HQLgikqAjFPAXHu2qgXMg', 'text': 'Every Saturday my father would take me here when I was a kid and I would always order the same meal, cheeseburger, side of cheese fries, and a medium coke. As an adult this order has never changed. I highly recomend this place to anyone who wants to indulge in a good burger. My one regret so far is I still have yet to try a slider from here. Also the cheese fries are amazing! Enjoy.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2009-05-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'ZT-X6uq5-hiA4JFC64kIUQ', 'review_id': 'rKEiL-T1eVYwyaaMiduZGA', 'text': 'I love this place.  Great sliders and thats the only thing I get.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2009-06-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': '5M96qhf3kE9D6hUl97xTGw', 'review_id': 'ehVlU2Oq1S3ipqBseruLRw', 'text': 'Cheddar burger and fire dogs - awesome.  Burger are dripping with sharp cheese sauce and toppings, perfect slight pink inside.  Dogs are loaded with goodies with the right amount of kick.  Onion rings are crispy, hot and fresh.  Plus they have Star Wars pinball, how sweet is that!', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2009-06-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 3}, 'user_id': 'SscF2gvZFSPE9D-ijmq2VQ', 'review_id': 'ww7p0IRYJzTIsw_B4S6g_A', 'text': "Happened upon this little dive and had a dinner of sliders, brats, fries and a chocolate milkshake I won't soon forget. Authentic and filling, it doesn't get much better than that. Such good, old-fashioned American food. You won't be disappointed if you eat here. The decor is fabulously retro, paying homage to Chicago sports teams of years past. The service is straightforward but attentive.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2009-06-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'fzkO1lGkx8MHhT8S4Rbg3w', 'review_id': 'mvEigl3YmuaL0S7z0TjixQ', 'text': 'You got to like the Chicago way to enjoy this place. I\'m talking about having your dog and "dragging it through the garden". The sliders are what you come here for, but I\'m partial to the Brat, served on Saturdays. Pretty solid dog and burger spot right in my hood. It made me think that PHX does actually get a good mix of culture from across the country/world. My top spot in the valley for Hot dogs would still be Ted\'s, but this is my pick for Sliders.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 3, 'date': '2009-08-22', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 3, 'cool': 3}, 'user_id': 'QKW7sYPWPSsIcWqSiDzChQ', 'review_id': 'hVPYwkS5A-hDwcKwDp9fkQ', 'text': 'ya, i love,  the windy city\nbig broad shoulders, blues bars. gritty\nimage, of, Sean Connery\nirish, beat cop, ornery\nuntouchable\'s,  Jimmy Malone\ninstructing, Ness, to get Capone\n"he pulls a knife, you pull a gun"\nchi-town, bad guys, liquor runs\nprohibition, back in the day\nthis, is the, Chicago way\nto make a slider, slap it down\nflat top griddle, sizzles, sounds\nlike sweet home, gotta go\ncheck out, the Chi, Burger Co \npinball, pac-man,  stand in line\ndog or sliders, can\'t decide\npeople order, big mistake\njust passed up, the chocolate shake\nand cheese fries, cubs are on\nharry caray\'s, favorite song\ntake me out, to C. B. Co\nivy, envy,  kids, borrow\nquarters, for the plush toy crane\nnot much here, has ever changed\nsince  eighty-one,  Pappanduros\nowner, won\'t ya, please assure us\nyou wont mess, with history\ntil the cubs win, the series\nya, i know, never say, never\nbut trust me, that will, take forever', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2009-08-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 2}, 'user_id': 'wAm7i46tiGxSlxwTp4shjw', 'review_id': 'FzgPFYT1_JiizVanDhqLsw', 'text': 'I have not been here in years and am wondering why.  I thought I was back home in Chicago when I walked in. This place is the real deal!  Chicago memorabilia on the walls the help in red white and blue ( ala cubs) t-shirts... and oh yeah!  Great Vienna hotdogs with the nuclear green relish.  I also had a two cheeseburger sliders.  Very tasty as well.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2009-08-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'YHsXC1pBglfXQNhVN_weFw', 'review_id': 'CPwKzclTijw1kBWlqXgcbA', 'text': 'This place sucks!! I am from Chicago just recently sentenced to the valley, but I will tell you what, the food at this place is as authentic as a three dollar bill!! I mean they were rude, unfriendly, and their food reflected there attitude..it sucked! Owners let me tell you something just because you order a sign that say\'s "Chicago style" and hang it outside doesn\'t mean that it is and you may be able to trick your Phoenix natives but true chicago folk should know the difference. The reality is that if you were on Clark st. Competing for business you\'d last about 10 minutes before you went dark. Your food is bland and nasty. Your employees seem like extras from the movie "coma" and look like they could use an FMLA day, and your place is unkempt and dirty. I pray that a white castle opens nearby and steals your handful of customers, it would not be hard. Next time I will take video of the place and the food as well as the staff and their attitude and post it on you tube for those who have any doubt. Finally, try using real Vienna giardinara peppers not your own creation because your way off. By the way, I will post a link to view your county health inspection for all to see!! Have a \nwindy city day buckaroo.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 1, 'date': '2009-09-03', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'jt8jtEY1K6TD1FBzYa7HGw', 'review_id': 'FIYk_UaQ1sYicycG-fh7qA', 'text': "My favorite thing to do is grab a bunch of sliders that fit perfectly into my over-sized purse to sneak 'em into the movies.  You might not make any friends if you do this b/c somehow in a dark theatre all you can smell is the onions, which I never notice when I eat them there or at home. Ha!  Oh well, it's a fun little treat.\n\nSuper yummy comfort food!", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2009-09-11', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 4, 'cool': 1}, 'user_id': '--65q1FpAL_UQtVZ2PTGew', 'review_id': 'qSBeMIAH-GRzT2aBRlv4QQ', 'text': 'Yes! Yesterday I decided to eat whatever I wanted and what do I go do?? Of course I go to a place with Chicago in its name! Being one of those many people in Phoenix from the Chi, I can definitely say that this place has the right stuff! If it were a little more compact and there wasn\'t a mountain to look at outside, I would almost think that I was back home! But enough about that. Let\'s get to the food!\n\nI had a slider, a 1/3 lb cheddar and some fries. All this was under $10 so the prices get a thumbs up! Flavor-wise, the food kicked my mouth\'s ass... The slider had me saying, "White Castle, what??" The fries were crispy on the outside and soft/hot on the inside (which is pretty much perfect). Lastly, the burger...oh the burger. Yeah, if you\'re craving a juicy, cheesy, greasy and all around mouthwatering burger, look no further. Every bite made me take a look at the burger and think of how good it was.\n\nIt is safe to assume that I\'ll be back to this place to try more of their food. Next time I\'m definitely getting a Chi-town dog! =)', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2009-10-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1Md7FNu_GujIwxbb9TqSqQ', 'review_id': 'n6KCWiwkVdJWqf8K8b5YQg', 'text': 'You will like this place if your from Chicago, Cub-Bear-White Sox-Bulls fan. Lots of parking. Was told the Beef was from Chicago. We ordered 1 hamburger and 1 Italian Beef Sandwich, it was okay. We had better. Items were nice and hot. Business seemed a little to crowded with memorabilia. We will try again when we are in town again, they have sliders.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 3, 'date': '2009-10-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'hGitwL2Ixiq3C6mJyQrlPw', 'review_id': 'KipildP700pr9Xiu8_0Yvg', 'text': "Back in the day, my daughter loved to come here for the peanut butter shakes and a bite o' meat.\n\nYesterday, a chili cheese dog was a supermarket frank with canned, soupy chili and a tab for $7.85 (root beer in a styrofoam cup included).\n\nAtmosphere? None. Stuck-on mirror tiles with gold particles? Aplenty.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 2, 'date': '2009-10-15', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 3}, 'user_id': 'W_QXYA7A0IhMrvbckz7eVg', 'review_id': 'sL4afrwMV5vWQ8tqyrKfgQ', 'text': "This place really made me laugh, but mostly because of the weiner hanging from the ceiling.  He has a big happy face along with arms and legs.  How cool is that?  To say this place is bustling would be a serious understatement.  Every single time we have driven by here, there wasn't a parking spot in sight.  When we finally decided to eat here I spotted the parking paydirt right up front.  \n\nInside is all sorts of kitschy and fun and it will suffocate you with Chicago-ness.  I love the sign that says when a Chicago team wins the world series, free sliders for everyone!  Anyway, the menu is about as simple as it gets, burgers, hot dogs, and some bigger weiners as well.  I got a cheese burger with bacon but only mayo and ketchup.  Despite all the craziness that goes on inside, they are wicked efficient in clearing the ordering line and then they pump through the orders like nobody's business.  My burger was delicious and soooooo juicy.  The cheese was all gooey and melty and the bacon was thick and crunchy.  Perfect!  To top things off, they actual put a decent amount of mayo on it instead of the usual scrape that you get most other places.  I was a happy hamburger eatin girl indeed.  If you want a good no-nonsense burger, stop by here and you won't be sorry.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2009-11-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'hJBOxmNREXmMGTfXgMcGug', 'review_id': 'RFg-dFGUt2DhKunAMzru2g', 'text': 'Very good burgers, fries, and shakes. Other people have said they have good steak and cheese sandwiches. Parking situation is not very good.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 3, 'date': '2009-11-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'nJ5UZqX_WrP0DAvZ_aE9IA', 'review_id': 'XLDI9XIRvUoJKvf7-0AhLQ', 'text': "The hot dogs here are always scrumptious and the fries aren't too shabby either. The chocolate shake however is soooooooooooooooooooooooooooooooo good. It is the best hot dog place in the Biltmore area hands down.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2009-11-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'M9zyD3urANpe6PoCnCJhDg', 'review_id': '9ejWfI3z913IGsDU0OzZDw', 'text': "Tasty burgers and onion rings. Clean and friendly. I'd go back again.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2009-12-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SGmFDTWDo-IZ95hxMJZseg', 'review_id': 'qSPV2CA3DSoue6M2oCWWEg', 'text': 'Best sliders in town! I went here every week in HS. It gets busy though. Park around the corner. Great food and a wonderful family run business.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2009-12-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'llkm_iXQszkN5DZvmqjNqA', 'review_id': 'awhe61JE8TSpg548vIozHQ', 'text': 'I LOVE THEIR SLIDERS!!!\n\nthere is not alot to say about this place.  there are only a handful of tables and you order lunch counter style however what they lack in size they make up for in Chicago memorabilia... oh yea did i mention that their sliders are stinking awesome???!!!!', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2010-01-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6ts41fCsDKHbFZaKOMNmVQ', 'review_id': 'mLbGokkD2rMDEq-9c--ScA', 'text': "I went here last night. I was SOOOO excited to FINALLY go to The Chicago Hamburger Co.. I have been driving past that place ever since I was little, but never got to go in. \n\nWell last night was the night. The hubs and his friend Josh have both gone a few times and rave about how awesome it is. I HAD to go! \n\nWell....It wasn't what I expected. I will give them that the service was friendly and we had our food in about 10-15 minutes. They were pretty busy, but it came quick. \n\nI got two double meat cheese sliders. I was only able to choke down one. The meat was not good at all, it tasted sour. The buns were really mushy. The grilled onions tasted like they had been made days ago and warmed back up. I pawned off my other burger on the hubs. \n\nWe all split a couple other things because I wanted to try it all. \n\nThe cheese fries....GROSS. They were soggy...like the fries tasted soggy before the cheese was ever put on. And the cheese had ZERO flavor, I wanted to dump salt and pepper all over it to give it some sort of flavor. anything. \n\nThe Frito Pie...Now I was way stoked that they had Frito pie on the menu. There used to be this hot dog cart in this industrial area that had bomb Frito pies and I hadn't had one in about 7 years. Well, the chili was disgusting. In all my life I have never had chili like the Chicago Hamburger Co. It tasted like a bag of sugar accidentally got knocked over into the chili as they were making it and they just let it ride. So so sweet...so un edible. \n\nThe Onion Rings...They were good. Nice and crisp. Really thin though and the batter they use isn't very special at all. But I would eat them again and be happy. \n\nOver all....Its mediocre. I would never ask to go back, but if the hubs really wanted to go there for sliders again, I would go and try something different. They have a turkey burger which sounds good. \n\nSorry Chicago Hamburger Co I really really wanted to like you.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 2, 'date': '2010-01-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'bYdUMQluPbp_zbIs_RLYDQ', 'review_id': 'mvPNyG1sf2cRdJTl0Nn1dw', 'text': "Went here for the first time yesterday and really liked it. It reminds me of the mom and pop shops I used to go to on the East Coast (except with burgers instead of slices. The guy at the counter suggested 4 sliders so I got 4 cheese sliders (should've gone for 8). Those are some tasty little bastards. The only problem I could find with them is the same problem I have with In and Out burgers. The problem being that by the time you get to the last slider (or that second double-double) the bread just isn't as good as the first. Next time I will employ my secret double-double method which is.....eat one then order another, repeat step one again; but I would do this 4 at a time at this place...\n\nOr I suppose I could just try something else the next time, which also sounds good to me", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2010-02-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'gc4rNAgbGydNMAPJ85FZag', 'review_id': '7lBb-sXPYxw3uA6SFORmEw', 'text': "My buddy took me to this place, I had some sliders and a couple hot dogs, The sliders are very simular to white castle's and I wasn't very impressed with the dogs but it was fairly cheap and you got a lot of food. Fun little location. I did buy a shirt haha.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 3, 'date': '2010-02-16', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 3}, 'user_id': 'w-MfmD1d9vNIwjLcU1QO1g', 'review_id': 'o3z5AX0On6hbDs6PSCbCBA', 'text': "I was lucky to grow up on 38th St, because I had this classic burger joint at the end of my block. Whenever I go back home to see my old man, I always stop in to grab a real taste of Chicago. To this day, they still got it!\n\nI recently visited Chicago (the city) for the first time on St. Patty's weekend. I was amazed when I felt right at home, must have been all those lunches as a kid at The Chicago Hamburger Co.\n\nPut me down for 3 double cheese sliders...\nThanks Bob!", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2010-02-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'xnM_4E1QS_5A8iH8Ij6trg', 'review_id': 'Y60yQ3FKov6w22URbyjSnQ', 'text': "The Vienna was good. The setup was correct all the way down to the poppy seeds on the bun. The only issue I have with this place is it is very dirty. There is stuff and stains everywhere. Don't look up, you wil be scared. If the dinning area is that dirty, I wonder what it looks like where the food is prepared.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 3, 'date': '2010-03-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cAJpG8briCwhX3KA7mly8g', 'review_id': 'ZKFFZ5Zv3NVr6bQ9Iaj33w', 'text': "This place is awesome.  A true representation of an old Chicago style burger joint.  The food is great and service is good.  No complaints here.  The sliders are amazing and the dog is wonderful too.  You won' be disappointed with this place!", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2010-03-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'BVZ7iTR_nI3jzdQidze1UQ', 'review_id': 'VWUZLpazFlB0gJRMwJgNEg', 'text': 'Went there for lunch today....I was craving a burger when a coworker suggested this place.  It was exactly what I was looking for.  The sliders reminded my of a place that I frequented in Hackensack, NJ called White Mana...The sliders that Chicago Hamburger Co served were delicious.  I am not from the Midwest, but this Jersey girl did enjoy a little taste of Chicago today!', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2010-03-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8gX8VpBo0dnSlKkWIdhIrA', 'review_id': '01lEtwdISkOq0vF1q_VLmg', 'text': 'I\'ve made several visits to the Chicago Hamburger Co, I was initially introduced by a friend who knew that I was originally from Illinois and missed some good old fashioned Midwest comfort food. My first venture there I tried their Italian beef sandwich, which really hit the spot. I got it with mozzarella and a side of red sauce, not exactly traditional but sometimes I just get that craving. It was pretty good on this occasion, the beef itself was kinda average but the bread was PERFECTION and I was pleased. Round two, not so much...it didn\'t stack up to the initial experience I had. My quest for the classic Italian beef in Arizona will continue elsewhere... Due to the failed Italian beef situation,  on my next visit I got a burger. Good, but nothing amazing. Visit number four found me giving the double cheese sliders a try, and I think I found my mainstay for this joint. While the regular double burger was a bit much and left me feeling like a fat bastard for the next 6 hours, two of these delicious little double cheese sliders did the trick perfectly. The fries are usually on point, I dump a healthy dose of Cajun seasoning on them as a rule. All in all, a pretty cool joint that reminds me why Chicago will always be "home"...', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2010-03-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dwiis_5YagRG7Ol8JSH-Ig', 'review_id': 'nl5vIzZrSADdntb-h66LyQ', 'text': "four cheese sliders with everything and a medium dr. pepper - and you're getting out of there for under $7. i will be back many a times to check out everything else they got. i like their style - laid back, short order food and the staff couldn't be nicer. thumbs up.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2010-04-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': '7o7vuRkJtnnipRWw3kft8Q', 'review_id': '_SPt7xZG-Wis6g_C5SJPxw', 'text': 'I have to begin this by saying that I am not from Chicago.  The midwest, yes, but I have only visited, but given the crowds this place packs in, I had high expectations of the dogs and the burgers.  \n\nMy boyfriend said, "eh" on the hamburger and I had the same opinion on the hot dog.  Nothing special and I have definitely had better - even at a roadside stand.  The service and atmosphere were great along with the prices, but I didn\'t feel like any of the food made me want to go back.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 2, 'date': '2010-04-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'RnImEtgtZ0cYcTbyNLLNRQ', 'review_id': 'mMdL2fwWDOSOxlJszVZ-AA', 'text': "So far I've only had the sliders, fries and onion rings in my two visits there. I'm stoked with the place for the terrific sliders, much bigger than you'd find at a White Castle type place. They have a special of after 4 - 10 sliders for $8.50, w/ cheese adds a buck. Just about a buy nine, get one free deal. I found that four sliders is plenty for me and I could probably be fine with three if I also had fries or rings.\n\nI really like the fact that they actually bring the food to your table vs. calling out a number and making you run up to the counter. They use real brewed iced tea vs. bag in the box, which is a big plus for me. The onion rings are good, though nothing fancy. They are cooked properly which so many places cannot do and the break apart nicely without falling apart in  your hands.\n\nNext time I'll try the hot dogs.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2010-04-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'CYefNOCXufOg59_681CRZg', 'review_id': 'ANK44UBJ7rRl0SFHr2wX_w', 'text': "This is, hands down, the best place in town to get a Chicago dog. I've been going there for nearly 10 years now. I always order the hot dog because it reminds me of being at home in Illinois. They're just perfect. \nEvery Friday the owner of the company I work for springs for lunch for all 30 employees and today I had the pleasure of picking our order up from Bob, Chicago's owner. He's a real sweetie. We just had the best sliders, fries and onion rings for the office. 5 stars. Anyone looking for good food on the cheap, great service and the Cubbies or Bears on the TV..this is where you need to be.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2010-05-07', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'zBoxoWxyzDVziZllC7m6qQ', 'review_id': 'dH7pvTkzp2RnHYSs8CUdeQ', 'text': 'Great Italian Beef Sandwich!! I have been looking for this kind of sandwich for some time. Little did I know it was right down the street from us. I am not a big fan of sliders, However my wife says there great here. She has been to Chicago many times and said this is the real thing. I will be going back many more times.  What a great find.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2010-06-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bLycm4eFD50zWlxnumRPtg', 'review_id': 'pCj_6gCfHlydNAi-6Z9lYQ', 'text': "My dad has been going to this place quit awhile now.  I have been lucky enough to go with him a handful of times.  This place will make all Chicago sports fans proud.  A little too much Cubs stuff for a South sider like myself but the food makes it all worth it.  I had the sliders this last time and they were great.  The fries that went with were just as fantastic.  I can't wait till the next time my dad and I can go visit Bob and have a great Chicago experience in the middle of the desert.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2010-07-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'jJlgHIU9ltclRKnhswpCvg', 'review_id': 'axYEHvML2RZP_bmxyVNudw', 'text': "Best. French Fries.  Ever.\n\nAlso they have great onion rings, fried zucchini, hot dogs...  I don't eat burgers really, so I can't speak to those.  I am obsessed with their tuna salad, though.\n\nI never thought I'd be ordering tuna salad sandwiches regularly from anywhere.  Tuna salad has a tendency to be that unpleasant gray or pinkish color, and have a tinge of fishiness to it, if its not fresh enough.  That is never the case at Chicago Hamburger Co.  This might sound strange, but their tuna salad is the most pleasant pale green color I have ever seen.  It's because they put relish in it.  Lots of delicious relish.  I am in love with their sandwiches, and although I used to devoutly order Polish sausages & fries, I can't turn my back on my new love.  Not the first thing people think of ordering when they come here, but it's definitely worth a try.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2010-07-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Va3U45KqBDXByKIr_NGJ5w', 'review_id': '3USYro0SvnG3bELAn9u9IQ', 'text': "I have literally been coming here for wings for the past 14 years. Yes even when I was younger. It's the only place I will go for wings.\n\nGrowing up I always loved going to Chicago's. My dad would take my sisters and I just for some wings. They still have the same baseball pinball machine which is always fun to play when waiting for your food.\n\nAs I got older, I didn't get as often until I got to high school. From there on, I always brought friends with me to Chicago's to try it out.\n\nI've been going often enough that some of the workers there know what I'll order. I have the same order of hot wings, extra ranch w/cheese fries and a large Pepsi.\n\nI haven't yet to expand on different food items, I've only had sliders, wings, cheese fries, shakes and hot dogs. The food is good and it's such a unique place.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2010-07-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '0j9BH_ymVlCqm3qqFWwoFg', 'review_id': '3zVdu4NRIXi3S7NpQbsQfQ', 'text': 'This place is definitely not for the veggie burger lovers. The brand (whatever it is) that they chose tastes terrible! I plan to go back and try out other things, but I DO NOT recommend the veggie burger.\n\nOtherwise, the onion rings were fantastico!! The perfect frying, with onions that melted rather than being chewy. \nI know it is always busy, but if you go during 2 to 3 its nice and calm.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 3, 'date': '2010-07-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'v7L0xB1KfYvqWUtIY3Kotw', 'review_id': 'RaBz1uan3aHz38UDtYPWLA', 'text': 'Love Chicago Hamburger Co.  I now live in the Bay Area, and sliders from Chicago are one of the things I miss most about Phoenix.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2010-07-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'dwiis_5YagRG7Ol8JSH-Ig', 'review_id': 'PJ-fapkZsof0vc9rTvT4Hg', 'text': "just got done throwing down a loaded cheddar dog. can't complain one bit. this place is starting to grow on me and i haven't even had a normal sized cheeseburger or special burger yet. or a shake... or a polish sausage... man, i got some serious work to do.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2010-07-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2kceAwjbj3I9XOeQPF3lMw', 'review_id': 'h73HB8GDNy9x_E1TiL2vAw', 'text': 'I have never been to chicago. But I love chicago food. \n\nChicago Hambuger Co. makes me feel like im there. The sliders are pretty awesome. My favorite is the traditional  Vienna Chicago dog. \n\nWith all the chicago decor on the walls. My favorite is the poster of all the things that has happened since the last time the Cubbie won the world series. Its pretty fun to read.\n\nWill be back for the shake or the patty melt.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2010-07-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': 'wcOqMTV92kxOornA42KyoA', 'review_id': 'TgY7mSzy3mRJLostsJDQFg', 'text': "Sliders are the reason I first started to go here; but I have grown to love the other food.  Always wanted to try White Castle; so, I've gone to ones in Cleveland, Minneapolis - I love Chicago Hamburgers more!!!  The fries are very close to perfect; but I love Chicago dogs, so I order Chicago dog (comes with fries); and sliders; I am so full; I don't need to eat for a couple of days.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2010-08-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'r68j756bEp2oF7Vs36J8Xg', 'review_id': 'Jq6Slj4Iq5bz2zJc-xNXJA', 'text': 'When a place has as many reviews as Chicago Hamburger Co and it rates 4 stars, sometimes I wonder why bother with a review.  Well, 1) it\'s good to have several current reviews and 2) i try and provide a little different view.  I bring my 5 1/2 yr old daughter here about twice a month.  She likes to call it "Chicag - eee\'s" (Like weenies).  This is one of those places where a little dirt is not only acceptable but seems to add to the flavor.  I\'m not talking about health code issues, just the dirt that comes from a well-worn well-known place.  The staff and cooks toil hard yet are always quick and friendly.  The food is great.  It\'s not backyard bbq good - - - it\'s hole-in-the-wall kinda good.  The shakes are great.  The prices are even better.  My daughter always wins a stuffed animal from the "Claw Arcade Game" - - - although it\'s probably cause I give her 20 quarters.  She and I both love the sliders.  They have a good flatscreen that always has a game on.  The only thing that would make me want to stay longer or go more frequently would be to put Galaga instead of Pac-Man.  Also, I love the red wiener dog hanging from the ceiling but it needs a little repair.  Regardless, friendly staff, good eats, and cheap food ... this place is worth a stop.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2010-09-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'Iycf9KNRhxvR187Qu2zZHg', 'review_id': 'oUdUcs3FAB4dBNfQe7fq0A', 'text': "I have been going past this place wanting to try it for a while but never made it in until last night.  I ordered the sliders because it's called Chicago Hamburger Co for a reason.  I got two double's with cheese.  They were really good and just hit the spot.  I got an order of onion rings and a chocolate malt to go with them.  I love how this place has malts not too many places make them anymore.  This place is what it is a great burger place that is not for the health conscious people but hey they aren't trying to be.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2010-10-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FopAKid3OBQQ-jVmY8HCPA', 'review_id': 'JfDtUJDJBsBs30RoMIMLxw', 'text': "Great sliders, friendly service, and best of all, awesome stuff to look at.\n\nThe wings are the best that I have ever had, lots of sauce, but they aren't drowning. The sliders are great, even reheated as leftovers.. but trust me, you wont want to stop eating them!\n\nThe service is very friendly, and the walls are plastered with Chicago memorabilia new and old. \n\nIts small, a hole in the wall, but its a great place for good food", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2010-12-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yp90PduP1gD7kgCLWuQg4w', 'review_id': 'XXKGcDvXvQcfQEsmHr5S-g', 'text': "Just do yourself a favor and go here and get the sliders, they are fantastic!!  I think the soft and chewy roll is what makes them so damn addictive!!  I have actually never tried anything else on the menu because all I know is that when I go here all I want is sliders!!  The decor of this place is really cool as well.  All stuff Chicago sports.  Although I'm not a fan of Chicago I understand this place.  If a place like this existed in Phoenix that had all things Boston I would love it!  I really don't have much more to say though about the place since I have only tried one thing but I will say this.  The staff is friendly and if the the Cubs ever win the World Series, it's free sliders!!", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2010-12-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TRl5jiNFI2m0wfH6CqO3_A', 'review_id': 'nvguqMUVGh1t3yE7SK3k0w', 'text': 'Sliders, cheese firies, burgers and dogs are great!  Makes us feel like we are back in Chicago without all the snow!', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2011-01-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'el_BsZHqhCZK_VG27TyPBA', 'review_id': 'wlX2akUoPfoWMe3wyw1Ihw', 'text': "Plenty of Chicago stuff on the walls, like a hundred other Chicago-style places in the city, but this did seem just a little more authentic. There was a sign on one of the doors inside - not sure the details - that said free sliders if the Cubs or Sox win the World Series. A couple old arcade games adds to the charm.\n\nI ordered a western burger (typical stuff - bacon, BBQ, onion rings, cheese), and was reasonably happy with the results. The bun was nice and floury, the burger decently flavored, and the cheese was melted and gooey.  Not the best burger in the world, but I wasn't disappointed.\n\nThe fries were nothing special - not even worth finishing.\n\nI keep reading good things about the sliders, so I think I may have to come back to give them a try.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 3, 'date': '2011-01-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'va02uX_MvN2suVKIX_pNeA', 'review_id': 'GrUXiGqdhu_G51FBk9v7vQ', 'text': "I work pretty close by and it has been a great place to pick up lunch. I usually call it in and they have it ready in less than ten minutes. My only problem is they have so many great choices on the menu that deciding on lunch is a struggle. I always like to get at least one cheese slider.  I can vouch for the Polish and Fire dogs. They come wrapped with fries so you really dont have to order any. I've had the Italian Beef.  The bbq beef, the western burger and a cheddar burger. All hit the spot. It seems like they use a cheese wiz and its different but its good. There shakes are good too I just don't remember what flavor I had. That was the only thing that I thought was a little overpriced so I've only ordered it once.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2011-02-03', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 2}, 'user_id': 'opjBZ0ImnKv5eRNQZ-98DQ', 'review_id': 'jX28dPzj7c9rZvL_U3gN6A', 'text': "The pictures and video say more about this place than I could in a review. It's a great neighborhood burger joint, and I'm happy it's a short walk from home.\n\nEverything I've had here is solid for a fast food joint. Once, around the holidays, I ordered their 10 slider deal, and ate them all myself. It was delicious but I hated myself a little after. Trust me when I say two or three are enough for one person. The chicago style dog is my standard here, they get everything right down to the steamed poppy seed bun, the fries that come with it are just average though. I also really enjoy the avocado burger, the grilled onions take it from good to great.\n\nI always like the mix of people that go to this place. Feels like the burger joint in the town I grew up in. Last time there was a teenage couple on a date, three elderly gals out for a meal, a married couple with a kid who I might have been annoyed with if he didn't have the cutest little biker jacket with a skull on it, and some guys watching a game on the TVs.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2011-02-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'K5owfRSgd1e7ds7-Oj3GVg', 'review_id': 'MhZ854ygKXTJ2XX681HF0Q', 'text': 'Had to give this place 5 stars, because no place in metro Phoenix that I know of has hot dogs and Italian beef sandwiches (with red sauce if you want it) as close to real Chicago taste as here. So good. Great fries, too. Just a hole-in-the-wall kind of place, but worth the trip. Always pretty busy. Try it.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2011-03-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '3xA1w6QoYCYN1SnR1h0DyA', 'review_id': 'a4Z2V_ax44P7K4r0aqwfwQ', 'text': 'Great food! My husband got a couple sliders, a hotdog and fries and enjoyed every bite! I got a hamburger and onion rings and was very satisfied! I also really like their root beer shake. Blended perfectly! 4 stars all the way! :)', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2011-03-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8z2mKSqTW-4pLobAUNvrsQ', 'review_id': 'rCFWFm7yV-3UX2ipjsQIPg', 'text': 'Fast service. \nGreat prices.\nFriendly staff. \n\nAWESOME banana shake!', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2011-04-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GtkKZaU-xYd36ssOsaveOw', 'review_id': 'DUJSyW4MtQHMh-Gx_HHKiw', 'text': "Great onion rings, and the sliders are as close as you'll find to White Castle in Phoenix. Lots of Chicago memorabilia for fans of the Windy City.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2011-05-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'cJnYpzzaUt8FfRlpQ-BnuQ', 'review_id': 'pbPiOv5fya-S6tilBdjIZQ', 'text': "Can't get enough of this place!  My faves are the single cheese sliders and the frito pie.  The zuccini is also very good.  These little hole in the wall joints are always the best.  Don't judge a book by it's cover!!", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2011-06-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'T7J9ae0wTskrI_Bgwp-4cA', 'review_id': 'L9OQ_1OC8StqijocTOknWQ', 'text': "If you want unhealthy, greasy food this is your place!\n\nI hadn't been here in over 7 years.  Was excited to go back after getting a coupon for 1/2 off on Deal Chicken.  \n\nWe ordered cheese sliders, veggie burger, cheese fries, iced tea and a vanilla milkshake.\n\nThe sliders have to be the best thing they offer.  The veggie burger was dry and a bit yucky.  The cheese fries are so gross they are GOOD, covered in a fake cheese.  How can you go wrong with a milkshake?  And they have fresh brewed iced tea!!  Very important in my book!", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 3, 'date': '2011-06-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'V-5mzxyCSNtoV1Ig0eNwjA', 'review_id': 'tuCi98ksX1f_w2gF0l-zoQ', 'text': "Terrific sliders! Great Italian beef... way better than Lukes Italian beef.  This is a little hole in the wall that has been there forever.  It's one of those gems that all the people in the local neighborhood know about! The Italian beef was out of this world.  Juicy, meaty, and the broth was salty and rich!  I will definitely go back.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2011-06-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vhxFLqRok6r-D_aQz0s-JQ', 'review_id': '7bkI5Nlwt_ZOFQ9_HKzquA', 'text': "I cannot believe I've lived in Az for as long as I have without trying this place.  Finally went and I am so glad I did.  The sliders are the perfect size, you can order them in single patty or double patties with or without cheese.  The hotdogs come with fries.  For about ten dollars you can feed three people, your cardiologist will not be happy with you, but the food is so tasty.  Parking is painful, that is my biggest complaint.  The staff is super nice and will even give out free re-fills.  You can't beat that.  I'm excited to head back to try the rest of the menu including their full sized hamburgers and their chili cheese fries.  Might have to wait until next month, I did just have that massive fondue dinner....", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2011-06-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': 'dQDHLSMNtRtgdtHdAtO4PQ', 'review_id': 'XiCGerJgunZVXo_Tc33kXg', 'text': 'East coaster who misses White Castle in total heaven! This place is great! Definitely worth a trip! \nI had the cheeseburger sliders, minus the mustard. SO great!!!', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2011-07-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9bP3urjM__IP5csFh9ZsuQ', 'review_id': 'Ghbad4hgTEolB6zZJNmCAg', 'text': "Been to this place only once.  Coming from Chicago the experience at this place was ok, but I've had much better.  Would not go again since I think there are better places out here.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 2, 'date': '2011-07-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xD0TVy8hQ4rXZ16cqhLxuw', 'review_id': 'mxnGWwVXAnQ4AMb79eAoIg', 'text': "This is the best place to go for sliders! I haven't had anything I didn't like there. Older building but full of character, been going since I moved here seven years ago.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2011-07-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'chECojA5tp0NzBxMgQIfgQ', 'review_id': 'cnYGQDG0F3sMh_T2XkCW5A', 'text': "My mouth is already dripping just thinking about the last time I ate at this joint!\n\nI remember it as if I was sitting there now.... grilled diced onions, shredded lettuce, salty-but not too salty pattie, the magic dressing (pretty sure it's thousand island) and dripping on my paper lined little basket full of just fried fries drizzled with ketchup and salt.....Oh, my treadmill beware.\nLast time I went we all enjoyed it and my guest even bought a guac burger to go after he finished his already huge burger.  It's addicting.\n\nDecent prices and good food over ride the parking, which does suck. But the only reason is because it's soooo good.  Even on weekdays during dinner time.  DO NOT go during lunch hour without phoning in your order, trust me unless you have an hour lunch and work close by and don't mind eating a messy burger at your desk!", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2011-09-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'zjVOnjc7uEoDMOTepWUSMQ', 'review_id': 'evo-QoSSsEdzEfsOsz6Vuw', 'text': 'reminds me of back home in Chicago. Love the atmosphere, great greasy food. But they even have turkey burgers!', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2011-09-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'R9n2K6acBRqMjLVCUxgfOw', 'review_id': 'aNFReciPCpOIxSnd2Xa7Vg', 'text': "Other than Ted's Hot Dogs in Tempe, not many foods have transferred well from the East to AZ , but this one has. This hole in wall has captured the greasy but delicious tastes that elude most places down here. \nThe place was packed on a Saturday at 4:30 so you know they're good. \n\nI got the Italian beef which was tender and piled high on a hoagy roll with peppers and onions. Yum!\nAnd my wife got a dozen wings. Half BBQ, half medium. They were flavored as wings should be.. spicy sweet BBQ, Franks hot sauce and butter for the mediums... and were really big. No bleu cheese dressing for dipping though. Only Ranch.\n\nPrices are cheap. \nService is painfully slow. \nThey need a bigger parking lot.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2011-09-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'c2PbAkorhZwYUpmNKMGxeQ', 'review_id': 'as3bUh4gO-1ra_pXfb6i2A', 'text': 'Used to make this a weekly stop, but the hot dog buns have changed, thus changing the whole taste of the dog. This being one of the true chicago style places in town, I found that to be disappointing. \n\nOn a positive note, the Italian beef is very good. I enjoy the unique style of hot peppers that they put on their sandwich. I also love the cheddar burgers here. Made just like they do in Chicago, using the thick spread style cheddar. Nothing could be better then a cheddar burger with grilled onions.\n\nGreatest thing about Chicago Hamburger is that it is always good food in your typical small place.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2011-09-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ltGh04bjEBhwItWVVG7UJg', 'review_id': 'p6xqu2a4Bv_4-JS_D2429Q', 'text': 'Chicago Hamburger Co. proves destination dining doesn\'t need to be stuffy. \n\nAccessible food, budget-friendly prices and an onslaught of Chicago-themed decor confirm this is a great place that I would think someone native to Chicagoland would be proud to have here in PHX. \n\nI ordered the 1/3 lb. Broiled Chuck Burger. The meat was prepared medium-well and came with "The Works" (ketchup, mustard, relish, shredded iceberg, tomato and onion.) While it was slightly too vinegary for my taste (too much ketchup), what made the sandwich was the GRILLED onions. They added a sweetness you don\'t often taste in a burger. The bun was good enough to hold it\'s own...and the sandwich contents. \n\nChicago Hamburger Co. has done for the Windy City what others like Ted\'s Hot Dogs and even Long Wongs have done for Buffalo: brought a bit of their local flavor to Phoenix. With this and the hard working staff to their credit, a taste of Chicago will be in Phoenix for quite a while!', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 3, 'date': '2011-10-06', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'bswV-wIGU9Bw4mbxSPdykg', 'review_id': 'My7lDYK0a8Go9hF3l8gePA', 'text': 'The sliders are fantastic.\n\nThe Chicago style hotdogs are good as well. \n\nIf I was including the years of positive experiences I have had with my family at  this location I would add another star.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2011-12-08', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 5, 'cool': 3}, 'user_id': '3nUQ4xbLlySDbkE03nyp-Q', 'review_id': 'Ab2LFFul9rQUjMZDIau7ZQ', 'text': '*********** THE VALLEY\'S GREATEST  ************\n             *********** 5 STARS *************\n\n       Every purveyor of Hot dogs, Hamburgers and Italian Beef Sandwiches\n       in the Valley, needs to MATCH THE CHC EXPERIENCE.\n\n    CHC, is THE GREATEST PURVEYOR of the above sandwiches.....BAR NONE.\n\n          For those of you who believe, you found NIRVANA ..... because you\n          spent $10 to $15, for a burger elsewhere ....... You\'ll come to\n          realize ........ THAT YOU\'RE NOT THE BRIGHTEST BUN in the oven.\n\nPut CHC, on your "To Die List" .....as for the other places ....a SH*T List, will do.\n\n                                     I rarely give 4 or 5 star ratings\n                       More Than One Star .....  HAS TO BE EARNED\n\nThe Food is Right On .... never a negative experience.\n     The service is outstanding.\n         The entire staff, has a great attitude.\n               The only problem ......... their way to busy.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2011-12-08', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 4, 'cool': 3}, 'user_id': '3dno9Y7mtvi2tq6IfMpDeA', 'review_id': 'aUwHz3Kn20hwb2o2zq1AyQ', 'text': 'I\'ve been here dozens and DOZENS of times over the last 25 years.  5 stars without a doubt.\n\nStandouts are the Italian beef with "lots o hot".  Their cheese fries are absolute perfection...  here\'s why.  Put fries in a basket, smother them with cheese sauce, put another hand full of fries in basket, SMOTHER AGAIN WITH CHEESE SAUCE.\n\nWhen you are done with these cheese fries you are looking for more fries for the cheese, not more cheese for the fries.\n\nThen, when you walk out, school girls and boys break into song and birds start chirping.\n\nOh, I have to mention the cheese steak.  I don\'t like the standard way they do it (beef, onions, cheese) BUT if you ask for it "Philly Style" they do it with their cheese sauce that they add extra cheddar cheese to.\n\nYum yum yum.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2012-01-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 's2TTCqBt93zlnzns5Z0TBg', 'review_id': 'OQ6ouY6N5SA9BGrH9NxLjw', 'text': 'Great traditional Chicago hot dogs, italian beef, sliders!  The food is delicious, comfort food at its best.  The fries are great, malts and shakes, you name it, also you will not leave here hungry.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2012-01-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'ELFrdF9n7Av2s9fjG3jzpg', 'review_id': 'HatsEQlcs_cQ5RKkLPYKXw', 'text': 'After 4pm $9 for 10 regular sliders, and $10 for sliders with chz. \nPretty decent place with good food. I had 3 sliders with the all the basic toppings (onions/pickles) and fries, they were all yummy. I will go back to try the other items.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2012-01-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'an58BsRsqUrRv5ZtedsNqQ', 'review_id': '9zNf0ndclsgFby0ejhNdgw', 'text': "Chicago dog was awesome! Everything else not so good. Chili cheese fries sucked, slider sucked. Restaurant was dirty. I probably won't be back again.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 3, 'date': '2012-01-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'K6JcyAcWcQFYEf-536o3kw', 'review_id': 'ZD4eyKRH_EngHdEwLgpZDg', 'text': 'Amazing place to eat. A hole in the wall that makes you feel at home. A hidden gem in Phoenix for those who love East coast yummies like sliders and hot dogs!', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2012-01-27', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': '2Yh1kRX52QHKzY2vP_jVQQ', 'review_id': 'SPzyzjLOMryudvmmmTb_3Q', 'text': "The people watching is five stars...the food is just aight. Super crispy zucchini was actually mushy inside. Sliders were fine but nothing to write home about. Fries were ok.\nI've heard people rave about this place but like I told my wife...if I was nearby, drunk and starving, maybe I'd want to come back.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 3, 'date': '2012-02-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': '5hIcclyqd9yelg2BlsiXBg', 'review_id': 'WOxOh2lx-dfo-N2I03Zk5Q', 'text': "This place is A-Ok...hence the 3 stars.  Not my favorite but not something to avoid either.  The sliders were tasty when ordered with everything on it.  They were larger then I expected.  The chili dog was decent.  The chili was a bit sweeter then I would have liked.  The fries were also decent.  One of the let downs- no Chicago dog...that's right no Chicago dog on the menu of a Chicago hamburger joint with floor to ceiling Chicago memorabilia.  They had a whole list of other hot dogs so it was bit of a let down.  The place felt a little dusty but I think they meant for it to feel like an old diner.  The customer service was excellent and I think I would be open to trying a few other items on the menu.  I would return just not too often.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 3, 'date': '2012-02-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8XAlHvNzvoU6Z41Z9iAASg', 'review_id': 'cfc8vlzgUqMXwroACjjIww', 'text': "I am from Chicago and I feel places should be care full about trying to title there places with anything CHICAGO in AZ. Those are mighty big shoes to fill! With that said this place is totally over rated...I mean We got a hot dog served as a sandwich....NOT IN CHICAGO!!! For this I will stick to what the Valley is  known for and go to In and Out or Lenny's!!! Quit it!!!!!!!", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 1, 'date': '2012-03-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'fJGWSgGsvb6leJzOuE2O3Q', 'review_id': 'WYilXwYb6XC5YuqpMHQvAg', 'text': "I was really looking forward to trying their sliders, but they're just ok - nothing special.\n\nHowever, I will come back again and again for their banana milkshake. It's made with real vanilla ice cream and chunks of banana blended in. I'm not even a big fan of banana things, and I love this. \n\nIt's a casual place, where you order at the counter and then can dine in or get take out. \n\nI hope to try more things here and find something I like more than their hamburgers.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 3, 'date': '2012-03-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lkHLJZc4FempZ4ROvr3nRg', 'review_id': '3v_IDL2m7PyOysPEzhVk7g', 'text': "This place reminds me of back home. I'm from Michigan and people in Michigan love hot dogs. We also love Jay's chips which you can purchase here. All I needed was Faygo to wash it down with....\n\nAnyway - hot dog was good, chili fries were o.k. - I didn't really like the cheese for some reason, and the shake was amazing. A bit out of the way for me now but I would stop by if I was in the area.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 3, 'date': '2012-03-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9SZBVZ-mxebOVa1BlWFtWw', 'review_id': 'hQnEpdrX2FKaO_FUAdvRCA', 'text': "CHC Sliders = Evil Tasty Little Devils!!  \n\nDAYUM YOU CHC for not being open on Sundays!  I can't tell you how many times I've suggested CHC for lunch or dinner on a Sunday  to have J remind me they're closed!  DOH!\n\nGimme about 3 Windy City Sliders - w/ cheese and hold the pickle!  \nDecent Fries.  \n\nI think I'm going to have to twist J's arm on a Tuesday to go grab dinner and try their Tuesday Special. 1/3 lb.Cheddar Burger, or Turkey Burger, w/ Fries $6.49 \n\nI don't think I'll have to twist that hard though!  ;)", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2012-04-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'kRMZ5hV-3OVkxdSh6YNw0A', 'review_id': 'pMTX15mrNul7tJMCqS1Rsg', 'text': 'Best sliders in Phoenix so 5 stars cause its as good as it gets.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2012-04-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '8T0evnkvRaTomru7ghPGeg', 'review_id': '1hg2bSBKuBbmH98cG7cFrg', 'text': 'Never been here before most likely because I rarely get to this end of town.\n\nHad a chicago dog and a couple of sliders.\n\nDog was good albeit the celery salt was a little salty for my tastes...and I like salt.\n\nSliders were good...somewhat reminiscent of white castle.\n\nFries were fries.\n\nSoda was soda.\n\nOverall pretty good.  Would eat there again, just gotta get to that end of town.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2012-05-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'D5J4mKahKvUBJUTWanZwdA', 'review_id': 'OFg4Zs9swPO4xSAlMNtSHA', 'text': 'I definitely got the Chicago feeling at CHC. You will see tons of Chicago memorabilia on the walls. White Sox and Cubs together? \n\nWe had the Sliders and Chili Dog. Both were good, but not quite Chicago standards. Chicago dog needs to be on the menu! That is a must for any hot dog place. The fries were really good as well. \n\nWe will go back again and try to get them to make us that true south side chicago dog.\nGreat little place at a reasonable price.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2012-05-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 2}, 'user_id': 'dT5JHk1aJQhOty1kwTitHA', 'review_id': 'X4gglhD52hxC7Xyc80WMLQ', 'text': "I have heard great things about this place and I had purchased one of those online deals to try it out.  I was not disappointed.  The only reason, I didn't give it 5 stars was because I was freezing.  But I had a small chocolate milkshake and the special of the day, philly cheesesteak.  My husband had a cheeseburger slider, chili cheese dog, and french fries.  We really liked the food.  If you want the sliders, make sure you order at least 3, I would say, because they're kind of small.\n\nMy husband is from Illinois, so walking into Chicago Hamburger Co, was amazing.  There is so much chicago decor, it's ridiculous, but since I've only been to chicago once, I liked reading all the signs and seeing pictures of former Bears players.  \n\nWe will most defiinitely return.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2012-05-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '_mjXNMEBG_0Vp3ga6l0XdA', 'review_id': 'Axpo2aw5sA2bXTXSMh2Z-g', 'text': 'I live right down the street and this is one of the best places to swing by (off hours are the best because it\'s not as busy) and just pick up a bag of sliders to chow down on.  Hadn\'t heard about the "Philly style" cheesesteak; I\'m going to have to try that out soon!', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2012-05-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'XHsWD63vpZoo_uOqEvcKtw', 'review_id': '9fOVlpWE_dinpK--kG2gfg', 'text': "Great TURKEY BURGERS: The BF loved the hamburger bun (he's a stickler about that) Fries are ehhh. Can't wait to go back and try other turkey sandwiches.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2012-05-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'pAeYPIapHTaAgdXFso4_6Q', 'review_id': 'l9SRALFDF_Yk1wvtiQSrzw', 'text': 'I have never eaten bad food here.  My favorites are the wings, any of the sausages, and the sliders. They also have some of the BEST milkshakes. The ppl are always friendly here. I have been going to this restaurant for years and have never been disappointed.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2012-06-07', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'OkwAoG2bcyi1QyqtwOF0CQ', 'review_id': '5aYZqPzKpqSRuya3eVBvKA', 'text': "I was excited about this place after reading all of the great reviews, but this place didn't live up to the expectations.  I ordered a Cheddar Burger and a Vienna Hot Dog.  The burger was awful; it had no flavor whatsoever.  In-N-Out blows this place out of the water, which is kind of pathetic because that's just fast food.  The hot dog was better than the burger, but it was just average.  I'm not sure that this place is worth returning to.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 2, 'date': '2012-06-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'U_Ggu-0s5mn7VfnIlFAkkA', 'review_id': 'JDH_QRqwV6tegxWE9qdAug', 'text': 'This is a great place to swing by and eat or get to go.  We have been getting the sliders (Double Meat + Cheese = Delicious) mostly.  The fried zucchini is ridiculously good.  Overall, a great place to eat.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2012-06-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vDpNMIiwVIBmO8kbucC7oQ', 'review_id': 'Xn6Vn4VaJrvzSeZGpWoGDQ', 'text': 'Writing this based on a visit last year, but just drove by and remembered the name again. Actually did a large pick up order to cater a Friday work lunch.\n\nThe sliders are great! I easily ate 9 of them! Definitely stop in for a burger fix', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2012-06-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Z0_C4HRVvkLkyEsVGGMnkg', 'review_id': 'YEFn0WpgKnFsXVmnVujVrg', 'text': '1/3 cheddar burger with all toppings.  You wish more places and owner/operators existed like this.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2012-06-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'iQiiCZDlisBYApaPCM7uxA', 'review_id': 'GwAL_Is9yvHLFKXGRta9cQ', 'text': "I wish more people knew about this little spot of hamburger heaven. \n\nTook my husband for the very first time over the weekend and he couldn't get enough of the mini sliders and chili cheese french fries. \n\nThis is a wonderful little dive restaurant that you would drive right past it and miss out on its wonderful goodness. If there was one closer to my side of town I would frequent this place every chance I got. \n\nThe people who run the restaurant are really nice and the environment makes me miss back home in Joliet. \n\nYou wont be disappointed!!!", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2012-07-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oO2Lh6HKSB5aYssEzoUW2g', 'review_id': 'iPZVzAhLoTz-hnppsaSVVQ', 'text': 'Skip the full-sized burger and order sliders; my fiance was eyeing mine jealously. Added crispy-not-oily onion rings, finished with a chunky banana milkshake, and left smiling, full, but without any greasy spoon remorse.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2012-07-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '2hXL2ExBsgjJNpm6BJy0lg', 'review_id': 'D_rV2NRS5m-KneWTUHTXfQ', 'text': "One of my Arcadia faves. Their sliders are great and so are the burgers, when I'm not in the mood for a burger their Chicago dogs are awesome (fully loaded w/all the fixings). Their french fries are my favorite, I always ask for them well done so they come out extra crispy. They also have fantastic malteds.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2012-07-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Ohs0L7Oyz-N8GLxVhhV1kw', 'review_id': '5vYq62UHM48gBZzUM1bPJA', 'text': 'Good little hamburger shop.  Guacamole burger was good, person at front counter was friendly, & atmosphere good like Chicago.  Had onion rings which had too much batter and not enough onion, but was cooked good and ended up ok.  Overall good for a little hamburger shop, but nothing spectacular.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2012-08-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '7brf9WC0Gr_7bUBXEHs9FA', 'review_id': 'KXVSXwJHmgO1Td-Bc7fmig', 'text': 'I have been coming here for over ten years on and off.  It is a typical independent burger joint with a theme (in this case Chicago).  The burgers are tasty with gently fried buns, sauce, tomato, onion, etc.  The hamburger meat is cooked medium well which blends with the fixings.  Overall the hamburgers are made just right.   The fries are delicious and tasty.\n\nThe parking can be tricky.  The parking lot surrounds half of the restaurant and is difficult to navigate.  It is too easy to get locked in to a space by another car.\nThe atmosphere has not changed in over ten year with the kitschy Chicago theme (newspaper clippings, photos, memorabilia, etc.) and will likely not change for another ten year.\n\nA nice treat for under $10.00.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2012-08-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pOim-Tccfc6Aw0ynGdPmYw', 'review_id': '-tKE2ySDvqIzkML4Jpjt2Q', 'text': 'From the outside I thought no, and even inside, it is not clear what to do - for the uninitiated ORDER AT THE COUNTER, but once the akwardness disappears you will think yummy. Have tried their dogs and cheeseburgers, along with fires and onion rings - all good - messy but good - give it a try, you will keep coming back -even if you are not from Chicago !', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2012-08-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'HavRojH3G8AlJchZXonaOg', 'review_id': 'fAv0kh1NbPIwkxaY71IYpg', 'text': 'Good Sliders and Chili Cheese Fries', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 3, 'date': '2012-08-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'HpxGTDm60d9JapjN36JFSQ', 'review_id': 'ym8VVCq7rAam1_uFvp-Gpw', 'text': "The food tastes good. Unfortunately I had forgotten that my stomach wasn't doing too well.  I had originally posted that I had gotten sick from the food but this is my post edited. I simply did not put two and two together.\n\nThe service was great, by the way and in the future I need to be careful when I have a pre -existing digestive bug.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 3, 'date': '2012-09-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'IpCH-jaFA-1YgCdi6YmnFg', 'review_id': 'DGExhvtk77gB1LGBeZTtjg', 'text': 'The burger and fries are nothing special....but not bad.  Be prepared for patties cooked in old grease.  The fries taste like frozen pre-packaged from sams club.\n\nParking is scarce.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 2, 'date': '2012-09-24', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': 'Avf58wphDluj8O4QtMgdzw', 'review_id': 'Y8URDX1IiO8LzpN8yNnoEQ', 'text': 'The place has an awful smell, the condiments table is super dirty, and my Chicago beef was lackluster', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 1, 'date': '2012-10-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'FL1xj5qKFZkU5GXVBj5TUA', 'review_id': 'hYzNN-9p8TjsQEnuufBKbQ', 'text': "When I miss my sweet home Chicago, I make a bolt for Chicago Hamburger Co.  Sure the hell beats dropping a G on round-trip tickets!\n\nSliders are a buck.  Same idea as White Castle, butt this joint is easier on the butt.  Chicagoans or anyone who has tried whiteys will know what I mean.\n\nThey're served on soft fresh buns with fresh onion and pickle.  The fries are damn good and don't taste like they were just pulled out of a freezer.\n\nDon't leave without trying a Chicago style Italian Beef with sweet and hot peppers.  The bread so super soft and fresh and all of the peppers taste like they were made right there in this dive... in fact, I think I could see a bowl of fresh peppers from the counter.  \n\nService is good and the environment and decor can't be beat!  All Chicago, everywhere!  Stuff you don't normally find in AZ, these guys know Chicago.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2012-10-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '_aztBhcgW3xZ2rBa4j5HPg', 'review_id': 'IiAaXpLoLFGSMwmOKACP_g', 'text': 'Lived in Phoenix all my life and just recently came here to eat.  Absolutely delicious.  I got a cheeseburger with everything on it except pickles; the beef was a little pink and the burger was messy...in other words really tasty!', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2012-11-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'V8w32UV03_uaJB43p_kbqA', 'review_id': 'EvqZjRPNMBSxuU4QK_mF9w', 'text': 'This place is amazing. cheap but great food and really nice staff.  the place has a great atmosphere with old Chicago stuff.  Their hot dogs are great. I personally love the chili dog.  The sliders are great too and  the french fries are the type that are amazing when warm but are still amazing when there cold.  You can also get authentic cheese fries, which accordingly to my girlfriend (a Chicago native) is nearly impossible in Phoenix. This is one of my favorite restaurants in Phoenix. We go to it at least 3 times a month.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2012-12-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'kpFx1hEnRUg4fk6D1APRjQ', 'review_id': '6VxoUA76PXGWgKpPwPaL3Q', 'text': "I was craving some back home love and stopped in at CHC.  I had 2 dogs, everything, xtra sport, fries, Pepsi. Just like home, what else do u want me to say?  I didn't try sliders but will do next time.  Chicagoans can breathe easier when in PHX.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2013-01-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': '7h-IWxWBjtPW5xuKhwjPpg', 'review_id': '0_KdwBKm8u3hUdrkvpJTgA', 'text': 'Ehhh... Kind of expensive for what you get. Burgers are soggy and the fries taste like they are cooked in old oil. Place is kind of dirty and parking is a nightmare.  Nothing special here, especially for the price. $10 lunch for a burger, fries and a drink. Also the dining room is pretty much standing room only for lunch. No thanks.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 2, 'date': '2013-01-26', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'ZI1PrgDFvSpYWafvJh9wAg', 'review_id': 'xMvmr4Kf1qZY66y_DlHgBA', 'text': 'Food just OK.  Health inspection was a "B".  Doesn\'t look clean.  Makes you wonder!', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 2, 'date': '2013-02-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'Qzxt48iXX0Ievaiu9N1h6A', 'review_id': 'Zec4N36-lr6pS30gmlRBLg', 'text': "I frequent this place often. It's a Dive and I love it. The owner is this older hippie guy that is super friendly and down to earth. A must to try is a great peanut butter shake.  I love it.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2013-02-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'Xv8gzlMoMiUB2PxJ1Q20Yw', 'review_id': 'SJxDj0fb8YtajQCMZycSsg', 'text': "Awesome!! Every time I am in town I stop here. Same ownership for years. Great service and reasonably priced. I had the sliders and a Chicago dog. It was awesome as always!! Don't miss this place when your in the area.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2013-03-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': '60i9h-gPKH1f0YC_bZXDhg', 'review_id': 'dSxXxT-lpkvqRAqDfrz4ZQ', 'text': 'A true Chi-town experience\n\nGetting a real Chicago Dog in Phoenix is more difficult that you would think.  Anyone can throw celery salt and relish on a hot dog.  But to get the real Vienna beef, bight green relish, and soft bun right is an art.  And these folks have it down.\n\nFun to also look at all the Chicago memorabilia.  My wife, a Chicago girl, ranked this place on par with an authentic Portillos.  The shakes are also a yummy compliment to the meal.  Good prices, too.\n\nOnly drawback is that we may take on the Chicago body shape if we visit Chicago Hamburger Co as often as we would be inclined.\n\nOooh, and I bought one of their t-shirts!', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2013-04-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'RbHpNuEjTlQsnnX5DOtYkw', 'review_id': 'Xy1ypIvLOrLUtpU5A3sWmA', 'text': "I love this place. The chili fries are AMAZING! The best peanut butter shake I've ever had. Get it and you will not be disappointed.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2013-04-11', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 2}, 'user_id': 'hL_rfPuj3lqxKgFBh7yqQQ', 'review_id': 'RRxugZZ-hdp0pFi6V-caTg', 'text': "This place reminds me of every neighborhood wiener joint and Chicagie Dinerette I have ever been to in Chicago.  The Chicago street signs, team schwag, and general Chicago schwag, the old school arcade games, simple booths - this could be anyone's Uncle Stanley's joint in Chicago! \n\nThe food is as expected - real Vienna Hotdogs, on the right buns, with seasoning, and the loud green relish.  Deep fried, tasty veggies like mushrooms and zucchini, and damn good, old school sliders that would slap the towers off of white castle.  It is quite the place for anyone missing the divey wiener huts of Chicago or trying to recapture some childhood memories for those aged 25-45. \n\nThe ambiance just makes the food so much better.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2013-04-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'OrMY-AG_Cx10WD4xDeQAUg', 'review_id': 'TpfcVCxy1EHvjf5_aWx4ww', 'text': "I love this place!\n\nI came here for a birthday lunch with the in-laws and I was very excited. One word: Sliders. Scratch that, make it two words: cheap sliders! \n\nI didn't realize there was a place in the Valley you could get a super cheap, really good burger. The sliders were very filling. We ordered by the dozen, so it was also a little cheaper than buying them individually. \n\nSo good. The fries, onion rings were also very good. \n\nI think this place should have a challenge. Eat 20 in 20 minutes and it's free! Or something like that. \n\nI liked the atmosphere. The walls are completely covered with random stuff and it adds to the charm. \n\nIs there something else here on the menu I should definitely try? I need some recs! \n\nI'd reccomend this place if you're ever in the area.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2013-04-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ro9VpZTkd6Zq0q3OLN8NlQ', 'review_id': 'cb8o04McaFHVK_O5JrwUPw', 'text': "Being a Chicagoian and missing some good yet simple food a former colleague of mine took me here.\n\nI got 2 cheese dogs and the garlic fries. The cheese dogs were great. As we sat and ate our food I presented the statement/question of.... how is it that some places can't cook a good hot dog? Luckily, this place has a good hot dog.\n\nThe garlic fries were ok but I had some of the chili cheese fries my friend ordered and those were better. The portions were very large and they had game 7 of the Chicago Bulls vs Brooklyn Nets game on... Perfect. I was trying to rush home to catch the game but now I was able to enjoy this good Chicago style food while watching the Bulls beat the Nets.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2013-05-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'pFXE_pm4fpctoiHRypK4cA', 'review_id': 'KXpGuAN06F4fUY6q56lEWw', 'text': "The food was great, the customer service was horrible! I called in an order and asked for it to be split into three. When I arrived to pay the man at the register basically scolded me telling me he wasn't going to make other people wait in line while he split my order. The person on the phone did not tell me this was a policy. I won't be back. He was rude and it was completely uncalled for. Maybe the person taking phone orders needs some training!", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 1, 'date': '2013-05-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'HcJrn266YlCs_DL5dN_sDA', 'review_id': '8lzoEisbL8QIBrTsKmGN5w', 'text': "My exec recommended this place to me and man was he right! Best burger I've had in a long time. Counter service which is still super friendly and while I had to wait a while for my meal, it was certainly worth it. Anyone looking for a huge tasty burger at a very reasonable price should check this place out.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2013-05-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4jHu7B5EFewkC3Tl7KP6sw', 'review_id': 'QwfgCmZRUpvicZ5DfMTYKQ', 'text': "Love this place, Have been coming here since I was a child. I'm 28 now. Still come here.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2013-06-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'NNdfPF-UhvLB8FxbsuSC5A', 'review_id': 'BGXnopH97MZ2Te38YqXFHg', 'text': "After a long day of work, both my friend and I need something for dinner, so we head to Chicago Hamburger Co.  My friend has been wanting to take me there for a long time, so I said sure, why not?\n\nWhen we got there, it was just a bit before 7pm and it wasn't very crowded.  I ordered the daily special, which was the Grilled Bratwurst w/ Fries or Cole Slaw.  My friend ordered the Chili Dog with Garlic Fries.  The garlic tasted really thick and both of us weren't really a fan, but the fries was absolutely great.  It was very crispy and fresh, not of those frozen fries you get at other fast food joints.  The bratwurst is good, but could be bigger.  The chili sauce is good too.\n\nI would definitely go back and try their other daily specials whenever I'm going to be in the neighborhood the next time.  Good food, I'll definitely be bringing my friends over next time.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2013-06-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DrWLhrK8WMZf7Jb-Oqc7ww', 'review_id': 't7YQxbMhp4zVB0ztBcJaqQ', 'text': "Just popped at 6:30pm in to try a couple of those Windy City Sliders at $1.04 each. They made them well done for me and it only took about 5 minutes to get them and 5 more minutes to eat them. I guess I was expecting more of the White castle experience (my fav burger chain) since that chain started in the Midwest, but these were good, but just run of the mill burgers. White Castle steams everything including buns, but Windy City doesn't. The buns are regular and the burger just comes off grill with the additions of pickles and onions and ketchup (no mustard for me). Nothing wrong with these sliders at all, but don't expect anything like the castle legend. Place itself was loaded with old Chicago sports posters, but seemed like a makeover might be needed or is that the charm of the place I suppose.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 3, 'date': '2013-07-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kHI1UedCN7pNnYEknsmqDA', 'review_id': 'wkjcF5aGqPlG6gPahvecUA', 'text': "I just ordered a regular cheeseburger with grilled onions and fries.  Burger was good, fries were about 1 minute under-cooked and you could tell if it had cooked that one extra minute they would have been awesome.   We called ahead to pick up and they were very fast and friendly.  I'm a fan.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2013-08-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9-sss2V4SkEJwD25EzEPuQ', 'review_id': '2hI5VN-w5g1q4GYgWimhaQ', 'text': "Words cannot describe how amazing this place is, although I will try.\n\nThis is one of my favorite restaurants. I'm originally from Chicago and this is the only restaurant I've found in Phoenix with REAL Chicago style food. My favorite dish are the cheese fries. This is the only place in Phoenix I've been able to find Chicago-style cheese sauce, not that fake Velveeta stuff. My fiance swears by their chili dogs and sliders, saying they are amazing.\n\nTo make matters even better, they are ridiculously cheap. My fiance and I will go and barely go over $10 for the both of us. I definitely recommend going. If you are a native Chicagoan, its mandatory.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2013-08-12', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'Qzxt48iXX0Ievaiu9N1h6A', 'review_id': 'SonWDCog1gnixyszKD0JUA', 'text': "Great Hot dogs, amazing chocolate banana peanut butter shake, and garlic fries are awesome. You would think I'd weigh a lot by the sound of it. lol \nThis place is a Dive that is a best kept secret. The owner is a down to earth hippie kind of guy. He's always accommodating and friendly. :-) We frequent this place often and have always enjoyed the food.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2013-08-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_6seymnSl8rS-pw801ENAg', 'review_id': '6bSjhTggt1_phUTDbUVZ8Q', 'text': 'Been coming here since I was a kid! My favorite fries in town, and best got dogs! Another favorite-the grilled chicken salad. Deeeelish! Chocolate and pb shakes are great too!', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2013-08-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZW8jy6ehrNzn9A5iCubVGg', 'review_id': 'QJd9Sjlq8jFiAJ4UOPqK4Q', 'text': "I've been wanting to try this place out forever, and I finally did last night. The service was great, the staff was really nice and they had a fun pinball machine we played while waiting. The space is completely covered in Chicago memorabilia which helped break the ice into interesting conversation. The food was alright in my opinion. I had very high expectations which might have clouded my judgement. The sliders had tiny patties, but I think that's an eastcoast thing so I won't hold it against them. I had my first Italian beef a few months ago from Portillo's and sadly, the one I had here was just not up to par. The au jus they had on the side was good but I didn't taste any wow factor as I did before. I was excited when I saw that they had garlic fries but they were pretty soggy (even for me and I usually like soggy fries). Everything was pretty affordable and we live close by, so I would come back to try a hot dog, chilli cheese fries or a shake in the future.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 3, 'date': '2013-10-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'b28CgyUxeYj9Nf23QdY5Ng', 'review_id': 'xqcXnLZKMBoKWL0PM1cWwQ', 'text': "I've been here quite a few times when I was younger and have recently been going back and I'm glad to see it's just as good as it was!\nMy boyfriend gets the Bob's Big A$$ Burger and he loves it. He get full off of it which is always a good sign. \nI get the veggie burger and my gosh it is DELISH!! We also get the garlic fries and zucchini as sides. However the fried tend to be greasy, it add to the old Chicago style! I just drain them on some napkins. The people are nice, not much of a wait, interesting decor, and great food! Whether it's lunch or dinner, this place is great! Yum!", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2013-10-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'M_ANCS3xO0F5B0CwrpWcCA', 'review_id': 'RVnvknlaUo3jTe_6sgPApQ', 'text': "Great sliders! Went here for lunch yesterday with a friend of mine and we used a Groupon. It's not the first time I've been as whenever I'm craving a slider this is where I head to. I love their cheese sliders and french fries. Yesterday I tried a new menu item - garlic fries. They were okay but I don't think I would get them again. If you are into Chicago's sports teams then you would love this place. All the walls are covered with Chicago sports team memorabilia. You do have to get here early as the place fills up quickly but they do get the orders out fast. They have great prices and it's a good value for lunch.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2013-10-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'CoCYe6lS8JEOHmVYkMgaIg', 'review_id': '4F-7Szo-KeCjD7q7FyiJtQ', 'text': 'I went there on a Monday and had the special which was a Chicago style hotdog and fries. I also ordered a slider with cheese. The hotdog was a Vienna Beef hotdog trimmed with the things that make a Chicago dog, and served on a poppy seed roll. It was like being in Chicago. Everything was fresh and tasty. The fries were hot, and cook perfectly. The slider was amazing as well. The bun was steamed, the meat was tasty. I really enjoyed the food, the prices are very reasonable, the service was great. I am leaving the area soon, but plan on a few more trips before I go.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2013-11-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'fkUuqu8br1N6d0HAZtzZVg', 'review_id': 'nE1hxnBAqT_0_bwa3Wdr2g', 'text': 'Ehh! It\'s ok! The decor in the place is awesome! The walls are covered with anything and everything Chicago, obviously. The food wasn\'t that great :/ heard good reviews about the place and just wasn\'t "wowed". I ordered the sliders which the lady at the counter recommended as a favorite. She also told me to order more than one since there was just a 1 ounce hamburger patty on each. Didn\'t taste any better than McDonald\'s, to be honest. The friend I was with ordered some type of polish dog, I think, which he said was good. The fries looked good but I can\'t say I\'ve ever complained about a fried potato.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 2, 'date': '2013-11-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KM7MA46cHr3450_vwDPlwQ', 'review_id': '_vNzZSl9V5zw2Xg5VTBG0A', 'text': "One reviewer said it was a love it or hate it kind of place.  Truth is,  I don't know ANYONE who doesn't at least like it...and most of us love it!", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2013-11-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'FotryrraSq3tubHJCFiVWg', 'review_id': 'fCnWZSusd-Pmxt3FF9DJaw', 'text': "They close at 8 but will serve the person in front of you if they know them and the doors are unlocked at 8:30. Oh, and while the place is packed and you're not the only on in live willing to pay. A+ customer service.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 1, 'date': '2013-12-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'D_BWrb2H6ILPN_ylMqj2FQ', 'review_id': 'yZImHQBBivPMxhVnZQ7v2A', 'text': 'I have been looking for genuine sliders since I moved from the East Coast to Phoenix. This place is THE PLACE! At the point that I found this little joint, I would have settled just for a Whitecastle or better yet, a Krystal\'s. However, Phoenix doesn\'t have either of those. \n\nMy mouth is watering even thinking of it. Not only are they the best sliders in town, but I\'m fairly certain they\'re some of the best I think I have ever had. Always cooked fresh, you can tell they haven\'t been frozen and then pre-cooked for the day. They\'re made right then and there as you order. \n\n The owner of this business is as good of a local business owner as one could hope to meet and absolutely embodies everything about this place. It\'s cozy, non-pretentious, and downright homie. He is always genuine and kid when I come in here. Though there are more "gourmet" type places for burgers in the valley, and those places are definitely good, this place is, hands down, my FAVORITE int he valley. \n\nThink I\'ll head over right now!!', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2013-12-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'ToYd5W6xK7e17geh__luUw', 'review_id': 'dE3vKsK2Z8STO5kZqJFYFw', 'text': 'Love the sliders, great dogs to', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2013-12-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'rotKO3R8h23YbiLFaZ-BLg', 'review_id': 'Pp1KWXQUx2JidFFuBzofng', 'text': "This place is incredibly good.\n\nDon't come here expecting the fanciest of establishments.\nThere are no waiters.  No valet.  Just tasty, affordable burgers, fries, sliders, and hot dogs.\n\nIf you're looking for some good food for not much $$, this is a great spot.\n\nI only wish they were open past 8 PM to satisfy late-night cravings!  :-)", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2013-12-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'BP5HEndcVXadA9bIxS_w3Q', 'review_id': '7pQiS-2yr9ApfK2UheII1A', 'text': "This place is great. Exactly what you expect. Tons of Chicago teams memorabilia on the walls, dogs, sausages, and sliders. Bratwurst on Wednesdays and Saturdays (which is my favorite). A couple of TV's with sports on. The French fries are great always super fresh and crispy, and everything else is made to order. If you can't make it on Wednesday or Saturday for a brat, I love the Firedog and the Polish Sausage. Plenty of seating, parking can be hard to come by during the lunch rush though. Friendly, courteous staff. Definitely worth a try.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2014-01-07', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': '0fOPM1H03gF5EJooYvkL1Q', 'review_id': 'mpMXNzrn1jQeLLSrzof8UQ', 'text': 'I would not go back for the Sliders or Beef Items.   I ordered the following(TO GO) on 2 Saturday afternoons 1 week apart:\n\nChili - There was sugar in the Recipe.  I did not like.\nSliders - Something sweet in the Meat, Perhaps sugar.   Nothing like White Castle.  If you are seeking the White Castle experience you will be dissappointed.  \nColeslaw - Raw Onion is in abundance and takes away from the very fresh Cabbage.  If they get a handle on the Onion they have a winner.\n\nWings -  Basic\n\nHot Dog - Basic - however the Poppyseed Roll was very fresh and the French Fries(although standard frozen potatoes) were delicious and cooked perfectly, both times.\n\nBiggest dissapoinment:   The Philly Cheese Steak.  There is something that is giving the meat items a bad taste/odor.   I really doubt the meat is old due to the Restaurant is quite busy.  Perhaps it is how they store the items as a strange undeterminable odor is getting into the Bread or Meat.  I ordered twice on busy Saturday afternoons.  Meat/Bread Items had the same Odor.   It is not a dirty odor. \n\nNevertheless, I would only return for the $4.85 Hot Dog which comes with French Fries.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 2, 'date': '2014-01-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': '9B0KmulfCwXCP0Th0yqBZg', 'review_id': 'USfxHHYoYkjAJg5VzystBQ', 'text': "Amazing for what it is...sliders and the banana shake can't be beat...best shake in arizona. Spend the extra 60 cents for the banana upgrade.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2014-02-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '1N3Df5j-E0PnRT430d0RBQ', 'review_id': 'SYTJO4fzDhSADs8F0Izrew', 'text': "I love this place, try the fire dogs. The only reason I have this 4 stars and not 5 is, the dogs aren't that big.  The place is very welcoming, love the Chicago theme.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2014-02-28', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'ixoJN9sIHp8DKj7PeQUKaA', 'review_id': 'WogSz3Wq1yjYRXr3ZIyGQQ', 'text': "My sister lives in Arizona and every time I come for a visit, we have to stop by this place. This place has THE best sliders. Better than White Castle!!! Not only are their sliders AMAZING, everything else is also. Their fries, veggie burgers, and milkshakes are all great and their onion rings are straight up TO DIE FOR. I prefer a chocolate  shake with my savory food. \nThey have outdoor seating which is nice if you want to take a pet, which I happened to bring a few visits ago. Their seating inside is pretty comfortable as well. The tables aren't crowding each other and the memorabilia all over the walls is interesting to look at.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2014-03-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'FYsAZu6zAD0aCGqg4T7eJw', 'review_id': 'RfWGA1CG2eVJYdyJ4g9VhA', 'text': "I am new to Yelp but have been coming here for over 20 years. Always lived in the neighborhood, and this is the place to be. The 2/3 cheddar is the only way for me, but no matter what you order you will be happy. Hands down the BEST burger joint in town!!!!!\n\nI can't stop eating here!!!! Every time I go it feels like home. Bob, the owner is one of the nicest people and treats all of his customers like family even if it is their first time there.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2014-03-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lweKA26bxv4o_5rsqLmCJw', 'review_id': 'wVEPUgwZIszUnf1joXp5Lw', 'text': 'Simply the best! I have been eating here since I was a kid and still love it to this day.  The sliders are my go-to choice but the wings and full size hamburgers are delicious also.  Bob and the staff are great and everyone is treated the same, like old friends.  Even when I lived in north Phoenix I would make the 30 minute drive just to satisfy my cravings.  If I ever leave Arizona I know this will be the food spot I miss most!', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2014-03-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Xc0BCBhqZ1DfPwZoJ0uw2g', 'review_id': 'oBtjoR_bV_KIw-XZVG959w', 'text': 'Maybe the best Chicago-style hot dog in the city.  Hot thick fries.  The banana milkshake is a winner.  Friendly counter staff and fast service.  Fun old Chicago sports and Blues decor. Parking can be difficult at lunch.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2014-03-28', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 0, 'cool': 1}, 'user_id': 'gmr1F-8sjzNns30aK2nXkQ', 'review_id': 'INnUC2QGwvuWx5I__gdSYQ', 'text': 'This place is legit !!!  Best burger I have had in 9 years in the Phoenix area. Great neighborhood spot full of Chicago pride which is evident from all the pictures and memorabilia on the walls. \n\nI had full intentions on showing a pic of my burger but I inhaled it. 2-3 cheddar with lettuce pickle spicy mustard and ketchup. Absolutely loved it. \n\nAnytime I am in the area I am coming back. Do yourself a solid and get down here.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2014-04-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'QbDvWrLQNV9JTIuvZDwmmg', 'review_id': '434maBSthch-o5X09rTY5A', 'text': "Damn good sliders and polish.  Says it was given best fries award but I didn't see anything great about them.  My only gripe would be that I didn't get any peppers on my polish but I didn't know I had to ask for them.  Id definitely go back and explore the menu it was tasty.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2014-05-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '2OFDDaFa5QjwAjs_i2GBPg', 'review_id': 'f020MsJKUcuejzPSP3s0yA', 'text': 'What a great greasy spoon.  If sliders are what you are craving this place will satisfy your cravings.  Chili cheese fries were really good too.  I would have given it five stars but service was a tad bit slow.  Really good food and overall staff friendliness', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2014-05-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZOpcHTNgF_iTnZz_cXTRTg', 'review_id': 'o09Ok3HZ-EWAHedVBBgBXQ', 'text': 'Best sliders in town. Great fries, chi town environment. Classic stop on this side of town.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2014-05-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6vckuRXzq3lzm26VYHnkJQ', 'review_id': 'GpvrC-UifQcmrDgD48xR_Q', 'text': "I can't believe I've never posted a review on the Chicago hamburger co. It must be true....we DO have a tendency to take the best things in life for granted. 1st timer? Can't go wrong with sliders and fries. Pretty sure there are magic unicorn chefs steam cooking the juiciest most flavorful sliders you've ever experienced in the kitchen. The owner is always working the counter (cool dude in the bandana), and never fails to express gratitude for stopping in even though there's always a steady flow of customers coming in. Other highlights include hot dogs, shakes, full size burgers and Italian beef.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2014-06-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Uvzb8Bg4-Q7UP9Cq3_ZUbQ', 'review_id': 'CuM4YIIVvI137JYdtMxiyg', 'text': "I lived in the valley from 1999 to 2004 and now get back to Phoenix every few years, wife had not been back n 10 years. First stop of the plane is to head here and order a 'Beef' and Chicago Dog. Hands Down the best outside of Chicago. Have seen some people complain about the prices but hey, its a small business and it costs money to get the original supplies and such. The Dogs were overflowing and the beef was great too. Nt the worlds most impressive, physically but the best does not have to change much. Good job Bob, see you next year :)", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2014-06-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DBGEhqsq7G6UKg75fGfztg', 'review_id': 'CbZCzyiYK6qqYepuJGwIsg', 'text': "Seriously the BEST veggie burgers in town (IMO)!  I've been craving one for about 2 weeks now, so freaking good.  Their sides are pretty sweet, too :)", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2014-07-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': '1MyXsAhZK35A6EAr4reLCA', 'review_id': 'BPXOVkto1AvHkomj2JGJAQ', 'text': "I've been in Metro Phoenix for 8 Yes, why did I not know about this place sooner?? Food is great, sliders...OMG, blindfold me and I would swear they were White Castles. I love all the memorabilia...well except for the White Sox stuff.  All kidding aside, really enjoyed our visit, food and conversations.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2014-08-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qKqvVFP6PmxlS7-u0xjs3g', 'review_id': 'FKn9ykIrva0aMvgCpmpIqQ', 'text': "This place rocks! It's as close as you're gonna get to a WC this side of the Mississippi and in my opinion its much better!\n\nThe sliders are perfectly cooked with all the fixings, taste amazing, and bring that mid-west experience of sitting at the slider joint trying to eat 2 dozen at a time. I wish I could tell you more about the other menu items, other than their fantastic homemade milkshakes, but every time I get here its a toss-up on the single or double cheese sliders.\n\nIt's a Chi-Town sports themed sit-down type place with old-school booths and a hometown feel.\n\nThe only negative I have on this place is parking, but I usually get there early to avoid the rush, you can park on the side street too.\n\nIt takes every ounce of restraint not to stop here when I drive past, do yourself a favor and stop in.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2014-08-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xTZTTophHUTFKxwotrgC1Q', 'review_id': '_rQB_6LWG-3GfwB9cnE_aw', 'text': 'This place is capital A Authetic. I guess you could call it the cats meow. The second you walk in from your buisy work day you feel welcomed by the aroma of burger. The owner Bob is a great guy just ask him for the catch of the day. Always blows me away just like the windy city. Gotta love this place!', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2014-09-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'X7-ipTS7CBll2Nt3yYrGAw', 'review_id': 'va4eSqjpCyEgdQ9FciEStQ', 'text': 'Great Sliders but my favorite is the Italian Beef.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2014-09-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'QzdnfTTeTKGrtzBrhg01LQ', 'review_id': 'M5YQXBcJlx9tyEw0TupDVw', 'text': "You guys, this was better than In-N-Out Burger.\n\nI had two cheese burgers sliders and a super-thick vanilla shake.  We split some fries.  It may have been my favorite meal in Arizona!  The quality of it all was fantastic.  We stayed until closing (it's only open until 8pm, closed on Sundays) devouring it.  This place may not look like much on the outside, but inside you're transported to Chicago.  If I come back, I'll try a hot dog!  They have beef franks that look awesome.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2014-10-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3SMK97v7Evoksbjo4b3TBQ', 'review_id': 'd8FHOicvQiuSh690NhWMBQ', 'text': 'Italian beefs, hotdogs, sliders, and really good cheese burgers! The beef and sausage combo is my favorite, sweet and hot peppers are a must and the fires are always constantly crispy.(usually order mine extra crispy) Longer wait but totally worth it. Good food, reasonable prices, and fast service. Good lunch grub spot. Oh did I mention Frito pie... Mmmmmmm.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2014-10-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Dd1JM4375DEl54HueHvxPA', 'review_id': 'cRKuO3sC0qioc7FjtCT6og', 'text': 'The best sliders in az! Hands down and fire dog chicago style mhmm ... a must have arizona eatery !', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2014-10-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fNs689kCLFAXDk9VrJIYWg', 'review_id': 'bX0moPH8hrAHuwGLXVYlIg', 'text': "Great place. The sports decor on the wall really sets a fun atmosphere. I had the firedog with the amazing neon green relish and it was awesome. Also tried the special of the day which was sloppy joes, which were the best I've ever tasted. They were completely unique and tasty. The service was precise and quick. Definitely recommend.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2014-10-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '32nOoYH8paK_Bbvl2VjaHg', 'review_id': 'PjnI-_xNbeNOCknT-zcekg', 'text': "One word...SLIDERS!!!!!!! Absolutely the best. You can't just have one!", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2014-10-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1tG5AHxkw0EesWNKjTwOgQ', 'review_id': '8vn32NSUb1Rp5Q1dgd6bfA', 'text': "Another great experience at Chicago. I love coming here for the delicious (and affordable) sliders. You can order them how you like, I prefer with cheese and onions, and they always come out hot, fresh, and delicious. I'm also not sure what they do to their fries, but I really enjoy their flavor. They are a must have addition to my sliders. Whether I decide to eat there or take it home, it's always a satisfying meal. \nThe staff is not overly chatty, but they are polite and provide excellent service. \nIt's a great addition to the Arcadia neighborhood!", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2014-11-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'd5LAdwkuweZ5JgwScYPU8g', 'review_id': 'zX-JwEeBPe4it9JiwgJxxg', 'text': 'Great experience at Chicago Hamburger Co.  Great service, great ambience and excellent food. 2/3 lb burger and Cheese fries are great!', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2014-11-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'YFZrhfWbsIiVGoP9CCd1kw', 'review_id': 'kpqrXIUBfkIK2FZQ9XsgWQ', 'text': 'Love their sliders! Everything is good here. Recommended.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2014-12-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tq0ZoiyXxEH2JK7TcOqqHg', 'review_id': 'bMF8VSD_eKad8CvvqUN0VA', 'text': "Perfect place to come to for burgers and dogs! Especially if you're from Chicago and miss White Castle ;) they definitely makeup for it with their excellent sliders", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2014-12-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Naum_cJgxYU4dXK7Lvrwng', 'review_id': 'mdmigfqDC3QU_543_-CRrg', 'text': "This place has Chicago Flair written all over it!!! The inside was filled with sports memorabilia galore from the famous Windy City. Arcadia for me has become an area of Chicago transplants and the food followed.\n\nI had the cheeseburger sliders, root beer float and onion rings. All delicious and left me wanting more. The quality was really good and everything tasted fresh.\n\nI also had their thick shake on my second trip here. I tried the chocolate peanut butter banana milkshake. It was creamy, dense and smooth. The shake was one of the best shakes I've ever had.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2014-12-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '9zNHEKKwEwVOZ4xSNXN_Dw', 'review_id': '_h6iwgjzU4xlhqG6EocWQA', 'text': "This place has been around forever. I remember going here as a kid. I usually get a Chicago Dog or sliders with cheese. Bob is great!\n\nDrawbacks..... Parking is a pain, very small parking lot. The place is also a bit small & run down. But don't let that stop you from enjoying the best sliders in town! I drive in from Goodyear to eat here, that's how good they are.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2014-12-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '84DE8p3JWf7L9-aojU-CLQ', 'review_id': '0c1IfvujUIyrAAepjk_fiw', 'text': "I've been coming here since I learned to walk. The owner, Bob, makes a fun atmosphere to eat a classic meal. Makes you feel like you're at the ballpark or the stadium. I'll never stop coming back. Sliders and milkshakes...enough said.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2015-01-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': 'JS6fc5FyOBC54kUb4b6lYA', 'review_id': '5hgvMfiSqI-DVeiT-uQniA', 'text': 'Went for the Brat \'n\' Fries special today, and it was okay. Who thinks frozen fries, fried in hot grease is okay...well, the ketchup helped. I\'m trying the onion rings next time, and maybe go with the burgers, but then no, I came for a Chicago Dog. The "Special" sign swayed me to go with the brat, and since I live down the street, I\'ll go again, but if it wasn\'t for that fact, I\'d go somewhere else.\n\nThere\'s a lot to choose from on the menu, and the Chicago memorabilia is fun to check out, but how many times can you be interested in the wall deco...once, I\'ll wager a side of greasy fries on.\n\nA note on the men\'s restroom. It was built for a tall dude, and there are now codes that dictate how high to mount a urinal and soap dispensers...just sayin\'.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 3, 'date': '2015-01-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '63fFw5ZU_U7fFK4oTKy74Q', 'review_id': 'Cv3ba742efi2gME6iJv3DQ', 'text': 'I love his place great food customer service is excellent. I showed up an hour after ordering food and he remade it for me! Awesome place! Closest you get to the real Chicago thing!', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2015-01-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'U8vyUODOrk9AkFDRe5NZPQ', 'review_id': 'wICpqqEEcZsSy8HBiqtBuQ', 'text': 'Always friendly!  Always yummy!  Sliders are a lot bigger than your typical sliders, so keep that in mind when placing your order. Fries was crispy on the outside and soft on the inside and normally always hot and fresh. Hot dogs are the classic Vienna hot dog of Chicago. Which means they are delicious!!\nThe place is wallpapered in Chicago paraphernalia, which is great for a Chicagoan like me!', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2015-02-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 2}, 'user_id': 'pprq_7lgBT-WDFGPQe1a_w', 'review_id': 'iL5CPZTricZoC0xzQTcXBQ', 'text': "Great spot for authentic Chicago sliders in Phoenix. I have been coming here for many years but have not been here in a long time. Same great quality food fast friendly service. If you're missing Chicago style food you have to hit this place up", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2015-02-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'SxZV-iqRoO1ERfrQvKbpkA', 'review_id': 'AlXcNXPbijoh-nXgjB7jbA', 'text': "I love authentic diners. Those little hole in the wall places that have mastered being unassuming and delicious and just concentrate on making great food quickly and aren't another trendy burger franchise trying to emulate that experience.\n\nChicago Hamburger Co. has that down. Their sliders are a little bigger than I thought they'd be but they're awesome and filling. Their fries are delicious and their milkshakes are just creamy deliciousness. Its tiny but the interior is homey and if you're in the area hit it for a nice meal you'll remember and savor enough to want to write a Yelp review about it,.\n\nThey even have a Rahm Emanuel for Mayor poster.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2015-02-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_LsbT_uW0UE6rhsWiAIrsg', 'review_id': 'SMAH6xe1kcbqWO_8W5st7w', 'text': 'if you are from chicago, massachusettes, michigan, new york, or pa, you will want to eat here, it has the foods you grew up with, great sausage, beef, hot dogs.  the owner and staff are great.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2015-02-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6DtSPifH5A8roiehFi_6vw', 'review_id': 'whgd_XTq-PpFRFerf0M6fw', 'text': "Great place all around. Vegetarian options are available for us non carnivorous types. Thanks for that, it's very much appreciated. \n\nFries and milkshakes are great too.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2015-02-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9dx-Atgssn3g71cOVVhuNA', 'review_id': 'no-TmR1ajsAnqzbjXc2-wg', 'text': 'Great burgers at a great price not much else to say just come in if you can get a parking spot.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2015-03-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9Z4oxegL-KRsHhWaWhEuxA', 'review_id': 'JRULF6rMHeUbgz7913Qr1A', 'text': 'Great sliders and awesome for any native of Chicago.  I take consultants there and they love it.  Peanut butter shakes are the best.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2015-03-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5c4p-A1sLBlpS1cPaMpdBg', 'review_id': 'V3n0FUs8BrT0AILQvcqWNA', 'text': 'Great Chicago dog and awesome sliders for a decent price. Love the Chicago memorabilia decor all around the place.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2015-03-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vP1-Z02_14sYZC2mr_3j4g', 'review_id': 'RCxDk-4iHSw6RtYN3Ro0jg', 'text': 'Love everything about this place! Awesome sliders/burgers! Most of all they really have authentic Vienna beef! A great place to have lunch.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2015-03-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MSGkbfEcbjrZZVQsXs7iQw', 'review_id': 'J9-uhGegWkvf_2oKfsh3zg', 'text': "Don't go for the sliders! Drove 25 miles to try the sliders and was terribly disappointed. First off, way too much bread, it was giant buns compared to the real deal. No flavor at all because of the bread, it was not moist with onion flavor like a real slider. Ok maybe the dogs and meat sandwiches are ok, I don't know. Please stop advertising that you have sliders because they are not!", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 3, 'date': '2015-04-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cc-NjTz637u7EtFd83dn_w', 'review_id': 'x3cLWF6Y7YmJPQba9YAyLA', 'text': "Great Scott! Holy sliders batman! \n\nThis place has it all. Sliders, dogs, fries, fried zucchini, chili, brat... \n\nIt's just delicious. The food becomes addictive so be careful. You will get cravings. \n\nYou order at the counter and they bring it out to you. I have been there a few times and it is always fast and friendly and hot and yummy!\n\nThey do get pretty busy but they are still always fast. I really can't say enough good things about this place.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2015-04-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GurDguC2dGEhjPWu-Nuy8w', 'review_id': 'FCaAmpPfIiwITv4umMZ3HA', 'text': 'Fantastic fast service - good food and service - good quick bite for lunch had a 2/3 burger the first visit - wonderful and the Italian beef - good (little heavy on the peppers)', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2015-04-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'aUtyiipxP4wX2KjHfrZroA', 'review_id': '7rdtBInw7ZHRk2kNx66dhA', 'text': 'Went here on my birthday for lunch the other day. There is nothing fancy I can say here at all except just REAL GOOD FOOD! I will be back when i feel like eating bad for you food.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2015-04-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0Dbqtr1O6cM3B6NgJTYPBQ', 'review_id': 'tqXFsp6WR4FqgNc_jOtdnw', 'text': "one of my coworkers said to go eat at chicago hamburger company so I figured I'd try it when we arrived at the restaurant the menu was poor quality you couldn't tell what was on each burger any other side items. I figured and I'll see what the food is like. so I ordered a Philly cheese steak cheese fries and a soda and the best part of the meal was the soda. Can to around $13 for a Philly cheesesteak in order a cheese fries and the soda the Philly cheese steak was bland at best and the fries didn't even taste like they had cheese on them if it weren't for the yellow stuff that looks like it was liquid over the top I wouldn't have suspected that they were cheese fries because they also had no flavor. I will never eat here again and will never recommend this place to anyone.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 1, 'date': '2015-05-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'km1ebe6LhEAF11nruJUkww', 'review_id': '6p2BALwbz5o79KQaWRrK_A', 'text': "It was, ok. I'm not sure why they bothered putting a spoon in the milkshake, it was far too runny to use a spoon for. Besides being too runny, the milkshake tasted great and you could tell they used real peanut butter in it. The fries were thick cut and not very greasy but lacked any real seasoning and that is with the additional cajun seasoning I added. The polish had a great bun and the dog itself was pretty decent. The relish looked so radioactively green that I'm not entirely sure what it was made of. The two small bits of tomato looked great, but again lacked much flavor. Overall I would return if I was in a bind for some place to grab a semi quick bite of food as my $11 didn't leave me hungry.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 2, 'date': '2015-05-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QYACvb4Jfa7jXt1QVaWhhw', 'review_id': '8mP3K7AttTJ3L5ewQ-Azxg', 'text': 'Great place!  Excellent hot dogs and friendly staff.  Will visit again.  Want to try the beef sandwich next.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2015-05-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2R3GYgswoPRNZIIp-K2CEw', 'review_id': 'v3qTa8FbbqJ6dvq58GmxKA', 'text': 'Better then White Castle! I drive an hour just to eat here, by far one of my favorite places to eat .', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2015-05-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'f7Hv9J9GTTXd3XsfRgt3Pw', 'review_id': 'cCjQQ4BTKLaZKLWNWKk1Pg', 'text': "When I first lived in AZ I lived and wrked just up the street so this was one of those places that was great to hit.  We used to just call them Windy City Sliders.   Oh my gosh, fast forward more than 30 years  and I'm driving by after making a delivery to my vets office and I see this place.  Nostalgia hit and I had to drag my son in here.  He wouldn't understand but he might appreciate the place.\nI will say the expansion (?), location, or could it be the popularity of hamburgers that continues to draw a good crowd.  I don't recall it ever this busy.\nDuring weekday lunch hours parking is atrocious.  Street parking seems limited too.\nService is efficient and quick to answer any questions.  Food is cooked to order and then your number is called.  I had to go with the usual, a slider.\nSmall, thin beef patty with chopped onions, pickle, mustard, catsup, and cheese if you're doing a cheeseburger.  The bun is nothing more than a dinner roll.\nStill as good as I remember but I wouldn't call it great.  \nIt was a lot of special memories brought to the front burner just stopping in hear.\nWhatever happened to California Coolers and the original Bartles & James?", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 3, 'date': '2015-05-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'm70PZuRVNwgm1_IhQPXU3Q', 'review_id': 'YCW7fTee_zevX_IinwZ4pw', 'text': "I first came here in 1997 (different ownership ) & have grown up eating here. I want to say, it is just as awesome. ....but it isn't.  The beef quality isn't the same. The lemonade isn't fresh made in house anymore and parking is a joke.  \n:(", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 3, 'date': '2015-05-30', 'type': 'review'}
{'votes': {'funny': 6, 'useful': 6, 'cool': 3}, 'user_id': 'IDHrwv_RCildFvmfWTkj5Q', 'review_id': '2kULdVVTFbu9b4o0UJeoug', 'text': '2 stars because I would never come back,  there are better ways to consume 10000+ calories.   \n\nI am sitting in the restaurant writing this review.  I\'ve passed this place several times and the parking lot is usually full.   I figure with 4 starts on Yelp,  it might be worth a try.   I ordered the western burger and fruits.   Maybe I should have tried the sliders.  I\'m not sure.   The burger patty seemed like it was pre-made and frozen.   But what really killed this was the bacon that was as tough as jerky.   The French fries were uninteresting.   I wanted to enjoy this so bad.   I\'m a little disappointed I came here on a whim,  especially since I had left over Salmon cooked at home.   Oh well...   \n\nI feel like I\'ve been cheated out of "cheat calories".   \n\nReturn factor: 5%', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 2, 'date': '2015-06-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'eUxfgRoDRmVy-9-6kN2FQw', 'review_id': 'O4vpPkk6bTKx6iwfQEnWhg', 'text': 'I was in the East Valley and had to stop after reading the good reviews for real sliders similar to White castle. The order taker was friendly the service was what I expected from a slightly dive hamburger joint in Chicago. I ordered 1 plain, 1 cheese and 1 double cheese slider with everything. About 4 minute wait time and my 3 paper wrapped bundles arrived. I unwrapped them and all were squashed by the wrapping process but they looked similar to what I have been craving. After my first bite the disappointment began to hit me. The flattened buns were huge compared to the thin piece of beef steamed on re-hydrated onion flakes, there was no taste to the meat beside the onion and dill pickle slices. A little seasoning, salt and pepper would have helped, better quality beef and cheese with flavor is missing. I will give them another try when back in the area as they do have the process for making a traditional slider and am hoping it was just a bad day.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 3, 'date': '2015-06-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MvUyVDZY-bF91sxKn1ioRQ', 'review_id': 'NLBLvPiykLwVZLGZwVK-pg', 'text': 'Came here for the 1st time my husband been from Chicago , this made him feel at home .thank you ..', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2015-06-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'C1rD8CfTU9zlsThNJ-48hA', 'review_id': 'X5iYa-cAG2zzxMGjX_QyLg', 'text': "If you're a Chicago Cubs fan, this place is for you. This place has limited parking, but I was able to find a place. I am not a sports fan by any stretch, but I loved all the Sports memorabilia. Add to that authentic road signs and replica advertisements and this place has great vibe.  After gazing at everything on the walls, I was greeted by a great guy. I got the feeling of warmth and hospitable. I love that, since hospitality is lacking in many a place these days. The chili dog eating maniac I am, I ordered... you guessed it, a chili dog. For $5.55, I was expecting one of those 1/4 lb hotdogs, but, I was wrong. Granted, the portions were huge. My fries were perfect, golden brown and crisp. The wiener itself wasn't very big at all, but the portion of the meaty, hearty chili was enough to make up for it. I love the poppy seed bun too. That was a unique surprise. \n\nNow, I've been through Chicago many times on my tours of duty, but never spent time visiting or trying their cuisine. I only give 4 stars for this one reason... I wasn't crazy about the chili. I love the heartiness of it and the portion. However, though I taste an underlying hint of cumin, it is the overpowering sweet and tanginess of it I'm not too crazy about. I dare to say, I think it's Apple Cider Vinegar. Not sure if it's a family recipe or a Chicago thing, but I'm just not too crazy about that. \n\nAll that said, I will go back. My overall experience was a great one, and frankly, they have more items to choose from. I liked it, and no doubt, you will too.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2015-06-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QyaRZw5vrYkqXMkPd67OLA', 'review_id': '0IhgLlA8a3ojqtpkwuIEOw', 'text': 'Amazing food and service! Bobs bad ass burger is a must! The ambiance makes you wanna visit Chicago! Sloppy joes are amazing too. Great spot and Bob is personal and very kind', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2015-07-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'I7Udvzp8fqgvWqa--0P6Iw', 'review_id': 'pLU6HW-hzelqfvdSoTnCxA', 'text': "Was craving sliders and saw this place on Yelp so decided to give it a shot. The staff is friendly and the place is clean. I ordered 2 double sliders with cheese and chili cheese fries. The fries were ok, I do like that they put actual beans in their chili (as a Texas boy I grew up having it that way) but overall lacked flavor. The cheese is cheese sauce but was a little bland for my taste. Some of the fries were slightly undercooked but the order came out hot. Not sure what happened there. On to the sliders. As most reviewers of the sliders (I assume) I am basing my experience with White Castle, which by no means did I grow up eating but have had the chance to try a few times. These sliders are better in my opinion in comparison. Then meat is seasoned right and the onions are mixed in thoroughly with the patty. The bun was fresh and soft and the slider itself is topped with just the right amount of cheese. I definitely will be back for those Windy City Sliders, overall a 3 star review because the fries didn't quite hit the mark for me.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 3, 'date': '2015-07-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'fOIr9hrQI6TopnVskfkjVg', 'review_id': 'biC5v_0eIW2564REcDP1Uw', 'text': "Living in Arizona but living in Chicago many years of my life. I would say this place is pretty close to the amazement of Chicago's food. The Sliders were amazing juicy and fresh. I even broke my vegetarian diet or it!", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2015-07-21', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 0}, 'user_id': 'mDzMELsP_F-MQJUSJiT2ww', 'review_id': 'FGe3vumtkc317ufUZ2aHXw', 'text': 'Not Worth the Drive for a Chicago Style Dog...\n\nI had a craving for a serious Chicago Style Vienna Beef Hotdog. I searched for options on the internet, and read reviews for various places around town. Places way out in Mesa and Gilbert were an awful long haul for me, especially since one can never be sure how the reviews will actually stack up against the reality once you arrive and try the food. So I decided to make the relatively short drive over to the Chicago Hamburger Company.\n\nI had my first Chicago Style Vienna Beef Hotdog in Chicago, back in about 1986. I love the "pop" when you bite into the hotdog, and the flavors of the relish, peppers, and other ingredients that make a Chicago Style Hotdog what it is - especially with Vienna Beef inside. I have repeated the experience in Chicago over the years, and when living in the Minnesota, I found great places to go to relive those experiences. Fast forward to Arizona. \n\nI\'ve had experiences that were close, but not quite there. I arrived at Chicago Hamburger Company hoping for the real deal.\n\nEven as indicated in the ratings, this is not a place to go for pleasant ambiance. It is strictly you order food at the window, they make food, you take it with you, or sit at a fairly clean table to eat it. No frills, just hopefully, the taste you came to enjoy.\n\nThe menu was straightforward. There was no line, so I ordered my Chicago Style dog, and because they might be interesting, garlic fries. My food was brought to me pretty quickly at the table I had chosen by the front windows. I was glad I had gotten there when I did, because a line had formed, and was getting longer by the second. \n\nThe fries were loaded with garlic, which is a good thing, but the fries were so heavy and greasy that after eating two, I had to toss them. Good idea, but way too heavy. \n\nMy Chicago Style Dog had all of the right ingredients, including the poppy seed bun. The hot dog, however, lacked flavor and there was no "pop" biting into it. I\'m guessing that the hot dog sat in hot water for too long, and that the flavors were leached out and the texture compromised. For all the great toppings, that Chicago Style Dog was a bust. I ate it, but the experience was disappointing. \n\nThey had a sign up proclaiming their home made milkshakes, so I decided to try one to overcome my disappointment. I ordered banana, and only had to wait a couple of moments for it. As I drank it on my way home, I thoroughly enjoyed it, although it didn\'t quite fill the void left by the disappointing Chicago Style Dog,\n\nI\'m going to guess they are called" the Chicago Hamburger Company", and not "The Chicago Style Hotdog Company" for a reason... Maybe one day I\'ll go try a burger - but not another hot dog.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 2, 'date': '2015-08-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 1}, 'user_id': 'l9GGMi-zf2ZTbHbW8wrkTw', 'review_id': 'IG4JNydAWCNjru6rX8u1ew', 'text': "If you enjoy a good ol' burger dive, this is the spot! Service is friendly. Ambiance is very casual with sports decor. \n\nThey have both regular burgers, sliders and dogs. The patties are preformed but they cook them so that they're soft vs a hockey puck. The sliders are kinda like a castle burger. The full burgers have a good seared flavor. Buns are soft and squishy. Ingredients were fresh. Fries were basic but good. \n\nBurgers themselves were 3/5. Add in the the old school ambiance and friendly service and its bumped up to 4/5", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2015-08-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hlPnJ3uGf3yZ08hvdCvgSQ', 'review_id': 'hu4Ct71xjX6fG-ODyChAZA', 'text': 'Great food and reasonably priced. Had the Windy City sliders and a chili cheese dog. Comes with more fries than you could ever eat and the milkshakes are pretty dang good. Worth the drive for my family', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2015-08-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'ji5Y8Vj_tlBmHOlE-LUNiQ', 'review_id': '4JBecVLw8Ee_YAu-USWEuA', 'text': 'An awesome atmosphere with food just as good. Highly recommend the cheesy fries. Owner is very interactive with customers. Very good place to eat.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 4, 'date': '2015-09-11', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 1}, 'user_id': 'U2Ez3lMr3CHuNl8NFww4QA', 'review_id': 'mXn0-nux3EhJoNx-fty-2w', 'text': "If you're looking for an authentic Chicago food joint, this is your place! Don't expect anything fancy or healthy but expect your tastebuds to dance once you take a bite! My boyfriend and I stopped in here on Monday to grab some sliders for an afternoon snack (I know, SO bad but we couldn't resist! In my defense, I only had 1!). Oh my goodness, they knock my socks off every time! Each slider has grilled onions, pickles and cheese. I recommend getting a side of pepperoncinis as well! You can buy their sliders by the dozen for under $15 if you need to grab a quick dish to bring to a party! We will be back soon!", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2015-10-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'NmMhhVIirN-RW8xrAg6dVA', 'review_id': 'wei3M63W05lRtlM1k_noaA', 'text': "The sliders are the way to go. Nothing closer in Phx to white castle than Chicago Hamburger Co. The minced onions are perfect!\n\nBob's Big @$$ Burger is another favorite of mine.\n\nStaff is friendly and the restaurant has all sorts of cool Chicago decor.\n\nI stop in for lunch at least once every couple of weeks, if not more.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2015-10-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'XxdedhAXhzZv8AUL3coO2g', 'review_id': '1Uz1P7-Q71Ax1RI31tGong', 'text': 'Great food, great ownership; have been coming here for years and never had a bad experience.', 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2015-10-28', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 8, 'cool': 6}, 'user_id': 'AYGHNy8gPxl2Q-etTT3hZw', 'review_id': 'xzBCKY2ceRhnNYNtxOVj1w', 'text': "CHC is a valley institution. I've been a happy customer since I was a kid. Bob the owner is always happy to see you and is a great guy. \n\nAt CHC the sliders are the stars of the show. Get several and be a happy camper. Also don't miss their shakes and fried zucchini.", 'business_id': 'iNvY0zAlaD_ye7Z6rHu-Ug', 'stars': 5, 'date': '2015-12-16', 'type': 'review'}
