{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'YnU-qgATIaFB0EZy8KpuuQ', 'review_id': 'o2O7A6o_4L-RASKduwYcEQ', 'text': 'Small little place on the border of Scottsdale and Tempe. I always order the Gyro and a Greek Salad, very good. The service is good and George always has good music playing.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2008-08-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'pKMZ8ZoPYPq3NrtQVEQ5yw', 'review_id': 'cl6IPE1luzgy3_FGlKVGGQ', 'text': "It's hard to totally screw up gyro meat. I've generally been pleased any time I've gotten a gyro. I went to George's Famous for the first time last week, and I was more than impressed. I got the Original and my boyfriend got the Gyro Picado, which is really spicy with all the peppers and jalapenos. Both were really good, HUGE and like I sad, the meat was great. Apparently they make a lot of their own stuff right there. The tzatziki was one of the best I've had. George suggested I get one of the other dishes that has a Vodka Alfredo sauce next time. He said it's a favorite of the regulars. I forget what dish it's supposed to come on, but I'm sure if you mentioned it, he'd know! I'll definitely be back.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2008-08-19', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 2}, 'user_id': 'hYph1O9SCO3B5tFmqzdOSA', 'review_id': 'CkYmfcd1ceKirIn0eNUD6w', 'text': "Whenever I have a craving for gyros and I'm in the mood to just pig out at home, I head to George's Gyros for takeout.\n\nI've never eaten there so I can't comment on service but the takeout food has not disappointed.  The Gyros Picado platter is gyro meat piled with grilled jalapenos, peppers, onion, choice of rice or fries (my choice is rice), and a feta salad.  There's tons of food, it's really spicy with all the grilled veggies, and the feta salad is FABULOUS.  So good in fact that I ask for an extra side of it ~ and at $1.50 it's a great deal!  \n\nThe tsaziki sauce (spelling?)  is really good too & I love smearing it on my bread before piling on the goodness.  They usually give me about 3-4 containers of it if iI ask nicely.   It's 'divey' but,  the food's good so give it a try.  I'm looking forward to trying all the other stuff on the menu.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2008-09-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'TvWbfWzeH7eR9z_ERWH2gw', 'review_id': 'Wkj6M2mWcMwOIH-1ItpwDQ', 'text': "I discovered George's through my restaurant.com coupon.  My girlfriend and I ordered two original Gyros.  I had the fries and she had the salad.  We also ordered the fried mushrooms and jalopeno poppers.  The fried appetizers came out first.  And they were perfect!  We have had fried mushrooms in the past that were dripping in grease or still frozen in the middle.  These were absolutely done to perfection.  They were crispy and seasoned without leaving you feeling greasy.  The gyros and fries were also well done.  The portions were generous for the price.  This is my new Gyro spot for sure.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2008-11-15', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 4, 'cool': 2}, 'user_id': 'E83jZ7j07Hx-RcRiTbA_kg', 'review_id': 'weB_Z6Bf34Y_HLWWeYid0Q', 'text': 'George\'s Famous Gyros is located in a slightly ghetto strip mall next to a gas station, "massage" parlor, hole-in-the-wall Mexican food joint, and a mail box store. From the outside it may not look like much but upon entering the dark exterior you immediately find that this is quite the popular lunch spot! \n\nMy friend, Jillana, and I ventured into this hot spot at around 12:30pm on a Thursday. The tables were packed and there was already 6-7 people in line ahead of us. Despite the crowd our food was served in a matter of minutes and the owner, operating the cash register, noticed that we were new customers and offered up drinks on the house. A rarity for today\'s economy! The owner was extremely helpful and attentive (readily changed our order from din in to to-go and made sure we had plenty of napkins and plastic-ware before he sent us on our way). \n\nThe place itself is rather small but has a rather fun, lively lunch vibe to it. I always love the 80\'s posters of the attractive Greek bushy-eyebrowed brunette enjoying a big gyro :-) Not sure how busy it is around the dinner hour but it seems that this place will certainly not be going out of business anytime soon. \n\nMy friend and I both opted for the classic Greek gyro, costing only $7.30 after tax. Great prices! The sandwich was quite tasty. The meat was well seasoned, packed with flavor. The fries were quite good and my friend thoroughly enjoyed her Greek side salad. The only drawback was that the meat was a tad on the greasy side for my taste. However, this would not deter me from frequenting George\'s. Next time I would ask for extra tzatziki, there was some on the sandwich but I would have liked a bit more. Plus, I love dipping my fries in the rich creamy goodness as well. \n\nOverall, quite a good experience. Price, good. Service, good. Food, goooooood.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2009-03-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'FlQVCUaTh1Jd2Z9T039oKA', 'review_id': 'LhDvTGC8QRCj6R67kNbrEw', 'text': "I'm a big fan of this place. Sadly, I haven't tried that many dishes because every time I go in, I HAVE to get the gyro and the greek salad. I hope one day to be able to broaden my palate and report on their other dishes. \n\nThe gyro is good - YES as another reviewer stated, it's greasy. That's why it's yummy. Skip the fries, they are nothing special compared to the other two sides available. The white rice with tomato sauce is awfully tasty but the greek salad is my favorite and it's what I get every time now. Nice fresh lettuce and a variety of veggies! I'm so picky about that.\n\nDisappointment: One day while the cook rang me up for my gyro plate (Feeds 2 for under $10, you can't beat it) he was telling me how great his baklava is. So when I went to a dinner party the next week I stopped in and bought some to bring for dessert. Sadly, the baklava was not to my personal liking. It was chock-full of nuts as he described but there was not enough phyllo dough or especially HONEY for my tastes. Rather dry and nutty, not sweet enough for me. Oh well!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2009-04-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'px_I0vn2NiOHYmPbkFCIqg', 'review_id': 'Pz0jebjMdj4Ktlkj4jSFMg', 'text': "I had a great lunch here today.  Got the classic gyro, which comes with fries or a side salad, and a drink.  I think in total it was about 9 bucks.  The gyro was great...tender, juicy meat.  The fries were pretty good as well...sprinkled with salt and pepper and pretty crunchy.  It's always the best to put the fries in the gyro...adds another dimension to it.  \n\nI only had two complaints about my lunch.  The pita was a bit soggy, but nothing major...almost just a little too moist and chewy for me.  Also, it took a little while for the food to come out.  I was on my lunch break and a little strapped for time and was hoping it would be a quick lunch.  The place was packed though...so by no means am I holding it against them.\n\nAll in all a pretty tasty spot.  The menu was pretty extensive with different types of gyros and shawarmas.  They had burgers as well.  Definitely looking forward to going back for another lunch.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2009-06-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': 'TQPFdHk9IDIH0n9K4SllVw', 'review_id': 'tUE8qUhpTmTlrPEVMRL63A', 'text': "I lived in Portland for the summer and became quickly addicted to street meat in downtown. When I got back to AZ I had to find the closet Gyros spot so I could feed the addiction. Luckily for me I live very close to George's and he honestly makes one of the best gyros I've ever had. \n\nTheir greek salad/gyro combo is an awesome lunch, definitely hits the spot. And he'll give you a free drink every now and then if you don't order it. Nothing better than a gyro and iced tea on a hot phoenix day. I cannot get enough of this place! I looked it up online and George is only 27 and owns/runs this restaurant. That makes me want to come back and support his efforts often. Good for him! The rest of the staff are all very friendly and do a great job at keeping the service fast and quality!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2009-09-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'fmIE7XsIenncwgtGTUCWcQ', 'review_id': 'vG6IqXMy39BHkFpgaJQa3w', 'text': "I spent a crazy day running errands around Scottsdale and found myself next to George's at 3pm while returning a projector. The server was friendly and service quick. I took my chicken gyro and a Greek salad down the street to Papago Park. Highly recommended! It was a perfect picnic!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2010-01-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'XCdwv4WmVRrmoljNADGubw', 'review_id': 'ScCp-W_ioSMXriULbL0N_w', 'text': "What is there to say? It's a greasy little hole-in-the-wall dive that serves up great, hot Greek food at reasonable prices. Not sure I'd take a date here, but for a quick, inexpensive, decent lunch this place rocks.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2010-02-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'br7jwXG7TaWC1-vrZxResg', 'review_id': 'N84-cLY6Fa7_D87Z619_KA', 'text': "As many of you know, as a college student, our first priority is to save $$$ and get the most bang for our buck. Once George's Famous Gyros entered my world, everything seemed perfect! George's offers some of the freshest and most delicious Greek cuisine I have found in Arizona. \n\nI can gladly recommend their chicken pita. This comes with either a garlic sauce or a gyro sauce, onions, and a pita crammed with sliced seasoned chicken breast. You also have a choice of great tasting fries or a bomb greek salad. All this for $6.75.\n\nI also can recommend the cheese ravioli (cheese ravioli with marinara covered in melted mozzarella cheese) and the Greek pasta salad (rotini pasta with chopped vegetables, feta, with vinaigrette topped with either chicken or gyro meat.\n\nThe only downside to George's is that it's only open until 8PM during the week, open until 3PM on saturdays, and closed sundays. Being a college student, my schedule is pretty hectic, and I find myself eating dinner anywhere from 6PM to 12AM, so I generally frequent George's for lunch time. Another downside is the inside. It's pretty no frills, but what it lacks in interior design, it makes up in food quality and taste.\n\nI give George's an easy 5 stars when it comes to DELICIOUS and FRESH Greek food.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2010-05-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'gSBvJ5FqFeSKRJaPiamttw', 'review_id': '5PGliCW4WywSzfw6-a71vQ', 'text': "After eating here usually within 24 hours I am already craving George's Gyros again.  Georges is the best. Great customer service, great food, great prices and a great place to fill up on warm amazing food.  By far my favorite thing from here is the Gryo #1 Combo. Already cant wait to eat here again.  I used to come here with my ex alllll the time.  I miss living in the area!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2010-06-22', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 5, 'cool': 1}, 'user_id': '0qIsBt4EzBDCKrIviV55Ew', 'review_id': 'gLj924vFhZvxFQNM5uQZ6g', 'text': 'Best Gyros, Yearos, giros, how ever you say it its great.  And its easy to find George here working hard to make sure you get the best. \n\n"A SMALL RESTAURANT  BECOMES THE ANCHOR  LOCATION FOR ITS SISTER shops, HOW RARE"\n\nI have tried all the Gyro spots in the immediate area. Georges is the Best bar non.  From the meat quality to the portion size, the meat is not weighed out the sandwiches are expected to be more than enough. The fries are great and you can sub them for a healthy salad.  Lots of veggies and a great dressing.  \n\n"There is something to be said for a small restaurant that becomes the anchor location for its sister shops, how rare and exciting for the Valley.  Seeing a business succeed today allows me to value the spot so much more.  Thanks George, Your Gyros Are Famous!\n\nFACTS,\nmeats hand picked from Chicago,\nGreat Salads,\nBest Gyro judged on size quality and fresh ingredients.\nHigh turn over means consistent product.  \nThe employees lover their food', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2010-07-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VChMRGEsIC675BAjnzq4ZQ', 'review_id': '8uFPpYVhdBkqUEs9b-ZBqQ', 'text': "Sometimes, random yelping leads to great things. Other times, not so much.\n\nThis was one of those other times, unfortunately. I wanted to love this place. It rocks the divey-tucked-in-a-strip-mall ambiance that often signals hidden gems. But, to be perfectly honest, the food was average. \n\nWe started out with dolmades, which were crafted very neatly. The texture didn't tend toward slimy, like sometimes happens when they are done incorrectly. I had the souvlaki gyro sandwich with a Greek salad. The pita was so stuffed that I ended up eating it with a fork. The pork was still moist, but it could have been more flavorful. The salad was meh as well, but I'm fairly picky about my greens.\n\nHowever, I will say that service was incredibly friendly. I might give George's another go and order something else based on this alone.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 3, 'date': '2010-07-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'U5TnaAf__Bn1wbe44T4c_g', 'review_id': 'WP-TAIP-c5HRczT9fe31Wg', 'text': "Gyro platter was pretty darn tasty. Definitely get with rice over fries. Dolmades seemed wilty until you discover they're just coated in olive oil. The tzadziki sauce was very dilly but overall really good. Definitely a place that will become a regular stomping grounds for me from now on.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2010-08-04', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 2}, 'user_id': 'BJRmDTOPOOutKUl35g37Ig', 'review_id': 'zNdXPBsMoawIY5mdZe3zig', 'text': 'While everything on the menu is fantastic, I go for the Gyro (Yee-roo). It is, and I have explored Gyros across Phoenix, the BEST!\n\nThe place is clean and the music depends on the combination of who is working there that day. If George and Z, his friend, co-owner and cook, are on, you get an easy mix of classic rock and contemporary pop. If Geroge\'s father is working with George, you will get Greek music (which I love...stay long enough for the theme to "Zorba the Greek"). If George\'s father and Z are there, you get a mix of everything.\n\nWith the police station across the street, lunchtime is crowded but safe. Off hours is easy and the wait isn\'t long.\n\nFriendly and very reasonably priced with specials posted that one should not ignore. I hear great things about the chili. One day I will order a Chili Gyro. They may look at me for a moment, but they will make one and probably add it to the menu.\n\nFriendly and great service. Become a regular and you\'re part of the family. Opa!\n\n4/20/11 - Sigh! I stopped at George\'s on my way out of town, moving back east. My "last meal," so to speak and I have yet to find the equal anywhere. So, dear diners, enjoy the fine fare at George\'s because you may have no idea how rare the place really is.\n\nAt this point I\'m ready to ask him to FedEx me a dozen Gyros... not that I would freeze any of them. I would just sit on the floor and roll around on them, naked. Well, maybe not... but I would eat them all in one sitting!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2010-09-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'io5b3aooPSgC0gFpSSrqNg', 'review_id': 'c2SIQzuVthBom9BdTPnyAA', 'text': "This was, without a doubt, the best gyro I've ever had.  The meat was so tender and juicy.  I had the original and will probably have it again until I decide to be adventurous and try one of the many other combinations.  \n\nI had a good chat with George while my gyro was being prepared and appreciated him taking time to talk because my gyro was ready before I knew it.  It was just an all around good experience.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2010-10-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'thdVzCfKx-DV0zYWqId3pw', 'review_id': 'HW87LHdJbB5z5I_LIkMbZA', 'text': "A fantastic little locally owned dive in South Scottsdale. I can't count how many times I've driven past George's, but I never had a desire to stop in because the strip mall it's located in is pretty shady looking. But then I read all the good reviews and decided I had to check it out. I'm glad I did. \n\nThe menu (which is posted on the wall, and takes up a lot of space) is huge. In addition to the pitas, there are pizzas, sandwiches, pastas, burgers, platters, and appetizers (both Greek and American). The very friendly girl at the counter wasn't even able to tell me what the best items were, but that's because a guy sitting just inches away started to rave about everything. I decided to go with the Original Gyro (hey, the place is call George's Famous Gyros, after all. It's $6.75 and comes with a salad or fries (I went with the salad). I also tried the Baklava since the raving customer told me it was the best he's ever had.\n\nThe Gyro was phenomenal. As good as any Gyro place I've ever eaten at. It's all from Chicago, and you can taste it! It looks small at first, but you'll be surprised at how much meat the pita is filled with. I recommend paying the extra 25 cents for extra sauce. The Gyro is so stuffed with lamb, that you'll appreciate the flavor it adds. The salad is pretty big, but it's pretty much just a standard Greek salad. The Baklava was great, but pretty small even for it's $2.25 price. I would also suggest that George's drop the salad or fries and charge a dollar or two less for the Gyro a la cart. I really didn't want either, and would've preferred to save the cash. The wait for my food also felt a little long, but its probably because most of the food was made fresh, so I can live with that. I got my money's and taste bud's worth, and then some. I'll definitely be back at George's Famous Gyros to see what else is good here.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2010-11-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'OxvnYH2G4tmea-qCfDMs5A', 'review_id': 'BkLdHmov-EuNmOeEl8b-lA', 'text': "This place is great. Get the sauce, best I've had on a Gyro. Original is great. Can be greasy sometimes though. Pita is so nice and soft, and you could even split one gyro between two people they are so big. I always pound a whole Chipotle, but sometimes can't finish these.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2010-12-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cGTldbs4qWUuvsoDnypPuA', 'review_id': 'A1TZ0zn2rUcuS0_v3SGL4Q', 'text': "Tasty + cheap = win win.  They definitely don't skimp on the portions either!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2010-12-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8bcuymGpfe4EJr_FCKPpLA', 'review_id': 'JAofzkJlfd1KOE91-zpaHA', 'text': 'This place has great salads, fries, pasta and most of they gyros are good.  Today I had the veggie gyro and no bueno :-(  the veggies had a very burnt/bitter taste to them, and the liquid from the veggies made the pita quite soggy.  This is the first bad meal i have had at Georges.  I wanted to do this review to let people know that I would recommend everything EXCEPT the veggie gyro.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2011-01-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QuMyAHpC62CUzPBFZ9ll3A', 'review_id': '9rDs2lTQmRh16TAQBdD2Tg', 'text': "YUMMO!!! If you want the biggest, the fattest, the yummiest gyro then George's is the way to go!! My boyfriend loves it so much he hits it about 6x a month!!!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2011-02-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'AkJFqLqHHAKY3H5R8p7cPQ', 'review_id': 'uw8MkjjdTAT9WhjbDsqjeg', 'text': "I have driven by this establishment several times going to either my friend's house or the tennis courts.  My friend told me its a pretty good place, so I thought I would give it a try.  I entered the restaurant and saw a wide variety of choices.  I told the gal to give me a minute as it was my first time.  After I ordered, I got a free drink as a first time customer.  I give them brownie points for that.  In addition, I wanted to add a little hummus to my chicken pita sandwich, and I got some hummus for no charge. The chicken was marinated very softly with tremendous flavors.  \n\nNext time I go play tennis, I got myself a post-match yummy meal!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2011-02-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ofQg505JkGomCSeo1U2Gug', 'review_id': 'ta0vtAnZrIrVjZeJh6oGCw', 'text': 'I was thinking that a Gyro sounded good for lunch today on my morning commute. I was running my errands at lunch time and happened to drive by George\'s Gyros.  I decided to check it out. The young gal at the counter was very nice and took my order. I watched as meals were delivered and the portions were huge compared to ther Gyro places in the valley. I order the "Original" Gyro and not only was it a lot of food, but it was very tasty! I\'m adding this to my list of places to grab a Gyro! Also, the menu is very extensive. I highly recommend you go and check it out!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2011-03-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'x1RhqWY9ZeHFmJBD3sEdRA', 'review_id': 't_tEOOiPCKevxzZacSNZuw', 'text': 'Best gyro in the east valley! We have been their twice now and staff is super friendly and the food is awesome. It is worth the drive to stop by here. You will not be disappointed!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2011-03-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZRozha8njFVmlPLa2i3FfQ', 'review_id': '8cN7C0R5UnDtMYcqg8OpVA', 'text': "George's is the real deal. I eat here at least 3 times a month and we just recently had them cater our wedding. The gyros and chicken pitas are fantastic, and like another person mentioned, the tzatsiki sauce is unmatched anywhere in the valley. I've had their falafel, dolmades, hummus and pita, and the fried mushrooms and I would reccomend all of those.\n\nThe atmosphere at the restaurant is very friendly and it isn't uncommon to strike up conversations with complete strangers. The price is right and I'll definitely be eating there many more times in the future.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2011-03-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'NDfPHhQaHXnovTKoRjXgOQ', 'review_id': 'nzgp-j2sSD2K6m7D35MHIA', 'text': 'Wow.  This place has unbelievably good gyro, but I\'ve been here literally 75 minutes waiting for 2 salads to go!  There\'s no acknowledgment, either, just an overworked girl trying not to get yelled at by the hordes of people she mistakenly told "30-40 minutes".  I saw one guy go up and get a refund after an hour, and when he left what they said was "oh he got all mad and left."  Actually, he had a limited lunch break like we all do and I know he waited longer than I did! Don\'t forget it\'s a small place, and we can all hear you. We love your food, George\'s, but unless you fix the wait we won\'t be back!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 1, 'date': '2011-04-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'uO3pavwCb8ylw-aog3Mn6w', 'review_id': 'DXoCZ4HY05-LQgcwt1JTuw', 'text': "More like a 3.5.\n\nThe food is good, but the gyro and cheesesteak my husband and I shared were a bit on the greasy side.  Although that is to be somewhat expected with gyro's and cheesesteaks, I feel like they were greasier than gyros and cheesesteaks ought to be.   However, I would not recommend their desserts.  The service was also good.  The reason why I didn't give this place 4 stars is because it didn't really stand out in comparison to other places like the Phoenician (not during the summers), but it was definitely better compared to places like Oliveo.  \n\nI think I will need to give this place another try, however.  I will update as soon as I do.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 3, 'date': '2011-05-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8DEtfP9Fmp5X1DG6iTtXnQ', 'review_id': 'PY5R_8dcx8e01PpofVAIAA', 'text': 'A no non-sense eatery...you get your Greek on and feel great afterwards.  My usual is the traditional, nothing special but always delicious.\n\nI almost always get things to go as the place is normally sweltering hot, decorated with crazy random and old posters of the Mediterranean, but the food more than makes up for it.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2011-05-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '13xj6FSvYO0rZVRv5XZp4w', 'review_id': 'CGZLbYXW5H7bF956j4tNQw', 'text': "Everything here is great! From the Chicken Pita to the Pasta.\nGeorge is a really funny guy! You will have a great meal here and it won't cost you a bundle!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2011-05-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'tBvrnSCLSpUdCDm5w5GPkg', 'review_id': '48q7oiNI-GR4Z1pHjDvqVw', 'text': 'Outstanding hole in the wall place. Not much to look at but yummers! They are sooooooo nice here. The food is great. We both got Gyro plates and Baklavah and it was all delish! I would recommend this place highly!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2011-06-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'tDSDuMzwQiI44W8cfxU68Q', 'review_id': 'fJfGOFtBG1Qvs_GKlpzTBQ', 'text': "Damn, I love this place.  Best gyro I've ever had, anywhere.  Everyone that works here is friendly.  You'll leave here stuffed for under $10.  What more to say?  If you haven't been, you're missing out.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2011-06-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '0biMLw2xDuS5vapftFr_cA', 'review_id': 'Moa6i6S8fx0pStecjRNYpA', 'text': "This whole in the wall joint has filled my belly and put a whole in my wallet because I can't resist their traditional gyro. The price is right for these large gyros and sandwiches. Don't go here if you expect the typical elegant Scottsdale dining experience. This place gets down to the point and makes good food, while not worrying so much about decor and presentation.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2011-07-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'bodQhLlL78mNLmUCKoNv9w', 'review_id': 'w5bhLbg0Fmgh8nVzc9H7_Q', 'text': "Bro! Best gyros eva Bro! The service is terrific. The staff inside is friendly and and it's a very laid back environment Bro!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2011-07-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '6l1PGyH1vwmh28cavv3gzA', 'review_id': 'PfCZ5Z7uWftQjblOrQGfNg', 'text': 'Good food relaxed atmosphere. Would recommend!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2011-07-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qhaVQb48m-1K68oEzvv-6Q', 'review_id': 'iabZ6kTJaZbFsLa9RLQEjA', 'text': 'If you are looking for Gyros, this is the place. Compares to any top Gyro in the planet. The restaurant is clean and small. It takes a lil time to get your Gyro, so its best to call and order it 10 minutes ahead of time. One of my top places for a quick lunch with friends on the go!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2011-08-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5YPkeTC1KT8ofbm3MDrWeA', 'review_id': 'wM4AK4sWqS47crKfNaG8cA', 'text': "Just like Chicago's Greek Town!!!!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2011-08-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-KV5e7bFg8BipE2vnmWf8Q', 'review_id': '0ebaT-ZUwSB85zWzr732tQ', 'text': "Whoa... the gyros are filled with lots of meat.  In fact, I wish they put less meat and more veggies (e.g. - onions, tomatoes).  The good thing is you can get your gyros with a salad or fries.  I always get it with the salad to add some vegetables to my diet.  The salad is a greek salad with a variety of vegetables, not your typical iceburg lettuce salad.\n\nI wish the gyros meat was a little crispier.  Lots of meat as stated above and  the pita bread is warmed so it's nice and tender.  I always get a little extra tzaziki sauce because there is so much meat.\n\nBest to call ahead if you're in  rush.  Considering it's about 5-7 minutes from downtown Scottsdale, it's a nice alternative to eating there.  Also the prices are great, but the location makes you think you got lost.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2011-08-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QuMyAHpC62CUzPBFZ9ll3A', 'review_id': 'Isd7r0qfPpotvUgnWN0POA', 'text': 'Hey George! PLEASE Deliver from the Scottsdale location!!!!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2011-09-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bodQhLlL78mNLmUCKoNv9w', 'review_id': '0VPfMhDCTyzBMHA7VqhBlw', 'text': "George's is by far the best place for a Gyro in phx! The food is always great as well as the service. My favorites include the Picado and the Texas. Another reason I love this place is George himself is almost always there to great you with a smile.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2011-09-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UA3XhZftX14dgK4Hn9-COA', 'review_id': 'aCQCcm7HBpG3McO-eolsQw', 'text': "More than meets the eye... Ha HA!!!! I took my wife here for lunch and she about punched me when we walked in for taking her to a hole in the wall. I told her to be patient and give it a try. \n\nI can't speak to the whole menu, but I'm pretty much addicted to the Steak Pita. She doesn't usually eat meat but I wanted her to try the steak pita that I am in love with and also the fries which are most of the time TERRIFIC! I don't even care for fries normally, but leave it to George to serve some of the best french fries I've had.\n\nWell, she actually ate steak...at a hole in the wall...and liked it...a lot! Ha HA!!! I make her eat it (her words). I was right, she was wrong. George's is good. I don't have to sleep on the couch tonight.\n\nFYI, I like my steak pita marinated/cooked with the vinaigrette sauce and then I add ceaser dressing on top for even more flavor. MMmmmm...I can taste the onions, tomatoes, steak, and pita in my mouth dripping with flavorful juices and dressing. Yummy yummy yummy!\n\nThe chicken pita made the same way is great too. I'm just not a fan of the Euro sauce.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2011-09-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'lT5B7K8p57jQ9KlkwMkPmw', 'review_id': 'mLb8nSaOo7GKNKv3td-ZcA', 'text': "I grew up eating gyros (year o's). George's has some of the best seasoned gyro meat and it is consistently the same.  The chicken pita is good as well, but nothing beats the original beef gyro. The fries are fresh and the greek salads are bomb! I agree with a previous reviewer about the dressing being heavy. Just get it on the side. This has become one of my regular lunch spots. I have driven across town to get here. Not only is the food good, but the staff is friendly and make you feel at home.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2011-09-28', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'DrJnC62-eMRnFai6immsbQ', 'review_id': '95xpbzrZXjyotMNTrbD1pw', 'text': "I was in this side of town and was craving Greek food. Checked out the reviews and thought this would be a good place to try...but I was extremely disappointed! I can't believe I'm giving the first bad review on their food...\nThis is absolutely my least favorite place of all the Greek restaurants I've tried. They do have a young boy working the cashier/taking orders and he did okay for his age. The service was poor. I think this place lacks people skills. No one follows up to ask how your food was. Okay, yes...it's a small place and maybe the workers might be young, but that doesn't mean you shouldn't check on your customers. And they certainly didn't follow up to bring my baklava (that they forgot to give me in the first place). The food was...well...just like their service, it was poor. The food presentation looked great, but my taste buds just didn't agree. .:sorry:.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 1, 'date': '2011-11-15', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 1}, 'user_id': 'hdga42cwsk6je1X8kK6UGQ', 'review_id': 'Eb9CSLbzUa1LoQWEJfquyQ', 'text': "I love anything that's filled with meat and wrapped in foil.  And if it's the size of my head, even better.  This place fits that bill.  Chicken pita is amaze-balls.  Fries are bomb because they use that good seasoning.  Salad-also delicious.  I'm generally not a huge fan of gyro meat so I can't really give it a fair critique, but I've tried it and it's pretty good.  This place will deliver until 7:30 pm but I've never taken advantage of that.  You can call in and pick up your order.  Or if you just order while you're there, it doesn't take long for them to make anyway.  There's some handsome dudes working there sometimes that you can creep on while you wait.  And you get a free drink if it's your first time there.  Nice work, George.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2011-11-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 't2Em6xzwcBP5KSz_LGQMFw', 'review_id': '9bR3e7TmOE1Lx58dn1R_nA', 'text': 'Amazing, great, tons of food for a awesome price!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2011-12-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': '7E4kwOgsH4aKKRhdbtwJqw', 'review_id': 'l6yVx9n7UxZl0yzzJXuy3A', 'text': 'Really good Gyros! Very fresh and good. Really clean inside too. Nice atmosphere and friendly staff! Two thumbs up from a Greek!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2012-01-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_TNEe9Coftz6PtzvoHQHpQ', 'review_id': 'gJYX0HhiGtblwTrB4uJpWQ', 'text': "George's Famous Gyros is delicious, clean, and a great atmosphere for the entire family. I suggested the company I work for to cater from George's for an even and the food and service was perfect!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2012-01-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'sul0rJDvTT9QTMGiuA52WA', 'review_id': 'JEkFa5zvYVQ6doXaohmI0w', 'text': "The food at this clean little strip mall cave is straightforward and you really cannot do any better if you're looking for Greek-American food. A big part of their consistently good food is the constant presence of the owner.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2012-02-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mEgD2AGWGKD_gs-Jf3Ypew', 'review_id': 'IyFuns_pTwzp1n6qLgOVQQ', 'text': 'Took a while for the food but it did taste very good!  Luckily I wasnt in a rush so the delay for the grub was not a big deal.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2012-03-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pC9McxCam7biyjRSRJ-7Ow', 'review_id': 'v8RBEF-eA-54f3gr4lZedw', 'text': "wow this place is poppin! I went here w my fiance to eat and we met the owner George himself since he was working the register. We told him we were from out of town and asked about the different gyro's they served- He was so nice! he hooked us up w two sodas and the food was only $7! Huge portions and fresh flavors. Def coming back when I am in Arizona again! Great customer service.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2012-03-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'NfyrHToGY6aJu22U9oS8Xg', 'review_id': '1nV1o1s_wKC6jXzEARu-2A', 'text': "Great gyros with plenty of meat, fresh tzatziki and all at a reasonable price! It was our first time in and he gave us our drinks for free. Thanks again!\n\nAlso, very kid friendly and they didn't mind our little hurricane creating a masterpiece on the table and floor.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2012-03-26', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 1}, 'user_id': 'U_fAIe7CUaGMejwSdNvMgw', 'review_id': 'wgYyiFDUv80-aGYMndACyQ', 'text': "There are many reasons to frequent George's.  The overstuffed gyros come with more meet than a Dagwood sandwich.  The salad comes with more than three vegetables and fresh kalamata olives, not black olives from a can.  The staff is friendly in a local neighborhood joint sort of way.  Don't be fooled by a similarly named establishment on Scottsdale Road, this is the place that was voted Phoenix's best gyro.  I also recommend the chili either on it's own or with fries.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2012-05-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '6et33jlMdxRWG0vHt_hgOw', 'review_id': 'Ws1zf_QvOgRJYlYp4Wd0Mg', 'text': 'A whole lot less for a whole lot more and a whole lot worse has been known to happen around these parts.  Good job George, love your place.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2012-05-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'OksbhhgC71Ary3zNHMypeQ', 'review_id': 'r1yEQJziriV-LyJIhLqm8A', 'text': 'We did the "after-dinner" crowd since a lot of reviews said it was packed at lunch. Weekday dinner time it was quiet. A couple of tables and no line! \n\nI know the strip mall screams THIRD WORLD COUNTRY. Especially with the run-down Circle K and dirty sidewalks. So that loses them a star. If you\'re paying rent, as a tenant you should demand some cleanliness around the place. \n\nMy friend had the gyro but since I don\'t eat lamb, I chose a chicken pita. With only three tables, they still brought our food to the wrong table, plus my side was wrong. The food was good, not outstanding or fabulous but it was good. \n\nOne minus star is for having a DESERT menu. Don\'t we already have enough desert in Arizona? When I mentioned the faux pas, I was told, ya they knew. They just didn\'t want to reprint menus. Wow...', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 3, 'date': '2012-06-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'vtedgK7wCKBqRyPOh6alPg', 'review_id': 'uKH20yOXOq_AJCpVe-o3TA', 'text': 'How does a stop mall neighborhood gyros joint deserve five stars? First, by serving really good food. Second, by actually being innovative -- for instance try the corn fritters or the baklava. Third, by offering consistently friendly and courteous service that goes out of its way. Fourth, by offering large servings that deliver the ingredients you want, not just lots of fillers but lots of gyros or chicken; portions so large that my wife and I often share one main and a couple of appetizers and still take some home. And fifth, by doing all this with incredibly reasonable prices. A gem is a gem and five stars it is.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2012-06-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 2}, 'user_id': 'HOeDPrTZlOUu5LyBzMiIHg', 'review_id': 'OTVLxNASNLG7sHsijgdCFA', 'text': "Living in S. Scottsdale, I had never heard of George's Famous Gyros.  When a friend suggested Greek food, I remembered there was a new place in the Papago Center on the corner of McDowell and Scottsdale Road.  Well, come to find out that place is also called George's Gyros (without the famous.)  Sounded shady to me and seems like that place is trying to steal business from the original.  So, we took the extra few minutes to make sure to google and get the right place.  \n \nIt was my 1st time eating lamb as guilt always took precedence over the deliciousness of a baby animal.  But, when my friend insisted that we order take out I finally gave in. I ordered a Greek salad (instead of fries) along with a kabob and just in case I didn't like lamb, a side of (cant remember name) rice rolled in a grape leaf. \n\nWe placed our order over the phone and after 20 minutes we went and picked it up.  It was ready and hot.  George told us there was only about 20% lamb and the rest was beef.  The whole meal was delicious.  There was plenty of leftovers for a 2nd meal.\n\nI will definitely be back to George's FAMOUS Gyros.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2012-06-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '04IL-BzBN8WdOQEtYVoZ4Q', 'review_id': 'BycWALLvzCQb74_5cxnBlw', 'text': "I've been eating here for years. Excellent lunch place. Other than the falafel, everything I've ordered here has been good. The price might look a little high, but the portions are solid. Sometimes, they do get backed up during the lunch rush, but for the most part, it's fast. The restaurant is clean and the staff is friendly.\n\nI admit it's probably not the best gyro you've ever had nor is it authentic Greek cuisine, but it's tasty, well priced, fast, and they deliver what they promise.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2012-07-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'Q53q6U9ueOSEohqlOO9hGQ', 'review_id': 'Mm387MzHGGBkYKXfmZM3FQ', 'text': 'This place has the softest pita bread! The chicken pita is delicious and the tzatziki sauce is so good. Hidden gem!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2012-07-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_ki8TQWep4CJTfF4kzyMtw', 'review_id': 'AjYnsmmj52aNhVYw5xEhqw', 'text': "George's has the best gyro meat! It has so much flavor and is very moist. I've had it in a original gyro as well as a daily special called a 'greeksteak' [I believe] that is basically a cheesesteak with gyro meat. Both are awesome! I still need to try the italian style with marinara and mozzerella. The portions are extremely generous, I usually have leftovers unless I am super hungry.\n\nI also really enjoyed the hummus. They serve it with warm pitas, which is a great touch that sets them apart from a lot of other places. Also, the greek salad that you can sub for the fries is fantastic! I'm not a fan of fries with a gyro, too much starch, so it is nice to have another option.\n\nThey have a rewards program called Belly. Each time you eat there you scan your card and get 5 points. You can save your points and redeem for different rewards, like a free drink, free meal, or even creating and having a gyro named after you on the menu!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2012-08-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MPNFtwa6OGZcMJoB6b90iQ', 'review_id': 'GZCG512BVlP6lq4tOPrA1g', 'text': "Everyone kept raving about the Greek salad so I ordered it for an entree and I wasn't a fan. Then again I don't really care for iceberg lettuce, if they used some other type I would like it a lot more. I had a bite of the gyro and I was definitely tasty and there was plenty of meat. If I am ever in the area and I wanted a gyro I would go here for it. I do wish they put more sauce in the gyro but o well. My sister got the gyro with a side salad and the side salad was a greek salad which was still pretty big for a side. I have had better gyros in California though.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 3, 'date': '2012-08-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'l32_Qnelh1c-nuTU9VgOlA', 'review_id': '9sdNBIVYct-yNPhXMD5CgQ', 'text': "Hi All!\n\nThis review is long overdue!\n\nI have been to Georges numerous times, I have brought friends and family from Chicago as well.\n\nI have to say Georges is my FAV Gyros place around!\n\nThe prices are fair and the food is very good.\n\nI have only had Gyros but one of these days I will try something else.\n\nThe gyros sandwich comes with a choice of fries or greek salad.... I always get the salad, never tried the fries.\n\nThe salad is always a nice amount with a perfect amount of dressing...not too much but enough and it has feta, onion and even those yummy klamata olives.\n\nThe tzaziski is chunky and flavorful and is good for dunking anything in or eating plain.\n\nThe meat is well seasoned and ample and I have yet to be dissapointed!\n\nOne think I always look for when making repeat visits to any business is consistency and I have George to always be consistent.\n\nA few visits ago the owner brought my friend and I a piece of  Baklava to sample and I would have to say.....the BEST I've ever had!\n\nSweet and savory but not that drippy saturated sweet, the perfect end to a good meal!\n\nMy only CON is that it takes an unusually long time to get the food, therefore I am not sure I would go there for lunch if you are on a time restriction.\n\nKeep it up guys....you have rated high in my rating system!\n\nI do reccomend Georges and really think you should give it a shot.\n\nand until you do.........\n\nBon Appetite'", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2012-08-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ax9j01tovIaGSaGafraZjw', 'review_id': 'Mp7d4szm1C8D89Ll4ypVJw', 'text': 'The BEST Baklava I have ever had.  The BEST!!!!!!!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2012-08-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'm1Be6yOl8texdFfH337z7Q', 'review_id': '-GSzREXjQ99_H5KAlKLPZw', 'text': "Been here many times now. Food is absolutely outstanding!  Very nice people inside. Food is always so fresh. Excellent for take out though you can sit there and eat. Strip plaza isn't appealing but this place is a rare gem!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2012-09-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '5FfVSB5wUOlyTpj1AVzKXg', 'review_id': '2bcK1ukgXH76ePrUTgfFOw', 'text': 'The best Gyro place in Scottsdale, or Arizona for that matter.  Awesome, awesome food.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2012-09-27', 'type': 'review'}
{'votes': {'funny': 7, 'useful': 1, 'cool': 0}, 'user_id': 'Ja8FvcWiWHEXME2vmTPTkA', 'review_id': '8i90xuIlYzyLCReXxbttsg', 'text': "Drug use must be rampant in Tempe, or perhaps, there is a direct correlation between those who are high and those who review George's Famous Gyros on Yelp.  \n\nThere is absolutely nothing good about this gyro except the quantity of meat.  There is essentially a pinch of lettuce, tomato and onion.  The sauce is there, but without much taste.  I've had better food at the ball game.  \n\nI think I will quit med school and just open up a gyro shop because apparently there is no competition since no one in Tempe knows how to make a gyro.  I guess all the Greek paraphernalia is analogous to an incompetent doctor with a great bedside manner, just because you look the part doesn't mean you are going to deliver in the end.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 2, 'date': '2012-10-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'iWvmrl_UFWg18JGeSsOm-A', 'review_id': 'jRg17_DkVd3ZwKelgdVgSA', 'text': 'My husband and I eat here like its a religion, this place is awesome, and the owner is friendly and the staff has always been good to us.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2012-10-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '588oY8EejEFCr-ym_2TR0Q', 'review_id': 'DAF8HNn6gUMlU7N_vks4Cg', 'text': "Cheap eats that taste wonderful are a very hard thing to find these days.  Last night my wife and I had a couple gyros, hummus, salad, and falafel and the price was about $20.  Walk in to this place at any time of the day, and there are people eating here.  George knows his stuff when it comes to quality and affordability and I know that next time I'm needing my greek fix, I'll be knocking at his door.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2012-10-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bx6FGR3w_XQDeKu8653-Rw', 'review_id': 'kvKoQL8AwXdrJRDqH_l5bQ', 'text': 'The food is seriously delicious, the portions are substantial and the prices are reasonable!!  Highly recommend for a great meal', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2012-11-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'TocDkq1UljoZ9_Q0cR-3eQ', 'review_id': 'evAxgPi-8m4z7PPTMXU4Vg', 'text': "Can't beat their price or their gyros! Their salad is awesome too and believe me I don't eat salad often. Go for the beef supreme gyro!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2012-12-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'GiqYkbv7IqD_ICmrruJyRg', 'review_id': '4oKkJkFqd9kJvLSI7JsBcw', 'text': "I live only a couple minutes away from this restaurant so I'm a frequent customer. The gyros are, of course, excellent, but some of their other dishes are a bit mediocre. I would not recommend the meatball sandwich, the Chicago dog or the pasta, but I would most certainly recommend the gyros! I gave this place one extra star because of the friendly and cute staff. Their service will make you feel right at home.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2012-12-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KRy9uNhhe7D-RekObUmvOw', 'review_id': '9hZh6SEPNNsI5-qIDbSnOQ', 'text': 'I can only talk gyros and Greek salads.....the platter rocks. Forget the fries and go extra large salad for same price. Get dressing on side. Always is if you order out. Atmosphere is not anything to talk about, but gyro platter with extra large salad is!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2013-01-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': '7jWmd57QoJnq2q4QyvVS2Q', 'review_id': 'EWtWLAyvfjEQFpssQ50PoQ', 'text': "Went here for lunch because I had a craving for gryo. Was tempted to go to Haji baba down the street but decided to try something new. Called ahead and ordered the original gyro with fries and was ready to go by the time I got here. Have to say I wasn't dissappointed. The portion was huge with gyro meat piled high atop a lowly peice of pita bread. I had to take off meat and put it aside just so i could take a bite! Not a bad problem to have.. definetly a first world problem! The fries werent bad either for not being McDs. The gyro meat was well seasoned--a little greasy but who cares.. still delicious! I'll have to order a side of Tzatziki next time since the meat to tzatziki ratio was out of whack! I'll definetly put this on my list of places to eat when I'm absolutely starving!\n\nTip: Dont forget to check in through Yelp. I got a free drink out of it!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2013-02-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'JHmO-lVrHA0njKnQnZ8qLA', 'review_id': 'vhEz4cB2PGLZkSsq03yYXw', 'text': 'I went here for the first time tonight for an early dinner. I ordered the original gyro & Greek salad. It was delish!! I will definitely be back!  They serve it a little light on the tyziki sauce so you might want to order extra on the side.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2013-02-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Hn5kxQQ4dyjiBsvOgO6v5g', 'review_id': '7SfhBZptBCFhwFxEkgndUw', 'text': "Better then any greek food that I have had in Phoenix.  I don't say that a lot.  Will most definitely be back.  One critical thing is on me.  Next time fries extra crispy.  I was mischarged though according to the online menu.  (6.95 + 6.45) *.09= $14.60 not $15.14.  Oh well.  Great food.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2013-02-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8oiIZYQnHtlhwdMvsFwdPg', 'review_id': 'ozqW_NIY3lJHwd2BgD8TMQ', 'text': "This place, by far, has the best gyros I've ever had and I've tried them all over the country and in Western Europe. I'm so impressed and not surprised that this hole in the wall joint knocks it right out of the park as it should. This is no heartless chain or a lifeless spot of mickey mouse fare, this is where it's at. I don't care where you are in the valley, the state, or the region. Get over to George's without further delay!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2013-05-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'TS_CuJIjSeSapHAlUyw-Vg', 'review_id': 'MxUL-jRZnK3qYa0nw0d7Eg', 'text': 'Yelped it because my boyfriend and I were nearby and were craving gyros. Our verdict: Everything about this place is amazing! Super friendly service, really good salad, AMAZING Mac & Cheese Bites, and of course the famous gyros were good too! Highly recommended! :)', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2013-05-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5MK7Ar1LfQRswvn1N2W6TQ', 'review_id': 'aa2E4fBrJSysCar4g8_6dg', 'text': "Wow. Seriously. Wowwwww. Amazing food, great customer service, quiet location. Really outstanding. The restaurant won't knock you down with ambience, but it's clean, efficient, and friendly. Go to this place. Now.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2013-06-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'L3BZT4DOrIWIgVaUjnfWsw', 'review_id': '8KCzBDbmHSp0wDE2MkpJoA', 'text': "This place is just the best.  I've had the chicken pita, gyro, spaghetti and meatballs, dolmades, and the baklava.  Everything has been really great.  The baklava is the best I've ever had and the chicken is pretty phenomenal too.  I can't say enough good things about this place.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2013-06-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'V6oaaZWuqaULJc6gYD8P7Q', 'review_id': 'WnITruxQVhciATSNQgxgwQ', 'text': "I went here because it was a Sunday and the other George's that I like is closed on Sunday.\n\nWe ordered a salad and a gyro to go and waited almost an hour to get our food.\n\nFrom watching their kitchen during the long wait it was easy to see that they work very inefficiently. It didn't seem like they knew how or wanted to work on more than one order at a time.\n\nI really wanted to like this place because it's so close to where I live and I enjoy Greek grill food, but after this experience I don't expect to ever try it again.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 1, 'date': '2013-07-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PJY1J0xMPzMVvzC4R5b0HA', 'review_id': 'KEvd0Sr9thiVYGkSEDIThA', 'text': 'Good inexpensive gyros, sandwiches and salads made to order.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2013-07-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '9Yys5NXvYyKHADrfvlvPGw', 'review_id': 'yEfg0WT4NcV94ExLuwtH7Q', 'text': "I used to work nearby this place and whenever a new employee would ask me where to grab a good lunch I directed them to George's knowing they wouldn't be disappointed. I've eaten about 2/3 of their menu and almost all of it was great. My favorites include The original gyro (duh!), The sausage and Peppers sandwich, dolmades, gyro pasta salad, shrimp mikanos, the chicken pita (w/ tzatziki), the veggie pita (add tzatziki) or any of their salads. George, Z and the crew are friendly and always take care of their customers. \n\nI moved away to North County San Diego and man do I miss a good Gyro! Can't wait for my next visit home so I can rekindle my love for George's.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2013-07-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'iGyRh_cEmES430a232y4Wg', 'review_id': 'I8twQhncVfNohaJzyasVag', 'text': 'Georges Rocks !! Love the place and food.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2013-07-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Wtak9ZqDewUNXkHV44XlbA', 'review_id': 'bRSb9q5GI0D4AgdSa6F8HQ', 'text': 'YES! Simple but delicious... Ive had the gyro so far and it was pretty good. Im sure happy to have them around the corner.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2013-07-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KRvx3YeAa5MZZGDGHLXrIg', 'review_id': '-5Y8ZexcbvdFvcvtvXzXIw', 'text': 'This is a no frills place. The eating area is small and has little character..... but you don\'t CARE because you are eating some of the best food around. Tucked away in the little strip mall that can best be called "iffy" you might wonder what am I doing here? Get past that and order the original gyro and YUMMY!!! They give you a LOT of food. The fries are always hot and plenty of them. My wife and I often split a meal for lunch. They have many many choices. The chicken pita is great too. Prices are not bad either. The only thing why they don\'t get the last star is they close at 8pm, and around 7pm the choices are kind of limited. But who cares, get down there early and pig out!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2013-08-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'yDlBXvcE-QDrvwz1GkkGWg', 'review_id': '4r0j2ztFJeHcQmaulzLqDQ', 'text': "Great food, but recently, beginning July 2013 and through today (8/8/13), it takes too damn long to get lunch. Even when calling ahead and waiting 10 minutes to pickup, I'm still told it will be another 15-20 minutes before ready. WTF?!  I only have a 30 minute lunch break. I've had to skip the past two times trying to pick up my lunch due to unreasonable and excessive wait times. FIX THIS PROBLEM SOON.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 3, 'date': '2013-08-07', 'type': 'review'}
{'votes': {'funny': 9, 'useful': 15, 'cool': 10}, 'user_id': 'MOpFJnB5HyXdXW1sMwz7Bg', 'review_id': '4hV-h8PFYzvuRohDoFeasg', 'text': 'I was missing my old neighborhood in Queens (shout out to Astoria!) as I sometimes do, and found myself craving a Greek salad. Not just an ordinary Greek salad, but one piled high with fresh produce and charcoal grilled juicy chicken breast. I knew it would be a task to find one near my Old Town apartment, but one day BF had a gyro craving and off we went. \n\nAfter referencing Yelp, we had narrowed it down to George\'s Gyros and George\'s Famous Gyros (I\'m in front of Ray\'s pizza! Famous Ray\'s? No, just original Jerry!). We actually decided on the non-famous George\'s, but they were closed on Sunday so our decision was made for us. I\'m so glad we ended up here, though-it was delicious! \n\nWe ordered take-out and placed our order at the counter, so we waited about 10-15 minutes which ended up being just enough time to scope out the staff (who have fun with their job which I love!) and the location (with the office door marked "Pirate"). We also enjoyed the soda fountain-this is a Coca Cola establishment, hooray! And they have a good syrup-to-soda-water ration which is hard to find. Now, on to the food...\n\nBF\'s gyro was GINORMOUS and stuffed to the brim with tasty gyro meat. He gave me a bite (so generous!) and it melted in my mouth. He conquered half of it before saving the rest for later, which he said was just as good cold. The fries that came with it were good, but I will warn you that they gave us Hunt\'s ketchup packets, so make sure you have your own ketchup at hand if you are like me and have an aversion to Hunt\'s. \n\nMy Greek salad was even bigger than the sandwich-TONS of grilled, moist, juicy chicken on top of a *big* salad. And they accommodated my request for no peppers or olives (which, yes, I know, makes it not a "Greek" salad but whateva) which was really cool. There was an abundance of fresh lettuce and veggies, and it was more than enough for two meals. It came with two containers of an oil and vinegar dressing, and hit the spot JUST like my fave Astoria haunts. And it came with garlic bread! Super buttery and crispy and plain delicious. \n\nOh! And the kicker was that both meals came to under $20 including tip, PLUS we got two drinks for free since we checked in with Yelp. I will be back for sure!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2013-08-07', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'gqtKmTHz6549Z9NxJt4Ihg', 'review_id': 'l5xjoP20_KA1J2_IxLrOvg', 'text': 'THE absolute best Greek restaurant anywhere....did I mention I\'m Greek? Literally everything in this no-frills eatery, including the non-Greek pasta dishes, put any restaurant to shame, even the "fancy smanchy" expensive North Scottsdale Greek and Italian eateries!  I recommend anything and everything on George\'s menu.  George Salvaridis is a great guy who loves to keep you laughing while enjoying his food.  His restaurant partner, Zlatko Redzic, a Le Cordon Bleu (spelling? ) graduate,  makes every dish amazing, and mixes so nicely with all of his customers. We love this place and so will you!  Andrea Koukos-Paul....a very happy customer!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2013-08-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'FyY_lBFItdSHgRagaTVu5Q', 'review_id': 'nUol05_lthSGRoGKkLfoBQ', 'text': "This place was delicious. I had a gyro sandwich that came piled high with lamb. So much so that the next time I go back I'll order an extra pita for the overflow. There is no such thing as too much and I'll never say it was, but adding an extra pita will greatly enhance your eating experience. Along with the gyro I had some of their tasty, crispy french fries which I'll ask them to add a portion of to my next sandwich, an Israeli delicacy that I very much enjoy. Though I took the food to go, the atmosphere of the restaurant reminded me of something you'd find in New York, lots of Greek art and maps plus a mediocre movie on television. If you go be sure to check in! You'll take home a free drink. A+ on this place, I can't wait to go back", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2013-08-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'lerk-SVCPQCHxEiiSGjiAg', 'review_id': '2iradPsLkAU-dBrtCUk9Xg', 'text': 'Best gyro I have ever had. Tons of meat! Ask for extra "tzatziki" (sp?) sauce. Side Salad is fresh too.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2013-08-19', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 3}, 'user_id': 'kKg99LUWR5K4rFQJxlmg4A', 'review_id': 'e1rmYjaA5eAMlgadN86Nag', 'text': "There are some things you know aren't the healthiest for you but oh are they so good. George's Famous Gyros is a place around the corner from where i live so I indulge myself from time to time with their gyros. They truly are the best in town that I've had. The meat is moist and tasty (bordering on greasy) and stuff into the pita. You'll never think they skimped on it, it overfills the pita. Great stuff, that I wouldn't recommend having on a daily basis but man in that moment there are few things better. They really should get a mobile version of this and open up at 2am to clean up with the drunk crowd.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2013-08-19', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': 'tIdJ0rSVCz7nRrqQM-MAcw', 'review_id': '8GloLbePCJmm8XQq7vGvnQ', 'text': "This place is the bomb.com. one of the better gyro places I've had in the west coast, and the best one in AZ i've tried.\n\nNot sure what to make for dinner? Just go to Georges gyros and get yourself a half chicken half gyro platter with extra taziki sauce.  you'll have enough food left over to take to lunch the next day... they give you sooo much food. if you're feeling like a fattie for life like me,  get yourself a baklava for dessert. \n\nhelpful tip: call in advance. if you go in person and make the order you will end up waiting 15 mins or more.. they take a while to make their food.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2013-09-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-PHr50bCtdM9fcdLBUhMiQ', 'review_id': 'trIeqVlyZtGICdb31ozJxg', 'text': 'Must try -- Salmon Salad.  Unexpectedly of the best salads I have ever had!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2013-09-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'onXeKtjibadvw5uKh-6jNQ', 'review_id': 'EchXx46DqJ4r4-QvSG0n-A', 'text': "This place is one of a kind. Friendly staff and spectacular food. My son eats here at least once a week, and we (the rest of the family) eat here quite often as we'll. I highly recommend this to family and friends and to all of you", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2013-09-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZW8jy6ehrNzn9A5iCubVGg', 'review_id': 'ccDomo8gseG_KyZ2c4HcVg', 'text': "George's Gyros is the best! We gave it a try  a month or two ago and I have become a slave to their gyros since. It's quality meat and their bread is so fluffy and delish. I have attempted to finish a whole one and haven't been able to do so. They are really generous with the meat and its awesome because I usually save the other half for lunch the next day. I love their fries and they give you a good amount of those also. I love the original gyro but I have been smitten with the picado gyro since I love me some spiciness!  The staff is super friendly and it seems like they all work together as a team to keep the restaurant going. The cashier is very nice and periodically checks on how customers are all doing. She stopped and had a conversation and talked about how's my people become regulars (and I can see why!). I will be coming here for the rest of my life! Best gyros in AZ in my opinion!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2013-10-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'VDEcdH6o8IjtfWv7R5khaA', 'review_id': 'w3Fi-CyCXnAQl8wiIxjFGg', 'text': u"After reading all the other reviews, I was excited to try out George's with my husband. We normally go to Pita Shack in Tempe when we are looking for a good Gyro but we were on the north side of town and wanted to grab a quick dinner. Looked up some options on Yelp which is what led us to Georges. My husband ordered the Gyro with jalape\xf1os, onions and peppers and I ordered the traditional Gyro with a side salad. We also ordered some Spanakopita and 2 drinks. Honestly the best thing about the meal was the side greek salad. Gyro meat was cold... which was kind of a bummer as we waited just about 15 minutes for the two pitas to come out. What really irked me was after we had checked out and were waiting for our food, a group of guys walked in and the girl asked if it was their first time in and since it was, offered up complimentary drinks. It wasn't like they were busy when we came in, she was just very short and didn't feel like engaging with us. Maybe an off night for the staff and food, but I wouldn't be inclined to go back.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 2, 'date': '2013-10-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Vs6r_qruKjJ0QfHGm0hJqg', 'review_id': 'jwOjVnK1hyZij-E54e8y5Q', 'text': 'Stumbled upon this hidden gem. Try the chicken fettuccine or the pesto pasta with gyro meat. Big portions and the salad and bread stick is a nice touch.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2013-10-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tCikj7OgsTe5utgxMhEa8A', 'review_id': 'sIggOOohwx2nSQAV_72vCw', 'text': 'I go here every Wednesday with a group of friends. Great food, good customer service.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2013-11-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fjURYUigGP09LDMbPM_95w', 'review_id': '5XKcsqeBRkZ6egwBK22J1Q', 'text': 'I\'m a Greek American from Chicago. Where do I start? The chewy chicken? The bland tzatziki or the fact that "thank you" was spelled wrong in Greek on the menus? Mediocre Greek food at best. Lots of Greeks in Chicago. I\'m embarrassed to share this fact with these guys. Not to mention the customer service was lacking. I asked for extra tzatziki for my fries and got ketchup (although after tasting the tzatziki I\'m glad I didn\'t get it).', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 2, 'date': '2013-11-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yDlBXvcE-QDrvwz1GkkGWg', 'review_id': 'LM7mkqANANmtIHXEo0yGVg', 'text': 'Update:  they seemed to have corrected the problem regarding long wait times to get food. I can now call in an order, make the drive, and pickup my food in 15 minutes. This seems much more reasonable than how it was before.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2013-11-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1p-6nlv3itZusvdgbEwNmQ', 'review_id': 'a4eRz2WZh8fW6iD5jvcP5w', 'text': "If I'm ever back in the Phoenix area I will make a point of specifically eating at this place. Not only was the chicken gyro just fantastic, but the salad that came with was one of the best salads I have had in ages. I could eat a giant plate of just the salad. Not to mention that just $7 gets you a whole gyro and a generous serving of said fantastic salad. If this place opened a branch in Seattle I'd be there twice a week. Just delicious!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2013-11-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'E97TraK012OTjWKthRMMGA', 'review_id': 'qSxW22kegDTtYPFdoWeeXQ', 'text': "The WORST service ever. Went there for lunch and order a plain Gyro with sauce on the side and a beef.  45 minutes later I still dont have my food. I heard the cook say he lost our ticket and the girl at the front desk found it in the garbage. At that point our ticket should have been placed in front to get our order out with only two orders in front of us. Instead it was placed at the end. \n\nThere were 3 cooks...come on! 3 cooks should have been able to get this order out on time and correctly. \n\nWhen I questioned I got every excuse in the book. I was told all the orders in front of us were called in. When I mentioned that I saw they lost our ticket she gave me another excuse. I asked for my money back and she said our meal would be up next then gave me two free lunch tickets. \n\nTwo more orders came up and went out so I asked for my money back. She then had the audacity to ask for the free tickets back. Never apologizing for the wait just saying basically it was our fault for not calling in the order.  Our food came up so we took it however when we got home the order was wrong anyway. \n\nBoth the Gyro and beef were DRY. No sauce on the side as asked for and no juice for the beef.\n\n I may have given them another chance had they apologized, gave me the free lunch cards and maybe taken the desert off. The girl up front was so rude and NOT customer friendly that I will never go there again and anyone who asks...I will tell them the food is just OK at best but the service sucks so bad they shouldn't go.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 1, 'date': '2013-11-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'FPB64eOZfsSrlqy8mKb8Cw', 'review_id': '4z6AZPbciuKIsmDnCK0kiQ', 'text': 'the food here is awesome! the only thing that could improve is a remodel or a really good deep cleaning all over and repaint.  the bathrooms are always gross too but the food quality always keeps me coming back.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2013-12-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ZubK3U5PlTWy4VIQG_Wpzg', 'review_id': 'Oef7zolYK3l_cb_KKTKmKQ', 'text': "If you are in a restaurant before closing time they should serve you. It's pretty much just good business and customer service. Apparently this place isn't aware of that.\n\nMy dining partner and I walked in at 7:54pm yesterday (12/18/13). The door was wide open, all the lights were on, people were inside eating, and the gyro meat was still in the rotisserie in the kitchen. No one was at the counter so we stood around deciding what to eat. Someone working there came in through the front door, so he wasn't even IN the restaurant. He immediately told us they close at 8, which it now was since we had to wait. We were turned away and walked out the door at 8:02.\n\nWe went down the street to Philly's and gave them our money since this place didn't seem to want it.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 2, 'date': '2013-12-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'gBcW5_ILchNjHMH55rg25w', 'review_id': 'hSBHebw2mSyZNyQzXISuUw', 'text': 'The menu is great the gyros are huge and amazing best one in Arizona! The inside of the restaurant could use a good scrub and some fresh paint so I always have to get my orders to go but the sandwiches are worth it!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2014-01-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'SIGjXC8FCuX8yGPVD2ZH0A', 'review_id': 'yR4Lks8NKfbIcUgnYFEgHQ', 'text': "This place is legit.  Their is another store with the same name in scottsdale but trust\nme this place is way better than the other one in scottsdale.  These people are Greek and the other store is a bunch of mexicans working their not Greek.  Don't be fooled go to this one!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-01-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uIj3DSFEoixRfAROnSc1OA', 'review_id': '35llZ-PkEBmvKV7yPmIplg', 'text': 'This place is amazing. I come here almost on a weekly basis. This is the best gyro place in ariozna and you have to come down here to try it. Also, staff is really friendly nice', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-01-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'btLssxZq0qOFKKBbYP8L6w', 'review_id': '7tnjXPuFL_RVHMXS9IRnow', 'text': "For what you get, Georges can't be beat.  At least in the valley.  The gyros are huge, affordable and very flavorful.  The staff is always friendly and helpful.  They make a good hot dog too.  I dig it.  I'm a simple man.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2014-02-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '3vML-LnH0dIyHCrqF5xEYw', 'review_id': 'nJN-Apqg1NcRufnJ2P4NKg', 'text': "Oh man, what can I say??? YOU MUST go here!!! The food was delish and awesome servings. Customer service could be a little better. I got the gyro salad and it was amazing, very filling. The gyro was also very good. If you're in the area, stop by, you won't be disappointed!!!!!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2014-02-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0dJ5poCwpMlNHuAxun_LdA', 'review_id': 'rDIVea5oswJKdJkfwEsvAQ', 'text': "This is the really deal Gyros. I'm from Detroit and grew up going to greek family resturants. The food is great and the staff is awesome. I love small places with staff that makes you feel like family.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-02-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '6WJHk3E4PLt0-EXakw5Kdw', 'review_id': 'JhWHAUlDfTHp5bdPEIhRJw', 'text': "I don't know what they put on the chicken in the Greek salad - but it's damn near magical.  I get carry-out from here usually once a week.  So far I've only had the Greek salad, but can't wait to try other stuff when I feel like splurging.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-02-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'j2GS4iC94ie908VnybGkuQ', 'review_id': '3n91532NkinlyRYuLb1crQ', 'text': "Great spot for Gyro's. Straight to the point and great taste.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-03-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'P1fXuGmbdTz_jfEZLbWYcA', 'review_id': 'rxdal68dKjg1CSLQf0xPoA', 'text': 'As a first timer, the food was good and the customer service was great!! On a side note, there was no ice in the soda machine.. And they were out of their baklava before 2pm. . Which seems odd. Either way, good food!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2014-03-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'e_edTlBKdTQF01-thcxi8g', 'review_id': 'HZ2EpkybNWhkcyNV4VoA4w', 'text': "This place doesn't look the greatest from the outside, and upon entrance the friend I brought along was really hesitant to stay. Despite the somewhat seedy atmosphere, however, the girl who took our order at the register (I believe her name was Katie) was extremely kind and helpful in describing the dishes and making suggestions. We sat at the tables outside after ordering, and Katie brought out our orders along with napkins and utensils. \n\nUpon receiving the plates, our first impression was amazement at the incredible amount of food we had been served. We then were under the impression that we had died and gone to heaven after digging into the absolutely delicious food. We ordered a Chicken Supreme pita sandwich and a Gyro Platter. Both dishes were pretty standard in cost as far as gyros go, but like I said, we got so much food for what we paid for! There were also bottles of Sriracha to use, which I always appreciate, and we also got free drink coupons from checking in on our Yelp mobile apps. \n\nThis place is a MUST! The meat was seasoned and cooked to perfection, and the tzatziki sauce was fresh and flavorful. Both meals came with salads which were incredible and very authentic, full of different veggies and topped with feta and a great oil dressing. We chose rice to accompany the platter which was basic white rice, but was the ideal complementary side. We also had the fries with the gyro which were thick cut and addicting! \n\nI would highly recommend dining here  to anyone and I look forward to returning and trying additional dishes from the menu. The only advantages that their nearby competitor Oliveo Grill holds are the option of delivery and being open late (George's closes at 8 p.m.), but other than that the food at George's Famous Gyros is above and beyond!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-03-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'i0e9FmpbakmNVt18cgZx0Q', 'review_id': '8IjTNN1wtYv6m9fFbc_iRg', 'text': "Been coming here for a while and the food is always great. Best gyros in tempe. If you haven't tried this place you must come, you won't be disappointed!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-04-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Hb49IsEZltm85wLz3uMrmw', 'review_id': 'wIeo0lDGKJlmPsaNZDw1EA', 'text': 'This place has fresh & delicious food. I did a take out order and waited 15 minutes but there was 5 orders ahead of me. The foodwas very hot and awesome . I will be back to try some other menu items.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2014-04-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SlExu-bSlQYltsodoB7ZOA', 'review_id': 'uS4Eqqac5LjhLFXIyt_GIQ', 'text': "On the way back to the Phoenix airport, George's Gyro's came up on my Yelp.  Willing to give this place a chance! We did have a plane to catch, so we were a bit rushed; service is a tad slow.  Full menu of gyro's falafels, hummus plates, salads, burgers, Chicago hot dogs, pasta dishes (seems unusual for a Greek place) and more.  I had the falafel pita and the Greek salad; pita was fresh, falafels were home made and delicious.  the Greek salad was tasty, greens, dressing, olives, feta, etc.  soooo good. Husband had the chicken sandwich, it had a nice charbroiled flavor and a good marinade, very good.  Sis had the hummus, very tasty, too bad we had no room for dessert!  Place is clean and friendly, service was a bit slip b manageable.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 3, 'date': '2014-04-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'MLWMXmi4AVG-L1sMImwb5A', 'review_id': 'uxFJf9kGPH1aU6zzQ2cpVA', 'text': 'Great, cheap, and just a plain knock-out lunch spot.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-05-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'T1SXQ2lkMdTFAaAYbazTcg', 'review_id': 'xojgYCvXZEzoz6ZNom3d3w', 'text': 'Best gyros in the valley! Amazing food. Fast, Fair, and plentiful! The service is an order taker, cashier, server and bus person rolled into one great young gal, who does it all with a smile and a quick fun wit.\nWide menu. Some of their pasta plates are fantastic in an old school way. Chicago Greek food at its best in Phoenix.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-05-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CDZlTpRi2uhNJ_8gGw2OaA', 'review_id': '1Dgx5Pj-x9L_sy4TlmYQQA', 'text': "Best gyro I've had in my life, and I've tried finding contenders. The rest of the menu would also leave you hard pressed to find something you weren't happy with. To top it off the owners are great guys and big supporters of first responders, military and the community.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-06-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'efUhnLfWHF6eCJ_d3vpzsA', 'review_id': 'smJPWdYOUoDYaO_w5P_CXA', 'text': 'Fast and tasty sums it up! Love em!!!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-06-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'AMD_DZ56lX4Q0vRzUR-H_g', 'review_id': 'YdEui0VQ8gZC_t2beZIs0A', 'text': "notes to self: Great deal. Super cheap with huge portions. definitely not health food, but it is tasty. The gyro picado has grilled peppers; the Texas gyro has bbq sauce. I'm curious about the Athenian stir fry...why are there no pictures of that\n\nMaybe it's obvious but it may be faster to order a salad than fries", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2014-06-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'lKq-XHxxvuGMT2hHLjiCkg', 'review_id': 'wnHT01Gk4C8NmIEHbX9prA', 'text': u'Staff were super friendly and very welcoming when I walked in. Received my free soda upon checking in. Jalape\xf1o Gyro is a must try and exploding with flavor. I will definitely come back soon!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-06-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pkX3McRFpdyrYHiDdFOWxg', 'review_id': 'tmfamrstPd-lwivMIhrk_w', 'text': "Gyro and gyro supreme=wow. Chicken gyro=wow. The hummus and appetizers are just ok, but if you want to experience a great gyro, you will not be disappointed. Honestly, I don't think I can I get a gyro anywhere else now because this is just so good. Don't let the kind of crummy strip mall scare u away. If you're in the area, check it out!!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-06-28', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'c9YbD_z_rIlc0XrrqgaGtw', 'review_id': 'Njg6xJ8XBstUvWqq5QZCNw', 'text': "I wasn't too impressed with George's when I first walked in, it's an older building and the location isn't impressive, but after trying their gyro supreme I can't go anywhere else! This was the best gyro I've ever had. They seem very authentic and their chicken gyro is amazing too. I don't know what they do to their meat to make it so much better than other greek places but it is unreal. Their appetizers are good/average but their gyros make this my go-to place for greek food.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-06-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JlIFNlISvKrjMHgj1PiK1w', 'review_id': 'iT0rA7BG6pF59nxtKZwIaQ', 'text': "Love the gyros and salads. Can't beat the customer service, everyone is always so friendly amd welcoming!!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-06-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'bkR1tRtCi5ZG4qbdYM-LYg', 'review_id': 'pWl1eJ-Mtf5EH1dHCJ7P1A', 'text': 'Let me just say: WOW!!! How have I only just now been to this place? If you love Greek food, look no further.\n\nWe stopped in today for a quick bite to eat and were not disappointed. You know how I love lists, so here is a list of the things that we loved about this place:\n1. Easily the best gyro meat we have ever had. Flavorful. Tender. The ideal texture. Just. Muah! *kissing motion*\n2. The fries/salad were also awesome. Taaaaasty sides.\n3. Generous portions. Holy cow, the gyros were gyro-normous! I almost had to use a fork!\n4. The tzaztiki (I am butchering the spelling of that word) is out of this world. It, like the meat, has incredible flavor and texture-- not too much dill flavor/very creamy/not too thin. I\'ll take a bucket to-go, please.\n5. There are  red and green bell peppers on the Gyro Supreme. YUM! \n6. Cheap. Cheap. Cheap. The prices at the place are ridiculous (in a good way), considering the caliber of the food you receive. We paid less than $20 for two of us. Can\'t go wrong with prices like that.\n7. Family owned/local business. We were able to meet the owner (George). Loved that!\n8. The decor. This tiny little hole in the wall place has really adorable styling inside. \n9. Free drink when you check in on Yelp.\n10. Only 5 minutes from the house.\n\nAll in all, this discovery was a complete win. While we were there, Rob (the boyfriend) actually used the word "out-%$@king-standing!". Seriously. That good.\n\nWe will be back ASAP! Thank you, George!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-07-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oFrtsn4tZz3QuFxCz6tpNQ', 'review_id': 'GMa59-E0dh_CshWYMH8XJw', 'text': "This place is delicious! I was down the street at Goodwill when hunger hit. The gyro was packed with more beef than any other gyro that I've had, and it was flavored and seasoned perfectly. I disagree with other reviewers who say it looks like a hole in the wall - sure, its not your typical HUGE flashy restaurant, but they have a very welcoming staff and George himself is working there, ready to have good conversation. If you're hungry, give it a try - you won't be disappointed!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-07-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'F4Cqtg-tTr6yfeCGzWeOKg', 'review_id': 'y1eP2emZ01YzZ6rv2NPm1w', 'text': "One of our favorite places to pick up dinner to go. So many options on the menu, and everything I've had has been delicious!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-07-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Knf6inuNOkyXpXe2cittpw', 'review_id': 'NA_m6cL8cAt8osWbjSq0lg', 'text': "Awesome awesome food!!!  Sooo good! \nKatie rocks! Don't know how she does it. She's the hottest lil' multi-tasker I've ever seen. I'm a permanent customer.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-07-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CnIIuP9IBwRSEe5lgcGRwQ', 'review_id': 'na7mvf-OgBxpY9fa8zpLNw', 'text': "Awesome food!  Takes a bit to get your order, but it's worth it.  Great for take out or a very casual meal out.  DELICIOUS", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-07-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fHBD9l80uh4zy_-8TSOPqw', 'review_id': 'bpYAJyyaR7TWsOG-TLfFHA', 'text': 'This place is great. The food (gyro, salad, and fries) was awesome. The girl at the front was very nice and professional.  The owner was very nice as well as he told us about the food. \n\nThe desert (baklava) was very good \n\nThe atmosphere was good as well. No complaints about this place.  5 stars for sure', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-07-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dXWizeAdQpnDUSKXnA5b-w', 'review_id': 'u1ygc2IAcUvafjVPDGq9uQ', 'text': 'Bit into a piece of metal in one of their gyros and fours days later I ended up loosing half of my back left molar.  I went back into the store to tell the manager about the dilemma and I was told "tough luck."  The girl that works the front is a sweetheart and when I explained what happened, she said that another customer had a piece of metal in her food too the week before.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 1, 'date': '2014-08-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZPYqDNoZ1qirGCl4uIY9pQ', 'review_id': 'gmtikyNXKe6yuXzC2Xb2TA', 'text': "Was craving a meatball sub and came here based on the reviews. Got it to go and it was out pretty quickly. It was about $7 for the sub and a side of fries. Got back to work to eat and it was still really hot and the cheese was all melty and the fries were still crispy. The only thing I'd change is that the marinara seems to be all poured on the top but not inside the bread. I like my meatball subs a little more saucy, but overall it was still good and a pretty decent price. \n\nThe girl at the front was super nice, and I didn't think the appearance is all that bad like others are saying. It's in a small strip/plaza but it's not like shady or gross outside. I was not intimidated in the least and I think inside was fine too, it's a smaller place but I'd prefer that over a big commercial chain any day.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2014-08-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'o3f_fZVVMV_Q3JRkkivzHg', 'review_id': '2TJnldFCH5IFp_mSHx1SbQ', 'text': 'This is my go to place whenever I am craving a gyro, and let me tell you, once you have George\'s, you will crave these gyros too. Not only are they delicious, but the portions are huge! So much bang for your buck! This place also has consistently great, prompt service. The owner is super friendly and down to earth. The girls who work the register are always smiling and give great suggestions. If there are any issues with the wait time being too long, they will give you a free drink to make up for it. I\'ve even seen them give free drinks to people when it\'s their first time coming in. Definitely going the extra mile.  A bit of a "hole in the wall", but by far the best gyro you will ever have!!!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-08-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7egDEinq1f0E8oDP4hqfHA', 'review_id': '1i9K11Fq7yFKaOnGcCxICg', 'text': 'Friendly staff and good food.  Been here multiple times and never had a bad experience', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2014-08-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'abQYa4mv84puUkc0zoGEew', 'review_id': 'hdqtxoPyIn0rxR26WAucXQ', 'text': 'The place is poorly ventilated, The decorations suck, The staff  may have a grumpy attitude... But the gyros are so damn good it does not matter!!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-08-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VMb9ttg8RoPTykbyTg9KNg', 'review_id': '616sp5YWdlYO8MBrh0qZXA', 'text': "Best gyros I've had in this state, lots of meat, the steak one is absolutely delicious, baklava is nice, crispy and rich. Prices are pretty good and the portions of salad and fries that you get with your Gyro are more than sufficient for the money. Great service and food, I just moved to Phoenix but I still find time to get to Old Town.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-08-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9LEClQcWZLdeBH1o81sUOg', 'review_id': 'B7Y1Vn1Sz8uUNrx4gYVFzg', 'text': "Nice environment, laid back staff. We got an Italian gyro and Picado gyro. The meat and ingredients were excellent but the pitas were stale. Probably won't go back :(", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 3, 'date': '2014-08-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4Y5lLrERPek83aQPcJP-NQ', 'review_id': 'mpMAJEfmYPZAturH1tk6pg', 'text': "The Bomb!! Greek food usually tastes the same wherever you go, but once you go here all the rest can't hold up. I don't know what it is but all their food (I've tried many items) is excellent and I eat their about every weekend. They recently upped their prices slightly but it's definitely worth it. The gyros are the best I've ever had and they jam it full of meat and toppings. Don't let the unfancy inside bother you, it is the best Greek food you can get in Arizona.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-08-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ca_o11m1Pcfe9rlca2mwJQ', 'review_id': 'jxQQoTub498IyrxLmTtGVQ', 'text': "This place is terribly greasy. You guys should go to Mediterranean Cuisine in Gilbert,  AZ. I promise you, they have Authentic Gyro, hummus (they bring out a massive plate with real authentic hummus), baklava, and freshly squeezed fruit and vegetable drinks. There place inside is much cleaner and nice. Great service also. Don't waste your time and energy going to george's famous gyros, it's greasy and makes you feel so heavy and bloated days after.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 1, 'date': '2014-09-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tCikj7OgsTe5utgxMhEa8A', 'review_id': 'AJVFD0VZ1-3WP1O-DeJpXw', 'text': "This is the type of restaurant where you can quick bite to eat hassle free. The wait for food is less than 10 minutes. The inside could be a little nicer but it's not bad. Obviously the food is amazing", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2014-09-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'scTqXL9o6yIFJCRYSB80SA', 'review_id': 'ulc2lmeelzX_-D5IgnJulQ', 'text': "The best place to get a gyro. Everything on this menu is outstanding. Try everything, you won't be disappointed. Not only having amazing food the staff is great. The employees have great attitudes, are very polite, and love being helpful. The atmosphere is very fun and enjoyable as well. Promise it is the best gyro ever. It's like you are I'n Chicago for your lunch or dinner.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-09-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ki71iAFTxsPPQfX430c99Q', 'review_id': 'nN93e9mvQVHp6PWTkrCvgA', 'text': 'The gyros are pretty good, but I would skip the hummus.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2014-09-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZcMNIIyAt5q5TCf5sxmNEw', 'review_id': '4xplofeO2K-24Zc_mqJPPA', 'text': "I've tried the chicken pita w extra diced cucumbers; tried w both a Greek salad and another time with fries. Both very delicious! Best fries!  Had the pita with siracha sauce and yum, added the extra kick of flavor with every bite! Hubby had the gyro and said it was to die for! \nEverything is reasonably priced! Will be back for sure and definitely recommend to everyone we know! Staff is very friendly!\nThey take online orders, too, which is very convenient. They will text you immediately with pick-up time!\nThanks for the wonderful food and great experience!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-10-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'vHoKL-4FCgGSfDrPr43Opw', 'review_id': 'W6TeInvRXPkqktoEyWQ9hA', 'text': "I ate here 2 hours ago and am still stuffed. The guy working said they aim to make you waddle out, not wall, and they succeeded. Oh my gosh it was all so good. I had the chicken platter and subbed hummus for the rice. The hummus was very thick, different from what I am used to. The chicken was a tad dry, but good when mixed with the tzatziki sauce, which they make in-house. My husband said the original gyro was the best he's ever had. And I am not normally a french fry girl, but couldn't stop eating them off his plate. I was curious about the meatballs, and the guy behind the counter brought out a sample for me and the hubs to try. Delicious it was, as well as the sauce on top. Great service, too. Nothing fancy inside, but overall great food.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2014-10-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4bY0OOzObSH8Yjp5E8qj1A', 'review_id': 'qh4LgDaGcMANJUlAPB2zWQ', 'text': "Man oh man! I've gotta say that since I discovered this place, I can't get enough of the food. It's funny but, I'm determined to try every single menu item. For the past two weeks, I've visited almost everyday, which is something I've never done w a restaurant before. Hahah! The cashier, Tyler,  has been helpful in making decisions when it came to items I was unfamiliar with. His customer service and friendliness is top notch!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2014-10-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Vxp9-2Sm67C9Q_EnpqIdcQ', 'review_id': '_cPLfFx7IywieZEDoHjP4w', 'text': "I live around the corner from George's! Excellent food and service every time. I am a meatball sandwich critic and I would say they have one of the best in town!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-10-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'z38S0cV6RkPDWgWA67hb_w', 'review_id': 'UyqfroTFD_pqcTjrH9wWtQ', 'text': 'I eat lunch here along with many people at my office about 2 times a week. The food is perfect, quantities are large and the price is right on spot.\n\nThe best part is the service and Kathrin who is there everyday I go is always the best.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-10-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pitcseZJ_USj3tS5i1x9dw', 'review_id': '6YHTn2S6z3-79rIJAGqa2A', 'text': 'Love love love this place. Food is delicious and the girl who works the front is just so sweet and friendly!!!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-10-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8vAnI75H-Awq1Qa3hopQMw', 'review_id': '7mt-l_h3rZZAnWVzEHXZkQ', 'text': 'Best gyros I have had outside Chicago. Definitely worth the trip. I will definitely come back.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-11-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'O3F9oWq1WAVdw7v6RMTBAA', 'review_id': 'CgCbIFPTe9d2eN5o1oQxlg', 'text': 'Amazing food at a great price! I great little neighborhood find!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-11-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Sdj97Asyp2P8MIP1etB6ug', 'review_id': 'Ay3tYclv_TvpVhNv6lTQAQ', 'text': "I am a huge gyro fan, and these guys did not disappoint! When we walked in we were greeted and all our questions were answered promptly. They even let us sample the meatballs that they raved about. I ended up ordering the original Gyro. There was plenty of meat balanced with the regular veggies. Having french fries with a gyro is a must and their's are pretty good. Overall, we had a good experience.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2014-11-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3U2qakfROY1qoAtcyRJc_w', 'review_id': '6_-4FVX0igFMmnlzs6F7BA', 'text': 'gyros, gyros, gyros... but I love the hot dogs the best. wait! no the deep fried mac n cheese. yeah that is it. That is my favorite and they work with the Belly app!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-11-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4bY0OOzObSH8Yjp5E8qj1A', 'review_id': 'bTji_9Kc_Etng1B6TQFMJw', 'text': "I can't get enough of this place. Everything I've ordered since discovering this place has been uber yummy. Katey and Tyler (cashiers/servers) are always kind, friendly, and helpful.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-11-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'Qvr5glP5aUctOvUbBWVKVA', 'review_id': 'y63yD9DnuZHRN1i611op9A', 'text': 'Was looking for a quick place to eat and i LOVE gyros.  So this little hideaway on McKellips between Scottsdale and Hayden was buzzing with customers.  (Fireman anyone?)  My supreme gyro was FULL of thinly sliced beef and loaded with vegies.  The bottom of the pita had lots of feta which I love.  The tzatziki sauce was also flavorful and gave it just the right amount of moisture and taste.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-11-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'eXeuQQWxhBVEWSEYELd74g', 'review_id': 'XjJl3EmmeqTeR1sm3mawsg', 'text': "Best gyros around. Chicken Caesar Pita is awesome. I eat here at least once a week. Portions are large enough you won't be asking for more. Always greeted by name. Belly app makes coming here frequently even better. Free drink or entire meal, the more you come the more you get from Belly app.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2014-12-11', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 3, 'cool': 3}, 'user_id': 'XTFE2ERq7YvaqGUgQYzVNA', 'review_id': 'EhN51JyiOUfdRLnDNnsN7Q', 'text': "I don't know... I just can't get in to this place. \n\nI was reinvigorated to George's greatness by re-reading some reviews. So I scoured the menu and pre-ordered a falafel pita for pickup. \n\nAs I remembered the service was not necessarily friendly, nor rude, either - simply adequate. \n\nI paid for extra tzatziki on the side for my side of fries.  The tzatziki on my falafel pita was so sparse (not close to the quantity in the 1 ounce side container) that I had to get some salad dressing to cover the pita with to make it edible.  Less than one slice of tomato was chopped up and 3 medium sized pieces of iceberg constituted the other pita ingredients.\n\nThe fries were mostly nicely spiced, and awesome with the tzatziki.  The pita?  Sucked.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 3, 'date': '2014-12-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '8KKUnoYOGRs8nMQLbwoFfA', 'review_id': '60TGYbgUeuQIyPzLqUOA0Q', 'text': "The food is ok. Very greasy though. I think the high review is for the large portions and cheap price. I'd rather have good food than massive amounts of it.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 2, 'date': '2014-12-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '1uhipArheEVbwWyoAbKAGg', 'review_id': '2JEQPdte8pgY2U0XK9JDaA', 'text': "Went in tonight for the first time and damn it's good. Ordered a regular gyro and fries and the gyro and tzatziki sauce are outstanding. The girl working the counter was very friendly and funny. I will definitely be going back.\n\nEdit: I should note that I haven't even finished eating yet, it's that good.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-01-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'qKfceRHpoYNIDV1HryX_hw', 'review_id': 'lxaU467c9C7hAElSZ36RXg', 'text': 'My tummy is happy!\nfave: Gyro Picado & Spaghetti with sausage and marinara sauce', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-01-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'i1fdEhds-IRcRDDN9aGsLg', 'review_id': 'WVZHs-g0Y0Pf9SA9CxMoeg', 'text': 'I stopped by after reading some Yelp reviews. The place is not big but most of the tables were full of people when I arrived. The gyro sandwich was very tasty and hardy. The side salad was a meal in itself. I would recommend!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2015-01-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'LM8KKro5TIQn8ernG4DH5A', 'review_id': 'cQqUZeduqvk92eorND4NPg', 'text': "Shout outs to their Meatball Sandwich.  It's the meal that makes my tastebuds (and my feet) dance. \n\nI'd even recommend heating that baby up the next day.  The sauce is gushed in the center of this carefully crafted sandwich and cut in half.  That means if you're full, just accept defeat because it aint going anywhere! \n\nNow the reason why it's a 4 star is because my wait times always longer than suggested.  Not my fault I'm trying to make moves.  \n\nThe fries are less than desirable.  I've been there twice and both times I end up throwing away my meal without finishing them.  \n\nFinally, the girl at the register.  Holla at me.  \n\nLeggo", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2015-02-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 4, 'cool': 2}, 'user_id': '4CgusCZkipvUhvBZrRD46w', 'review_id': '5pWZHIfcGPp8RZuFuZcrRA', 'text': 'Here for the first time letting Yelpers be my guide.  Wanted Greek spinach pie in the worst way as I hadn\'t eaten it in a LONG time.  George\'s is a simple store front restaurant where the menu is literally on the wall for all to see.  If you have questions you can go to the cashier/server.  We didn\'t know that she doesn\'t come to the table to take your order. So we kind of sat around staring at the menu/wall.  Then we had questions and went up to the lovely Katy, the young lady at the counter.  I say lovely because she was helpful and attentive and she thought we were a blast.  Hey, anyone who likes us that much can be called "lovely".  And yes, she really was.  \n\nOrdered the spinach pie which only came in appetizer portion and a pork soulvaki sandwich with fries.  Hubby ordered a pasta dish with green peppers, chicken breast and a garlic sauce.  His came with a huge side salad.  Everything appeared fresh.  The appetizer portion of the spinach pie had 6 triangular pieces.  Not so small for only $4.50.  Amazing.  \nMy pork souvlaki sandwich served on a pita had onions and tzaziki sauce.  The french fries were well done as I had asked.  Pasta dish was enjoyed by hubby so no complaints there.   My sandwich was large enough to bring half home with some of the fries along with 4 pieces of the spinach pie.  What I am trying to say is that this place gives you portions.  No skimping here.  \nMy only issue with my sandwich was that the pork had too much garlic and oregano.  Hubby thinks there is no such thing as too much oregano but you Yelpers out there know that too much of anything, especially oregano can overwhelm the food.   Hubby had no problem with the garlic and oregano in his dish as he found it to be dee-lish. Then again, it could be just me--everyone doesn\'t have the same palate.  \n\nSo here you have it.  A simple greek place that doesn\'t take your order but smilingly brings it to your table and gives you great portions for very few "drachmas"  \nGeorge\'s provides a good value in a clean and friendly environment.  All you Yelpers couldn\'t be wrong.  Thanks for the lead.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2015-02-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': 'y6TszIl9rQiO9vWUUJJJZQ', 'review_id': 'IG1az14QD4ZYHNmPdbCfpQ', 'text': "I really like Georges, and it's just around the corner from my house. I almost always eat in, but the last time I had take out and the fries had suffered. Boy did I wish at that moment I hade gotten the Greek salad instead of fries. \n\nThe Gyros are always great, though unbalanced as the meat to veggie ratio is a tad off consistently. I don't want to ruin it for the meat lovers because it's off in favor of meat, and needs a bit more on the veggies, and sauce. They are always the same, every time, and I guess that's a very good thing, at least you know what you are in for.\n\nIt's a big menu with pastas burgers, salads and appetizers, plenty to choose from.\nalthough I always seem to stick to my favorites.\n\nService is always friendly, just like most favorite neighborhood joints that care about the customers, no complaints there.\n\nThe only real gripe is no matter how busy or how slow they are it's always 10 or 15 minutes to get your order. Again very consistent, so you know what to expect. \n\nGeorge, if you are reading this know that my critics are sincere and I think you have a great place! thanks again, as always!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2015-02-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wzRuzTTpDX7ZOjt6WggVFA', 'review_id': 'hHQdGGcgXt3WqUerAiGQ3g', 'text': 'Food was good, fresh and fast.  After having the original gyro my wife said, "I don\'t want it to end," a phrase I have not heard her utter outside of the bedroom!  I had the Greek salad; while the base was a bag salad mix, the vinaigrette and other ingredients were delicious.  The burger patties (which my sons ordered) are nothing special (but hey, it\'s a Greek restaurant, not a burger joint) but the buns are homemade and topped with a delicious Dijon mustard.  I\'d say stick with the gyro menu items (duh) and you\'ll be happy.  Restaurant was clean and orderly (George was bussing the tables himself!).  The only reason it\'s a 4/5 is because of the bagged salad mix and what I think may be store-bought hamburger patties; otherwise great food!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2015-02-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LHjiREftxNGA3Yt0kpuzxg', 'review_id': 'tz2js8Q_ddQN0gxTufUEsQ', 'text': 'The best gyros in town!  This place reminds me of the great mom and pop Greek joints in Chicago.  My wife and I drive out of our way frequently to grab a gyro plate.  I have not been able to find a better Greek menu in phoenix area.  They have killer gyros and meatball subs.  The baklava is great too!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-02-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ITlZjI1cKXt1606nLBUeCQ', 'review_id': 'K8qomNRapKxPqDtNld0rUg', 'text': 'The strip mall may not look the most welcoming, but the food is great! I called them for an order and the food was ready to be picked up within 15 minutes. The staff is nice and accommodating.\n\nI recommend the tzatziki starter!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-02-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XEZwxtUgOOC8g7ZGhyZdHA', 'review_id': '-XX4xmiVXUr1vZZ8_6fNAA', 'text': 'Love this place for a quick bite or some awesome take out.  Every gyro is delish and the folks there are great.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-02-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SV3a4ofJi4X0Ipuj7yORhg', 'review_id': 'SvtQJUNjhGmnv3TLixf1nQ', 'text': "Its my first time going here with my beau. And the gyro with the side of salad is amazing! I wasn't able to finish the whole thing tho, but I brought home the left over for lunch the next day. And maaaan! Its amazing as it was yesterday. Definitely a recommend for out of towners.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-02-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'd0wJVf7Gv7v1B-HHYhxZtQ', 'review_id': 'y-WtJsgZzEG7tl1gNtCbxQ', 'text': "I've been here a few times, I can't believe I never wrote a review.\n\nTheir gyro sandwiches are solid.  They really stuff the sandwich and its nice because its not super greasy.  I've had their steak sandwich too - its weird how they package it kind of like an open faced sandwich, but it's decent.  It's chopped bite sized pieces of sirloin.  They season it pretty well but its a tiny bit tougher than I like.  The fries are decent though I like them crispier.  Everything tastes pretty fresh.  I kind of prefer the greek salad which they do a great job with, and you get a lot.  \n\nThe baklava is also a wonderful addition to your meal.\n\nI wouldn't get the chicago hot dog or anything, but other items are priced well so you get a pretty good value for your money.  The food is freshly made, seasoned well, and portioned nicely.  The wait is a bit long if you don't phone in your order ahead of time but this place is definitely a try if you're in the neighborhood.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2015-02-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WwdbQR0cZkkZ-Mn1121KOQ', 'review_id': 'MAMgJVDq7gdcPaYsmwPeRg', 'text': "Great Greek place with solid gyros. Fair prices and large portions. Good service. Not the best gyro in town, but it's really very good.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2015-02-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'Nz6Qv5ZCkFsSWW0OMNhAMQ', 'review_id': 'LM5_e34DXORbj0vdi8U0VA', 'text': "Every time I go to George's I always say that will be the last time. This time will definitely be the last time. The food is good but the wait is extremely too long. \n Cannot recommend anyone going here unless you have one hour to waste.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 1, 'date': '2015-03-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'GhOkV_amPw-TpXAFIY1tiA', 'review_id': 'P9m-lx7rMV-wcA9R89tXlw', 'text': 'Food is good, service gets to suffer if they get busy, order online and save the wait', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2015-03-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'ODmAwk74wipFEfE4gYBrRQ', 'review_id': 'aHyAIblpsL_Oq8CmKId9Mg', 'text': "Just tried George's and my wife an I were impressed. The food was great, and the prices reasonable. \n\nThe cashier was nice and talkative, and only as we were leaving did we realized it was the owner. Nice guy, tasty food. We'll be back for more.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-03-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'm_X3EuJVW-q5UhlG6CCDzw', 'review_id': '_SDtOQ3ps6dL9X-CapLN6g', 'text': 'Great food. Always on point and the staff is full of wonderful personality. Katie is the most recent, of many, employees to help me fill my belly. This is a neighborhood staple!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-04-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Olyvhl7mAo3pkLhp9wq6RA', 'review_id': 'mBfKsODPaPjyd4-wkTb0LA', 'text': 'I like this place. Also I think the review with the hot girl saying "And you get a free drink if it\'s your first time!" is hilarious. hahahaha \n\nAlso, call ahead with George\'s, this place is always busy and there is a wait. Use that shiny phone you got and call in your gyro.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2015-04-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WFvYKaCI6l5g6z59cnAYkw', 'review_id': 'G7qIEZbRi3Nd1Oucr3t-ww', 'text': "The best gyros around. I'll pass 5 other spots closer and come here. The food is great and the service is awesome!!!!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-04-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '2KSD42GxE7mOUtDyO3iQ-A', 'review_id': 'hssB11S2jAAHhoNPacUqSw', 'text': "Went there on my lunch break with a co worker for the first time and the location wasn't far from work. I got a salmon salad with a side of onion rings and it was good but the wait was so long. Our lunch break was 30 mintues and it took almost half an hour for our food to be ready. We were late getting back. Now I know to call in in advance for pick up. Not thrilled about the wrong wait.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 3, 'date': '2015-04-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UKs_r-VtpLAa6pbUgzjKyg', 'review_id': '6-wV0rNjO5fXYf7j-mkGrA', 'text': "I enjoy George's Famous Gyros every few months.  It is not very close to my home or I would go more often.  Always clean inside and very impressed with the young girl at the register who also brings your meal to your table.  Katie is her name.  She is consistently full of energy,  happy, and eager to make the lunch or diner  experience great.  Refreshing to have that kind of a greeting and service.  I sure recommend this restaurant to my friend if they are in the area.  Chris F.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2015-04-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0Z3y3CoPTJGe9gRXgJNIMA', 'review_id': 'shx6Sau2G6Scd8FftmRMmw', 'text': 'If Michael Scott opened a restaurant it would be called Mikonos. This place might be better though. More than just Greek on the menu. Tastes good!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2015-04-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8T0evnkvRaTomru7ghPGeg', 'review_id': '1YY5m2c92sl6By_JWnZPNQ', 'text': "Ordered the gyro with side salad and dolmades.  Salad was good...could have had more.  \n\nDolmades were meh.  They were served cold and didn't really taste homemade.  The tazatziki served with the dolmades was mostly flavorless\n\nGyro was meh.  The meat was ok...nothing special.  The pita was ok...again, nothing special.  Again, the tazatziki was mostly flavorless.  It was also place on the pita vice on the meat.  The pita managed to soak up whatever moisture (and there wasn't much) was in the tazatziki.  The tomatoes and onions were also placed on the pita, vice the meat, which in turn obscured their flavors.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 2, 'date': '2015-04-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nL4QufiB7bmRrP-oV14L4Q', 'review_id': 'o_FxJQJBCykuVmZXAQXHKQ', 'text': "So.  Much.  Food.  So naturally, yes, I loved it.  The Original Gyro is a gyro, packed with meat and with a crapload of fries.  Or salad, if you're into that.  If you're a big eater, get the platter.  For two bucks more, you get basically another entire gyro, along with a full plate of salad.  Food was tasty, and the service was quick and very personable - he came by to serve us our food and even stopped by to check on us and how we were liking our food, a very nice touch for a fast food place (I'm not sure if this falls under the fast food category, but it's not a sit-down restaurant, so let's just go with that).  It's a little out of the way for me, but definitely worth the drive!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2015-04-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zYRUEdDH1stDLgpsBxvwEg', 'review_id': 'zhB8lgcadAZ9ejUz1DqH-Q', 'text': "My family and I have been eating at George's for years. Between my entire family we have tried everything on the menu at least once. The Original Gyro is wonderful and comes with your choice of fries or salad. Their chili is also great..... I love taking some home to make chili dogs the next night for dinner. Some of the dishes I would recommend are:\n- The Original Gyro\n- The Chicken Supreme Gyro\n- The Club\n- The Fish\n- The George Pizza\n- The Shrimp Pizza\n- Mac and Cheese Bites\n- Pickle Fries\n\nYou really can't go wrong. George and Z the owners are great people. The atmosphere is very laid back and kid friendly. I would recommend this restaurant to anyone as there is a variety of foods to choose from. They offer great food at a reasonable price in a reasonable amount of time.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-04-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'X72_TZm2dnrXok6gX6hX1w', 'review_id': '9jsqdTZF8kyJtcdov7bWsA', 'text': "Well the ambiance isn't much to look at. Plastic silverware and paper plates don't help but the food is absolutely awesome. I had the gyro platter and my friend had the steak platter. Both were excellent. The pita bread was great and the hummus was some of the best I've had. I highly recommend this place.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2015-05-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'V0eyg4fE5N5xhGy8wauqNQ', 'review_id': 'vcH5rzg1TJkVs923Ivs35w', 'text': "Great food. Great people. Had the pleasure of speaking with the owner's son. Very nice guy, told me the history and that his Greek family has a lot of roots in Chicago. I spent time in Chicago and this particular restaurant is authentic as you can get in the U.S. Amazing.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-05-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Uj40Euddax8Tla63PqEIMw', 'review_id': 'aKqlJPIZw5hgWY2Es4kpdA', 'text': 'Great place for lunch. Girl at the front desk is very friendly. I always get the Italian beef w/ mozzarella & fries (less than  $10). I think their seasoned fries are worth mentioning also. Will come back regularly.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-05-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yL8tmPRvPx7PFvEaWdWYTA', 'review_id': 'Rdui0sN-JesBjimnVB7RUw', 'text': "Believe the hype. I take friends and family here and everyone raves about it. The platters are a TON of food, and it's a two-meal-deal for me! Don't let the hole in the wall looks scare you away... George's is the place to get a great gyro in the area. It's quickly becoming one of our favorites and it's always on our short list.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-05-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'poVxDmOPrxbnmvKp6eCs3Q', 'review_id': 'kTkokocMgdw3V23ga6UGyA', 'text': "I am lucky to work across the street from George's. Picking up or eating in are fast for those in the go! Bonus: you can now order and pay on Grub Hub, so it's even faster!  Now, be prepared if you hit the lunch rush to wait.  This place is jamming during that time with all the local businesses and contractors.  I highly suggest pre-ordering!  Bummed they close at 8, but they've got lives too! \n\nThe staff is always laid back and friendly. George is.the.jam. He's super nice, hilarious and appreciates his customers.  There is always something cool on tv, be it new or from days of yore. His business also always contributes to our yearly Christmas charity for kids. Decent.\n\nOk, to the food. There is nothing bad on the menu. The gyros are great. The salads are great. The pizza and pastas are great. My favorites are the spanakopita and the dolmades.  Though they are appetizers, the abundance of food makes for a great finger food lunch as well! Not feeling Greek? They have American and Italian selections as well.\n\nTo the reviewer commenting on the cold dolmades, if you have been in AZ a while, you may notice that most are served this way, especially since they are not meat dolmas. I will tell you this...if you want something a certain way to which you are accustomed, just ask! The staff at George's will certainly oblige if you want your dolmades hot.  I make changes and omit ingredients all the time and they are super cool.\n\nIf you enjoy basic Greek, you must patronize this establishment.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-05-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '3tmioHBB285d8wbp7caCgg', 'review_id': 'Z8TJr1F9YXOXHh9QBwKthQ', 'text': 'Delicious food. Fast service and the fried bread pudding was amazing. Service was awesome. Chicken Caesar pita was very tasty. \n\nWould recommend anyone who like pitas or gyros to give this spot a shot.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-06-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3gIfcQq5KxAegwCPXc83cQ', 'review_id': 'SJSrRNlAItXyD9Ml32m0Xw', 'text': "So here's the deal- I am on the fence about this review. The first time I had food from here it was ridiculously good. I had the chicken picado pita and everything about it was great. It was fresh, spicy, flavorful... just delicious in all ways. While eating leftovers of this sandwich the next day I think I said 'I could just eat this forever it's so good.' So, I return the next week, order the same thing but... no magic! It was still good, but not nearly as good as the first time. What's a girl to do? I'll probably give it another shot, but know that this place isn't very consistent. \n\n\nPs their greek salad is super yummy and the dressing is awesome.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2015-06-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'zlKSUN5Ld6JdwUViuQAUgA', 'review_id': 'R2qn923U-UZVdbirKLfMpQ', 'text': "The food at this place is AMAZING ! I had the chicken pita w/salad and my boyfriend got the gyro w/salad. Everything was so fresh and the dressing is delicious ! My favorite thing we ordered were probably the dolmades. It's so hard to find good ones in Phoenix and these were perfect ! The baklava was also amazing. I would highly recommend everything we ordered", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-06-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XfXoRiSIZToRwzBQdipzAw', 'review_id': 'm4NpMZKLT4shJV_baibJMg', 'text': 'Great food and always smiling service! Try the Greek fries with your sandwich or gyro. Outstanding!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-06-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'I40xmGdzU7AR3LlsEiKIXw', 'review_id': 'bxrjZ--7WkDS7OMFdwXz2Q', 'text': 'I am a frequent customer. This is my go to crowd pleaser local restaurant.  I love the Giro salad', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-06-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JHmO-lVrHA0njKnQnZ8qLA', 'review_id': 'UB27UKqw00qzgHlYqiPeDg', 'text': "Stopped in for lunch... I'm trying to cut back so me and my sis decided to split the gyro with salad. The wait was a little long but the place was packed. The girl at the counter was great at her job... Very up beat, called customers by their name (must be regulars) and when she brought out our food, she had the kitchen cut our gyro, serve on 2 separate plates and serve us 2 full salads!! The food was delicious and worth the wait. I'll be back.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-07-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'T9_j8lcgcqa0k1cCCGZamw', 'review_id': 'OysECF_1euuhQfGYjN7maA', 'text': "No ambiance here, but if you're lucky, you might get to meet The George. Solid gyros/platters, and the falafel is tasty too! This is a go-to for my husband and me when we're craving gyros and anywhere near a George's location.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2015-07-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KmbnwPNzQuQ7SpSnQaHmyw', 'review_id': 'GB83OSnJtjyE94Eym-4qGQ', 'text': 'Best gyros, fries, and Greek salad. Always the first place I recommend to anyone wanting Mediterranean.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-08-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Em37ENOXv7iQ-ePqdg9S4A', 'review_id': 'SEqmN76uFBI61je4eYlFsw', 'text': "It was good, not that great. The worker was super nice, but I ordered fries and they gave me salad but I think I was just confused while ordering since it was my first time there? They gave us free soda's for checking in though. But the food took a really long time & I didn't feel it was worth the wait.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 3, 'date': '2015-08-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IW59bVLSkyOvFgycFNEUTA', 'review_id': 'xbBzTcrB18NC4JfCLE1_2w', 'text': 'Tasty, fresh and quick.  Always a tasty stop after a round of disc golf at Vista del Camino park.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2015-08-19', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': '7R8eMTyiWBsSmAl56dI5-w', 'review_id': 'V_x5R7owng02rcHyrXCxng', 'text': 'By far the best gyro place in the Tempe area -- I have been searching for years and Georges is the best I have found in this area. After countless orders we have never been disappointed. Also, one gyro and Greek fries is enough to stuff my boyfriend and I with leftovers for our gyro loving pitbull. Highly recommend!', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-08-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PXXW6UFzgOI446k9cJb3BA', 'review_id': 'BKen4tdivAv7SrZb0YJ8Ew', 'text': "LOVE this place!  George's Gyros makes it fresh when you order. We eat here every chance we can when we're on this side of town.  The service has always been great and everything is perfect and tasty every time we go.  \n\nNote that this is NOT a fast food place and you are probably better off taking your hungry, tired kiddos to McDonalds or Taco Bell; you will wait a little longer for your meal to be prepared (fresh) than going through a drive thru - so please keep that in mind before you go here.  If you ARE in a hurry and need a gyro fix your best bet is to simply order ahead as take out so it will be ready for you when you get there.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-08-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'T428ouFIwImnea8tTH0sjQ', 'review_id': 'zJpQh_umlPeYKwGN1dtyfA', 'text': 'The guy that took my order was super nice. My plate is full. I ordered the original gyro with frys  and it tastes soo  good!! Waited 6 min for the food.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-08-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pXRHc1MCC_gIqHvu6h9PjQ', 'review_id': 'vsFMOrjjSb0wRK-fnskXvQ', 'text': "Love The Food! Always fresh and tasty. I like that I can call in my order and in 10 minutes it's ready. The chicken pita is my favorite. Thanks for making great food.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-09-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': '6Nheif2-CxeVbcFeU2RVEg', 'review_id': 'T6l5v1iAByp37QdPnkNGOA', 'text': "Just moved down the street so decided to try it out.  Ordered the Gyro and mac and cheese bites.  The mac and cheese bites were amazing.  I ate all them before even trying the gyro I was so full that the Gyro was just too much for me so I didn't really give it a try.  Going to go back many more times.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2015-09-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'PPxOLeKoXD2xa8IJztFpJA', 'review_id': 'O3HUIxeLSizZrCfzaWSkFg', 'text': "I come here all the time for lunch!  The Chicken Supreme is awesome.  TONS of chicken!!!  You really get your money's worth.  Service is always great too.  Everyone is super friendly.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-09-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '-JFMcLPQxi9D-ltajgwrKA', 'review_id': 'PWigAvqcwQCLTY6gos4Jnw', 'text': 'Finally got to visit !\n\nPortions are huge ! Be prepared to eat ! Lots of meat for the prices . Service was fast friendly and nice . We will be back ! \n\nVery clean restaurant !', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-09-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'Cgvn-oleFU0ujlLNTa_wxA', 'review_id': 'LFbGxJsVqC1znnOUAinDcA', 'text': "Let me tell you I NEVER write yelp reviews but this place is really just that good! My office partner and I are training in Tempe/Scotsdale area for work from California and we found this little gem. First of all the girl at the front is doing the job of ten people at once and is constantly running(taking orders, phone orders, delivering food, etc) but always keeps her cool and she's super sweet. We came twice in a row since the first time was so freakin good! Both times I got the chicken pita and my co-worker got the lamb gyro. Amazing each time with massive portions. Definitely the best pita I've ever had. Be prepared for a little wait because they are super busy with a tiny staff and small kitchen but it is so worth the wait. The saddest part about going back home will be leaving this place behind. Great job you guys! Come franchise in Sacramento any time :)", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-10-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'VC4niV35pN5FTjm6EATukg', 'review_id': 'khtr9KUmaVMY_SJjDTRJLw', 'text': "This is my favorite place for greek food, I like a little mor upscale but I havebno complaints about GEORGE'S.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-10-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hWDR9p63FOVWnWxjJE12ig', 'review_id': 'aZUFMOchJIpeONrl8qg0gw', 'text': 'Food is very good, portions generous, many choices, pricing reasonable, clean, fresh, good hours, consistant, service fast, friendly and good.Trying similar places always never on parr with this place', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-10-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GnnuqvyK_EYHFork9XMbxA', 'review_id': 'qDunUzeYQTjJ1VMeqmVFLA', 'text': "Always great food, great prices, and quick and friendly service.\n\nI usually get the original with a salad and I've never left hungry.\n\nDon't forget to check-in for a free drink.\n\nThanks,\nE", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-10-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0lyVoNazXa20WzUyZPLaQQ', 'review_id': 'aWbJQ75_Bhd2EeO7mjeDuA', 'text': "Every time Im here, the young lady behind the counter is there and remembers me. She's always got a smile on her face and she knows the menu inside and out! She's definitely an asset to this company. That being said...I usually have the Greek chicken salad with is always amazing. Tons of chicken, bell peppers, onion, olives, feta, cucumbers and a greek dressing. I've had the mac n cheese bites with creamy gouda, so delicious. We did a chicken gyro with their homemade tzasiki sauce. It came with fries which were noce and hot and then we had the baklava. So delicious and nutty, not too sweet. If you want a diverse menu, great service and fantastic food....this is it right here.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-10-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'E-c186UlQ6ZwEYCJLZpDsA', 'review_id': 'Y0lKH-8b8V2aYwHRXjDFJA', 'text': "It's a blessing that this wonderful place is so close to my home!\n\nLocation: the location is nothing special. It is a whole in the wall, but I'm glad I tried it. The restaurant itself is small and not much to marvel at, until your food comes out!!\n\nFood: lord help me this food is so good I could eat it everyday! The servings at George's are enormous (I can generally share it with someone)! I can always tell an affordable and hearty meal awaits when I see mainly men who do physical labor come in, one right after another. My meal however was even more hearty and delicious then I ever would have imagined! The amount of meat on my gyro was enough for two separate gyros at other Greek restaurants. Beyond that their fry's are amazing, (I'm really picky about frys) the Greek salad is a generous portion, and their baklava is to die for!\n\nService: I can't tell which is better, the service or the food. They have probably one of the sweetest humans as the cashier. This girl (I will have to get her name next time) says hello to all the regulars by name and genuinely asks them how their families are and so on. I'm by no means am a regular YET, but she always is so kind and welcoming. Even though it's obvious she doesn't have to, she always brings out our food and makes sure we don't need anything else. often times she will even pick up our plates for us. Mind you this isn't a sit down restaurant. \n\nTips: leave a tip!! This place is great and so is the staff!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-10-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 's67JlGEwy4qq1sJlVzFpVA', 'review_id': 'XL0mNcNg8YtzHJTcn4qyXw', 'text': "The best steak sandwich and Gyro platters!! Well worth the long wait and is always hot and fresh. Reminds me of the great Gyro's I would get back home in Chicago.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-10-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'eI_iX-so_LNK_Tke1-osig', 'review_id': 'HQ97KhExY8N_mDrnHN--yg', 'text': 'Simple fast and delicious.   Casual.  Great food.  Styrofoam plates.   There is indoor seating a d two outdoor tables.   This place would be a regular stop if I lived anywhere near.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-11-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'C1qjmOLCksM1Ng9hL8hN4w', 'review_id': 'n0RndxDqdiW1E29H--zpWA', 'text': "The place was incredibly busy and it took probably 20-30 minutes to get my food, but once I got it I could see why they're so popular. Food was amazing!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2015-11-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'xBke73MSnvty0HRuvY9WiA', 'review_id': '1kQFUJsI4tQOrct6eL5O7A', 'text': 'I\'ve been coming to George\'s for around 3 years since I live close by. However, I will never come back after the horrible customer service today. I ordered a gyro plate over the phone for take out. When I got there to pick up my food I looked and saw that it was a gyro. I asked to make it a plate and was told that I would be charged for a gyro platter in addition to the gyro I had in front of me because I said plate and not platter. I was told, "we don\'t have a gyro plate, we have a gyro platter." I\'ve ordered dozens of times before and have never had a problem with the nit-picking of plate vs platter. They could have just thrown a scoop of rice in the box next to my gyro and charged me a dollar more and I would have been completely happy. Instead they chose to lose a customer of 3 years.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 1, 'date': '2015-11-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zWvj5K-wm8Dj7HEYtkhPYA', 'review_id': 'yv3qJI6olDnHfM_SRYXU4g', 'text': 'Sooo good! I got the gyro supreme and my mom got the regular gyro. It was delicious! Good pricing. Make sure to check in on Yelp for a FREE drink! \n\nIt was chocked full of savory lamb meat, and the fries were freshly made! The man even checked to make sure our food was good. \n\nWe liked eating outside. I included a picture.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-11-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'pgGz8bNMXQPMi-4A9pr1rQ', 'review_id': 'Z8qJn1NRDPAEEkoXCzHgyg', 'text': "Great food and good value and friendly staff, the girl that was running the front was on the ball. I could make two meals out of my order of chicken pita with 1/2 salad / 1/2 fries.  This location gets busy during peak times but worth the wait but know what your in for...If you're in a rush you might want to order ahead..hence the 4 stars.", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2015-11-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'yXveApEnCcV_DtiucGCWCA', 'review_id': 'O_4Zjj3IxCeeGliGyvo0ew', 'text': "George's is amazing! Last night my Mom and I stopped in to take out dinner and had the pleasure of seeing George. It is apparent he is dedicated to fantastic customer service and the best food! We had the meatballs and spaghetti and it was fantastic! Homemade! Katie took great care of us too! And dessert was great too...Nutella cheesecake!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-11-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'e3pYd5NwheE1rDTT8GU1OQ', 'review_id': '7YvRvG9KjFXYHow9aZjBmg', 'text': 'Service was friendly and fast.  Purchased a gyro to go.  Checked for a free drink.  Skipped the salad and fries.  next time will ask for extra sauce.   The sandwich was very very good.  I could taste oregano and spices. Place was busy at lunch.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-11-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': '8JEjQJuCWjtnEeMpGz8Qag', 'review_id': 'FADYrBYEb9SU7cRMG58MTA', 'text': "Delicious and greatly priced! I cant decide decide on the original gyro or platter BC I love them both so much. I love getting the platter to split. The gyro meat is so on point, I always order extra pita BC the meat is overflowing making it easy to make a second gyro. The staff is super friendly, I've never had service issues and the food is always delicious and consumed quickly!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-11-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'c3w-8mwJW311XIuAGlcBgA', 'review_id': 'J5VSsiL-z2Rs5lJCLjRf9A', 'text': 'My recommendation is to stick with the original gyro instead of the supreme because there was way to much stuff inside that it was hard to eat. I ordered the chicken gyro and it was really good and flavorful. Definitely a hole in the wall place.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2015-11-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': 'c3w-8mwJW311XIuAGlcBgA', 'review_id': 'U1bF_VGQcj5906rt-n2miw', 'text': 'My recommendation is to stick with the original gyro instead of the supreme because there was way to much stuff inside that it was hard to eat. I ordered the chicken gyro and it was really good and flavorful. Definitely a hole in the wall place.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 4, 'date': '2015-11-30', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 4}, 'user_id': 'QGU9YeQmXkwYBnn_Bam3vg', 'review_id': 'OI-RVoQ_Cm0lDCCVKrkbxg', 'text': "Love this place! I eat hear at least a couple times a month. I order the same thing each time (steak pita with a salad) only because it is so amazing! \n\nThis is by far the best Greek food I've had in the area!", 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-12-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Y0qPTCyopXNgMyVbX0D28g', 'review_id': 'X6-g-_fEwHNwYQ9dTt-rLQ', 'text': 'Best gyros in the valley. The meat is so moist and tender and full of flavor. If you find a better place please let me know.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-12-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5qDbvu4N_j4NBb2xHlG7gA', 'review_id': 'af3FYtau8EA_vM7Xo729mg', 'text': 'Great food. From the Gyros to the Athenian Stir-Fry. Always tasty.', 'business_id': 'rN2cc4bXzlsIxhWEoolBTg', 'stars': 5, 'date': '2015-12-08', 'type': 'review'}
