{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4ISG7_E0jmpjIZlBBtZnQQ', 'review_id': 'Qd5rzF9NTLKqegbbAr7ssA', 'text': "This fod is pretty good - I recommend the crab cake sandwich or the cajun sausage sandwich.  If you're not concerned about calories, they do a really good job with their fries.  The service is unpredictable - sometimes it's better on the patio.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2006-01-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': '90a6z--_CUrl84aCzZyPsg', 'review_id': 'oVWBh0ls6xmR2Gq-FEMi_A', 'text': "I am not too fond of the dinner experience here, but it is a great place to grab lunch. Lots of choices and generous portions. Steve's is inexpensive for an eatery in the heart of downtown.\n\nNote the cute quotations on the walls.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2008-04-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fhV21-QB6n402-J9vR-7cQ', 'review_id': 'OPvdG_WXcne_1ifqX4OSmQ', 'text': "Steve's is a cool concept, but not executed very well.  They offer a pretty good selection of vegetarian items, and the location is decent.  I love their  dedication to freshness.\n\nThe problem, for me, was the not-so-clean restaurant.  It was DIRTY.  The container the glasses were in, the table, the seats, the floors, everything.  I would like to blame this on a busy morning, but we were there first thing.  We were the first people to sit at the table for the day.  GROSS.\n\nThe food was ok, but I had a really hard time getting over the dirtiness.\n\nClean up, Steve's!", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2008-06-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '5wN78N4K0a39C-uPzPmxDw', 'review_id': 'UAQjI4ldnF7dPwvW0AmE0A', 'text': 'Steve\'s decor is ridiculous and I love it. It reminds me of Saved by the Bell in an awfully wonderful way. \nThey have a very interesting menu, it seems pretty standard diner fare but it is obvious that they provide fresh, healthy options whenever possible. \n\nMy friend and I went for lunch yesterday and we both had burgers. I had a bacon cheeseburger subbed with bleu cheese, my friend had an ostrich burger. I liked hers, l you could tell it is a leaner meat, but it was a little too birdy for me; I will stick to my moo burger.  I ordered my burger medium and it was done exactly so. Both were served on wheat buns. I also had the "Famous" tortilla soup which was very good with wonton chips on top, and also tried my dining partner\'s white chili which was made with chicken.\n\nThe service was very friendly and efficient even during the downtown lunch rush. The bathrooms are cute but tiny, and you enter through the kitchen. This isn\'t a place I will crave, but definitely somewhere I\'d stop by again for a nice outdoor lunch (except they allow smoking on the patio..ick. is that even legal? Definitely not 25 feet from the door...)', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2008-12-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KWLpwr7BCgiJ17xeKQvXvQ', 'review_id': 'rw38AhHrD7d7N5aRsCAm0g', 'text': "Convenient place to get breakfast and lunch.\n\nAte @ Steve's twice in one day.\n\nKitchen and servers were great with healthier breakfast substitutions - egg white omelet was delish.\n\nLunch was so-so, salad was a generous portion. Lunch plates seemed to be big volume - but I would have preferred a smaller portion with fresher & better quality veggies.\n\nMy morning waitress and afternoon waiter were both friendly and attentive. Steve's is convenient and flexible for people of all tastes.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2009-03-13', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'B7McDYDrf4R814OT3xwInQ', 'review_id': 'zSh0NoVUGckspMhdDKZxVA', 'text': 'Onions rings tasty - service bad\nI should have listened to all the rest of the reviews. But we were hungry, at the convention center and not wanting to walk to far.\nWe also wanted to eat outside.\n\nOur server was terrible. He offered not options when we asked what was on tap and if they had any wheat beers. He said they didn\'t have any and didn\'t offer up the drink menu. Sigh.\n\nWe started with the "spicy" onion rings. Basically onions rings sprinkled with season sauce. Tasty none the less, although not spicy!\nI did a chicken sandwich - they did not cut the tendon out, so chomping into that sucked. The coleslaw was ok.\nHubby wanted the Cajun sausage sandwich and said - the Cajun sausage. Also said no veggies. The waiter assumed he wanted the main pasta dish...  which was awful. Tasteless Alfredo sauce.\nOur companion for the meal got the crab cake sandwich, he didn\'t want the wheat bun and his only other options was sour dough bread.\nThe crab was not tasty.\n\nThe front patio is a great location to hang out, but just don\'t go with great expectations. And grab a drink menu on the way in!', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2009-04-11', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'zQ_FpDX-GDPuai4GOldCJQ', 'review_id': 'Qdzx_pC1PKtizh8ShOMWZw', 'text': u'We experienced three cool firsts a couple nights ago at Steve\'s Grill in the heart of downtown Phoenix.\n\nThe first first was the ostrich burger.  Amazingly good!  What did it taste like?  You already know what I am going to say.  It tastes like chicken!  It really does!  Prepared very well (served as ground meat) -  juicy with tomato slices and plenty of diced onion.   \n\nThe coleslaw that came with the ostrich burger was okay, but lacked pizzaz.\n\nThe second first was Citronage orange liquor.  Normally, I have a splash of Cointreau in my martini, but Steve\'s didn\'t have Cointreau.   At first I thought I would just use Triple Sec as my splash.  \n\nBut our waitress kept saying, you gotta try the Citronage.  So we finally gave in.  Really distinctive and pleasant flavor.  It\'s definitely orange but also has a smoky flavor, reminiscent of a good a\xf1ejo tequila.    \n\nThe third first was our waitress, Teigh.  She was fun, and as refereshingly frank,  a server as I have ever had.   After I told her how much I liked the Citronage, she meant it all in good humor when she said "You bitches were just ganging up on me about insisting on the Triple Sec.  I was trying to tell you about the Citronage!"\n\nIt was nice to get a hot meal after 11:00 at night too.\n\nOh, and love the huge 44 oz glasses of ice water that you automatically get with your meal.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2009-05-24', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 7, 'cool': 5}, 'user_id': 'pYsYs7eQ9SWqAaQS0xoRLA', 'review_id': 'Coggx6JJf7fNkLRj_siyvQ', 'text': "Steve's Grillhouse was A-OK!\n\nAfter a long, hot trip from California I finally made it into Phoenix. While cruising the downtown area, Steve's was one of the first places I saw- so i decided to check it out. \n\nI ordered the Blackened Chicken Sandwich while my Girlfriend ordered the Cajun Pasta with Chicken. The wait staff was nice and the food came out quick. I enjoyed my blackened chicken, however the chicken wasn't really 'blackened'- it was just kinda grilled lol. I didn't mind though- the honey mustard tasted good. The Cajun pasta, however, was a little too spicy for my flavor. I know it's 'Cajun' style, but it left such a hot aftertaste in my mouth that it felt a bit much. \n\nI can see Steve's being a cool little spot to grab a burger from every now and then if i was from the PHX area. Right around the corner from the stadium and arena- got nice outdoor seating that's kept cool by overhead sprinklers- I give it a solid 3 stars.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2009-06-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'mRTY_S2IQyAweG0pLNOgLQ', 'review_id': 'gY4AjcJRe6K3qVbV7feIxA', 'text': 'OK, so only 1 reviewer before me, and they had and liked the Ostrich burger, so I tried it too. I must say, I didn\'t think it tasted anything like chicken, I thought it was very lean and A LOT like Buffalo. It was good, very good for me. Horrible for the ostrich - I\'m certain. \n\nMy wife had a turkey deal. Some kind of sandwich. She liked it very well, as well. \n\nMy only "beef" was my waitress brought me a bottle of ketchup with no ketchup and a big poop for me is having my diet coke run dry. And it ran dry folks! I almost went through the roof, but instead, I just waited and asked for a refill. Bam! \n\nReal good food, glad I went. Used my Yelp Mobile App for my iPhone to find the join. Thanks Yelp!', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2009-07-05', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'm7vtKWpZ9wdEQ95wJxrMrg', 'review_id': 'z7R7y039osygxa7jTvjB2g', 'text': "Colorful place - literally. The decor and lights make for a casual atmosphere that puts you at ease when you enter. My friend and I came here late in the evening, near closing time when it wasn't busy anymore.  There were just a few guys inside relaxing and having their meals and drinks. We ordered burgers - with fried onion straws for me, ostrich burgers for my friend, and we both agreed that the burgers were good. The fries were cut thin, almost shoestring style, and unfortunately were too dry. For the friendly service, relaxing atmosphere, and our not-too-spectacular food experience, I'd give the place 3 stars.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2009-09-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SvaIOy69Fb9Yz0rOE8Svsw', 'review_id': 'zBUA0cIZUnbKWbIzDBEyPA', 'text': 'Stopped in on the way to the airport from the Sheraton downtown.  I was giving a ride to some out-of-town guests and we just needed a quick bite.\n\nLiked the atmosphere.  Didn\'t like that they allow smoking on the pation ("only in the corners", but the smoke smell prevailed over the entire patio).  Good friendly service.  The ostrich burger was interesting.  I had it done MR (chef\'s rec), and it seemed a little pink but moist.   My guests also had the ostrich burger (but overdone) and a regular burger (which looked scrumptious).', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2009-10-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'GkWuTgewni9bzPM4HUCO-g', 'review_id': '8UlmBHpxgLqWBC2D7Pf8cQ', 'text': "The service was lousy. Our waitress didn't bring out our drinks for 20 minutes and we had to flag her down just to get those drinks. We were essentially ignored the entire night as she  never checked up on us, or refilled our drinks and the restaurant was not busy so there was no excuse for her lousy service. We had to flag her down again just to get our bill. The restaurant wasn't busy which was strange because this was right before an event. The food wasn't bad but it wasn't good. It had no flavor. If you are seeking simple bar food, I would recommend Jacksons on Third and Cooperstown over this place. I would even recommend the Matador restaurant next door. We won't be coming back and I don't recommend this place", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2009-11-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QzBwdhtjO-8trteJdwaJzw', 'review_id': 'P4nB10v9ZbUvJ8Z6UqkEKg', 'text': "This place is right across the street from the Wyndham and Hyatt hotels and the west entrance of the convention center. Decent breakfast (good breakfast burrito!), average lunch / dinner. This place is good if you are at the hotel and need a quick meal, but don't make plans to go here for a sit down dinner, you're better off going somewhere else. It is better than the place next door, called Matador. We had breakfast here twice and lunch once, out of convenience because of our conference at the convention center.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2009-11-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Hd8PWEpsPNs8BIxtM4GTZg', 'review_id': 'FHEYm445fWhQpfzfkxUQrQ', 'text': "Steve's - where whole foods rain? \n\nThe front cover of Steve's menu speaks towards the owners views, policies and procedures regarding the use of chemicals on/in their foods. Simply put, there are no chemical preservatives used on any food items they sell. Now to some this may be of no concern, but to others this mentality is priceless. I had a chicken salad and draft beer....I know I know, salad and beer are not exactly a normal combo...but then again I'm not exactly your normal dude either. Never the less, it was fantastically chemical free. I sat at the bar, my usual m.o., and the service was friggin stellar; hats off the barkeep. \n\nAll and all I had a great experience. I give 4-stars for customer service and lack of chemicals.\n\nGo to Steve's.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2009-12-02', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 1, 'cool': 1}, 'user_id': 'JgDkCER12uiv4lbpmkZ9VA', 'review_id': 'JwhfoPvHR-Cq3Xy_WvYDOA', 'text': 'I have to agree with the reviewers here. This place is just not good. \n\nWe went there before a Suns game because every other place was packed. Steve\'s was empty and now I know why. I ordered their signature Green House Pasta, which was one of the blandest things I\'d ever eaten. Our server was so scatterebrained and running all over the restaurant that he forgot part of my order and I still can\'t figure out why. He didn\'t appear to have any other tables.....???? He kept saying "be right with you guys" every time he left. Uhm, are you trying to tell us that You\'ll be back? or that you\'ll see us when you see us? I\'m so confused... did you forget that you already helped us?\n\nThis restaurant solely survives on business from Hyatt and Wyndham guests that stumble outside and see the first place they can eat. I told our server that I thought my food was awful, and I ate it anyway because I didn\'t have time to wait for another item nor did I want to risk my food. \n\nOne thing I noticed is the menu says "we use fresh fish as often as possible." What the fuck? So what if you can\'t get fresh fish? you\'re going to serve me something less than that? How about "we only use the freshest fish." Or truly, do you sometimes serve unfresh fish?', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2010-03-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'X0YSVMYKk-dgtGkBdiyqPQ', 'review_id': 'J4vIbcxn6KqOjTdUsjYddA', 'text': "Came here after a Suns game on Friday night and it was pretty mellow compared to any other bar in DT Phoenix on a weekend night.  The food was alright.  My ostrich burger was good, but nothing to rave about.  Our waiter for some reason seemed awkward every time he showed up at our table, but maybe that was just me.  He wasn't rude or anything.  Just awkward.  There were tv's everywhere and seem like it'd be awesome for sports games.  We had a musician on the street singing to everyone.  I am sure he's not a regular but he made that night pretty good with his music.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2010-03-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'kG8jkVFgOAOq6Ht6RvAjEQ', 'review_id': 'Jges_WNmDzp6a3AOwzvmnw', 'text': 'Just slightly off the beaten path but right next to the Hyatt Regency is this great little dive called Steve\'s. They had a cool acoustic guitar player out front so we thought we\'d give it a try on Saturday afternoon. \n\nWe were sat promptly and got drinks pretty quick too. 3 of us had cheeseburgers of various kinds and the burgers were all so big nobody could finish them! But boy were they delish! Seasoned nicely and just perfectly done. The fries were shoestring kind and they were crispy and well seasoned with a blend of tastes as well; not just salt which made them super yum.  One of us got the crab cake appetizer as a meal and it was just the right kid size serving for kids who like "crabby patties". The crab cakes were pretty good though. What was amazingly good are their onion rings. These had just a kick of spicyness to them with a kicky ranch dip. They were remarkably good and I will return to Steve\'s if not for anything else than the onion rings.\n\nThe service was hit and miss. Our server tended to forget about us once the appetizers were served and drinks went empty for longer than I prefer. But the food was good enough that I will come back again next time I\'m downtown. \n\nFINALLY someplace that is half-way decent, fairly priced, and IS NOT the HRC.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2010-03-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Bwo_j9OGpZN60T5HxKOTeA', 'review_id': 'wgJVmKQXiMjCAtd09RhoNQ', 'text': 'Good food. Awful service. The waiter was nowhere to be found when we needed our check, even though we slotted 2 hrs to get through our meal, kept our order super simple, & told our server upfront when we needed to leave. We had to ask 2 other staff and finally chase him down on foot as he walked away while we continually said "excuse me." I won\'t be back.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2010-04-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ERooWMl7BS5hIgkbM1Xt5Q', 'review_id': 'z1R-8tDEM3l-NyApVKBlBw', 'text': "Late night desparation, dining disappointment. My friends and I decided to hit a downtown dining spot after a concert. Steve's was the only restaurant still open. They get 1 star for being open on a Saturday night. The blue cheese dressing tasted homemade and was full of yummy chunks.  Other than that, the service was poor and the food was blah. Whatever you do, don't order the rib tip basket. Ribs are chewy and greasy and COLD.  \n\nWon't ever go here again. Pass it up.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2010-05-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '7cR92zkDv4W3kqzii6axvg', 'review_id': 'H6J84YsGPfU6qJ5PLFJvSA', 'text': "I went to Steve's as part of the @downtownphoenix spring fling pub crawl.\n\nIt has a nice atmosphere, and I love the patio.\n\nWe were only there for about 30 minutes, but in that time, I was pleased with the level of service we received, and with the chips and salsa.\n\nThe chips are kinda different, almost like fried wontons in their texture. They were delicious. And the salsa had a nice flavor, and decent heat.\n\nI was hoping to have breakfast after the crawl, but I was too exhausted (old) and had to head home long before that happened.\n\nI will definitely go back to Steve's, and especially to try their breakfast menu.\n\n(only 3 stars because I didn't get enough time or food experience yet)", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2010-05-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XgIhw-aWaq_Fx3ZVQGjnuA', 'review_id': 'tZuKNIl_kBo2pfg6cTPKLQ', 'text': "Good food can be quickly forgotten by bad service.  I'm sorry that you've got the table from hell, but out table is important too!\n\nThe micro brew samplers were interesting and tasty, but nothing else screamed repeat and come back here.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2010-06-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'wpMBzk8_l1J1nTho_F4JCw', 'review_id': 'tuD1mCfpmWNDMHV_nkwXnw', 'text': 'I\'ve read most of the reviews and am surprised at some of them.  We have been staying at the Hyatt Regency for the week, and on the second day here discovered Steve\'s Greenhouse Grill.  Thought we\'d go in and try it out and are so glad we did...\n\nWe have eaten there most every day now while here.  \n\nThe SERVICE we received was great!!  Very prompt and constantly right on top of things.  My thanks especially to Kathy and to Mo for the attention they paid to us while we enjoyed the place.\n\nThe food comes in AMPLE servings.... (used to be a day I could finish it all)... :)   We tried a variety of items and were not disappointed with any of them.  The food quality I would put on the lines of "cafe" cooking/food.    \n\nLoved the onion straws... and they know how to cook one heck of a good Ribeye steak!!!!\n\nI would personally suggest that if you want a place to eat with good food, good service (was for us), good portions at good prices, stop in and see Kathy or Mo.  Tell them I sent you.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2010-06-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6gZ-gZcWgg9_uPQ1beqkYw', 'review_id': '8EuLmx4lUsjhcbqdMTLX-A', 'text': "This is my second time at Steve's. The food is great, the portions are generous, and the service is top notch. Our server kathy was prompt and paid just enough attention to us to let us know she was looking out for us but not smother us. You know the kind of servers I'm talking about. Their $4 root beer floats are awesome. Be sure to stop in and grab one if you are in the area!", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2010-07-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'C7lPrHmw-BDKJY-8TWY9TA', 'review_id': 'rYUOo3u2deNqKr5-Vy3okA', 'text': 'Fish n chip special was good. Nice range of happy hour discount drinking. Kathy was an excellent server but disappeared after round two. Or was it three?', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2010-09-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'lurznoz_56tPKDziR_dvdw', 'review_id': 'hIsntqqb_VLA4CrZ8cPtVQ', 'text': "The good - very cute place & great live music.\n\nThe bad - Brought here from a Restaurant.com coupon, and naturally had a three course meal for very cheap (thankfully because we are never coming back)\n\nThe food is very mediocre, I ordered the southern fried chicken and it was average, about as good as you would find anywhere else. The BLT my girlfriend had was again, average, nothing spectacular. The fried ice cream for dessert was nearly impossible to eat because of how hard it was. \n\nHowever what really tipped the scale on poor ratings was the HORRIBLE service. The server knew nothing about the drinks, was unresponsive or un-knowledgeable on any of the questions and was EXTREMELY rude, short and snappy. The server was also VERY slow - slow on refills, slow to bring the check, everything! (I ended up leaving cash when I wanted to pay with card because I was sick of waiting!!)\n\n I am a VERY good tipper, and was extremely upset I had to pay the 18% gratuity; if that were not included she would of gotten no more than 10% for her horrible service!\n\nBAD BAD BAD SERVICE!!\n\nWon't be back.\n\nBeware - generic food, horrible service.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2010-10-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LP8JFPcEtA0ti8g_BRBX4w', 'review_id': 'aFdgOaR42EZfpZwcrxqNYQ', 'text': 'Steve\'s, one of Downtown\'s oldest diners, hosted the after-hours breakfast during Saturday\'s Downtown Pub Crawl and bravo to the management and staff for recognizing the tremendous opportunity the event presented. \n\nThat night Steve\'s was transformed from a quaint lunch spot into an open-air discotheque. Amazing.\n\nThe patio was packed with Crawlers enjoying their breakfast and dancing to crowd-pleasers like Cupid\'s "Shuffle" and LMFAO\'s "Shots," with a beer in one hand and yummy bacon in the other. There were moments when I actually forgot where I was and I was sober as a judge!\n\nThe $5.95 breakfast was perfect and the staff was super friendly considering the mass of drunken humanity it was dealing with until 3 a.m.\n\nGreat job, Steve\'s!', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 5, 'date': '2010-10-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZtLmnhBjThesrAaekS3P1g', 'review_id': 'cLe9XmycneAazNQeg_yCFw', 'text': "My husband and I found this place while staying overnight at the Hyatt.  Thought it looked like a place where students would party at night, but also loved the patio setting.  We decided to have dinner there...and I am so glad we did!  The food was fabulous and presented as if it were on the verge of being gourmet type food.  Totally unexpected and delicious!  And the bonus was that our meals each only cost $8.95, which was the special menu of that time period, I guess.  While we were enjoying our meals, a musician set up on the sidewalk in front of where we were sitting and began playing some mellow, folksie type music, which was perfect.  Our waiter was a bit quirky and disheveled looking, but friendly enough and more than willing to do whatever it took to please us.   We are not hard to please, though, as long at the service and food is worthwhile...which it was.  We will definitely go back to Steve's whenever the opportunity presents itself.  :)", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2010-11-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0Sunr838_CEnkDRSAgaz3Q', 'review_id': 'rHFrTHicKvplYqoAUl__FA', 'text': 'Really nice jumping point for a good night in Phoenix. Crab Cake Sandwich was great!', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2010-11-14', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 0}, 'user_id': '0o0VMEJeQY0pAAZ9nxErBA', 'review_id': 'SoWusAnkzgvdof4vZ_KMwg', 'text': "Not my favorite place. \nThe bar is super tiny. They had a complementary snacks buffet advertised out front. We went in and didn't see anything. When we asked the bartender told us they burnt the food so there wouldn't be any. OK. \nThe decor is all neon lights and straight out of the 80's which was actually kind of endearing. \nThe servers were very odd, loud and kind of annoying.\nI'm not sure why but this place just didn't speak to me... \n\nThey do have $1.75 Miller Lights on draft for happy hour.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2010-11-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0nCNOQv4VV2qYcqVno5ZrA', 'review_id': '6wyflU1jrapqZ80eRoUsJA', 'text': "I've been to Steves a couple times for a late afternoon meal and drinks. It's a nice short walk from the lightrail towards the Hyatt. Every time has been a pretty good experience. The food is good, and the prices aren't that bad.\n\nThe thing I want to point out is the drinks; they're fantastic! I'm the guy who doesn't care much for beer and goes for the mixed drinks (go ahead, laugh). Steves has some of the biggest margaritas I've seen. The price isn't too bad and when waiting for your food, it's nice to have that giant drink and enjoy downtown Phoenix with some friends.\n\nThe outdoor seating is nice and sheltered by the buildings, so the sun doesn't cook you while your food is being cooked inside. Honestly, I've never sat inside, I love the outdoor seating so much! Bring on the 110 degree heat!", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2011-01-09', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 4, 'cool': 5}, 'user_id': 'usQTOj7LQ9v0Fl98gRa3Iw', 'review_id': 'AmkGV3FJ9jpU-zO2dS3HGw', 'text': "Meeh it is just ok.  But I have only ever been here for thier buffet breakfast between 1am and 3am after Pub Crawling downtown.  They manage to work with large crowds well and the food is typical of a hot breakfast buffet.  \n\nI can't speak for their regular menu items, but I do hear they offer a Happy Hour appetizer buffet that I may have to check out sometime.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2011-03-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'aBps9nTCyYhXaubGmfOgpA', 'review_id': '8qIFS7xDO3a9kt0E7-RwnA', 'text': "Cool place to eat and have a beer or two. Maybe even catch a game. My friend and I came on a less busier afternoon. We had a pretty funny, cool entertaining waiter. Food was good with our mandarin salad and veggie patty burger. The waiter was nice enough to have our meals split and everything for us. Only 4 stars because we really didn't have anyone check up on us at all and it took forever for him to bring the bill, run our cards etc....", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2011-03-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'K7dhrsAHwSytMxl2rIqEVw', 'review_id': 'uKyz6ElZ4tTLGjj73gDJjQ', 'text': 'I had a pretty good time here.  We came here after a preseason game for drinks and sat out on the patio.  The service was great.  Its in a pretty cool part of town that you can sit, relax and enjoy the "downtown vibe"  From there you can walk to several other places.  We didn\'t eat but everything that came out of the kitchen looked great. Seems like a place where a lot of fans come before the game as the arena is a short walk away. Worth checking out.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2011-04-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'slJrbI92rtg04ybQmOiEcQ', 'review_id': 'iIdtP5ZBw5PwI0_4igVRcw', 'text': "I went here twice over a few days while I was staying at the Hyatt next door. The first night had slow service but the burgers were good. So were the margaritas. A few nights later, the service was appalling. And I mean as bad as I have ever seen anywhere. We got seated right away but waited for 10 minutes before getting our drink order in. Then it was another 15 minutes for our thrown together margaritas with no salt or lime to arrive. And another half hour for two burgers to arrive. There were people walking up on the street waiting to get seated but after 10 minutes of nobody greeting them, they eventually walked away. Others got seated, waited and waited while nobody came to greet them and walked out without any wait staff knowing they were there. Others could not wait any longer to get seated so just walked in, found a table, sat down and were ignored. No idea where the manager was. I was in no rush and watching the horrific service play out in front of me was entertaining enough to stay. Right after our food arrived I ordered another drink which by the time we finished eating and it had not arrived yet, I told the kid waiting on us to forget it. No margarita is worth another 20 minutes of waiting. He looked surprised I was upset. He may have looked more surprised at the comical tip I left him. No excuse for such terrible service at such a premium location right downtown. No idea how this place stays open if this is normal for them. I can't say service is like this all the time but be warned if you go here. Give yourself plenty of time and prepare to be patient.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2011-04-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '-wwNJ0zd82_q8Gh5XXqAEw', 'review_id': '9GCvlKrPwhOJhD0zAFCmjg', 'text': "Went here last night after my wife's Phoenix Symphony concert with about 12 of her friends.\n\nFood came out very quickly. Ordered a Midori sour and calamari. Calamari was above average and $8.   \n\nStaff was not overly friendly, but also we didn't feel like we were bothing the server either.\n\nFun/lively atomosphere\n\nKitchen closed down way too early (10 pm).\n\nBottom line, it was good, but not a must-visit place", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2011-05-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_4lqpCYCqOQzbB6xQGGhrQ', 'review_id': 'G4r0EOqX6TJWQL8ZyX7kQw', 'text': 'This place was good.  It was a nice location from the Hyatt when we went to Phoenix Comicon this year.  We probably ate here at least twice.  The staff was great, but at times I could tell they wished the comicon crowd wasnt in town...', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2011-06-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XFgkghaWowkrTEgOtOEpPg', 'review_id': 'sbFzWUjgY-gEQEF5hl8N1A', 'text': "Steve's was located right between my hotel and the convention center where I was working. It hit the spot for a quick morning breakfast. We were there the first week of April and probably ate at Steve's at least once a day. The weather was wonderful so we took advantage of the outdoor seating. Service was a bit slow, but I appreciated the pace as I wasn't in a huge hurry. The food was always delicious.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2011-06-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 1}, 'user_id': 'Xm8HXE1JHqscXe5BKf0GFQ', 'review_id': '9iC3nBywCeYbgCDWd73Pog', 'text': 'This bar is in a good location if you\'re in the downtown stadium district but ... I ordered two car bombs and rather than bring them to me, the server came back and informed me how much they would be. Okay, so go get them. Then he comes back with a can of Guinness and one shot. He sets down two glasses and looks at me and says "oh, did you want a shot too?" Then he brings me my check and the car bombs are not on it. I had to remind him to go back and add them to my tab because I was leaving... immediately.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2011-07-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QobN0Enl4AuZwLtdJatO3A', 'review_id': 'OlkTRX_6mnq_SuJH6c8scg', 'text': 'Not sure about the rest of the food but the chicken quesadilla and cheese sticks were awesome.  Plus they have $ 2.75 bud and ultra bottles', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2011-07-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ky2tT17Acz3JOc_bUyom5Q', 'review_id': 'WOhhyaUsGrwNyB1FJ9_elw', 'text': "After reading all the reviews bought a Groupon anyways, I'm willing to give a place a try to form my own opinion. It wasn't over-the-top awesome but it wasn't awful either. Our drinks and food arrived in a timely manner, though the waiter did seem to be a bit of a space cadet. We had 2 cheeseburgers and the ostrich burger, everyone ate up with no complaint. Won't go out of my way to eat here but wouldn't avoid it either.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2011-09-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'zOKccyCYBgKt2AuAEFh8TA', 'review_id': 'QZbYhfdRh8Ph9947pNstRw', 'text': ':: DON\'T GO HERE ::\n\nIt simply isn\'t worth it, and I am not just talking about the food.\n\nThe food is "meh" at best - nothing special at all.  \n\nWe tried it for breakfast and we had the ham and cheese omelet and the kids french toast.  \n\nWasn\'t horrible, but wasn\'t great either.\n\nWhy the 1 star?\n\nBecause they don\'t validate parking.\n\nWhich means when your total breakfast tab is less than 20 bucks, you are going to pay 12 bucks for parking unless you are lucky enough to get a spot with a meter right in front of the restaurant.\n\nOh, and there are no signs that tell you they don\'t valiate parking - you just get to learn it the hard way.\n\nOr read this - and simply skip this place.\n\nTrust me, you aren\'t missing anything - there are plenty of other great places within a 5 block radius to go to breakfast.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2011-10-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': 'UbTUkH9hAL42kMz-XXwojQ', 'review_id': 'u9YfvQyRCcNJabOXkf1NRg', 'text': 'This place sucks big time, went for breakfast had to wait 5 mins.to be seated when their was many empty tables.  once we were seated we waited 10 mins with not even a cup of coffee severed or I will be right with you said.   Needless to say we left without breakfast.\nAfter writing this review I recieved a very nasty email from a woman claiming to be the owner (Kathy Cline), about expressing my opinion and my personal experience.  I now wish I could give this place no stars.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2011-10-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kIyDxmlUE_hNPOi2YE0xqQ', 'review_id': 'lEAAjy_nbYGFiMbJ9vf18A', 'text': "I love this place! I've been here for lunch, dinner & Happy-Hour... I've had soups, shrimp-n-chips, pasta dishes, steak... (practically the whole menu) & I've always been pleased w/ my food. I'm partial to their fries as well. Great Margaritas (try the Coyote & the Pomegranate) The shakes & floats are pretty yummy as well.\n\nOne of the main reasons I like come is *because* of the staff... They've always been friendly & funny & quite entertaining. I'm a patron that likes to interact w/ who-ever is serving me. \n\nSeating is plentiful inside & out. The bar seating itself is a little small-ish. Friendly diner-feel inside. \n\nSteve's comes highly recommended from me ;)", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2011-11-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8Fhyi6U9-3OZC0j8DY3TPQ', 'review_id': 'p4t-EVCN1QC7UL561o3f_A', 'text': 'Great place to spot for a drink or quick bite to eat while downtown.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2011-11-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'bIVnclr28abP6XP79jWFlg', 'review_id': '-7chj88VhbfLxBymycj1-g', 'text': "This place is close to my office and I have gone now a few times. The service is fast and the food is decent. They also offer a few unique items (like a buffalo burger) and the chicken dishes have been great!\nPrice is good but don't expect anything fancy there. It is a very basic kinda a bar feel, kinda a restaurant feel.\nOverall I liked it and will go back!", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2011-12-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-SC91ZBxiD6zLXwaW-NjQQ', 'review_id': '-uAsqLvtYRD5uaAF8rw_7g', 'text': "Pretty good place to go for a late dinner downtown. Food was simple, but tasty. Our server was AWESOME. We asked him places to recommend for drinks after, and he gave us about 15! He was energetic and really friendly. I'd come back here for sure!", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 5, 'date': '2011-12-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 4, 'cool': 1}, 'user_id': 'tjhDhH8FuFly8mQTlkjVEQ', 'review_id': 'aW2sUSSSFr5UQkvKGSaaDQ', 'text': 'RUDE OWNER, BORING FOOD, TOO SPENDY FOR \'BAR-FOOD\'\n\nI work and live downtown, yet have never been to this restaurant. Today I checked the Groupon Now! deal site and saw Steve\'s offering an $8 for $12 Now! Deal. I decided to try something new, and as I only ever get \'to-go\' lunch, confirmed this was allowed to use the deal. \n\nCalled in my order ahead, waited the suggested amount of time before heading over, then waited at restaurant for order. Once my order was ready, I was presented with bill for $14.26 ($13 entree + tax). I presented the Groupon worth $12. Server said, "I\'ll have to see if I can use this." Went to the back area and returned with a female employee. They discussed something I couldn\'t make out, then server came back to me with bill of $4.26. Before handing him my card, I asked why it was $4.26, instead of $2.26 ($14.26 bill - $12 Groupon = $2.26 balance). Before he could speak, the female employee behind the bar spoke up, rudely and loudly, saying [paraphrased], "I always add a tip to to-go\'s, to give these guys a chance to make money. I assume you would tip them anyway." I asked her why this wasn\'t part of the terms, that she is not allowed to force gratuity on a customer when not explicitly stated in the terms. She said, again raising her voice to me unnecessarily, "I am the owner and have already told Groupon to change the terms to not allow to-go orders. I don\'t even have to accept it." I reminded her that as the customer this is not my issue, but hers with Groupon, and that I am not obligated to pay tip or required to dine-in to redeem this deal, as the deal\'s terms did not state either. Again, she was extremely rude and loud, saying that the point of the deal was to bring customers in to sit and dine, not to get a to-go. \n\nDeciding it was pointless to attempt to converse such an ignorant individual, I informed her that she lost that opportunity because I would never be back. She continued to speak over me and ignored my attempt at discussing the issue as an adult. \n\nNot sure why she couldn\'t explain this to me calmly, as a rational \'business owner\', but instead allowed the the server to present me with a incorrect bill. Why not personally explain the mistake on the Groupon terms (that they do not allow to-go\'s on Groupons or that she would request a gratuity included in my charge), and earn a customer, instead of alienating one? . Instead, she successfully removed any chance that I will patron this establishment again. \n\nWith all the other delicious, super-friendly, and locally-owned/runned lunch options in the downtown area, I feel patrons should be aware of this business\'s practices. Not sure about you, but I would rather NOT be inaccurately billed, berated and fussed at by a restaurant employee during my lunch. Your choice!\n\nOh... and after all that, how did the pasta taste? Eh -- nothing special. Like boiled noodles with canned cream sauce, and two strips of over-cooked chicken. Went to Chipotle instead :)', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2011-12-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': 'UbTUkH9hAL42kMz-XXwojQ', 'review_id': 'lDfekzHaSzplqa3u1oE5iw', 'text': 'This woman that owns this business is having friends write good reviews for her, she is mean and nasty to her customers and the food is so-so from my experience.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2011-12-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '2xbM3UCkgKs8eaqLjHugEg', 'review_id': 'rawROixbOen0xgymyHMi7g', 'text': 'Agonizingly slow service. Tepid, mediocre food. Salsa from a jar.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2012-03-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vuUddBhwlrVijAAFvK5UTg', 'review_id': 'jAHLGxEPZ9sKulxlYbLI4g', 'text': "I AM A FAN.... of this funky little downtown dining spot. I don't really understand the theme, or maybe there isn't one at all... it's just cool! Nice patio for outside dining, which is what my wife and I opted for last week on a perfect spring evening. Our server was quick to take our orders (it was a pretty slow night, but hey, it was a Monday), and was very attentive to us our entire visit. The food was decent enough. I had the Chile Burger and my Wife had the Ostrich burger (which I actually thought was overpriced.... $12.95 for a 6oz patty... hmmmm). The fries and the potatoes that came on the side were really good though! \n\nFrom what my friends have told me, this is one of the best happy hour spots (price wise) in downtown Phoenix! We were there after happy hour and the drink prices were still pretty cheap! I'm definitely planning on dining/drinking here again!\n\nLastly, I gotta give a shout out to Vinny! The dude is probably one of the nicest, most genuine people out there! Anyone would be lucky to have him as your server at Steve's!!", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2012-03-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TVqvnBr86HpYxQiSq4f87A', 'review_id': 'BJjiyH2QMIdpfD7VdJYBwg', 'text': 'They forgot what I ordered, my omelette was dry, and the waiter never came back to refill my drink our give me my check still waiting for my waiter nowhere in sight service is extremely slow and sucks', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2012-04-07', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'pNh-npXn3wjhsWDHu4U4Xg', 'review_id': '3QE0obH-GdkJ8OmveVukEw', 'text': 'Amazing hamburgers, wings and caesar salads!!! Great service to boot! ;)', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 5, 'date': '2012-04-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'b1k4tWoA_ISD7wqu82l8rA', 'review_id': 'iISNudQpeTQI6hYs-4soKQ', 'text': 'Um.  \n\nHappy hour specials on the board.  Fine enough.  I was attending a conference across the street so it went without saying we\'d try this joint.  I first ask if I can charge my phone somewhere.  Lazy asshole douchecanoe bartender lazily waves in the direction and says "Power strip over there."  Over where?  I figure it out but guess what.  NO POWER SOURCE.  I know this is first world problems but seriously WHAT THE FUCK PHOENIX NOTHING FUCKING WORKS IN THIS CITY.\n\nSo I order the $4 margarita.  It was ok, nothing special. They also seem to have some kind of happy hour food special, like free apps by the non-functioning power strips. \n\nThey have two TVs in the joint.  Mind you, this place is like 3 feet from Chase Field and US Airways Arena where the Dbacks and Suns play, respectively.  You\'d think they would invest in a package to get out of market games.  Nope.  Now, if you want like local softball teams from Joe\'s beer league, knock yourself out, but I asked about MLB and they were like "no."  Not even an explanation.  Well fuck you too.\n\nBetween the attitude from the bartender (he was such an asshole), the owners (I presume they were the owners) know-it-all righteousness, the bitchy waitresses, well fuck this place in the ass.  I give them an extra star because the margarita wasn\'t bad.  Oh and the bathrooms were clean and they at least had toilet paper.  Trust me, in Phoenix you can\'t leave things to chance.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2012-04-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FqsPW9diOO4VZwIEmfXv5Q', 'review_id': 'Tj2AKK9wTRy1A7312G4vJA', 'text': "I don't understand the nasty reviews - a couple of you could stand to not use so much foul language!!\n\nThis was my first time to Phoenix, we stayed at the Hyatt - Steve's is right across the street.  Our first morning we went for breakfast.  Our waitress was so adorable!!  She was friendly and related well to all of us.   My BF loves corned beef hash but NOT from a can.  Our waitress confirmed it was real fresh corned beef hash - it was the best we've ever had out!   I had the belgian waffle with strawberries -that was ok.  My son had the french toast - that was really good!\n\nLater that night our dinner plans got canceled so we went back.  BF got the buffalo burger - it was a little dry, but buffalo is.  It had a great taste and they were very accommodating to everything he wanted on it.  I had the meatloaf sliders - the best meatloaf I've ever had - better than mine and that's saying a lot.   The waitress said that was new on the menu.   My son had the chicken wings - they give you 12 chicken wings for $8.  In CA you'd get 4.   And, they had several flavors of chicken wings to choose from.  The wings were great!!\n\nOh, and my BF got tater tots with his burger - SOOOOOOO good.  Perfectly crispy yet soft and yummy inside.\n\nThey had 4 TV's inside and 2 outside.  We had a great view of two games!!\n\nWe already plan on going back to Phoenix and going back to Steve's!!!!!!", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2012-04-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'Pl8Z-vrOHKZaMfrYAWKDyw', 'review_id': 'dmSuRX1D0n6C799_fciMvQ', 'text': "I was in town on business and decided to give this place a try.  I'm not a fan... If I was binge drinking then I could have tolerated the horrible service and mediocre food.  I hate fast food but would probably just hit Burger King around the corner next time.  I was hoping it would be a great find.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2012-05-03', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': '8KmHPVzyBW45_tXX8zU5mA', 'review_id': '9n4Y8ExOpPCBTamqH8R87A', 'text': 'Boo. I have to admit that being a former waitress, I have NEVER not left a tip - even when the service has been borderline atrocious. I didn\'t really have a problem this time. So, the restaurant itself is nice enough. A man who spoke little English took our drink orders, and we thought he was our waiter so we asked him to make sure he split the checks. He gave us an annoyed look and brushed off the request, demanding that we hurry and order beverages. 20 minutes later a woman came out and once again, rushed us into ordering. We told her again that we needed the checks split and she waved us off. The food was "OKAY" - nothing that screams out for a James Beard or anything. My TORTILLA soup was watery and packed with corn kernels and some cheese, then topped with deep fried WON TON STRIPS (not tortilla strips). My burger came out cold and dry (not dry  texture, but literally DRY, with no sauce). I asked for some remoulade or mayo and ten minutes later they came back with italian dressing in a cup and said "we don\'t have any of that other stuff." Funny, it was in the menu... So I choked down my burger and waited for my check. And waited. And waited. When it arrived it came split in two. We had asked for separate checks but four of us ended on one tab and two ended on the other. The waitress then accused us of not telling her that we wanted our checks split. Then why did she split the freaking check in TWO?! No idea what happened there. 15 minutes later she returned with the split checks and we gave her the credit cards. Another 15 minutes later we sent one of our party to hunt her down. The manager came out at one point and just smiled at us like she had no idea what we were talking about. We ended up burning almost 2 hours at this establishment. 5 minutes after that she finally returned with our checks. I don\'t think I\'ll be back.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2012-05-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'Rg4gzsz3w00vRlIOXcGUIA', 'review_id': 'KQtzfkAi7hPypNAN3ST1wQ', 'text': "Buffalo burger was really dry. Beer was good & they accommodate a group of 8 but it was so boring. I didn't enjoy a dry $12 burger but Frank, our waiter, was nice. Also cheese is an extra dollar, so is peppers, etc...  Took forever to get the bill.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2012-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'jdfiORh60zOH7ERQ44WgFA', 'review_id': 'Mh7JpgCRQVwg8_QwVMK0yA', 'text': "Steve's is FABulous! We are from Phoenix but had never been to Steve's until Comicon 2012. We went for a drink one night, and noticed how many great items they had on the menu. The wine I ordered (a white Zin) was good. Prices were quite low compared to other places during a downtown event. We went back the next day with 5 people for lunch. We were seated very quickly. Then, three of our friends showed up and wanted to eat with us. Steve's let us move another table next to ours so they could sit with us. Our waitress (I wish I had her name; she's getting a master's degree) was very attentive and flexible with our ever-changing large group. I had 2 beers, my husband had 2 margaritas (they're very good, by the way!), and our friend also had 2 beers. There were 8 of us altogether, and even with all that alcohol, the bill was $98.00. Amazing! We were thrilled! We'll probably be back for at least one meal today. Good stuff!", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 5, 'date': '2012-05-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Iq4beW4vsrvYk2lqKpimtQ', 'review_id': 'WTJOBMdzqRP6jTKljTuTtA', 'text': 'Nice Happy Hour spot in downtown Phoenix. Their Sunday brunch is good as well. Kind of a small establishment,. Nice friendly staff.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2012-05-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'bm-ZjadUDA_3adQt3GRakw', 'review_id': 'fWkO2_FmihoKu-efyMAqsw', 'text': 'I came here during Phoenix Comic Con, I was planning on going here around 4pm but the place had a 35 minute wait so me and my friends decided to just go to their bar. We waited a few minutes for a spot to open and we sat around and waited for the bartender to come to us. She never did and when she did I asked her for a beer and she did not even look up at me, she went and did her business and attended everyone else but me, so I just left I thought it was BS. I decided to give this place a second chance so I went there at around 11pm and this time we sat at one of the tables, we waited 15 minutes for someone to come help us and when we did we ordered two drinks, they took a long time with those drinks and the place was not even busy. After that they completely forgot about us, we were contemplating walking out on the check but instead we waved the server down for our check. I will never go back to this place again.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2012-05-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': '_uL7OiQSfNsCd60DrAf7qQ', 'review_id': 'lMkAEtQ-TGP1aT1C_Fe8pg', 'text': "I bought a Groupon for Steve's yesterday and took the boy out for dinner. \n\nAt first I was very impressed. I love living in a city and the patio has that awesome downtown, surrounded by big buildings, busy feel. They had televisions so we could watch the basketball game, and misters so we could stay cool. (Great misting system by the way, not the annoying kind that just soaks everything.) \n\nI made sure to check up on Yelp to see how my fellow Yelpers felt about this place before stopping by. They only gave the place 3 stars, but all the reviews were pretty positive, so we gave it a whirle. \n\nThree stars is very accurate. Why?....\nthe good....\n-cute fun ambiance\n-nice big menu that can satisfy anyone\n-very nice friendly staff\n-great looking happy hour\n-and there is a Groupon Now for more than 50% off - winning!\nthe bad....\n-lousy service, not horrid, but slow and waitress couldn't be found sometimes\n-a tinny bit on the expensive side - happy hour is the time to go!\n-food was good, not great but good (specifically, cottage cheese was watered down and the mac'n'cheese had way too much chipotle spice in it)\n\nOver all we had a good time, the people watching is great! There was a convention about to start for some wacko hippy spiritual liberal boarder hopping group. Ha-Lare-E-Os! \n\nI def recommend them, but try to get the Groupon or check out happy hour, and don't be in a hurry.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2012-06-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '1IV4EE5koNjlK7DYsAHpNQ', 'review_id': 'qL2GNrOLCS-tpMLFf742Ig', 'text': "Great wings! Order extra crispy. Tried teriyaki and hot - both good enjoyed teriyaki more. 2nd time had seafood jambalasta, pretty good. Boyfriend had chipotle Mac and cheddar thought that was really good. Soup of day was loaded baked potatoe which was AMAZING!! from CA so next time I'm in town will def go there.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2012-07-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '-vRFUY8ixuNniCCNVvmkRQ', 'review_id': 'NjDO6ygfRjRCfGQJew9D2A', 'text': "I AM A FAN !!! am a believer (:  I LOVEEE THIS PLACE! \n-service was nothing less then outstanding and I am super picky when it comes to Good service! The help was delightful laughing along with us and making sure our every need or want was taken care of ... On top of everything else the food is delicious - anything and everything  try it all! I have so many dishes there I can't begin to start but Trust me you will be one happy camper when you leave!", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 5, 'date': '2012-08-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HiBTUkTuSTAf9tvTu4Uw3w', 'review_id': '5zeBFkNpbF_---F6F2xhAA', 'text': "Ate here on a Sunday afternoon. Nice clean place, friendly staff & good food. Our waitress was excellent. She put a rush in another customer's order so they would not be late for their flight that afternoon. \n\nHad a burger & fries. The Shoestring fries are awesome!", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2012-08-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7aL6XWBInqZxDY8otQwWFw', 'review_id': '3KKGyuRqwWxO2jkcK0ldvA', 'text': "Food is ok. Not bad not great. I had the vegetable fajitas. Beans were soupy. Veggies were drowning in oil. Service was terrible. Slow and  inattentive. Waitress brougt out the wrong meal for my partner. Before we could get a word out she was gone. We didn't see the server again until we were done with our meal. She agreed it was her mistake and took 10% of our bill. The dish served was $13. The dish ordered was $10. She took off $2.33. So in the end we paid more to have a dish we didn't want. I noticed a problem with the table next to us with the bill. Seems to be a real problem with this server.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2012-10-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7OsaMcUwflV3a9-2wC6aLg', 'review_id': 'bM76SCcxjLrFLfkizN-zrQ', 'text': 'We ate here with a living social deal. Without that we may not have ever known about this place . We enjoyed the atmosphere on the patio. The food was ok, nothing outstanding. The three stars is pretty right on for the food. Our issue with this place was the our waitress, who was overly fake friendly and borderline rude. My husband asked for mayo for his burger which he still had half left, she brought the mayo, along with our dessert (there was not a choice of desserts with the living social deal). She walked by and set them on the table without saying anything. The dessert had ice cream with it, which obviously wasn\'t going to make it until we were done eating. Also, even though we ordered extra stuff above and beyond the living social deal, she felt the need to remind us we "HAVE" to tip on the total cost of the bill including what we got with the living social deal. Which left us totally speechless and that remark caused her tip to be cut in half. We like to use groupon and living social deals to try places we may not otherwise have known about. This is the first time we have ever made to feel bad for taking advantage of a deal from either of those. \n\nI would have given 3 stars because the food was ok and we enjoyed the atmosphere, but the  staff/service bumps it down to 2 stars.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2012-10-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'c4DFtrb-7eUOEVLtY1dnvA', 'review_id': '9mNmV8T3d_9tAUftNVxLcg', 'text': "Surprisingly good.\n\nMy guy has wanted to try Steve's the last few times we've been to Phoenix and stayed at the Hyatt across the street but we've never managed to work it in. Tonight we did after a Diamondbacks game. I'm very glad we did. \n\nWe just ordered burgers but they were the best we've had in a long time. I'm one of those weirdos that likes my burger medium or medium rare and even places that let me pick how I want it cooked always bring it to me well done. I never send it back but just eat my dry overcooked tasteless burger. I didn't have to do that here though. The meat was perfect. I ordered the cowboy burger minus the BBQ sauce. ($8.50) The patty was good sized and came topped with a thick slice of tomato, a good portion of Romain lettuce and a thick slice of red onion lots of bacon, cheese and onion straws. I chose the grilled potatoes as my side. They turned out to be sliced red potatoes grilled with some green chili's. Yummy. My BF chose the French fries. They were good also. Shoestring style. Crispy with almost a battered texture. We chose to sit on the patio where a they had a guitarist playing. Entertaining with out being overbearing. My bf even tipped him when we left (something he rarely does). \n\nAll in all a really good experience. I'd give it 4 1/2 stars if I could. The only thing that kept it from being prefect was the Cole slaw was bland and although the waitress was efficient she just didn't have much of a personality. But now I'm just splitting hairs. It was a great casual dinner", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2012-11-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BbznjOjqrA5XE1ED_eaCUA', 'review_id': 'bvfLVJaVSsvzsZ0qExdrog', 'text': 'This place looked okay on yelp, it was only a block from our hotel so we walked there to pick up breakfast on Sunday. We walked in and had to sit ourselves and were handed two menus without a word from a sullen teenage server and were then ignored for almost 20 minutes so we walked out. It looked grubby and the menus were sticky. Altogether this place deserves ZERO STARS', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2012-12-10', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 2}, 'user_id': 'X5GbNXY_nNoa_vTZDD0aCA', 'review_id': 'J2qSNQodg4wHPZJFlEogyg', 'text': 'Nice covered patio, very small bar inside. Decent beer selection.\n\nWe came here for a pre ballet drink on Sun. The service at their tiny bar was good, cant speak for the food as we didnt eat. Seemed like a relaxing little spot in the middle of the city.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2012-12-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0hG2xeIG79AqGj6s7F5O7g', 'review_id': 'rps6R9TdFzCq0ampnbPVsg', 'text': 'Reasonably priced. Rapid friendly service. Typical Nth American fare. Nothing too spectacular or original. Worked for our family of six. Was convenient for the theatre and got us in and out in plenty of time.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2013-01-01', 'type': 'review'}
{'votes': {'funny': 5, 'useful': 6, 'cool': 6}, 'user_id': 'k2u1F6spBGhgk2JtAe97QA', 'review_id': '2N4s_LvOfIHh1OheNSuMpA', 'text': "Steve's is hit or miss with the service. Just know that going in. Vinny is great. The others... Meh. The kitchen takes for-ev-er. (Squints from The Sandlot style right there) I've gone times where we were the only table in the whole joint and it still takes for-ev-er.... And then the burgers were over cooked. Blegh. Whatever.  \n\nI do like the burgers from here. When they are cooked med rare like I likes 'em. Cowboy burger... drool. Actually all the food I've had here has been pretty tasty. The beer selection is pretty good and the vibe is kickin. They usually have live jams on the patio on the weekends.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2013-01-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '79LOudEmAcxSYVA1SF5Ayg', 'review_id': 'TIoM4YrqpqODVqNpqKoOEQ', 'text': "Been there twice!  Both times the food was good.  Nothing to write home about but decently good.  The reason for the 2 stars...the service!  Wow!  Talk about horrible service.  The first time we went we sat for about 20 mins without our server even approaching our table.  We finally had to flag him down and ask him if we can put our order in.  The rest of the visit was more of the same.  Us sitting and constantly flagging the server down for things we needed cause he never stop by on his own.  2nd visit was more of the same...had to ask multiple times for anything we wanted.  Had to flag server down cause he never stop by our table.  My cousin had time to walk to CVS and back before the server came to our table and take our order.  I don't think I will go back.  Service just really sucked.  No one was rude or anything but being constantly ignored was not an enjoyable dining experience.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2013-01-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'sPFh-si4S3Ii6A-1Ycg99g', 'review_id': 'CTpW84PtYODUVU19vrqW4Q', 'text': 'Good food, but TERRIBLE service.... so bad I will not go back.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2013-01-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JDX-28rGjHBV-y7ntR3GJA', 'review_id': '5z6xffdADVD9qxaZnXSZ6A', 'text': 'Ate here while at a conference that was heald at the hyatt. \n\nFood was good, prices fair, good atmosphere. service was very good the first day and marginal the second.\n\nI will definatly eat here agin.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2013-02-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2yRfqW5p8Gzr9mQ0q3uRdQ', 'review_id': 'UBX0peJhIWq1PiUrhkkmRQ', 'text': "I think my experience was similar to other reviewers' experiences.  Great food, lousy service.  At first, we had two waiters who both thought they had our table, but we were ignored for a while.  Thanks for bringing the side of BBQ sauce after I finished my burger!\n\nBut I really enjoyed the food, and would go back for that.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2013-03-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TMixIS7ctdUzXY5gN7q-RQ', 'review_id': '-nRyPIOG-Np-cWhQkB0jbw', 'text': 'This place was across the street from my hotel and I was tired so I decided to give it a try. The fish tacos were good and there was a lot of food for $9.50. I went early so the service was good at the bar. The one thing that disturbed me was that they were having a business conversation in the middle of the restaurant. Talking abut who paid what bill and such things. Extremely unprofessional, go to the office for such discussions.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2013-04-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7gCf6mKoDVaxt2oKqgO9Dw', 'review_id': 'G7onuQIYxI2PmE7qzPywbA', 'text': "I was on town for a convention with a friend and this restaurant was the closest to our hotel. We both ordered the special of fish and chips with a side of clam chowder. It took forever for our food to come out. I didn't like the chowder, fish was ok and my fries were soggy with oil. The waiter we had was fantastic. He had us laughing anytime he came around. Gave the 3 star rating an extra star just because of that. I would come back for the friendly staff but just stick to drinks.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2013-04-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '70yC-GM-rH2y6tqnYvRD_Q', 'review_id': '4CO9ZI4eKHnvAYgGro0ahg', 'text': 'went here tonight for happy hour before the DBacks game.  Took about 10 minutes for the waitress to visit us.  i should mention the place was nearly empty.  Waters took another 10 minutes.  when we ordered, the waitress asked us if we were here for happy hour and we said yes; my friend ordered wings and i ordered a salad, both from the HH menu.  Food came about 20 minutes later and was very good.  waitress checked in on us once then we had to flag her down to get our check quite a while later.  we asked her to split my beer and salad & friend\'s beer and wings on our cards.  although the wings are listed on the HH menu, and waitress knew we were there ordering for HH, wings were billed at full price.  Flagged down to ask about this and she said "the wings are not on happy hour."  ????  um, yes they are, and again she repeats that they are not, regardless that it\'s written in black & white on the menu.  she gives us no explanation, just that they\'re not on happy hour.  then she got irritated we didn\'t understand this.  she said she meant to tell us this but kept forgetting.  apparently the wings, although again, on the HH menu, are NOT on HH on game nights.  this is mentioned no where, written no where, and was not told to us when we ordered.  fail fail fail.  the waitress was unapologetic, abrupt with us, unwaivering, and didn\'t give a crap that this was on her to mention from the get-go, not once we get the bill and have to ask about it.  between her shitty attitude, crappy customer service, and the \'customer should know what\'s on the HH menu and what\'s not, regardless of what\'s actually written on the HH menu\' policy, there is no need for me to patronize this place again.   too bad, because the guitarest was awesome.\ni know it\'s not a huge deal, but the waitress handled this completely wrong, knew it, and did nothing to remedy and learn from it.  i was a waitress for a long time; takes A LOT for me to leave a crappy tip.  this gal got a $2 tip for her efforts.  maybe that\'ll get her attention.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2013-04-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': 'oss8R_DtOKLjJsCTtAMclw', 'review_id': 'DWxIShZuLS7MKSpsaygaKg', 'text': 'I came here for a quick bite and a drink just before my flight back home.  Seemed like an ordinary American sports-bar type of restaurant.  It was nice out so we sat out on the patio area. \n\nI ordered the Famous Tortilla Soup and a Salad  (http://www.yelp.com/biz_photos/steves-greenhouse-grill-phoenix?select=9SyetYbV84cEYwlIejZgSQ#CwViykSXMSxRuhxAy9G0jQ).  I don\'t know why the tortilla is called "famous."  It was just an ordinary tortilla soup (kind of watery and lacking in chicken flavor)-- nothing spectacular but it wasn\'t bad.  The salad was pretty plain: chopped iceberg lettuce.  I also ordered a margarita-- this tasted like it had a little too much margarita mix in it but it did the trick :P', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2013-05-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'V6rhoTCw7S6H8eHwv2M6Vg', 'review_id': 'tGPotivToLv10zvWI-iWeg', 'text': "I've gotta say, nothing blew me away here.\nService: OK, correct food came out, but we sat for awhile before anyone came over and drink refills were nonexistent.\nFood:ok, They were burgers.  Took awhile. \nAtmosphere:ok.  I guess.  It was a nice night, so we sat on the patio.  Which is sort of cave like.... I like the guy on the sidewalk playing his guitar...\nSee what I mean? I'm not fully on A-ok... not quite a Meh.... just ok.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2013-05-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '_8KAa1lhcX0JEmDqvODwFg', 'review_id': 'WdCQMlfBzmWB_2yvTdxTOg', 'text': 'Never again. My last minute birthday dinner sucked after horrid service that didn\'t remember/forgot: to bring any water (but they managed to type two free waters in our bill), my dish came with a side item, to bring my boyfriend ketchup and took over 7 min to get a bill then 7 min to have him take it away. My boyfriend\'s drink also came in a airplane glass (same size you get for those of you that fly) and it costed $5.50 for well-gin and sprite, really? Plus, while waiting for our dishes, he brought us two of the wrong ones and we had to tell him it wasn\'t ours. Never had a "sorry" come out of his mouth about anything. Even two of the other bussers asked if we needed anything and we just said "no, just waiting on our bill." I have never wanted to walk out of a restaurant until now. \n\n*This is really sad considering my first experience here was quite nice.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2013-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '-AW0P9ppS27ntBRgxVLOsA', 'review_id': 'kXOmvxdrVKPl7ajcHqzCeg', 'text': "Went there twice since it was close to the Convention Center and there was an advertisement for 10% off for convention attendees to the event I attended.\n\nFood was good.  Price was reasonable.\n\nBUT\n\nService was really slow.  Waited 20 minutes for the bill the 2nd time I ate there.\n\nRefused to honor the convention discount of 10%.  1st time, the waiter forgot to include the discount.  I didn't bother to check until after I left.  2nd time, the waitress said the discount applied only to volunteers at the event.\n\nI mentioned this at the information department of the convention I was attending.  Hope they do something about this.  Either way, without any evidence of attempts to improve their service or honesty, will go elsewhere for breakfast even if it costs me more.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2013-05-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'yJ22u_1l01H4NM3wCowIKw', 'review_id': 'jAV_kE4dkbFUxtqkVkoDbw', 'text': "The service was incredibly slow and the food wasn't very good. I ordered the fish and chips expecting a typical fish and chips experience. When I learned that it was actually tilapia, I was curious at first when when I tasted the overcooked, too-thick batter over the crumbly fish I was immediately turned off.\n\nThey do make some good flavored lemonades, but really I was just horribly disappointed.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2013-06-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8eSZ5VFUnFckouBgey0Rkw', 'review_id': 'Z6lcPjW6P6WbiZ1wtk6LBg', 'text': "Wow, I've had some bad experiences at restaurants, but never anything like this. It looked it it was going to be a bad lunch when I ordered an arnold palmer and it came out and tasted like tea and water, none of the sweetness of the lemonade, luckily I was able to swap it out for a coke. We asked about the beer specials and our waiter couldn't remember, but stood there for a while trying to, but then gave up.The drunken chicken sandwich was slathered in buffalo sauce instead of the chipotle remoulade which I ordered. The chipotle mac and cheese which was described as penne, came out as spaghetti. When we asked about silverware we were directed to the jars full of knives and forks but no spoons. Storing silverware on the table is disgusting, who knows what was done to it before we sat down. We sat for a while waiting for our check before finally having to ask someone to send our waiter back with it.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2013-06-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'qa05pUVNapADHZXpHMPMeA', 'review_id': '12jpin67TKupphgWyYmUxw', 'text': 'A-OK describes Steve\'s Greenhouse Grill perfectly in my opinion. It\'s somewhat like a Cracker Barrel minus the company backing and plus sports... a rather kitsch design scheme with loud colors, loud TVs, and loud alcohol advertisements hung all around, a large and  eclectic menu with something that will surely please all types of eaters, your very typical bar menu of slightly overpriced drinks, and somewhat over the top servers singing praise over every single menu item ("You can\'t go wrong!" "They\'re all my favorite!"). I had some chicken fried steak with fries and Kristen G. had "The Special", which was fish and chips with a bowl of New England clam chowder. Everything was A-OK. Some things were a little salty, some things were just right, some too bland... I\'m telling you, if you took a Cracker Barrel, cut the budget by three quarters, and told the manager to attempt to please every kind of patron that would be walking around this area of Phoenix, you would get Steve\'s Greenhouse Grill.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2013-06-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yOS0c7p5vNafPSAU8kbenw', 'review_id': 'DYkyTVrYOAELhI26w-ApyQ', 'text': 'I was a vendor at Phoenix Comic Con, running on a tight schedule in the morning. I happened to be with a few "Pirates for Hire" on this fun and nerdy day. Hoping for a relatively quick sit down, the first thing that we noticed was Steve\'s Greenhouse Grill. \n\nWe waited for about 10 minutes to be seated, puzzled... the place was still pretty much empty!  A massive line did form behind us however. Finally when we were sat, we continued to sit there looking cool for another 25 minutes before even being served. Let me tell you how uncomfortable it is to have a table full of hungry, irritated, picky, rushed, short fused pirates. Eagerly barking out food orders to this poor waitress, we noticed a horrible confusion happening with the humongous line that had formed. Yelling, crying, threatening, panic...It was the perfect storm, and on this special day they were absolutely bombarded by an upset horde of fictional heroes, monsters and villains.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2013-07-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LOENjNpItvW21f2BHYnlMQ', 'review_id': '3qTHRJwZQ5b-S7beUiP5Lw', 'text': 'Place was pretty empty on a sunday before a d-backs game. Service was good, waitress came back frequently to check on us. The caesar salad was huge and good value, had lots of cheese, fresh lettuce, with wonton strips on top instead of croutons, which were very good.   The kids had quesadillas, which were average and yummy shoestring fries. My wiofe had grilled vegetable bruschetta, which was just sauteed veggies in a bowl, with garlic bread on the side. While tasty, not your Postino bruschetta, needed more pesto on the veggies.  Overall, good place to go before a game, or lunch during the week.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2013-07-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'bwmXfjwrogAaGqV33kSVpQ', 'review_id': 'wKhwQWCdKFLOXtP-3rqgrA', 'text': "Food is pricey and didn't look very good. Too bad nothing around was open. As the food came out, I'm glad all I ordered was a beer. Looked like a dirty diner with the employees just sitting around watching tv bc there were no guests. Won't be back if I can help it.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2013-07-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ANtOgsl3gf1IkVqdJGCwfA', 'review_id': 't60Rqd6YiPPuQ5qEpB2APg', 'text': "I've visited Steve's for the live music they have occasionally. The food is good but not always top-notch. Wait staff is not always on the ball and we've had to visit the bar for drink refills. Last time I visited I was disappointed to see that the menu had changed and the desserts I LOVE are now gone. I'll still go back for the music though.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2013-08-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'E7aJ5KGbdgBDfH6cD0gaHA', 'review_id': 'ScD2sWkkvMTbv5e8ls3d1A', 'text': "This was the absolute worst menu I have ever seen. Horrible elevator music, distasteful attempt at decoration and my bread was as hard as a Rock. Cesar salad was drenched I'm dressing and my lettuce was soggy.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2013-08-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cXMtOu2DKxhuSTH44hyWaw', 'review_id': 'KxAQBth5DPznrTdIMkxbEQ', 'text': 'Convenient early morning breakfast before your convention, with seating outdoors too.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2013-08-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4UEQLQTsY9S7krwEcYRO4Q', 'review_id': 'NFr8vOPBw1sp4OM3ptbQuw', 'text': "The Chili Mac Sundae was tasty! Best skins I've had! Good price for great food. Wings will be next to try, heard Honey Hot Wings are the best.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2013-08-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rLabZxcQJsMZ2eJpXGiYTA', 'review_id': '9Wxa04FnzSFP-w0TqiKEKg', 'text': "The food was good.  The staff was terrible.  It's hard to eat good food when your stomach is turning from rude and dysfunctional waitresses.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2013-09-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IF7OP38zqk8Du2F6Mm53PA', 'review_id': 'yocyRi1KjafZtuPFMecnLg', 'text': 'Very basic stuff but they have survived in an ever changing downtown.  Good specials, especially Wednesday night $5 burgers but essentially high grade bar food.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2013-09-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vUZoIaCIwGvSWY1kMGM7qQ', 'review_id': 'bSUshkIK3J2GDbOnv6lO7Q', 'text': "Business takes me downtown a few times a month. I had never been here before but thought I would try it for lunch today. Had a burger which was pretty pedestrian. Fries were cold. I would have said something to the waitress but never saw her again. Service was pretty bad, the hostess who seats you seemed pissed that customers where there. Probably won't return.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2013-10-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'W--AN3TcISKXWMA13Nbh2w', 'review_id': 'k8mkb7wy2Iko1TdzkwG4Gg', 'text': 'Staff was super accommodating. Beer durning happy hour was CHEAP CHEAP CHEAP. I would back in a New York second. The calamari was excellent.  The burgers looked awesome. Two thumbs up', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 5, 'date': '2013-10-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'v_8NZCbngZ3T7h9NZd0krw', 'review_id': 'pcAEHi1ku_OGyFhtDdxbzQ', 'text': 'Pretty consistent spot for lunch. Love the daily special price and variety. The tots are great!', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2013-12-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ygL5LlO0fQIi3O8heHZT5Q', 'review_id': '9DbHITvp1zlmGl_vedgAUg', 'text': 'Food was pretty good. Coffee was awful. Service was pitiful. We waited 15 minutes for our coffee before breakfast. Waitress disappeared for that whole time. The food came and -- oops-- she forgot about the coffee, water and OJ. Breakfast over, and she was nowhere to be found again. Will not go back.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2013-12-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BCfIK8jsuxY8QsoozNDPFA', 'review_id': 'iwkJFRMDLb0yD0Didmvh8A', 'text': "Finished watching a ballet performance and thought this place looked like a good spot to have dinner.  Well I was wrong. I got the sampler platter, everything was over cooked and had no taste. I would have to say that Applebee's sampler platter is way better then what I ate. The waiter made me feel rushed and when I asked him a question he just said look at the menu. (Okay but isn't it your job to know the menu.) The bathrooms had a weird smell and were dirty. On my way home I started getting a stomach ache.  Please done waste your hard earned money and eat here.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2013-12-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9jAGh1-u0eyguTQncljuhQ', 'review_id': 'tGwy29TI0rNNkJOffrwc8w', 'text': "This place is marginal at best...the food is nothing special and the service is absolutely horrible. We ate here last year and were unimpressed but figured we would give them the benefit of the doubt and another try...big mistake!!! We stood outside waiting to be seated for forever and  were finally greeted ( and I used the term lightly)by some sour faced hostess that seemed to hate her job... maybe even her life.  Another long wait and our server showed up... the food did come out quickly... but how long does soup and salad take.  But after that he pretty much disappeared.... We sat there for the better part of 30 minutes ...totally finished eating, just hanging out for our check. We were seated outside and saw several groups of people just walk away because they were tired of standing there waiting to be seated. I would understand if the place was busy but it is far from it...its too bad because we do a lot of work at symphony hall and would frequent this place because its convenient...but I think I've had my final bad experience", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2013-12-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QApOSiinEa0DS9u-gMerOQ', 'review_id': 'Id1D4ttIGa6LPNi9WhOckQ', 'text': 'Service was excellent, waiter was so nice and attentive and funny! The food was so good, I had a Patty Melt that was so tasty and not greasy at all!  MY husband had the Crab Cake sandwich and he really enjoyed it!   Dessert was AWESOME!!!  It was a Turtle Brownie the biggest one we had ever seen!  It was a very nice way to end a perfect day of ballet and dinner!', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 5, 'date': '2013-12-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vf52I74zH1rwncfgcUy_WQ', 'review_id': 'ExGokZHUTOni9T8GKxDmTg', 'text': 'Nice little grill. Got a late dinner, crab cakes. Had heaters on patio and music playing. Nice atmosphere. Was told by locals that it is a great breakfast place. Maybe tomorrow am!', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2014-01-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pu7z6pfqh12qyNSauY0dEg', 'review_id': 'Bf8s83BnzyYgBT8rqRC3mA', 'text': 'A solid three stars from me. I come to Phoenix every year for a conference, and have been coming here for 6 years now. It is always consistent. While I have always had breakfast, service and food are good. Nothing that really jumps out and says "I would drive a thousand miles through a gasoline fire to eat here, you have to try this!", but it beats the highway robbery prices at the hotel. Someday, I will try lunch or dinner and report back.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2014-02-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'n_IWYJVibQ5i0p4RoCj0eg', 'review_id': '2nGW_eqw_x7EdY--XJw2tA', 'text': "I would like to give this place four stars... But I think I needed to sit in the outdoor seating for a better experience. \n\nRegardless I really find the servers and staff to be so friendly here. The atmosphere seems outdated but a good place to grab a quick bite. My experience would have probably been better if I sat outside because it seems they have live music there every night. \n\n The menu is so large with numerous options. I think anyone could find something to eat there.  The salad was fresh and a larger size. I recommend this location for a good meal- it's not fancy, and not anything amazing, but we had a good dinner and would visit again.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2014-02-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'o8eOstEDypthsmdttzepWg', 'review_id': 'VUR7UEbxN50sT5ixx9VdfQ', 'text': "Too bad there is jot an option for negative stars, or rather a falling star.  Steve's earned it today.  Lots of us having lunch together.  The results was the same....... Lunch sucked.  White chicken and bean chicken sorely lacked chicken.  Chicken was fresh from the deep freezer, lacking taste and texture. The bison burger was again a freezer bound burger, but took enough time to cook it , that it seemed as though they slit the animals throat themselves.  The fish tacos lacked zest.  But the beer was wet.   The Long wait did not make this meal taste any better in anticipation, but reinforced that we were glad we got this place out of the way..... Buyer beware.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2014-02-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7812y-pChGq3eN6ZWUFv7g', 'review_id': 'L9NPIP-p1BnqLIfNSuU2ww', 'text': 'I went because a) it was across the street & I didn\'t want to walk too far in the 90 degree heat; b) the menu sounded interesting and maybe a little offbeat; & c) the concierge at the Hyatt Regency said it was really good (no accounting for taste). \n\nI waited at the the sign that said \'Please wait to be seated\' & I waited & waited &... Finally I walked into the main restaurant & asked to be seated. The hostess said "Oh,I didn\'t see you". I guess 10\' was too far for her vision in the  less than 1/2 filled place or maybe she was too busy socializing. \n\nI started with a nice, not great, brew - Devil\'s ale or something - at the rec of my waiter. I then ordered Chico\'s meatloaf, the chef \'signature\' dish. It is tasteless meat lying on a bed of tasteless soggy fried potatoes & covered with nice but nothing special marinara sauce. It came with two spiceless spicy cajun onion rings and \'eh\' enchilada soup of the day. Service was good & the price was right $20.00 with tip but the food & ambiance was lacking.\nSo if you want an OK nothing special inexpensive meal then it will fill the bill. Otherwise as noted in my tip: Don\'t go there.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2014-02-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': '_y8Ccwu6hdc-Kn79QaDARA', 'review_id': 'aM2ePpYaGvBIJwz8EJ5qdw', 'text': "Literally terrible. Enough said.\n*Can't get a refill of water\n*Ordered a sausage burrito and got a salami burrito \n*Didn't get jam for my toast\n*Couldn't get a mimosa refill \n*The list goes on, etc...", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2014-03-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'F0SQ3rgTM28t95F29xjFzQ', 'review_id': 'hNYYOg1GjgGrwhuUprvXFA', 'text': 'The friendliest group of servers. Food is good. Come here most weekends with friends and they treat us right.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2014-03-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': '3Cpei-yBqkAc00jj02pBAg', 'review_id': 'd9FkBDgWnZcTUXUrqwAD2A', 'text': "-Buffulo burger - eh...nothing special to look at here\n-shoestring fries\n\n-men's bathroom stall lock does not work. i walked in on someone accidentally. MENTAL SCAR\n-waiter asked if i was going to the rodeo. and people at the bar were legitimately excited about nascar. is this what arizona's like?\n-he was kind of annoying too\n-never got a refill of water. service was gone when needed. SUPER slow arrival of food, though to be fair Arizona in general seems slow\n\n-felt a bit pricey for what it was\n-walking distance from hyatt/convention center\n\nOverall, the food was pretty freaking meh. But it was food. The service was even more MEH. But oh well, fellow traveling businessmen, just go somewhere else.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2014-03-19', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'CbvquYV5e7dPGmGUrY3rnQ', 'review_id': 'yiKrPuyIY1NGI6yBePRGGw', 'text': "If I could rate this with a negative number, I would.  This was among the worst dining experiences I have had, and my review will present a factual description of why I feel that way..  We were a party of 8, having dinner before a concert.  Two of the meals were inedible, but only one was comped.  A third meal had to be returned, and the replacement didn't come for another ten minutes.  Then, it was barely edible, and my friend ate only a few bites of it .  I ordered the caesar salad with steak, dressing on the side.  The server brought me a caesar salad with dressing mixed in, and without the steak.  Five minutes later, he brought the steak in a bowl, looking very unappetizing.  It was o.k., and I ate it. We will never return to this restaurant, and I will describe our experience to any friends who may ask about the place.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2014-03-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'z5g5Lclwt13_BO0BStohMA', 'review_id': 'z3wklZ_B3f84AyQvVgX1xQ', 'text': "You can't beat the $5 burger special. Any burger on the menu, plus tots, is only $5. And they're tasty and big.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2014-03-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'R9U8bZ84V-xPx3udCcU5jQ', 'review_id': 'GsJAY_FLtV2weV97qHRDzA', 'text': "Is it the best sandwich on Phoenix? No. Is it the best value? Quite possibly. \n\nCathy is the manager who I have seen in there almost every single time. After a couple visits with slow service (as mentioned in other reviews), We ended up with Cathy as our server. She took our orders quick and was on top of refills and the check. She made sure to give us her name and encourage us to request her in the future. \n\nWe learned are lesson with several of the other servers, but Cathy makes is feel like we're the most important regulars she has. \n\nAwesome food specials on Wednesday and Thursday ($5 burgers and side and then $.50 hot wings). Great happy hour pricing as well. \n\nAgain, not the fanciest place and it's not 5 star food. But if you want good food for a great value with awesome service, swing by Steve's and ask for Cathy. Tell her Taylor sent you.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 5, 'date': '2014-03-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rvL6tIP-WT54fVYQqT9N8Q', 'review_id': 'B15-49qS_r7x1y1kDgBcQQ', 'text': "Was seated and waited 15 minutes before a waiter came to my table. Poor customer services can't understand how they stay in business.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2014-04-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fZSYQ4sF52xiWHhXUJAgbw', 'review_id': 'zHryHZdmzUQxfTSzi_59fg', 'text': "Food was ok, service is just awful. Sat at the table for 40 minutes, server finally brought my drink after the food arrived. I order 4 street tacos, they were cold, but still mostly tasty. I work 20 seconds from here, but won't be back.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2014-04-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'RhOKK1W9omYim8La0vxqNw', 'review_id': '8E2NRT4DabBAHGLoDFZJDw', 'text': 'I been going to this place off and on for years so I like it... however loud annoying soccer fans singing group songs at 9am is super whack. So much so that we left after driving 30 just to eat there...', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2014-05-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zNFIzjoEX3skz2zd7wE5Sg', 'review_id': '0uH3XnnwfEPMxTwCPBvPxQ', 'text': "First Kathy was our server and extremely efficient. She put up with my coworker who kept changing her mind. LoL Even I got annoyed but she kept her cool.\n\nThursday was 50 cent wings. So I got six honey hot. It was nice and saucy and delicious! The skin is nice and crunchy and big pieces. My coworkers got the hot, they didn't come with sauce like I'm used to and all of them were served with blue cheese. Want ranch? You have to ask for it.\n\nI got the Fish & Chips with house salad. Sorry about the picture, by the time I remember to take one I had already dug in! LoL Okay, the whole meal was huge and I pushed food on my coworkers and still had to waste some of it. The house salad is a big serving. A huge helping of shoe string fries that I piled on a plate and handed over to my coworkers, the few I had were tasty. The fish are bigger than my hand and I was given 2 pieces. It was good with the tarter sauce that wasn't JUST tarter sauce, it had some kind of orange tint to it. Hot sauce? But it was delicious and I could only eat one.\n\nThe fruity tea I got was delicious, freshly brewed - ask for extra ice.\n\nMy coworker got the soup of the day, cream of potato bacon. It had huge chunks and my coworker said it was delicious. Two coworkers got the BLT half sandwhich and it came with heaping pile of bacon that looked extra crispy and something I would get next time.\n\nWe all said next time we're downtown, we'll be stopping here.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2014-05-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WUGhGxH3YYc_YZXgsynXvA', 'review_id': 'qMtax_Zqf0Fdz-KIOZ_YYQ', 'text': 'The best crab cakes and grilled chicken Ceasar salad! Definately a place to visit in Phoenix!', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2014-05-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '4G0kvHoYsVG3tWDD1YStgA', 'review_id': 'XZuGPf9O76mfdeqfpj9TwQ', 'text': "I ate here twice while I was at a convention. It's convenient. The servers were nice, the selection was great and my food came out quickly...and they give you lots of it. I needed a to go box for breakfast. \nThe Cajun sausage and tortilla soup were my favorite things.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 5, 'date': '2014-05-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'owTs2bnmBiit3UoXXPxwKw', 'review_id': 'Z01JOISg-kwh_X_SFJLubA', 'text': "Customer service sucked at the bar.   Employees didn't seem happy at all.  Heard them bitching and complaining by the computer.  Over this place. I'll go back to Marjorie's where the staff seemed happy to see everyone and excited they were getting business", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2014-05-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'msJa3Q9y5JsJQJbhkvGJQA', 'review_id': 't49hoMdzs4umFYfi23KWmg', 'text': 'We stopped in here after a movie one night and it was a fun little find. We just wanted to grab a beer and have an appetizer. We got their chicken fingers, which were very good and hit the spot. The best part though was finding that they have hop knot! Maybe the only place downtown that does now;) We will definitely be going back.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2014-06-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'EJz9ovpxWuteD1Vh0SUYNQ', 'review_id': '9BI5kF2W8QejSkqfKA10Dg', 'text': 'Bummer.  Fantastic drinks and prices.  Went in for lunch and after an hour they were not so apologetic   We left without getting out food.  Drinks only ok.  Kitchen and staff not so good on busy days. With the location next to the convention center one would think they would be staffed.  If not staffed at least attentive.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2014-06-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BsgXTs_hz4AwgbK0wSIIxw', 'review_id': 'doTClfq2gBUCN91vsaT2Ow', 'text': "Got a voucher for half off so we used it as a date night.  Hubby's chowder pretty salty, the mere suggestion of cole slaw and his fish & chips were so-so.  I had the California chicken sandwich, fries and blackberry lemonade.  Delicious.  Waitress a gem and the downtown vibe is sweet.  Worth the trip and might be someplace I would go aftet a function downtown.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2014-07-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'YLcgm9PknLBAuWgo-d7MGw', 'review_id': 'NFBUQCC4Cy01ykkLvO3hNA', 'text': 'Ok.... So the only reason I even went to this place was because I didn\'t want to re-park my car after I found out "Cartel" was a breakfast joint.... In hindsight, I should have re parked my car. \n\nThis place is so very amazingly and exceptionally average. As in like, my stomach was full but not because the food was so good I couldn\'t help but to eat every last bite, as much it was because I only had an hour for\nlunch. Wife ordered a "tortilla soup" and some type of healthy rice and grilled veggie meal. The soup was barely edible (salty, over spiced and FULL of corn) and the rice was reheated from cold storage and the grilled veggies were soggy. My Reuben was edible. That\'s about where that stops but for full disclosure purposes, I\'m a bit of a Reuben snob. (See former reviews of the Reuben at Windsor) My daughters burger was meh. Fries and tater toys were deep fried in the same grease that was not only old and badly needed to be changed but also used to fry the fish they were serving for the fish and chips. Gross!! Fishy tasting fries! \n \nService was below average. Waitress not only had a huge case of the "idontgivadamns" but wasn\'t anywhere to be found except to drop off food and take Initial order.  Decor was dated. I could go on and on. I won\'t return and I highly recommend going anywhere else downtown besides this place. Hell, the hot dog guy on the corner of Jefferson and central is a 100% improvement from this joint.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2014-07-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ep73rqaWvnW_pjnXFYlYaA', 'review_id': 'qtlGUQCpxtsjObBIN6Hb7g', 'text': "Can't review the food. Hostess very slow to get to front door as it must of been too hot on patio. Another 10 minutes to get watered down lemonade n watery tea. Waited n waited for server. So we walked out. Too many teenage workers and no adult supervision on site", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2014-08-10', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'DvsFVoI0kkJ94nWc4QCFMQ', 'review_id': 'iKac-W6ByVjJ2iQ9ZEi5bw', 'text': u"Was in Phoenix for a Gold Canyon convention. This became our go to place. The 1st day our lunch service was horrible..very rude waitress. Erica. My food was so so. Chicken sandwich dry, no flavor.We noticed they had some specials that night so we came back. We had bartender helping us. He was great. 50\xa2 wings! Fantastic..the honey hot are the best wings ever, tarot tots...yum! And the watermelon margaritas and the long island iced tea are the best ive had. This place is definitely the BEST choice around the convention center. A little rough around the edges but for some reason we kept going back and I'd continue to do so during my next convention.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2014-08-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LGVHiUTI3QJ7a44EET50XQ', 'review_id': 'kpdpqkCx5Ca9hwjMZLzu_A', 'text': 'Ate here twice on my trip. Breakfest was very good. Biscuit and gravy were very good, like homemade.  Very good eggs.  Also had the meatloaf which was very good as well.  Nice atmosphere.   Waiter worked his but off and did a good job.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2014-09-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lMPTQT0jf6-S7AxhMoOZzQ', 'review_id': 'tchskTSBR7HE-NzGhGJ93g', 'text': "My husband and I like to try new restaurants via whatever comes up thru Groupon. We've tried some ok and some forgettable places. But OMG Steve's Grillhouse was a total surprise. We LOVED it. Will go back again with no groupon/coupons-yes they were that good.\nI got the blacked pork chops. They came with House potatoes, mixed veggies and a roll. 2 pork chops. My husband got the green chili burger. I had never had blacked pork chops- They were the reason for the 5 starts. Total FLAVOR!! I'm so tired of flavorless food or food that I have to cover up with condiments.\nThe wait staff were very nice and they refilled drinks before they were empty ( I think that's a plus in the AZ heat)\nOh yeah- sports were on the tvs if your in to that...my husband was.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 5, 'date': '2014-09-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': 'Dt2GkpngikqwsxMtwKFIHA', 'review_id': 'HXf49Ub9k_XyczTkvATyOw', 'text': 'Great place near the convention center for breakfast lunch or dinner. I had salmon dinner which was good and then breakfast this morning which was very good as well. Wait staff has been very friendly and attentive both times. Would recommend this place to visitors to avoid high cost of hotel food.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2014-09-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': '6ebr5nvlNqKY_71Fba_1Qg', 'review_id': 'hqesZdDewbrjJ-3-xR5nTw', 'text': 'Ugh... Rip off. \n\nCalamari was supposed to be served with 2 sauces. It wasn\'t. When I asked about it (20 min later when I got the servers attention) I was informed that what I missed was a generic tartar sauce and did I want it now...\nThen I asked for their "best" "favorite" "most asked for item" on the menu. I was steered to the taco salad. \nMEH - guacamole was fine and that\'s saying a lot. \n\nHad an Amazon Local and they tried to rip me off. Manager was called over and he "fixed" the bill after another 20 minutes and blamed the server.  Walked away and left me hanging again. No apologies no ownership. Nothing. \nCustomer service = 0\nFood = 0\nRip-off artists = 5', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2014-09-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8AMn6644NmBf96xGO3w6OA', 'review_id': 'a8O6A0um6-WLDG4xsGrCdg', 'text': "Bought the Groupon and tried it out tonight.  It was completely dead so I didn't have any issues with service like many other people noted.  Our waiter was awesome and very attentive.  Burgers were juicy and flavorful but perhaps a bit too much seasoning... still very good though.  Their red skin potatoes were super awesome and a nice alternative to fries.  Really good ranch too!", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2014-10-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FmNItFKs6boubJBSvsLNLQ', 'review_id': '5at-AL2nWZ8aYJCo4_pUrw', 'text': "2 stars, all for friendly staff. The food was below par. I had the top sirloin with grill shrimp. The shrimp tasted like it was from Walmart and the cut I got for steak was unworthy of finishing. Way to tough and I ordered medium, I literally bent my fork trying to hS the steal while I cut with my knife. I got this place because I used the app UrbanDaddy which the mood was not the problem, great suggestion, just didn't enjoy the meal I had here. \n\nNot a lot to say. It was dark, small bar, but it is a restaurant not a bar. I wouldn't go back. Give it a try if you want, your experience might be different.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2014-10-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fXKyI0HlHE6rVtHEnqn1ng', 'review_id': 'jKXnhSKW0y37tpdig5tlNQ', 'text': 'Good food decent prices. My boyfriend had the NY Steak Sandwich with no complaints. I had the Tuscan Chicken Breast. Very juicy and seasoned. The seasoned veggies served with it are good as well. Good service. We went on a Groupon but will definitely be back.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2014-10-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'EpDU_vdfZLt8PLvTqiKtaA', 'review_id': 'sSoSIh97YQ9iDPxreH0JIg', 'text': "There are two days a week where Steve's is the best place to have lunch downtown: Tuesdays and Thursdays. $2 Street Tacos on Tuesdays (get the beef ones, they're great!) and 50-cent Wings on Thursdays. The quality of the food is actually pretty good!", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2014-10-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QrNoFLt8lFHK5gY9evkIZA', 'review_id': 'b78m0E4BEn88mSIb1alx2A', 'text': "DON'T SIT ON THE PATIO. We've been there four times--twice seated indoors and twice seated on the patio. When we sat indoors, the service was good, the food was prompt and well prepared (hot). When we were seated outdoors, the service was poor and inattentive and the food was slow and poor (cold). \nWe were there tonight and the service was terrible. The server dropped the salad (one of two) on the table and scurried off. We weren't sure whose salad it was since both of us ordered salad but only one came. There was no table setup and salad is not a finger-food in my world. When we finally saw him again, he gave us a jar of silverware but no napkins and there was no indication of whose salad it was or where the other one was. Finally, we flagged him down again and at least got napkins. Apparently, the salad was mine. It was lettuce with one wedge of tomato and fried tortilla strips. It was terrible.  \nWhen the entrees finally arrived, my salmon was overcooked and dry and the vegetables were cold. My friend's fish tacos were cold. We didn't see the server again until it was time to bus the dishes and bring our checks. He was prompt about that! Then he mixed the checks up and gave me her change. Really?\nIt was horrible. If you decide to give them a try. DO NOT SIT OUTSIDE.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2014-10-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VY1eha3LEt2ELQO9iZ0aow', 'review_id': 'druvAidhmVE-pkIZPg8BCQ', 'text': 'Great breakfast. Open at 6:30am (every day of the week). I had the Mexican Omelette- very good (very hot-spicy). My wife had biscuits and gravy, and she said the biscuits were tender and fluffy, the gravy had bits of sausage, and the half order was just the right amount.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 5, 'date': '2014-10-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9R0oYdqzXyg_X2CVhww1GQ', 'review_id': 'udV3c3zda8njmDENwU65zg', 'text': 'Loved it - very fair prices - open for breakfast too- had a salmon sandwich for dinner -$9 and tasty - tired of fancy restaurants and the prices? check it out -they offer inside and outside seating- 1/2 block from convention center and across the street from the Hyatt', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2014-11-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'kykS7iXkYoJLvlaTPzVf1w', 'review_id': 'j4xPRVDpk9AIYTQnEKABDA', 'text': 'Terrible service had to call waiter for our order . Got the calamari came incomplete with 1 sauce not 2 like it said in the menu. Then the waiter  (20 minutes later) Ignored me when just one foot away from me when i complained about it Did not take our order so we called him again as if we had to chase after him to give out our order. Still Gave the meal incomplete. Then had to chase after him to pay our meal. Food was good but service was really freaking bad', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2014-11-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7wzZj8FVMHW_Elc9kAMfRg', 'review_id': 'OhYiAmIEy-998ux0Kk6_Kw', 'text': 'Average at best... After a solid 10 min, our server finally came over. We ordered the sampler to start, to which he responded "I don\'t think we will be able to do that since we\'re busy" ummm... So you stop cooking once you get busy? P.s. they were not busy. The food was fine. Nothing to write home about, but not bad.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2014-12-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZT-X6uq5-hiA4JFC64kIUQ', 'review_id': 'rlfpcj9PWD_98W-xiaM1Qg', 'text': 'OUTMOTHERFACKINGSTANDING!!!!!!!!!\nLoved this experience!!!!!  Started off with the fried wontons with salsa and guac.  Was incredible, I say again, INCREDIBLE!  I asked our waitress if the salsa was made in house, IT WAS MOTHER TRUCKERS and the guac too.  The salsa tasted extremely fresh and the guac was chunky and tasty as eff.  I wanted to hug the guy who made it.  But sadly he wasnt there.\n\nOn to the burgers.  The girfriend unit and myself both got bacon cheeseburgers.  The burgers were perfectly cooked to medium and medium well.  The seasoning made the burg.  Facking amazing and crispy ass tots to boot.\n\nAny time i find myself in downtown Phoenix i will be thinking of eating here.  LOVED IT!!!!!!!', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 5, 'date': '2014-12-12', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 4}, 'user_id': 'vlyj0sEDEQk-HEiiLWQh1w', 'review_id': 'lezfDi_PuMJ0DRHNnxd2MQ', 'text': 'Came here for the first time on a Sunday for lunch with a party of 3. It was literally right in front of the Hyatt regency doors where we were staying and so I was like okay cool. I\'m a huge carnivore so the fact that I saw the word "green" in greenhouse grill, I wasn\'t so thrilled to try it out coz I knew it would probably be really healthy and quite possibly not have meat options.\n\nWe sat down just in time before it got busy. Looking at the menu, prices were $13+ for much more filling foods like the pasta and chicken menu. They come either with soup or salad. I ordered the white chicken chili for my soup and Tuscan chicken breasts. Now, I hate soup but it came with it so I had to pick the wiser choice that came with meat. I am happy to say that I was surprised it was actually really good. Seriously good. My Tuscan chicken breasts that is covered in Parmesan and pesto was good but I felt that the pesto was a little bit strong. The meat wasn\'t too dry or too juicy. Roasted seasoned potatoes were good and my fruit cup was delicious, absolutely.\n\nThe service? Uhh not a huge fan. Sometimes they take forever to come back and check on your table. At one point, our waitress did not come back for a while that I had to go inside the restaurant since we were seated outside, and go ask for a glass of water in the bar and I brought it to my table. Also, just double check your silverware that it\'s clean. I don\'t think the waitress realized that she got some of the white chicken chili soup on my glass of water on the rim.\n\nOverall, as a carnivore, this place is a good choice if you\'re trying to eat a meat healthy option or if you stay at the Hyatt and you have to be close to your hotel for your flight.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2015-01-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zTKXJE0demeSu7Dq8xyi0g', 'review_id': 'rhu_FVT0KIV7BaZPtCgo-g', 'text': 'The food is good, price is reasonable but the menu is confusing. It is not clear which sides come with what kind of food. Make sure you check that before ordering extra sides.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2015-01-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mqNQJqp8XSS3DHc74faapA', 'review_id': 'UxulWjp1366MmCyof-vVRQ', 'text': "Enjoyed lunch today at Steve's with 2 friends. We were greeted and seated very quickly inside. Our waitress who I believe was one of the managers, came over and took our drink orders. I had the strawberry lemonade which was phenomenal!  I had the tuna melt, my friend had the California burger, and my another friend had the chicken and chips. The food was delicious amongst all of us. I also used a Groupon and had absolutely no issues with it. The food the service and everything was excellent. We will definitely be back again to try the specials.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 5, 'date': '2015-01-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'v9EEs4RhmYqNDXErBCdckg', 'review_id': 'pEEVa2BgkVtPb8Leqta1BA', 'text': "This place SUCKS! No service whatsoever. So disappointed. No wonder we got in right away. BS. I suggested they were understaffed and they assured me they weren't. The bartender wouldn't even sErve me. He assured me the server would be right with me. I will never ever be back this is ridiculous!", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2015-02-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'T7J9ae0wTskrI_Bgwp-4cA', 'review_id': 'Bz2UD9Re811eoy5kDapNNg', 'text': "The location downtown was ideal for us and they have outdoor dining and offer 50% off parking.\n\nPlus, they had a sign welcoming the gymnastics girls to the convention center so that scored points to my daughter, a gymnast.\n\nShe had a kids meal with cheese quesadilla, fruit and decaf coffee which they brewed fresh for her. ($5.50)\n\nI had a breakfast burro with egg, cheese, green chili and potato.  I'm not sure there were potatoes in it?  Served with salsa and guacamole and a side of fruit for $8.  The burrito was bland.  Got iced tea served in a nice huge cup for $2.75,", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2015-02-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ovzrs96BlAe-chKf9Zc73Q', 'review_id': 'e97FYL8jMhIrb6wqXqajXg', 'text': "This place has bad reviews on Around Me so I was expecting a bad experience and bad food.  I mean. It's a bar. But the food was very good and I was seated immediately and very prompt courteous service.  No complaints.  I recommend it. Didn't try the coffee.  I'm going to Starbucks next.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2015-02-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '7pMA9iC-4nXzGKsHL7VxXw', 'review_id': 'mwbcj_jXtrKXNNjFCt7xVA', 'text': 'All I can say is O-M-G!  This is my first visit here and I don\'t think I\'ll be back )at least during lunch time).  I was completely appalled by what took place in this establishment today.  My co-worker and I had placed a pick up order and while we waited to be served we watched the staff and manager treat these customers horribly! \nA silent spoken man walked up to the bar area to "Kathy" asking if she could get his server so they could check out.  She (Kathy) snapped and yelled at the gentleman saying "I am not your server... There are four other people ahead of you... "Can\'t you see I\'m busy".  My co-worker and I were blown away.  The man and his female companion (friend, girlfriend, wife...whatever) then asked for the manager or owner.  Another short hairs blond woman appeared and states she was the manager.  This lady, the so called manager then started to yell at this couple.  I was blown away.  There are so many choices for eateries in the downtown area to choose from that one would think you\'d try to keep your customers.  \nI will say the food was good, but the service from the bartender "Kathy" and this "manager" was unbelievable.  A BIG SMH!!!', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2015-02-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QF5eJJAlJJDYho2Auc9mzg', 'review_id': 'hGaEWPAfRYWqLLCJYRWiAA', 'text': "This is one of those places which gets a lot of foot traffic from the Phoenix convention center which is less than a block away. They cater to all crowds and the staff is always kind. \nI'm not posting just for this though. It's all about their WINGS! They have the best, let me repeat, The Best chicken WINGS I've eaten anywhere in the Phoenix valley. You can get them fried or grilled, but fried is the way to go in my opinion. The Chipotle Honey hot sauce is amazing, but they offer quite a few other flavors such as BBQ, Parmesean, and Garlic. What makes them the best is their size. There are not your ordinary buffalo wild WINGS bite size. These are huge, juicy WINGS made to get dirty.. \nTheir drink specials compliment their WINGs well and I suggest to GO on Thursday, as that is .50 cent wing day!!!\nCheers", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2015-02-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'HcpuW_gRKlFJYriMM8e5pw', 'review_id': 'PULn7ZTIygWoIiPp79vbsQ', 'text': "We were in town for  a conference and stumbled across this place our first night in town and we Loved IT! The burgers and grill potatoes were excellent. The next night we went to Hard Rock and were very disappointed because we had Steve's the night before and it was so much better. We could not stop thinking about how good it was, so we went back another day for their Wing Special. Again we were very pleased. Everything tasted so good and the service was really good.  Prices are very reasonable. We might even go back there again tomorrow for lunch. There were 7 in our group and every one of us Loved our food!", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 5, 'date': '2015-03-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'tJkk31Knw6qZ_mRzq6NGqg', 'review_id': '3HD8x4rkSR-PFWZPQ-SFDw', 'text': 'The food was about what I would expect for average bar fare, it\'ll do in a pinch,  late at night.   The problem is with the service.   Our waitress was rude,  unhelpful,  and very sarcastic.....when asked to fix one of her errors,  the response was "well,  there isn\'t anything I can do about it now,  so sorry".   \n\nWe had a medium sized party,  and there was an automatic %18 gratuity added,  which I refused to pay!   Normally I tip well,  but no way this time.   It is safe to say I will never be eating at this establishment again!', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2015-03-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'J6HRob70Xn-H0aBWsI3kTg', 'review_id': 'qNPRkyCEuwmkOZd_HuafAQ', 'text': 'WORST SERVICE EVER!!!!! The waitress sounded like she had no clue what she was talking about. Menu is NOT at all accurate. Had another waitress yell at me to move out of her way so she could deliver food to another table,  one of the items we ordered was inaccurate and when we asked about it she said there was "nothing she could do about it now". Some of the meals were missing items that should have been included as stated in the menu. It took forever to bring one of the drinks to our party.  Saw one of the waitresses sit down at the table next to ours to take those patrons order. Just an ask around horrible experience.  Will NEVER go there again,  food was not worth the trouble.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2015-03-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'r7BM8kA0AkSsGZs6ehv6og', 'review_id': '239uwH35w5nT_3HiGGvJeg', 'text': "I would not recommend Steve's Greenhouse Grill. The service is terrible. We were seated 10 minutes before my husband got up to ask if they forgot about us 20 minutes before we got our drinks. They are not even busy.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2015-03-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'i_2fQ5WY4ElySO7s4WS7qw', 'review_id': 'XTfESTjvO93RRF5oWunR0A', 'text': "We came here for breakfast after flying in, we'd been up since 2am and were starving. My parents both had huevos rancheros, both said it was ok but not great, but the chili that came with it was good. I had biscuits and gravy with a side of toast and it was decent but nothing special. Husband ordered a steak sandwich and liked it.  Service was good except they forgot my coffee and I had to ask for it again when the food came.\n\nOverall OK but next time I'll go somewhere else.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2015-03-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rkrKxJACaMwyod3sWL6-fg', 'review_id': 'lcD9HcZ8vzEu-X4wOKqLHA', 'text': 'Went for breakfast at the recommendation of the hotel I was stay. When I arrived it took a few minutes to have me seated even though the restaurant was empty ( should have been a sign of what was to come ). When I sat down I told the waiter that I was waiting on another person and they would only want coffee and was ready to order . He brought the coffee but left me waiting for about 10 minutes until I asked another server to take my order . I explained to her what the situation was and she had the audacity to tell me to relax . The manager who came over could care less how her employees treat the customers so we walked out . Poor customer service , would not recommend', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2015-03-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'eGAfB-vUSAMp2UFgpDwPjw', 'review_id': 'cxWkyONK1KrH8twiG9QlXg', 'text': "I have really mixed reviews with this bar / restaurant. It's very casual and has a great outdoor patio in the front facing the semi-private street. I liked the atmosphere a lot. It's more sports related. There's multiple seating on the large patio as well as inside the bar. The bottled beer specials are unbeatable for a downtown bar. Beer, wine, and mixed drinks are 1/2 off. The bottles averaged $2 on happy hour while other bars average $4-$5 for bottles.. Happy hour outside on the patio is 3-6. It's continued to 7pm if you go inside the restaurant. Pricing on bottles is definitely, A+. They have a happy hour food menu with $4 and $5 pricing and a nice selection. I really enjoyed the atmosphere. My experience was completely soured when I ordered the Mexican pizza on the happy hour menu. Mexican pizzas are supposed to be pizzas hence the name pizza. This was a very cheap, flat cheese crisp with limited cheese and jalapenos.It was a cheese crisp at best. It was by far the worse aka Mexican pizza I've ever seen. I immediately complained to the server. I actually told her it was horrific, not a pizza, and the worse example of a Mexican pizza I've ever seen. I told her I wouldn't even feed it to my dogs. She completely agreed!!! She also said it looked horrible and wasn't worth eating!!! YET, there was no offer to comp it off my bill or bring the manager over. I told her to tell the cook it was awful. She just kept agreeing. I didn't get compensated for it, no apology, just nothing. I left the entire thing sitting on the table. If you're looking for cheap bottled beer, a pretty cool atmosphere, and easy parking, this is your place. I couldn't rate it a 1 star because of the other perks. Not comping me and agreeing how horrible the food was is unacceptable.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2015-04-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'qPQX8DZnhpwYwcPYoFjnTw', 'review_id': 'MX1WwGI7xq9ywV_XaBzxQQ', 'text': 'Ordered a steak and potato, turns out they are out of potatoes. Potatoes, people!\nThe $20 steak came and it was layered in fat. Tough to cut through with a steak knife, almost too much work. Talked to the manager, Tony. He basically told me tough luck. Not exactly a customer orientated business, in my opinion. I would not eat here again if it was free.\nThe bright side is, Blue Moon for $3 and a guy out on the curb playing guitar, made it okay. Just really disappointed in customer care and attention to quality.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2015-04-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MlQ8T64p5a3rvjYiPbv4gw', 'review_id': 'JKzQFs93V9vo1Nc1lldjqg', 'text': "Awkward. Is the best way to explain this place. We went there at about 230pm on a Saturday. It was not busy.   The bartender said hello then walked right by us to talk to the wait staff. He kept talking to them while attempting to take our order.  The wait staff hung out by the bar and bashed their customers the whole time.  \n\nI'm amazed this place is in business...didn't try the food and we didn't dare...\n\nAlso, kinda weird that you have to walk through the kitchen to use the bathroom.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2015-04-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'P4HOU7JPF33EBGFK5ZdqAQ', 'review_id': '_MLk-j1BwrjbCf9e83V1wA', 'text': 'The salad was great but there grilled chesse was terrible. The waiter was hardly around to get a refill', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2015-04-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Mu3ygbUWqUDd6-2wTJTkuw', 'review_id': 'oa41I8kYkojRHoZUg4cSXA', 'text': "Don't stop to use the bathroom then eat there. The bartender is the most rude person if the order was not place I would not have stayed after I heard that remark. Ruined my day diem town. So no I won't return. Not a happy camper.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2015-04-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Wi9sUinpVTNlvaAvW1pl_A', 'review_id': '5k79lJPw1vMW-7_qpN7rew', 'text': 'Dirt in my salad , flat beer but they are making it by being expensive, indifferent and slow...', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2015-04-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'noVEeq-9TiYiQB2dGBRt3A', 'review_id': 'mtrLfn634XQD7Hn1eMWT8w', 'text': "This place is awesome! For us it's a nice change of pace, big city dinning. Great food, cold beer and friendly staff. Sit on the patio to get that cooling breeze and listen to the latest musician. Oh, and $5 burgers on Wednesday!!!", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2015-04-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Fec3jKhFWNJDvI7oDiLakw', 'review_id': 'CfPmCRHsGLTuEO6vFhjarw', 'text': u"Burger Night in downtiwn Phoenix finds me at Steve's. Bartender Mike Lowery suggested the super cheese burger with jalape\xf1o. EXCELLENT with the grilled potatoes.\n\nSitting at the bar watching the D-Backs vs Rangers. Life is good.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2015-04-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'HWRMP-z6cuYchcrzFmZTqw', 'review_id': 'KBIr0lQv6xI9ZbIaN7hzrA', 'text': 'Visited the restaurant several times during my visit to Phoenix. Good Happy Hour, I really liked the meatloaf sliders.Staff was friendly especially Shannon.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2015-04-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3MRDaXvqljKKGiPb98_Bsw', 'review_id': 'A4nGWxP65X4PfaigyGSb7g', 'text': "This was my second visit there.  The first was really bad but thought maybe an off day.. food was ok but the service wasnt very good.  Well I was maybe right.. First visit maybe was an off day because the second visit was even worse.  Rude staff, not busy, couldnt get waited on, the staff were bickering it seemed.  FINALLY got our food--only 3 of us-- and then couldn't get refills or a check.  Done.  Cant even imagine what a third visit would be like.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2015-04-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'c5AqKJaxLRAJYOOLV170bQ', 'review_id': '7Sa4RiGglm9VTDWuhG2hhw', 'text': 'Disappointing.  Ask for medium well burger. It was rare. Sweet tea from a fountain. Servers were very nice. Fire the cook!', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2015-05-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yK27ag6QSyfUPmg2SyEeLw', 'review_id': '7MYsY99pIOM6XqOD_CXJpA', 'text': '"Jo" was a great server!  Convinced one in our party to get the grilled fries NOT the french fries, and the spuds didn\'t disappoint! The New York steak sandwich was scrumptious!', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2015-05-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_WG5_cxIVeY4_gR8AJJczw', 'review_id': 'X-3M3m2qlr2plKQNJhMsFA', 'text': "Great hole-in-the-wall bar! Good drink prices, and huge menu. Never had anything I didn't like. Daily specials like $5 burgers and taco Tuesdays! Good spot to go before a game or to watch a game.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 5, 'date': '2015-05-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 0}, 'user_id': 'q3CPVKQ4vLNdjMxLDLL27A', 'review_id': 'Vr9PDS9ltgPhQje8tB6DOA', 'text': u'Thank you, so much, for ruining my Phoenix Comicon this year. NEVER AGAIN will I EVER go to this place again.\n\nWalk in and the place is packed - much to be expected during Phoenix Comicon. Menu selection wasn\'t the best, but I ordered anyway because I was hungry and my boyfriend picked the place. Took a while to get our food - understandable due to Phoenix Comicon. When we get our food, DISGUSTING. \n\nI have never, in my 23 years of life, had to salt  burger I\'ve ordered from a restaurant. I ordered a medium burger, got something that was thrown on the grill for 10 seconds on each side. I ate it thinking it was just me being picky but it really was undercooked and gross. The Jalape\xf1os were the only thing keeping me eating the damn burger, and throwing salt and their salsa on it. Fries were just a hard pile of grease.\n\nWhile we were trying our best to eat this stuff, I notice the wait staff hanging in their corner all at the exact same time, not tending to any tables. I let the eating food in the corner slide because I figured they had been busting their asses all day busy with convention goers, but they just stood their chattering for about 10 minutes when they could be wiping tables or clearing tables or whatever. They were just plain lazy, all except for the guy with the camo avengers shirt and the dish bucket.\n\nOur table was so full and cluttered with useless crap that didn\'t need to be there. There was barely enough space for our food on the table.\n\nThey didn\'t ask us whether we wanted a booth or table. The regular tables were uncomfortable, YET I was in a seat that faced an empty booth that looked much more comfortable. Would\'ve been nice to know my options.\n\nHuge group of kids show up and they\'re screaming their heads off all hyper and stuff. Which I understand, BUT do you seriously have to yell, "WHO WANTS BURGERS? WHO WANTS SPAGHETTI?, Just ask the kids individually and treat them like a normal person. This isn\'t a damn school field trip and it was very annoying for everyone else in the restaurant, not just me.\n\nAfter we tried to digest the meal we just had, I wanted to be far away from that place as possible. Get to our hotel room and, just my luck, FOOD POSIONING. So, thank you, so much, for ruining my Phoenix Comicon experience AND my Friday night. Whatever tip my boyfriend gave the waitress was NOT well deserved at all, and I don\'t say that often (or ever).', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2015-05-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9RhliONg-lmdBba9oP2QUA', 'review_id': 'KcozVIkFxpU0_QURNQSimw', 'text': 'We started out Saturday morning May 30th with a breakfast at Steve\'s. We wanted to entertain ourselves by watching the amazing Comicon crowd and we were not disappointed. Our waitress, Kathy greeted us with a smile and sat us in the huge outdoor patio. She immediately told us about the free Wi-Fi and the specials. She served our drinks within minutes of ordering which impressed all of us because the restaurant was full. I had a Grey Goose Bloody Mary that was fresh, mildly spiced, and mixed perfectly. The breakfast menu is huge which is refreshing for Phoenix. I ordered the California Omlette, and is was huge, fluffy, full of vegie\'s topped with cheese and guac. I could only eat half but Kathy quickly put the rest in a to go container. This was the best omelette I\'ve had in downtown Phoenix. Two Bloody mary\'s later we left and we\'re thanked by 3 different people on our way out the door. Needless to say, this will be where we go to dinner tonight and a "go to" from now on.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 5, 'date': '2015-05-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oNG_Yly05okihYDbOqYITA', 'review_id': '5HqxyzJ1KFM_2HIDgOf9JQ', 'text': 'Location, Location, Location.  That is all.  Only been there once, but yuk, what, and hello..? (food, menu, and service) will prob give it another try.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2015-06-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'of1geEWHCSVhhF4vFrDysw', 'review_id': 'LsBiOyKgRZ70E6qPINtAwQ', 'text': "Awful place !!! We went after a baseball game and it's was packed. 30 minutes waiting for a table. The host was dumb. She had not idea what she was doing. I ordered a chicken sandwich and it was cold and horrible. My partner got spaghetti primavera and he got spaghetti pesto instead. Never again", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2015-06-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'igD3xrixYp_klbguMHxo4g', 'review_id': 'SpAQC98LIGBSMEGEKT1rRg', 'text': "The food is nothing special. Bar food at its most average. The service is inconsistent, but prompt. The beer selection is pretty decent. Overall, you could do worse, but it's cheapish and convenient if you happen to be around the convention center.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2015-06-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uq1y9VRH9vOy91x8f4TQSg', 'review_id': 'jx0gGa4CeZq1kuZvVEbuAg', 'text': 'Waited 20 minutes for a server to come over and give us water. The server finally came over after we asked 2 people for our server. After that she took our order on a newspaper that she grabbed off a stand because she didnt have her pad. She took out orders and the wrong food came out. Food was bland with little flavor. I do not recomment this place.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2015-06-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bMe9uMGUhBydc0zgGAHgXQ', 'review_id': 'o85mIKDGKp1utFYqs46iDg', 'text': "Not impressed. Ordered the patty melt and fries for lunch. Food arrived in less than 10 minutes, so I have no idea why fries weren't piping hot and instead, barely warm. Patty melt cheese wasn't melted. Pretty bland sandwich. Served with 1000 island dressing (no, it wasn't a reuban ).  Generous wine pour though. Sat on patio around 12:30. Crowd was light.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2015-06-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GsvY5GSYQk7LGhbWTIc3Zg', 'review_id': 'zg3oEdx0J-rpeEYALnK6Ig', 'text': 'Bad food, service and very bad attitude from the manager.who chewed me out when we complained.  They could not find a desert menu, sat at table for 30 minutes before we got food menus, convention n sports people beware.  This is the ultimate riip off tourist trap.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2015-06-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'hq5uZIPcNc5vLu0tLcUgUw', 'review_id': '8wBjrohTyVDcElKOsjImbA', 'text': 'Very slow.  Staff seems confused.  Several tables around us were complaining about the service.  At least it was a cool place to get out of the hellish phx summer.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2015-06-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'HZY9WlNUiPS8_1q_ge9LRg', 'review_id': 'vzipF3A4LtFo1bnf1YntbQ', 'text': 'Had meatloaf, avoid it the tomato sauce is vinaigrette based.  Portions are small and dried out.  Friend had chicken fried steak extremely large plate size steak.  Tasty\n\nI really enjoyed the white bean chili.  Soft taste not to big with the smokey flavor.  \n\nService was horrible.  Our waitress disappeared?  Manager seemed repugnant even when we walked our ticket to her to pay.  Had to wait until the end of the meal for water refills and had to get the bus boy to help us.  \n\nLow cost food, but there are so many better choices downtown. Skip this place.  You will not miss it.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2015-06-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'lUY6BuVeOACC19tfupm1mg', 'review_id': 'orlxjHMeOflqg4mkSbP9Cw', 'text': "This is a funky place, but awesome food! My friends and I ate here twice during a conference. Quick, tasty, and reasonable. \nBetween us, we had crab cakes(who knew in Phoenix?), burgers, soup, salad, chicken strips, and the most amazing sampler platter I've  ever seen! Every dish was excellent.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2015-06-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rTJjz8u0R5MtapXigeVgvw', 'review_id': 'O2_MRD3Kc-W0tob-YJ11TQ', 'text': "It was a warm morning here, but not as warm and friendly as our server Gordon was. I had breakfast, hash and eggs. The food was excellent, the coffee never empty and the price was very reasonable. Eat here, you'll like it!", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2015-07-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': '0trYkEZFTej_lt8mi0ELWw', 'review_id': 'gemD2AnEJke5Yypj9XqFDA', 'text': "Received a Groupon from a friend, so decided to check this place out before it expired. We stood at the hostess stand for 5+ minutes, before finally grabbing one of the very busy waitresses who ended up seating us. She was very nice, but you could tell she was in over her head and they were under staffed. She did the best she could, but it shouldn't take over 30 minutes for your food to arrive, especially during lunch. The food was mediocre, nothing to write home about. \n\nWith all of the conventions and nearby hotels, they have the potential to do great things, but from my experience, I don't know that I would ever return.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2015-07-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'y6q92_h-cM-mbRfEtOHJ0w', 'review_id': 'lYy38K0PNTp-oa7frWdk5Q', 'text': "Horrible experience ! Waited 30 minutes for food, only to be told they had 1 chef and the 2 items we had ordered were out. Reordered  different things, after another 30 minutes still no food. Paid for our drinks and left hungry. Don't waste your time!", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2015-07-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'Ob-aUBLAA9JhhwC4VUTQSQ', 'review_id': '2e8MG7Gcu-bAkqdwsVSWBg', 'text': u"We were seeing a show at Comerica on a Sunday and discovered that many restaurants in the area don't open on this day!  We bought a group on and hoped that we would be one of the people who had a 4/5 star experience and not a 1.\nWaitress was very nice and food was prepared adequately.  They were helpful when we asked a couple of questions.  \nHonestly, I think what people mind is the d\xe9cor-we realize that it's a sports bar, but the patio was not ideal to sit in, the inside felt as if it could use a major facelift and they had their paper products (cups, napkins, etc) in full view of all the customers.\nSomeone was right there to seat us immediately.  it was an okay experience", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2015-08-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kASDrzMXITaZdYoLRekVFw', 'review_id': 'WQUpH2iH0ZGqVKgLhNHwgA', 'text': 'My husband and I stopped in here one night right before 11pm after a concert. We walked up to the door and saw the hours posted on the door saying they close at 11, so we turned around and started walking away when a waiter opens the door and tells us "We\'re open!" so we go inside.  I believe they\'re open until 2am on Saturday night.\n\nWe are vegan and this restaurant is not geared towards the vegan crowd; however, they do have a garden burger on their menu.  They were so kind to make vegetable fajitas for my husband.  There drinks were superb with the Cadillac margarita being one of the best my husband has had!\n\nTony was our server and he was amazing! We sure enjoyed talking with him.  He loves working there and was so enthusiastic about his job (his 2nd job for many years) and his family. \n\nThe atmosphere here is 2 stars but you need to overlook that.  The patio is way nicer than the inside. \n\nGive this place a try and support a locally owned business in downtown Phoenix!', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2015-08-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'O-VK6aGY2S1kLMxKT0C4ZA', 'review_id': 'YFe5DHB2dViE4v-PKCB9lw', 'text': "HORRIBLE!!!!!! After we got our food, we never saw another worker again. I couldn't even get a soda because I could not find anybody. Once we did, the girls who did work there were sitting in a booth eating dinner and when I had to get my fiance to get up and ask for our check they looked at him like how dare you bother us.  Will never go again. Food had no flavor what so ever.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2015-08-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'ZhnXBRziSyXZHG5B3GebcA', 'review_id': 'FnPJ_CRymkJVT1doQfdJww', 'text': 'Meatloaf breakfast was terrible (worse than frozen dinner) and service equaled the food.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2015-08-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'pA_eifXHOUftssGehzI0sA', 'review_id': '8UJZrMsXyX-OOxID_3V5pA', 'text': 'Went here for the DTPHX wine walk and it was the most disappointing of the few stops we made. A pitiful small poor plus we had to pay tax on top of the $3 wine walk sample price, they were the only place that did that and everyone involved in the walk was only carrying cash so that seemed weird. The food was serve yourself and was a bread and spaghetti sauce. Considering the free advertising that a public event like that provides you would think they would put in more effort. It is how you are representing your restaurant. I will not be going back here.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2015-09-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Q3G4aBrpup-kyJP6LWB-Pw', 'review_id': '3J-WWQ-Lswpj6amwiqdsYw', 'text': "Crab cakes blew!  When we asked if they were good, got a strange look and less than reassuring reply for waitress.  I suppose if you can't say anything good, don't say anything at all.  Hellish water!!!  Margarita was tasty.  Big zero, not going back.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2015-09-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'A35ae41mm3HBSAZ0OMzgHw', 'review_id': 'sqvurBKOsYLzgZxI4oOwcQ', 'text': "Our party of eight came in to an empty place to celebrate my birthday.  We sat outside to enjoy the live music which consisted of a guy playing a guitar.  We ordered food and drinks and were enjoying ourselves until the resident street people came around ...along with the owners.  As the woman owner walked in she appeared to try and become confrontational with us but then went inside.  Just after that, our party was told we wouldn't be served anymore and were cut off.  After we explained that none of us were driving they graciously let us stay for a brownie with a candle in it. We were then told we had to leave after I went in to talk to the waitress and the male owner tried to stop and listen to what I was saying to her which made me stop talking until he walked away.  That's when we were cut off.  It was a clear and vulgar display of power. It seemed as though the owners bought a bar so that they and their friends could drink.  I can see now why it was empty.  Good luck with that.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2015-09-14', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 1}, 'user_id': 'rNTn-3bsXjYIn7-Ug64L-A', 'review_id': 'qzZh8Fgu_i4XQVfYB220XA', 'text': "I literally downloaded the yelp app just to give this rating. Food shit, service absolute shit, bar super shit. I'm incredibly pissed off and disgusted and being a small business owner I honestly hope you crash and burn and have to file for bankruptcy because of your absolute crap service, food, and generally everything.\n\nAlso, fish and chips requires... REQUIRES vinegar. Holy awfulness.\n\nMusic was the only good thing.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2015-09-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oEOxm94SuMQD_rzpQt2oig', 'review_id': 'h1Tr5HJdzCIG5fUJIQR0Ig', 'text': u'I like this place. They accommodated our bicycle club with reserved seating on a Saturday and even allowed our Acoustic band (The OddBalls) to get up on stage and play a few songs. The beer is cold the food is good. I took advantage of the daily special; Miller High Life pint and $5 burger. I chose The Chili Burger. Nice options available; poblano, jalape\xf1os, verde or red chili. Side options were good too: fries, tater tots, cottage cheese or cole slaw. I chose poblano and tater tots', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2015-09-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '9kRhaU5L37Z5Gam9vkr4iQ', 'review_id': 'DoKJK7FXmx-Nrnm5ZZUxBg', 'text': "Great food at a reasonable price!! Head over and ask for Betty Boop!! She'll treat you right! The chicken cordon bleu is amazing! Check out the patio seating on a comfortable Arizona night!! Thursdays bring about $0.50 wing night, and the sweet honey chipotle is so good! A must stop for good food and friendly people!!", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 5, 'date': '2015-10-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cw-6s5AjOfJnDmOq7N-WaQ', 'review_id': 'ncfrNE0JgNHvogXrw-CGeQ', 'text': 'I am giving this place 5 stars. I am not sure why people rate it lower. Okay, ambiance could probably be slightly approved, it does resemble a low/mod sports bar in terms of furnishings. But there are a lot of positives. It has a pretty expansive menu - what you would expect from a bar and grill. You can get anything from steak and burgers to pasta. Most importantly, it is well staffed and they care about their customers. I heard one of the managers asking his waitstaff to checkin on a particular table. Service is key in the restaurant industry. Oh, and their kitchen was pretty fast. Order to salad was like 60 seconds or less.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 5, 'date': '2015-10-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'r-QvzN6xTCIoNSra0JoOGQ', 'review_id': 'uFU9r4_OkxAsiNp1Cy9o2Q', 'text': "Horrible food & service!   Don't waste your time or money on this place!  I ate here last Saturday with some friends and it was one of the worst dining experience I have ever had.  We arrived and were asked for our order after about 5 minutes. Not bad but it got much worse from the on.   After another 15 minutes drinks were finally delivered. The problem was we ordered vodka tonics and received vodka and cranberry juice.  We stated that was not out order and they took them back to get the correct drinks.  15 minutes later still no drinks.  We are at a total of about 35 minutes now waiting on drinks.  My friend finally walked to the bar to see about the drinks.  The bar tender was extremely rude saying oh you mean the vodka cranberry drinks I made.  She explained that wasn't what we ordered and he decided to make the correct drinks.  Now that we finally got drinks another 20 minutes passed and we still don't have food. Mind you the table behind us placed there order after we did and they have received there food and are finished by this time.   We have been there almost a hour by now.  I complained to the waiter letting him know we needed to be at a concert said he could just bring us our check for the drinks.  Totally shocked I said you are really charging is for drinks that we waited 35 minutes for and had to get ourselves.  He said he would send a manager over.  Manager was useless, just didn't want us to leave on our food order.  Surprisingly food arrives soon after the manager walked over - we order flatbread that was cold and tasteless.  It was awful!   We asked for the bill and we were being charged for everything.  No attempt at making up for their horrible service at all.   The manager finally took 1 drink off the bill - very big of him!   I guess when your restaurant is this bad you are used to people complaining.  I would give zero stars if possible.", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2015-10-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cQlT-mx5Tgb0K404yKEwnQ', 'review_id': 'e73QTY3-qTaDmESkP_1ZFQ', 'text': 'Had the fish tacos! Best ever!! Yummy! Yummy!! Great food, great price, great service!!', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 5, 'date': '2015-10-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': 'cQlT-mx5Tgb0K404yKEwnQ', 'review_id': 'w1HByqZbnEwMha9FQ_yUeg', 'text': 'Had the fish tacos! Best ever!! Yummy! Yummy!! Great food, great price, great service!!', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 5, 'date': '2015-10-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'BCn1nGhx6HzF0bcymKNI8Q', 'review_id': 'sdB0RzzImyVWQHMQ_jz3Ig', 'text': "You service sucks. I literally watched your manager and employees discuss their schedules and who was closing.. While I waited for a drink that nobody served at your bar that nobody was behind. I hope Steve and Mike figure out who's working today #SUCK", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 1, 'date': '2015-10-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'vOvBtgSQHFY2KwPH3L2QlQ', 'review_id': 'VJF14kkKPdc4DeYAz4sdZQ', 'text': 'My experience here was just average. Our server was fun, but the food was nothing to write home about. We were also always chasing the server for utensils and water refills. It was a very busy night, but it was a Saturday in a convention city.  Should be used to the crowd.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2015-10-29', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 0}, 'user_id': 'p7XXnH02kU9ULn0fWaHNYw', 'review_id': 'bnWa8Pp1uOXmVdiLCjyURQ', 'text': 'Nice location with good outside seating area. They have live music sitting outside in front of the resturant with great singers!\nService was so great! Absolutely friendly and taking care. Good selection of local beers to very good price level.\n\nUnfortunately the burger was not meeting my exectations; std. pattie with sticky bun... This can be done better. At the end I was so satisfied with the good service staff, so that I can provide four stars :)', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2015-11-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GTXnk7FH5JdcmjGHFxGewg', 'review_id': 'g0r782a_9IfOdUdWmIWKjA', 'text': "Friendly bartenders and cheap drinks. Seemed like a dive-oasis in an over classed and overpriced desert. Wifi is free and good for simple internet but bandwidth limits didn't let me watch my Dallas Stars game. Would come back!", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2015-11-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'J3eiMX88FDJwtvxMBGtjEA', 'review_id': 'mzBBuHaFfwrpHu9LvcSstA', 'text': 'This place could probably be winning or losing depending on the nite. For me, not a big win.  First they were out of the beer I ordered.. only finding out after 15 minutes. Secondly it was $5 burger night and a turkey burger was included but you could not order any toppings a regular burger had unless they charged you per topping.. odd when turkey was "included in the deal" .  Then.... I bit into it.. it was okay.. and then.. as I pulled the burger away from my mouth after the 3rd bite something held on.. a hair lingered in between the burger and my teeth. Not mine.  They made me a new one and the manager never came around or apologized and they still charged me.  Last time I had a hair in my food they made me a new plate and comped my meal and management even apologized\n..mishap forgiven; customer service cherished,  and I still go with love in my heart for the place and the delicious food. Not this place! I understand that randomness and mishaps happen, but to not treat a customer with respect afterward does not deserve my appraise.  Props to the new waitress who had to deal with it, however your management should go back to hospitality school.  What a shame. It could be an awesome place, great seating indoors and out, and even some live music.. much potential. I hope it gets better. Good luck.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 3, 'date': '2015-11-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UUkJVU96KO00RWXxoyQrgQ', 'review_id': 'uUfu2sGxi_yBbZKKRuRkfw', 'text': 'Chill bar atmosphere. Very large menu with lots to choose from. It was our servers first day and she did a fantastic job!', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 4, 'date': '2015-11-28', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 7, 'cool': 6}, 'user_id': 'fm5-O3_otnzaAFHYH4pYRw', 'review_id': 'Xni4_up0-c-PJzS_kDmhGg', 'text': 'We stopped in here for dinner because it was very close to our hotel and we were able to be seated immediately. They have outdoor seating, which we chose since it was a nice evening. The seating its self was lacking. The staff was nice but not on top of their game. They did not come around often enough and made some errors.\n\nI was feeling like something simple so I ordered the Breakfast Burro. It comes stuffed with scrambled eggs, green chiles, potatoes and cheddar cheese. I chose to add sausage. It was good sized, enough to fill me up. The flavor was a touch bland, but I was able to overcome that with some hot sauce.\n\nThis is not a bad place. If you are looking for affordable bar food, then it probably will be ok.', 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2015-12-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '0CwMCyAVXVhhTEFuUnhImw', 'review_id': '5YMSqZ2nH5SvgH34_q70ew', 'text': "I stopped at this restaurant for breakfast, because it was close to my overpriced hotel. The food and service was mediocre.\n\nI ordered the Huevos Rancheros ($9), in which the beans were cold and the  fried potatoes were not cooked completely. A cup of average coffee cost me $2.75.\n\nI won't be going back", 'business_id': 't_0576Esa58pcLHCEpj31A', 'stars': 2, 'date': '2015-12-06', 'type': 'review'}
