{'votes': {'funny': 4, 'useful': 7, 'cool': 5}, 'user_id': 'nc3cqVN0UuB3m50-CcMftw', 'review_id': '2uyQYXdhqWGCrthSRQF-JQ', 'text': 'While there seems to be a saturation of Thai restaurants in the Central Corridor, I\'m not one to complain when something new comes along the pike. And Thai E-San is a welcome addition to the eateries in our area. And being opened less than a week didn\'t stop us from trying this place out. \n\nFor starters, Thai E-San took over the former Big Wong space. Since I\'d not been in there in ages, I\'m not sure if the new tenets did a massive overhaul or if they moved into this clean space. It feels more like you\'re visiting your Asian aunt than walking into a restaurant. The tables and chairs are so huge, I felt dwarfed by them. The multicolored lights cast interesting hues in the room. But it is a little too cold, temperature-wise for me. \n\nOkay, on to the food. Robert M ordered the crispy pork with Chinese broccoli; I ordered the beef Mas-Sa-Mun curry. Robert\'s meal wasn\'t exactly what he expected, which would have been cubed pork chops battered and deep fried. Rather, it was pork with the skin still on and crispy. I liked it. The Mas-Sa-Mun was beef stewed in a coconut milk sauce with potatoes, green onions and peanuts. I\'ll get it again, but hotter than mild as it lacked the kick. But, I ordered weak so that\'s what I received. \n\nThere were a few hiccups: service wasn\'t very attentive, the dishes came out at different times, another table received soup instead of fried rice (but the guy was a nimrod who insisted on eating with chopsticks and proceeded to holler at the staff from across the room), and the bill was delayed in its arrival. All things that should iron themselves out as the staff--which appeared relatively new to waiting tables--grow more accustomed to their craft and the kitchen becomes better choreographed. The prices seems a little high, but in these times I feel like any amount could be construed as "too high." \n\nI\'ll definitely be back, but to order different items and find their signature dishes. I\'m thinking their "Special noodles, Soup" items are looking mighty fine and the lunch specials sound like a great bargain, starting at $7.95 for a lunch dish, fried wonton, egg roll and cup of soup.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2009-08-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'STRH5HCQ9lkCMNy5R7pq9Q', 'review_id': 'hTC2LWOzDcr_4wnvbCgttA', 'text': 'I stopped in to pick up some Green Curry tofu to go, and have to agree that unless you\'ve got a crew, the seating setup doesn\'t  seem like it would lend itself to intimate dining. But it\'s not anything unexpected as far as decor. Much like the Indian restaurants on 8th Street in NYC, if it doesn\'t look like the inside of a fully lit Christmas tree, there\'s something wrong.  I enjoyed the substantive look of the chairs and tables, actually. Compared to the converted diner look of Thai Rama, there\'s much more opportunity for ambience in the evening, for sure.\n\nBack to my food: I asked for it hot, and said "I can handle it." I likes me some spicy. The hostess was super nice and I waited maybe ten minutes before my to-go bag arrived.  As a lunch special, it came with a spring roll and soup, which made quite the spread for ten bucks. The green curry was awesomely spicy, savory and the veggies were nice and crisp, however, I would have liked a firmer tofu in it. The rice was nice and sticky and aromatic, too. \n\nOverall, I think Thai E San gave me a great calling card with that one dish. I will definitely go back with friends to try some more dishes we can all share to explore more of what the restaurant has to offer.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2009-09-04', 'type': 'review'}
{'votes': {'funny': 7, 'useful': 11, 'cool': 12}, 'user_id': '6kmu0mYbdpMIOZ6Y0eVsxg', 'review_id': '3ISpwI5_v2aSgaQEkila1g', 'text': 'Definitely the prettiest Thai restaurant!  I walked in to meet with one of my favorite girls, Ayesha S., and saw her sitting at a HUGE table.  Huge.  For two of us.  It was a big, round, marble monstrosity but very stylish.  \nWe started out with the spring rolls with shrimp.  They came out and they were gigantic!  That must be the theme here.  Definitely fresh ingredients and nothing in it was overdone.  \nService was a little spotty at the beginning, but improved during our meal.  They refilled out drinks a few times without having to be asked.\nI got the spicy mussels.  They came on a big (HUGE) platter with a few sauteed veggies and a spicy sauce.  I know mussels aren\'t very good as a leftover, so I ate them all.   I didn\'t feel stuffed like Thanksgiving at the end of the meal, but properly sated.\nI will definitely be back again.  I\'d like to try a few more items on the menu.  Like Ayesha, I\'d like to see more heat.  "If it don\'t make ya cry, why would ya eat it??"\nI\'d also like to meet the owner.  I mean, since everything is so huge...maybe it\'s a reflection? ;}', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 3, 'date': '2009-09-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'bc3SCW1ccSPWbmGtcpeExg', 'review_id': '5oAXfGrWtydyTljLIn_4bg', 'text': 'The BEST Thai restaurant ever!!!! If you love spicy food, this is your place. I would recommend Thai E-San to everyone who fall in love with "Lemongrass Soup" and also "Curry". It\'s just right, I can\'t explain you\'ve better try! such as Satay chicken(took so long but yummy) Lemongrass soup, Spicy Fried rice, and Mus sa man curry Ohh! don\'t forget Thai tea for your drink. \n\nI definitely will be back. Thank you', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2009-10-31', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': '_PzSNcfrCjeBxSLXRoMmgQ', 'review_id': 'zHXL7hSLavHi2CAzSfEYyQ', 'text': 'We had a party of 5 celebrating a b-day! I am giving them 1 star not because of the food, it was because of waiting for over 1 hour for our food. After an hour of waiting and watching the other par tons leave because they can not wait, our appetizers came out then the soup. Then one by one our dishes came flowing out of the kitchen. The b-day girl insisted for us to wait, because to her the food is one of the BEST. The food was good, but not the BEST. Was it worth the hour wait? NO!', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 1, 'date': '2009-11-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'gcyEUr4DXcbjnGRAWFtfAQ', 'review_id': 'PuEbQIa6EM1cAmth1ZNdsA', 'text': "I'm a sucker for a great local Thai restaurant, so I decided to try our Thai E-San (since it's right around the corner from my house). I was able to call my order in, and it was ready about 15 minutes later. It's in what used to be the Big Wong Chinese restaurant, but they've made some nice changes inside. The decor was very nice and inviting, and I was promptly greeted by a super cheerful lady all ready with my check. I ordered the  Pad Thai Lunch Special with chicken and Shrimp. I ordered it with two stars for the level of spice, just to be safe. the lunch special came with a humongous bowl of soup, a spring roll and a humongous heap of Pad Thai. I started with the soup, which I found a bit off putting (but I'm not much of a soup guy, maybe my wife would llke it better?) Next I dove into the spring roll. Not very good in my opinion, but that could just be my taste. I wasn't a fan of the texture, and there wasn't much flavor in the spring rol. The pad thai was pretty good, I've definitely had better. Will I go back? Heck yeah I will. I only tried the one dish, and it was pretty good. Next time maybe I'll  try one of the many curries they have on the menu. All in all, I shelled out 7 bucks for lunch for myself and what will most definitely by lunch for my wife tomorrow.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 3, 'date': '2009-11-10', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 2}, 'user_id': 'b9XdpPlzZCVimhNb0z8CNA', 'review_id': 'bDnRCkIqofwW80AirbyAIA', 'text': u"We've wanted to try Thai E-San since they opened, and we finally made it down.  The ambiance is very nice.  The music was soothing and appropriate, but the food left something to be desired.  We started with the pork satay.  The pork was very good and perfectly cooked.  But the peanut sauce was bland and chalky.  I couldn't taste the peanut.  For our entr\xe9e we ordered the Panang; Chicken with carrots in coconut milk and peanut sauce.  Maybe it's just me, but I don't like the spice that makes your food taste like lemon cleaning fluid.  Is it ginger? I don't know really.  But the Panang had a lot of it and that was all I could taste.  The service was good and the other patrons seemed to enjoy their meals, so to be fair, I would have to reserve judgment on Thai E-San until I've tried a few other things on their menu.  The problem is, we really like Thai Lahna and they aren't much further away.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 2, 'date': '2009-11-11', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 4, 'cool': 2}, 'user_id': 'CAlxnkAuqNetlUmWtCQ_eQ', 'review_id': 'QDDu1NR9l6OpVV3cT34_-w', 'text': 'You know the food is going to be good and authentic when Engrish is involved, the online menu lists "Stirs Fries" and "Fried Rices". My hope is that ethnic food is as authentic as possible since it\'s an opportunity to experience the food and culture of somewhere I might not ever get to go. And Thai E-San does not disappoint.\n\nThe menu is expansive, with something for everyone, tofu, fish, chicken, squid, duck, beef, pork, vegetables, rice, noodles, you get the idea. The ingredients are fresh and high quality.\n\nThe prices are reasonable (especially considering the portions are enough for two meals) and they have great lunch specials.\n\nThe staff is courteous and friendly.\n\nI just can\'t get enough of Thai E-San. It\'s some of the best Thai food I\'ve had in the valley.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2009-11-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': '68WiOF02xISzb9Q6VLQRkA', 'review_id': 'nqQWsdJCkoA5X0QoAoEuWQ', 'text': 'As a big fans of Northern Thai food, we were excited to try this place.  The food was great and they even have sticky rice.  Everyone there was friendly and service was quick.  The decor is definitely different, but the large tables actually proved useful for all the dishes we ordered.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2010-01-05', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': 'WJkmgkrSPMHTfDTD3VgqqA', 'review_id': 'vjxRe0XJF2QBMNAJUDrJiA', 'text': "I wish Big Wong is still here... but instead its Thai ESan.\n\nAfter my bad experience at Thai Lhana I thought I would redeem the Thai cuisine by checking this place out for dinner. The parking lot look busy but when I got inside, there were maybe 5 couples seated. There were only 2 servers so we waited a bit before being seated.\n\nThe place was scary quiet, library quiet. I couldn't figure out but then I had an AH-HA moment... the tables were GINORMOUS. I felt small sitting in the chair and the round marble tables normally seat 6-8 but are used for couples. Everyone was seated so far away, screaming would have been a good conversation level. \n\nThe two servers seemed pretty busy so it was a while before we were able to put in our drink orders. We both ordered an iced thai mil tea which was good, standard. \n\nWe ordered a Thai Sampler Appetizer: wontons, fish cake, chicken satay, egg rolls and Thai Toast, pad thai and red curry (spice level 4 of 5).\n\nIt was about 45 min before our appetizer made its way out. I would normally be understanding if they were busy but there were only 5 other couples in there... and its just a plate of deep fried goodies. I think that should have taken 10 mins.\n\nThe egg rolls were probably the best. The wontons needed more filling, I pretty much ate deep fried wonton skins. The fish cakes were good but overwhelmingly seasoned with lemongrass. It was almost too much to eat. The chicken satay were alright, a bit dry from the grill. The Thai Toast is battered tofu and deep fried, of course... would have been better if I had some maple syrup. It was deep fried beyond recognition.\n\nThe pad thai noodles were mush. The noodles were overcooked and just stuck together in a huge ball and was hard to separate. And while I wanted to taste it, I honestly believe Thai ESan cooks season all their dishes with a huge heap of chili powder. Every part of the noodle was covered in the chili powder. I'm actually still flossing out chili flakes from my teeth. It was too hot to even enjoy.\n\nThe red curry was good. I liked the coconut flavor and fresh basil. Never had curry with green beans and bamboo shoots before but it was good. Also another dish with a generous heap of chili powder added to it. I couldn't have anymore because my lips were on fire. \n\nI know Thai food is spicy but damn... let me taste the other flavors too. All I tasted was HOT. I couldn't finish the curry or the noodles. I thought Thai ESan would convince me that Thai food was amazing again but it was too hot to handle.. and not in a good way either.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 2, 'date': '2010-01-15', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'uqK3yvpg5Evk_XgzMW-lAw', 'review_id': 't768vEQ4rmuqxZiN34DTtw', 'text': 'I hope it was just a night of bad experience in service.  I was there for a birthday dinner last year.  There were tables, but disappearing quicker due to no service. There were only one waitress and one chef doing all the work.  Entrees served one hour later.  Appetizers came at the same time as the entrees.  The foods were delicious after an hour wait. \n\n  \nPrice: Average\nFood: Excellent\nService: Horrible, hope it was just that night! \nMust try: Thai fish cake, Satay, Tom Yum Soup, Thai tea, Sticky rice, Pineapple fried rice, Thai tea & Curries.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 3, 'date': '2010-01-15', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': 'QwO4LVCiPZZdg5URrQfYpw', 'review_id': 'Jheago_JfCsjsw6HaTC6ew', 'text': "In the death throes of Big Wong the place had really  fallen apart. I was glad to see that the new owner had revamped the place. Nice decor...TABLES OF BIBLICAL PROPORTIONS. These tables are not only something that you'd expect to find at the top of a beanstalk, but I think archeologists will have a big find in a few thousand years (sturdy). The walls have been tastefully painted. The ceiling has been restored to it's 1970's, stick your pencil into, glory.\n\nFood: Hot. Great gobs of hotness. They give you a scale of hotness (I love thai people) of 1-5. I hesitantly ordered my Spicy Noodles at a level 4. My wife ordered her pad thai at a level two. My dish came out at a perfect heat for me. The noodles could have been a little less done. I couldn't taste the spice at all, but my wife still enjoyed it. \n\nAll in all, I'll probably be back.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 3, 'date': '2010-01-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 4, 'cool': 0}, 'user_id': 'Aaafbip-U2aeTXbvinBLiA', 'review_id': 'jCTrwiqgqXyhd95G8t4hlg', 'text': "My family is from Northern part of Thailand, therefore I was happy just by that AND they have STICKY RICE!  And I've been to many Thai restaurants around town, and I judge them by how the prepare Thai Steak Salad..THE BEST IN TOWN!!!  Of course with Sticky rice!  \n\nYes, the service can be slow at times, but it's authentic people, and home made! Its not supposed to be a buffet or quick service, enjoy the food....enjoy the friends and family you're dining with....huge tables-it's awesome....enjoy the experience, enjoy the fact it's not a chain restaurant, or made by American standards, it's Thai..spicy and uber tasty hotness..... enjoy the fact it's in central Phoenix!!!", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2010-01-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 2}, 'user_id': 'W_QXYA7A0IhMrvbckz7eVg', 'review_id': '1hetWfmtwmAPyC7oz7rPCg', 'text': "I'm going to let you in on a little secret: I am an absolute weenie when it comes to trying new places with foods I've never heard of before!  It's true.  Yes I have managed to review over 400 places before ever trying Thai food.  Weird, right?  Anyway, my New Year's Resolution this year was to be more adventurous when it came to dining, and I am determined to embrace that resolution.  I'm doing really well so far, I mean, I ate Thai food!\n\nAs we were walking in, I started freaking out a little bit, because when I get scared of food, I order something really lame, and then I get really grumpy.  I kept telling myself that this was just a different version of Chinese food, which I love.  Once we got inside, I had to stifle the laughter upon seeing the epic tables.  Each one could literally seat 10 people.  They don't have anything smaller.  Seriously.  Anyway, we sat down and were kind of ignored for a while, got menus, got ignored, got drinks, ordered, got ignored, got food, ignored again, paid, then left.  You get the idea here?  The service is pretty horrendous.  \n\nI didn't know what to order, and I found myself gravitating towards familiar things.  I told myself that ordering familiar would be pointless, so I went with Beef Pad See Yew.  I was definitely avoiding the spicy after seeing the table next to us sweating and crying after eating some soup that was a level 3.  Sheesh!  Once my dish (beef, broccoli, fat rice noodles, and bean sprouts) came out, I pretty much devoured what I could.  the portions were huge, and I ate about half.  It was really good!  I still don't know what I think of Thai food, but I did eat the leftovers the next day and still enjoyed them.\n\nI probably won't come back here to dine in just because the service is a little much to handle, but it could be really fun with a big group.  I think take out would be the way to go.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2010-01-27', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 2, 'cool': 0}, 'user_id': 'fev0iI-XDrteD4SYRKjiUw', 'review_id': 'hADocWwq10R3OwxxYoBdHQ', 'text': "So San-E-Tize (as I like to call it) has been staring at me every time I go to F&E and I finally convinced my wife to try Thai food.  We went over here on a Saturday night and I was totally excited for a new place.  But then the bad service started.  We were seated, then ignored, then we got drinks, and were ignored again.  Then we were asked if we were ready to order (which we were) and then ignored again.  This was getting a little old.\nI finally ordered a Sweet Basil something with chicken.  It was a runny mess that was lacking in meat.  It needed noodles or rice or something to thicken the dish up.  It really just wasn't very good.\nI ordered it with a #4 spicy level and it was about there (maybe a 2 or 3 in my book).  I don't know if the 6 is insane or not but I don't know who would be willing to ruin their meal just to try and find out.\nIn the end, I wasn't really impressed.  The large tables are just comical, the service is sub-par, and the food was just blah.  I posted a picture of my meal just for reference.  I might go back and try something with rice next time but this was just not what I wanted.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 2, 'date': '2010-02-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'RxfFQxUtSIGYwTKU_rvAeg', 'review_id': 'pwEp-QNO8ISU8JBOH0Rpzw', 'text': "We got take-out and they were very short-handed. It was very busy on  a Sat night and they only had two servers that also doubled as a hostess. What was supposed to take 20 minutes to get our food took 35 minutes. We also had to return the food because what was supposed to be a #1 spicy was actually more like a #3. My husband, who loves spicy, couldn't even eat what was supposed to be the most mild. When I went back (after first calling them 15 minutes before to notify them I was coming in), I waited in the lobby for 10 minutes before being acknowledged. The lady responded that they were busy and seemed inconvenienced by me. I was the one who had to drive back and get my meal remade! I was very disappointed at the response and reluctance to fix the issue. The remake of the Beef Salad was slightly less spicy but at least we could eat it. I really enjoyed the entree but having my food wrong the first time and the bad customer service ruined the experience. We also had the fried appetizer sampler that was just okay. My husband goes there very frequently and loves this place. The portions are very large and prices very reasonable. I will go back and hopefully, this one experience was an isolated one.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 3, 'date': '2010-02-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '7_ZhEUnA-ymFeBObvs40Fw', 'review_id': 'I1IsxdxYxSpmrztSEe6c4g', 'text': 'Went here with a friend from Bangkok and we had a lovely dinner.  I highly recommend the green papaya salad, the spicy catfish, and the pad thai.  They now have a liquor license, so you can cool your mouth with a beer or glass of wine :)', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2010-02-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': '68WiOF02xISzb9Q6VLQRkA', 'review_id': 'SLIYRBJxtFmEtjWzJPcoWg', 'text': 'Now that we have eaten here several more times, I realized the 4 stars does not do this place justice.  Really excellent food.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2010-02-21', 'type': 'review'}
{'votes': {'funny': 6, 'useful': 5, 'cool': 0}, 'user_id': 'OeF4ktJqY5Qf_gf494uE_g', 'review_id': 'qJG0bjW5IWoFwAB_8Dqj7Q', 'text': "An absolute disaster of an experience tonight -- our server basically completely ignored us, our food took more than 45 minutes to arrive at our table, and by the time it did, I had forgotten what we'd ordered. While I try to be a decent tipper, this was the first time in a long time when I didn't feel any remorse about leaving no tip.\n\nThe catfish that was served was slathered in sauce to the point where I didn't recognize what it was. \n\nThe seafood stir-fry something or other was decent, as was the something-or-other soup, but by the time it was finally brought out, I didn't even care. I just wanted to leave because I had been waiting so long.\n\nThe only redeeming factor was one of the servers/hosts comping us a beer and a Thai tea because of the delay in getting our food. Otherwise this would have been a zero-star review.\n\nThai E-San may have decent food, but they need to learn how to handle a semi-busy night. This was an utter and complete FAIL as a dining experience. They need to learn how to better operate their kitchen and deliver the dishes ordered in a timely manner. Few foods are worth waiting for as long as we did.\n\nUntil they get their act figured out, I recommend going somewhere else for Thai food.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 1, 'date': '2010-02-26', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 1, 'cool': 0}, 'user_id': 'cfOL87aFWBkzPNeLYhhGoQ', 'review_id': '_QMt2C-7vqAkyxsJS5w2Bw', 'text': "Twas'  a Friday evening and I worked way too late, so  I decided to pick something up to go at a relatively new Thai  restaurant close to where I live. \n\nThai E-San doesn't look like much from the outside, but once you walk inside - you are transported to a different world.  Although I have never been to Thailand, I could only imagine that this is the kind of restaurant one might find there.  Beautiful tapestries, huge granite- inlay  tables  and an ambiance that transports you to a different place and time.\nFor a Friday night at 7p.m. it wasn't that busy - only three other tables- two of which were single guys.  So I ordered the Pad Thai Noodles with shrimp only , and was offered a seat while I waited.  The only server  working asked me if I would like water or tea and since I thought that it would only be a few minutes,  I politely thanked her but declined.\n45 minutes later.........\n I finally had my to-go  order.  But please , let me digress.......\n\nAfter 20 minutes of waiting  I got up and stood in front of the reception counter and looked into the kitchen.  There were only two persons working in the kitchen; I assumed one to be the cook and a prep cook. I had asked the only server who was running ragged ( mostly to the kitchen asking (in Thai?? ) where the food was).  She told me the cooks were from Thailand.  \n\n It looked like a Laurel and Hardy comedy back there.   The (prep cook?) kept wringing her hands and pulling her hair  and dropping things.  The cook (I assume) kept yelling at the poor woman (no wonder she was discombobulated). \n\nOk . let's talk about the food.   My Pad Thai was ok.  I had asked for a side of the chili sauce (which they forgot to add) as  I like my food spicy.  These were really mild.  Also , the noodles were gummy and stuck together.  I was wondering if they overcooked the noodles in their confusion to get the other diners food out (which, I observed also took way too much time) .\n\nI have read some rave reviews about this place.  So I do want to give it another try before giving my final decision. I am willing to forego some hiccups with service and food as I appreciate the fact that this is an authentic restaurant with immigrants from Thailand, and that it may take some time to get their act together to  provide consistency in service and food.  I really do want them to succeed.  I'll try again next month so as to give them some time to get their act together.  Hopefully, I'll have a better review next time.        Chow for now :-)", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 2, 'date': '2010-03-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bc3SCW1ccSPWbmGtcpeExg', 'review_id': 'RIJ3QkjeRBM7QK2YGYIMng', 'text': "Hey! Thai E-San, I'm back.\nI just went to Thai E-San last Sunday. It was busy day! I ordered appetizer #angel wings to start with. Then TOm Yum soup came right after angel wings, it took us 15-20 min to finish those soup and appetizer. The meal came a little late BUT the taste was so GOOD. My spicy eggplant was little too hot, but don't worry I love it! I'm not a big fan of noodle dish but my mom ordered Rad Nah noodle with gravy sauce. That dish was surprise me! I think I like noodle from now on. We would love to try mango sticky rice for dessert BUT we were so full , maybe next time. The food portion was so big, finally we finished it all, and have a very great evening!!! \n\nThank you Thai E-San, I will be back soon.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2010-03-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'ERyIslb4qqt0bcjQKcsjsg', 'review_id': 'JH7xeePHIjzx4WhGSXJlJw', 'text': "This is my absolute favorite thai restaurant in town!!  The food is absolutely amazing.  I bring friends here to introduce them to authentic thai food.  The dishes are always fresh and the spring rolls are some of the best I've ever had.  I usually get the #67, as hot as they can make it, and they never fail to disappoint me!!  \n\nThe service is excellent and everyone is so friendly and warm.  I've read some of the reviews on here about slow service and food service times, but I can honestly say that I have never had bad service here, in fact, quite on the contraray.  This is just one of the reasons why I rate this restaurant so high.  I eat here a minimum of once a week, and sometimes more because I've found it to be consistently superb.  Also, it is very affordable and the proportions are huge!!", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2010-03-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KyL_XHVrwC8A9vGDF5cH8A', 'review_id': 'HGNfF265n6L08qrK4US72g', 'text': "It was lunch time on a Sunday afternoon and I was craving Thai. I pulled up the Yelp app on my iphone and started searching. The first place I went to wasn't actually where Yelp said it was. Strike one. The second place I went to wasn't open. Either they were closed on Sundays or only for dinner. Strike two. The third and final location I was going to try was Thai E-San. The building was where Yelp said it was and they were open. Third times the charm. \n\nPretty good sized menu. Lots of seafood options. Nice list of appetizers. Full bar. And really spicy dishes. Score! \n\nWhen ever I try a new Thai place I almost always go with the Pad Thai. To me it's the dish to judge how all their other dishes will be and so far it has served me well. Their Pad Thai was no exception.\n\nI loved it, the son loved it. I would definitely go back.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2010-04-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'McMS1Xw6qouR8M4pygTNDg', 'review_id': 'Ri9Omy5kqzRPu5rozeOyRg', 'text': "This is my favorite place for Thai food. Their Royal Curry is incredible. The Thai Iced Tea is perfect. The rice is exactly how you want it. The Pad Thai is perfect. Everything i try i like. The people are really sweet that work there and I have always had great service. I've taken a lot of my friends to this place and they ALWAYS like it and want to go back. Give it a try!", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2010-04-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_PzSNcfrCjeBxSLXRoMmgQ', 'review_id': 'lFgVWtanCl1g8gj3KYS16w', 'text': 'I was there on a Friday night.  We had 10 people in our group.  They had more employees this time and I am glad.  The food is good and we did not have to wait a hour for food.  The service could be better, had to ask for refills and someone to take our order.  We ordered:\n\nAppetizers:  Angel wings and #10 combo appetizers (chicken stay, chicken egg rolls, fried wontons, Thai toast, and fish patties)\n All of the appetizers were GOOD!  \n\nEntrees:  2 BBQ chickens; green curry with beef; 2 tom guy soups; pork fried rice, pineapple fried rice, pad saw yee noodles, pad thai noodles, and green beans with pork.\n The BBQ chickens were good but dry (need to apply the sweet chili sauce).\n The tom guy soup were mild (but my mouth was on FIRE).\n Everything else was GOOD!!\n\nEveryone took a leftovers for lunch!', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2010-04-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'EOlGkRn-83UnF7634dOUKw', 'review_id': 'W4V9plr6dE0wI2EooS3CmA', 'text': "Ok yelpers...let's get one thing straight here. As far as FOOD is concerned, Thai E-San definitely has some of the best out there. My roommate is Thai and this is one of the only places she hits up on a regular basis. \n\nFood: AMAZEBALLS! All of their servings and portions are SUPER HUGE. The Spring Rolls are the size of cucumbers and only $3 for two of them. The Chicken Satay was also tasty with 6 skewers for about $8. Between the two of us, I think we've ordered about 1/2 of the menu, but I really enjoy their fried rice, pad thai, the stir-frys and the chicken curry. As a BIG fan of spicy food, I love how I can control the level of hotness for EACH plate. You can rank them from a 1-5, and the 5 is quite spicy and YUMMERS!\n\nService: YES....YOU WILL HAVE TO WAIT!! The food is prepared TO ORDER and unfortunately, the owners don't trust anyone else to make the food, so there's only ONE COOK!! I've never gone on a super busy night (because I KNOW better) so the longest I've ever waited was about 30 minutes, but since the food is SOOOO good I don't mind. \n\nThe waitresses are really nice, but if you want assistance, don't be afraid to flag them down. They're happy to help.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2010-04-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'uqK3yvpg5Evk_XgzMW-lAw', 'review_id': 'Vs3PH9fMZMthjxV5YpzckQ', 'text': "I have attended a B-day dinner with J on a Friday night.  This time around was better.  At least, we got our foods a lot quicker.  The appetizers were good combo.  The fish patties were the best.  I had ordered the BBQ chicken since last time they were out.  The chicken was too dried and salty for me.  I have better BBQ chickens at other Thai places.  As for the service, they still need work on it.  At first the waitress attended to our large group, but when it was time to pay, somehow she seems not to like us.  Maybe, it was the coupon I gave her for the wine after the bill came.  I showed her the coupon before ordering so she knows to discount the bill.  Of course, she forgets to discount it.  It took at least 15 to 20 minutes for them to recalculate the bill for us.  The kiddies were getting a little loud.  I had the feeling that they wanted to kick us out.  When we walked out, there was no Thank you or Goodbye.  I'm still a fan of food not the service. I am dropping a star for their service.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 3, 'date': '2010-04-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Ux7a5tbceLU6anNycjwt_Q', 'review_id': '46_z3Gkn15hyAxq4MfJC-w', 'text': "I came for the Thai Issan food which is heavily influenced by Issan culture and not as much by the Siamese which is the typical style of ubiqitous Thai restaurants . The history is a different story. It's about the Issan food; generally not supposed to be spicy, oily or colored but looked homemade, can eat with your hand without feeling primitive and satisfying.\n\nMy party ordered 5 plates to share. They arrived in about 15 minutes. The Pad Thai was right on in terms of flavor, soft texture and not colored. One saucy dish had some flavoring issue which could be fix by the cook tasting it before it leaves the kitchen. The other dishes were fine. The portions were right on and ingredients looked and taste natural. This is not processed fast food but 1 to 2.0 step above it as it takes a skilled and versatile cook to prepare and make. The dish prices are a few bucks more than typical Thai food but the taste here is commensurate with the price. \n\nWhen we arrive, we saw 2 women waitering there. I didn't experience the 7 minute followup rule and we had to call to get refills. The service could use some improving but I think it will take some time and effort from the Asian staff to get up to speed in American style of service. I thought it was noteworthy that they ask how I wanted to vary the spicyness of my particular dish. \n\nThe store is smartly located near downtown and easy to access. The bland outside of the store does not match the inside. You will find granite table and a nice interior decor that is not too touristy. The inside decor raises the expectation that the food would be good and this place succeeds in that aspect.\n\nI would recommend this as a place to bring others with me for Isan food. The place just need to institute more American style customer service efficiency and attentiveness, then it matches the quality of the food and make this place a great place to stop by when you're in Phoenix.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2010-04-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VovMsKbDF2Msflj1zPYF0A', 'review_id': 'qH-M8QeBHBSI_pRwuikLag', 'text': 'My first Thai E-San experience was just funny.  Shortly after they opened, I went in for take-out.  There were all these menu possibilities (e.g., fish in noodles, etc...) that I had never seen before.  So, adventurous me decides: Must order.  \n\nWell, this inspires lots of interesting looks .... and finally (ions later) the food comes out and they say "well, we never really made that dish with fish ... It might not be good... if not, return it..."  (No, they didn\'t think to say something before they prepared the food...)  I go home and find myself separating the fish from the rest of the dish and eating the two dishes. \n\nSo, after that ... long Thai E-San haitis...\n\nFind myself back there.  This time I ordered pad thai, figuring that they must have prepared pad thai.  The wait was shorter.  The pad thai came and the first thing that I realized was holding the pad thai package was like weightlifting... Yes, there was just that much food!  The food was good.  It was fresh.  But, seriously, it could feed a military.  The military of a small country, but a military. \n\nMy big complaint (after the fact that their portions are HUGE) was a massive lack of heat.  Next time I will ask for uber-spicy...', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 3, 'date': '2010-05-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wIi2J1UGRB2G_3vu5eNK3g', 'review_id': 'EnYB2jF_VFknEFshXID6XQ', 'text': 'coming from toronto, where there is an abundance of amazing and authentic thai cuisine - and having visited thailand twice - i have to admit that i am a little picky when it comes to thai restaurants.\n\nthai e-san is the first thai restaurant i have been to in the valley that has really impressed me.  the flavors are incredible - fresh, bold, authentic!  the menu is unique & diverse, the portion sizes are generous and the staff is friendly.  oh and when you say "spicy" it actually MEANS "spicy!"', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2010-06-20', 'type': 'review'}
{'votes': {'funny': 15, 'useful': 16, 'cool': 16}, 'user_id': 'C8ZTiwa7qWoPSMIivTeSfw', 'review_id': 'gGOciLguaTWgEElKumR0qA', 'text': 'I felt a little like Honey I Shrunk The Customer sitting in those large chairs at these massive granite and wood tables. Community tables are so risky as most people do not like them. I, on the other hand, enjoy them. We were seated at one end and then joined soon after by a very nice couple. We bantered back and forth a bit and he realized he knew me from my restaurant. Love that!\n\nSo, as I said above we were seated. And then waited. And waited. And. Waited. Some. More. Eventually waters were dropped but no beverage order was taken. Again, waiting. Cue the Jeopardy theme music. Finally one of the two servers came by (and in all honesty, they were pretty busy) and dropped off soups, which come with the $6.49 lunch special. Yummy! I ordered tofu fried rice and Rickie had sweet and sour pork. Mine was fantastic, though sadly they neglected to include my spring roll. I would have flagged someone down but I was consumed with worry over my table mate\'s missing food. They served her friend\'s food yet hers took at least 10 minutes. Strange. Rickie wasn\'t pleased with his dish as it was pretty teeny tiny!\n\nTwo lunch specials. Two beverages for $18. Not bad. Oh. The decor is so Thai...bright green and gold speckled walls with beautiful Thai rugs. And. Then. For some odd Asian reason...like at China Chili random pieces of scrap paper taped to the walls saying "Dessert. Mango Sticky Rice".\n\nWith a little gay spray I could bump this baby up a star!', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 3, 'date': '2010-06-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 5, 'cool': 2}, 'user_id': 'lPaYMDmJbAnv_3pmZH_inw', 'review_id': 'Z09y-2EGIQj-m9ZE692ffw', 'text': "I'd love to write about each of what seems to be an onslaught of Thai restaurants opening in the Valley, but many offer the same style of fare. However, a few serve more unique dishes in addition to the classics.\n\nLocated on Indian School Road next to 3 Snaps Resale Shop, Thai E-San specializes in the regional cooking of northeastern Thailand, also known as the Issan or Esan region. It is difficult to clearly define Esan cooking since many of those native dishes, like papaya salad and larb, are common on many Thai menus. They are more about heat and sourness, as pretty much everything we tried here reflected that.\n\nI have noticed some commonalities among Thai restaurants, including gracious service. From the time we entered the large dining room until we left, the staff was polite and attentive, not to mention gorgeous. Thai women are stunning.\n\nAnother similarity with many Thai restaurants is the sheer size of the menu. I have no idea how they can keep so many ingredients on hand to make so many dishes. If you don't mind some reading and ask lots of questions, you can learn a lot about food, cooking and, of course, eating.\n\nStarting with the Thai E-San Special Appetizer ($12.95) lands you in the middle of a massive amount of shareable treats. Brimming with crunchy Egg Rolls, tender peanut sauce laden Chicken Satay, Wontons and a sweet and spicy Cucumber Salad, there is enough for at least three bear-sized appetites. The portions are large, so sharing is a must, which is also very Esan.\n\nThe Beef Salad ($8.95) is sliced char-grilled sirloin with chili, onion, lime juice, rice powder and fresh Thai herbs. It can be ordered with varied heat, from one, which is mild, to five, which is hot as it gets. I prefer ordering two or three, then add heat from the chile condiment jars. This dish was bold, with a nice sourness from the lime juice.\n\nI also was excited about the Thai E-San Sausage ($10.95). It's more of a grilled savory sausage than a fermented sour or sweet sausage, with tubes stuffed with ground pork, pork skin and Thai herbs with a heavy lime flavor. The snappy crunch of each bite led to textures of the pork skin and ground meat, tender with a chewy spring.\n\nI love Drunken Noodles, and Thai E-San's version was top notch. Also called Spicy Noodle with Basil ($8.95), there's a choice of meat or tofu that is stir fried with large wide noodles, chile, basil, bean sprouts, onions and bell peppers. Each tender noodle tastes like it was seasoned on its own with an explosion of flavor and spice.\n\nThe massive pile of Pineapple Fried Rice ($12.95) is mixed with shrimp, chicken and juicy pieces of fresh pineapple and topped with cashew nuts. It's a sensual mix of sweet, sour and salty, appealing to most, if not all, of your senses.\n\nThai E-San offers only a couple of desserts, Coconut Ice Cream ($3.50) and Sticky Rice with Mango ($4.95). The latter offered slices of sweet ripe mango atop hot and sticky rice bathed with warm coconut milk for a great finish.\n\nThai E-San has almost 100 menu items, so there is plenty to keep me coming back.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2010-07-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ux7a5tbceLU6anNycjwt_Q', 'review_id': 'j9EuaSc6lrYhaYBO3S8c6g', 'text': "I ordered friend noodles to take home. Some how the instructions wasn't clear or mis-interpreted about the level of chili in it. I was just excited to go home after a day of sweated heat in Phoenix.  I got home and the sauce looked lava red. I ate about a third of the dish, and I wish I didn't eat any. My lip was swelling and face sweating.  I drank down a coca cola bottle to control the convection going inside me.\n\nSome how, you need to check the level of pepper spice on these take home orders. I will give them another chance as this is just one dish (and not about pallet of dishes ), and to explain themselve, and I will be happy to update my rating. This is not an experience to be repeated.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 3, 'date': '2010-07-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8_nmcrZX28dC654priVVMA', 'review_id': '66VzCDnLQwEZoSBnpMa3wQ', 'text': "the food here was very good! very fresh veggies and the fish and scallops were cooked wonderfully. light sauces and lots of flavor in all the dishes we tried. i'll definitely be going back to try more things!", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2010-08-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'cHoC_bpAfmsgdRhe04A3lw', 'review_id': 'fGPsPzuIK9GvGIPNFiu78g', 'text': "This is probably one of the more authentic and best thai places I've been to since moving to AZ. It's almost as good as my favorite place back home. They give very generous portions and the prices are decent. We had egg rolls and fried tofu as appetizers. The tofu was the perfect crispness and the thai sweet chili sauce was sooo good (comes with peanuts, so if you have an allergy, don't forget to tell them to make it without). \n\nI had pad see ew with fried tofu and loved that they put chinese broccoli in it. That's how the place back home makes it. They also have regular broccoli too so its a nice mix. The noodles and sauce were really good and not at all overcooked. I also got pad thai to go (with chicken and shrimp) and it smells and looks really good. (I'm eating it for lunch tomorrow!) My friends got duck penang curry and chicken green curry with level 3 spicyness. They can eat spicy, but it was hitting them pretty hard tonight, so you might want to watch out for that. \n\nOverall I was very happy with the food! The neighborhood seems a bit sketchy at night and it's a bit far from where I live, but it's close to where we did yoga so that was convenient. There was one semi-creepy guy refilling our water, but that didn't bother me too much because I was starving and the food hit the spot tonight!", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2010-08-11', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 0}, 'user_id': 'M6oU3OBf_E6gqlfkLGlStQ', 'review_id': 'WjxxGjeF-lUKW_Zw8ijY4Q', 'text': 'I thought the food was coming directly from Thailand, because of how long it took to get it.\n\nFrom the moment we entered things seemed a bit off. We were not welcomed, and after a awkward two minutes up front the hostess walked to the tables with some menus and we assumed to follow her.\n\nWe got to our table and review the lunch menu, pretty much standard items. We waited some time before we put in our orders, we also hand to remind the waitress that we needed to order drinks.\n\nAfter a decent wait our soup came,   and then our waters.  The soup was decent and it was fun to spicy with the condiment tray on the table.\n\nWe then waited, waited and waited,  47 minutes after we entered our food arrived, this does not work well for a lunch.\n\nMy Druken Noodles were mushy and soft. (6.95 combo)  The Won-ton chips were quite stale and my meal did not even come with the egg roll that the menu indicated was included.\n\nJust a note if you decide to come here for some reason their spice scale is the same 1-5 but 3 is hotter than you usual 3.\n\nWe then played the waiting game again to get some dogie bags and our bill which we just paid upfront.\n\nThere are faster, and better options around that are worth the extra $1.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 1, 'date': '2010-08-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'eFR0Ai1j0Zuvt3bV4X8JYQ', 'review_id': 'YA-VjaziBVdzeLZgSKB32g', 'text': 'Delicious! Visited on a Sunday around 3pm with a friend and were the only 2 in the restaurant. Tried the pad thai and terriyaki chicken. Loved the huge portions, friendly staff, huge granite table and ethnic background music.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2010-10-11', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'jccGOMPTOGS22Tp2m9PAog', 'review_id': '84NtqUmZeoWyFiFE5OsiSg', 'text': 'In an effort to be nice, let me just say this.  If you are going to try this place for the first time, try not to get your order to-go. This way you can make adjustments and hopefully get your food to have some flavor. I guess I should have known something was amiss when the order was called in and nobody asked how spicy to prepare the dishes.  The pad thai was mushy and bland.  The thai style chow mein had more firmness in the noodles, but still required extra soy sauce.  I will give some credit to the egg rolls that were pretty decent and not overly deep friend.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 2, 'date': '2010-11-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'acOfAooftS7jdWlhyI0CQw', 'review_id': 'I1wvfoxwbKaPFaXWHGeUgA', 'text': 'Great food, interesting service. I always go and never leave wanting more. I end up full but wish that the decor was better. It looks like Thailand threw up on it. Good food, support a local business.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 3, 'date': '2010-12-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-GNcVLtPu1QlJ07cMRe4zw', 'review_id': 'TXOMUvYyqf2WvEH6PxsnYQ', 'text': 'Real Thai Food. Great  drunken noodle. Prices are very reasonable. It\'s not a "fancy" or trendy looking place, but if you\'re looking for very good food at an affordable price, look no further.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2010-12-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'vhxFLqRok6r-D_aQz0s-JQ', 'review_id': '1LqQ95d1Y87yLoWvdU0a1w', 'text': 'Mom and Pop place that is delicious.  A fan of their drunken noodles.  They will ask you hot spicy you want your curries.  If you brave good for the spice, you can always quence your thirst with a Thai tea.  The Satays are delicious and the portions of all meals are plentiful.  I usually have enough for anotehr meal.  The decor is nice but they do have these oddly large tables.  Go with a big group and order lots!  They also have lunch specials which are really reasonable.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2010-12-26', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 7, 'cool': 1}, 'user_id': 'e0Rls_7QxkVcFJtUXDaA0A', 'review_id': '1tzyAB_wjLT2SmZoEpIxPQ', 'text': "This place is a farce and a travesty...  as are all over priced banquet style Thai places that place a premium on marketability at the expense of food taste and quality.  It's the sort of place that fat English guys wanting to recreate their holiday in Pattaya or Koh Samui would go.   Again, I go back to my rule about ethnic restaurants - the less people of that ethnicity you see patronizing the place the less likely you are to get a great meal.  \n\nAlthough they do serve authentic Isan food on their menu - they recreate it unfaithfully and only in shades of what you really get in Thailand.  Isan, is a poorer, ethnic minority in Northeastern Thailand that is significantly influenced by Laos.  True Isan food is amazing - usually eaten with hand fulls of sticky rice - larb (ground meat, mint, and lime) , som tum (papaya salad), gai yang (grilled chicken), and sai krok isan (isan sausage). \n\nAny restaurant claiming to be the standard bearer of Isan food, should serve these dishes with mastery.  Thai E-San does offer them, albeit at a ridiculous premium, but does so disappointingly.  \n\nIt is sad to see such a great regional cuisine get such a terrible representative here in Phoenix.  Save your money and go elsewhere... unless you are an English tourist in need of nostalgia... in which case, proceed with my blessing!", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 1, 'date': '2011-01-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bVXoyEW7ehdlM0FIxE7Vwg', 'review_id': 'MAjP-1_nDpFdlfDQ4WMomw', 'text': 'Not good. We order many dishes and the only one that was somewhat authentic was the red curry. But even that was not great. The duck dish was terrible, even the pad thai was not good--the noodles were way overcooked as was the chicken. Would not go back again.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 1, 'date': '2011-01-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'g_Dw7wj0BdG8aV7sMbcMSg', 'review_id': 'jP9VfBm60uvnYICKf40qFA', 'text': "This is a really nice looking place and the decor is really pretty. I would say there food is really good, but can be hit and miss as times. There a little over priced for there meals but there BBQ Thai Pork ribs are really good. Overall it's a great place to go.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 3, 'date': '2011-02-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vFXT1dkQwgD9tTMUMGubZw', 'review_id': 'xEEqqpUHDAZx-9EhSHOamw', 'text': 'Yummy food, reasonable prices....need I say more?', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2011-05-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'uP-k3VT4Ss8fubITUybf-g', 'review_id': 'wjvZy0sRVSIquQrVUlDKgw', 'text': "Just had this for lunch with some coworkers, I had the Royal Thai Curry lunch special and it was absolutely delicious.  The soup that came with my meal I believe was the Silver Noodle and it was great with the cilantro!  Great prices and delicious curry, will definitely eat here again, next time I'm trying that Pineapple Fried Rice...yum!", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2011-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1CpyQ1VkgmNwA6RxHoq2bA', 'review_id': 'VlKSoEfcvPAlt5OtYz6D8w', 'text': 'After a recent "ugh" experience at wild thaiger, I thought I\'d try something different today while in the area.\n\nMan, this place is just not good.  2-stars only because I unfortunately have had worse thai in this town.\n\nFor what it\'s worth I had pad thai, and it was horrible.  Soup was ok, and staff was adequate.   Other than that, my search for a good, or at least passable thai restaurant will have to continue......', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 2, 'date': '2011-08-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DDad5K6GNA0sXB7N1OB6wg', 'review_id': 'PftXPwe8UOQ-kXwsfZ0Zyg', 'text': "So I've tried a lot of thai restaurants in phoenix, ever since I moved here a couple of years ago and this is by far one of the best I have tried in the area. Regardless of service, I come for the food which has never let me down. The cost is reasonable, the food is always on par and I have yet to have any real issue with the service. You can't go wrong if you choose to try one of the curry or rice dishes.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2011-08-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MqUmlcr_J-qLBbWlkst5eA', 'review_id': 'jO9B1iN-x93k_ZSzjJ57kw', 'text': 'Great place has really big tables but good food . Curry beef the best . Been there more than once !', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 3, 'date': '2011-08-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xlhOYJz88hseqBnygHVz6g', 'review_id': '1b_EMovg7gPQn3WEyOJ50w', 'text': 'All I can say is YUMMY! Yesterday I went to lunch with a friend at Thai E-San. I got the Pad Thai noodle lunch special. All the lunch specials come with a soup of the day and egg roll for a great price. The soup had tofu and cabbage. I\'m not a big fan of tofu, but the flavor was really good! It was sweet, sour and spicey and I didn\'t mind the tofu at all! I got the pad thai noodles "medium" spicey.... wooohooo, the medium spicey cleared my sinuses! It was on the little spicey side for me, but flavorful enough for me to keep taking another bite! The meal ended with a few slices of watermelon, which was perfect to cool my lips and mouth with. I can\'t wait to go try another dish. The food, service and value will make me come back!', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2011-08-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'YOyyG48zHokIEzFEAHMq2A', 'review_id': '-Bwj6OzwPhGcFfb--zlkMg', 'text': "Probably the best Thai restaurant that I've found in Phoenix.  The food is excellent for a reasonable price.  I have brought a few friends here that like Thai food, and everyone else seems to enjoy it, also.\n\nAt the restaurant, you can pick your dish, and add your choice of meat/fish/etc.  My favorite dish is the spicy sweet basil with scallops.  Also, I highly recommend their soups.  I have never tried something here that wasn't delicious.  One word of warning, the food can be extremely spicy so if you are sensitive to spicy food, make sure you order accordingly.  This restaurant is highly recommended.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2011-08-27', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'bcvhLHYRdcjo0MHmQnM7ZQ', 'review_id': '9fpa7TvA9SmGh79S7kRDrA', 'text': "The best Thai food I have had in Phoenix. We read all the bad reviews on here before I went- but was desperate for Thai food later in the evening so we still decided to go. \n\nWe were pleasantly surprised! It is better than Thai Elephant and Thai Basil. Definitely more authentic and more flavorful. We are picky and eat out frequently- so it's saying a lot that we loved this place.\n\nWe tried the hot and sour soup with beef, the silver noodle soup, and the drunken noodles. The drunken noodles were literally the best either of us had ever had. My soup was probably one of the best I've had (hot and sour) with WAY more flavor than most places. My boyfriend said his silver noodle soup reminded him of an authentic dish his filipino mother used to make. \n\nAlso, the staff was super friendly in that we-are-all-family-and-we-welcome-you-with-open-arms kind of way. The lady at the front was also hilarious. She and our waiter checked on us several times and were very good about explaining the dishes. \n\nLast- the Thai iced was great and the place was beautiful.\n\nYes- the tables are rather large and a bit awkward, but it was no big deal. \n\nAlso, the food did take awhile but this is a small shop with authentic recipes that were well worth the wait. \n\nWe will be back!", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2011-08-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'DDad5K6GNA0sXB7N1OB6wg', 'review_id': 'SSXzNIdpbK2Jt7F09uGi0Q', 'text': 'So the owner/management has changed so not my first place to drive a long distance to!', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 2, 'date': '2011-10-10', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'va0CpyGqJsF26ZHHn7-dAA', 'review_id': 'Oy9TFFOpCrIzjsI8rf-A3Q', 'text': 'perfect early Thai dinner.... spicy Musscles ...  Tad Pad with Shrimp and Chicken , perfect fit for a early dinner., no RUSH crowd here if you arrive a week night early dinner    Good food, great price !', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2011-10-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'i0A-c2yoHySmFhRV2sDR1g', 'review_id': 'GrIf2VhL1lz3n08oqkDLzg', 'text': "Went here for lunch Sunday and had red curry. The curry was very good. They have a 1-5 spicy scale to tell them how hot you want your food. I went for 3 since I had not tried their food before and am cautious of Thai opinions on spicy. Next time I will try 4 since it was not as spicy at that level as some other places I frequent. \nService was very attentive and friendly. The restaurant was busy but we got a table quickly and several people came over during the meal to ask if everything was good. I will definitely be back when I'm in the neighborhood.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2011-11-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'zHgmWv6NbwZepUSqA_FlLw', 'review_id': 'KF0nnYOL2UEYC4kk9CHL4g', 'text': "the bad part on travelling is: have to keep on looking for a great food.\nthis place isn't authentic enough to be called thai food.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 1, 'date': '2011-11-13', 'type': 'review'}
{'votes': {'funny': 4, 'useful': 5, 'cool': 6}, 'user_id': 'F6QsMoJdvtohlbnST-fDyQ', 'review_id': 'TTLJjeGGsrGgv4JtTc9hCw', 'text': "The first time i came here was when they first opened. So i thought i would give it another try. As i was craving Thai food.     I hoped they were still open as most places close @2:30 pm.    Yes they were open and they serve lunch specials till 3:00pm/ Wonderful!  Guess what else???? They do not close after lunch and reopen for dinner. They just stay open.                                                                                 You know when you want food, but cannot go until 3, but nothing is open till 5:00. No worries here they are open all day!                                                                  When i came in at 2:30 i was the only one there,though more people came in later. It smelled wonderful and i was greeted and sat immediately.   My waiter Julio was adorable and sweet. He brought me some lovely hot green tea in a half glass Tea pot. It was delish!  The decor is very nice with a lot of sparkle. Slight Christmas decorations tasteful and not over done. Bathrooms were nice and clean as well.                         For food, I got the yellow curry with Shrimp. First he brought out the soup that came with  it. Wonderful chicken and rice soup. It was so good.                                          Spice taste is 1 through 5, i ordered a 3.  The rice was fluffy and not all stuck together as some places have. The curry dish was incredible, it also came with an egg roll and some fried chips. Even the egg roll was good with fresh veg inside.  I am so happy i went there. I can't wait to go back. After you have finished your meal, they bring you some fresh cut watermelon.  Just enough to clean your palette.     This is the place to be!!", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2011-11-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '2Yh1kRX52QHKzY2vP_jVQQ', 'review_id': 'HK8UCh_EwbT2GO3Pxp0a3g', 'text': 'Red curry and Tom yum rock. Level five heat will make you sweat. The owners are always extremely friendly. What more can you ask for? \nOur favorite Thai in town by a good margin. \n15% off at happy hour for the holidays too!', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2011-12-23', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'JzumWFO95p7yk3Pvw7jFNw', 'review_id': 'vm50R9jfuNXg7wwZFIlbNg', 'text': 'Great food and great service.  We had their lemongrass soup, fish cake, BBQ chicken, pai Thai,  pineapple fried rice and curry beef.  All was so great, hot and tasty.  I will def go back again.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2011-12-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'k9FoMS595RrfHHg8tIV3-A', 'review_id': 'aozcXpvByOYAvfL_4olUjw', 'text': "You can't go wrong with any of the food options here. It's all FANTASTIC!! It can be a little pricey but worth it.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2012-01-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 3}, 'user_id': '8DEtfP9Fmp5X1DG6iTtXnQ', 'review_id': 'QedkapOz2A6moLqDKz7xjA', 'text': "I don't often make it to this part of town, but now that I've tried Thai E-San, that just might change.  Friendly staff, great food, and a calming atmosphere give this restaurant an A in my book.\n\nMyself and two other friends enjoyed a few dishes, as we were told most were meant to be shared.  What was selected: Lemon Grass soup with Chicken, Fish, and Squid; Yellow Chicken Curry; and Chicken Pad Thai.\n\nThe Lemon Grass soup was just what was expected, deliciously tangy with some nice heat.  Tender fish, chicken, and squid was portioned liberally and melted in my mouth.  The Yellow Chicken Curry and Pad Thai were pretty standard, though definitely not a disappointment.\n\nEverything was excellent, though I have a feeling if it wasn't, the chef would have corrected it for us.  She was very helpful, even came out to make sure everything was to our standard.\n\nI will be back.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2012-02-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'RAWy3YCE-jwfyuGvwzUaqQ', 'review_id': 'CAWImWhtgFLLgzlujdvh1w', 'text': "I am not sure what took me so long to write a review but this review is based on over two dozen meals at Thai E-San. I love this place. I have to admit, I usually order to go but I have eaten in as well. The people are absolutely wonderful and the service is just right. I have never had dinner here only lunch. It is perfect for lunch with their amazing lunch specials. The curries are my favorite thing but the Pad Thai is great as well. The portions are large. My only complaint would be about the restaurant. It is not bad but doesn't have much ambiance. The food makes up for it though.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2012-02-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'yKYY9HMRDpWPl4E10U7WBg', 'review_id': 'n8OLsTO5LtEseInmBiY2eQ', 'text': 'Love the Tom Yum soup.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2012-03-06', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': '459YZVKm719USPkrm-EFfw', 'review_id': 'bF7vggHe3wV24PZaHn7iCg', 'text': 'Great prices for tasty food. Portion size a bit small but still very good overall.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2012-05-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'xXsvZ5tXbGpKVPAbljxoUA', 'review_id': 'LCm4yuJizRUC7lJGQqWiMw', 'text': 'Easily my favorite Thai restaurant.   Every time I have been there, the staff is friendly and welcoming.   They will prepare your dish as spicy as you want, I enjoy really spicy food and they do a great job accommodating my request.  I usually either get shrimp or scallops with my dish, and they always are fresh and high quality.   I did not have an issue with the portion size.   I had plenty of food on my plate and left satisfied.   The food has a very clean taste and does not leave you feeling too full and uncomfortable.   I will definitely continue going here and will recommend it to anyone looking for a good Thai restaurant in central phoenix area.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2012-06-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'V6rhoTCw7S6H8eHwv2M6Vg', 'review_id': 'pT4ESqZscd9iDwFxrmH8eQ', 'text': 'I am lucky enough to live very near by this thai place.  We have it almost weekly when I refuse to cook.  We have tried the yellow curry, pad thai, thai toast, and the Pa-Naeng Curry.  I have yet to be disappointed.  The prices are good, the portions are large (I Always share a meal with my husband and then have lunch the next day)  and the staff is very friendly.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2012-06-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'aLTl_OkLo0BFRxdz1n6sYA', 'review_id': 'TLDILAnBn1_67ZjLx17RLw', 'text': "Ok prices, Ok food. I would rather go to Thai Basil. The portions don't match the price, in my opinion.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 3, 'date': '2012-07-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'SJoMGpnY0DVtMlpjFK78-Q', 'review_id': 'iUYPbLcqxoSCnlvAoS7qLA', 'text': 'I love Thai. It is usually gluten-free, and can easily be made vegetarian. They finally got smaller tables and are more comfortable!\n\nThe owners are always incredibly nice and love to make sure we enjoy our meals! Thai E-San has superseded ThaiRama as our favorite thai restaurant. Everything is delicious, and they are very accommodating to your needs!', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2012-08-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'VpL2gVvtB94NJiK5-EPjoQ', 'review_id': 'uA6PRd_AMJyU53iZXIiPsQ', 'text': 'I love this place! It is perfectly located for my needs, the staff is always friendly and the food is fantastic. It is super easy to order anything vegan or gluten-free and where I have had trouble communicating the level of spice I want at other Thai places, that is never an issue for me here. Their Coconut Soup with Tofu and the Mas-Sa-Mun Curry with Tofu are my favorite.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2012-09-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'NjcHcAq5iT-7B-Ka_WLKgg', 'review_id': 'Jkk6KvCifbPvaJUjDR9gWQ', 'text': 'Great food. Beautiful atmosphere. Friendly staff. We will definitely be going again.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2012-10-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vwEHW0d307Ij8LITCXcnyg', 'review_id': 'PJ3Gg8hJKHA1hV9KUdjCCg', 'text': 'Best curry in town and when I ask for added veggies, they add a wonderful assortment not just bell peppers. Service is always good and most is gluten free.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2012-10-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ICaw9k7gICS4j7H6_Rpypg', 'review_id': 'rQ9qytoNi91r1cFMwEG7RA', 'text': "This place is amazing. Their Pineapple Curry is delicious and can be spicy or not spicy at all.\nIt's probably my favorite Thai place in Phoenix. I highly reccomend their food. The service is also amazing.\nIf you have short lunch hours it's probably best to call in an order because their food is made fresh, so you actually have to wait", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2012-10-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xVTY2s588zm4bJiaZZU8CA', 'review_id': 'FHuXMFd6ErgSikXn_3hdzA', 'text': 'all the naysayers seem have a bone to pick, the service here is incredible and the food is better.  vegan options as well and staff that helps make sure your order has no egg or fish sauce.  if your looking for thai, this is the best place in the valley we have been to, and being vegan, we have been to too many to count', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2012-11-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pE0vnjSfvv58nC_8MG8j2g', 'review_id': 'U6CedTwbPEduviQ3LRkRcw', 'text': "This has become my favorite Thai restaurant in town. I have become rather picky about my Thai food and this place takes the cake. I highly recommend the basil catfish, the eggplant tofu curry, pad ce ew, and the mussamun curry. As an added bonus, when you ask for your food hot or Thai hot, you don't see lashings of ground chili strewn across the top of your meal, but, rather, the extra chili is cooked with the food, giving a much more satisfying experience.\n\nIn sum, go to Thai Esan, order a Singha (or three), a pad ce ew Thai hot, and enjoy your evening.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2013-01-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1g8Crb6WGQUsA2l2X3yVGA', 'review_id': 'xl-fl_VVDeT21Ap_69Zxcg', 'text': 'The most authentic Thai restaurant in the valley. Very clean. Great customer service. Prompt with menu, re-filling of the water, food etc etc.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2013-03-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'ENCky0t5RuXVOEn9mxbRTw', 'review_id': 'g4CoZKFoE3LmJDcX-Qcrqw', 'text': "I've been to several Thai restaurants in the valley and this one is my favorite. Great food with great service!", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2013-04-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': 'z-nSJ8XjwdIqt01XgvOqqA', 'review_id': 'RZhGwxoe2PbbMcok0Zk5rA', 'text': 'This is one of my favorite spots for Thai! The service and staff are always stellar. I love the spicy fish and coconut soup. The papya salad is something everyone needs to try at least once.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2013-05-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'D6VcEnYtfnXqC74aUWmckw', 'review_id': '-h11UC19QepGFU2ZzCOkAw', 'text': "This restaurant does not look like much from the outside, but inside was a whole different story.  Very clean and neat.  Comfortable seating and TV's if you want to catch a game.  Some of the best Thai I've had.  Red curry was excellent!  Pricing was very reasonable for the quality of the food.  They have a limited beverage selection with only serving cans and bottles.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2013-05-28', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'j-kShDJgp5acGhqJAkJHnA', 'review_id': 'ID9qn07am5t2PLoZVX8J4w', 'text': "Its 9:15 on a Saturday night in downtown Phoenix and the boyfriend and I are hungry.  Thai food sounds good but one of my biggest issues with Phoenix restaurants is that they close too early.  You are lucky if you can find anything opened past 9pm.  I think I remember that Thai E-San is opened until 10:30 but I am not sure why I think that.  \n\nI have never been to this restaurant but I hear good things and have wanted to check it out for a long time.  We get to the restaurant and check the hours. They close at 9:30.  I hate getting a table at the last minute as I don't want to hold up the staff that have been there all day long and know that they want to go home.  I turn around to get back in my car when a nice lady comes out and asks us to come in.  Well, with that warm welcome, how can I refuse?  \n\nWe get seated in a comfortable window booth and look at the menu.  It is big with the usual menu items that one would expect at a Thai restaurant.  We start with Thai iced tea ($1.99) the perfect drink for a hot Phoenix evening.  We then ordered the chicken Satay ($9.50) Seemed high priced until the dish arrived.  7 large servings of grilled chicken breast perfectly grilled, served with cucumber salad and peanut sauce.  For our main dishes we both were in the mood for curry.  We tried both the Royal Curry, yellow curry in coconut milk, potato, onion and carrot (9.95) and the salmon green curry, coconut milk, bamboo shoot, green beans, Thai eggplant and Thai herbs ($14.95)  Both servings were Tasty, although too large for us to finish but that did not stop us from ordering the Sticky Rice with Mango ($4.95) \n\nThe service was exceptional as the staff treated us like family.  One warning, if you do not like your dishes spicy, do not order past a one star.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2013-06-30', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 1}, 'user_id': 'a_UGd-H5LZcbEgOLI_94GQ', 'review_id': '7F6lNEa67KJc8LZYLNKA-w', 'text': 'Well this place has everything I could ask for.. I would say it is the most "authentic" Thai I have found in Arizona.  When I order "Thai hot"  at other restaurants I am left disappointed. Here, my eyes water. That\'s what I\'m talking about! They have quick service and it is family run. The owner\'s daughters are both vegetarian so she is quick to accommodate and also recommend dishes you might not even see on the menu. She is always there and will come and greet you every time you visit. My personal favorite here is the massaman curry.. The best in town without a doubt. They also serve amazing thom yum soup.. And it literally comes out on fire.. Well, there is a circle of fire around the soup bowl. Semantics. \n\nThis place has recently undergone a facelift. They used to have very over the top dining furniture which limited seating. They have since streamlined and added new booths. There is also a large flat screen usually featuring sports and they now offer wifi. \n\nThe last thing I really appreciate about this place is that they are open late!\n\nHands down my go to place for Thai. I tell everyone and bring everyone then repeat.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2013-07-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zNFIzjoEX3skz2zd7wE5Sg', 'review_id': 'jVj8l-ueBCQ71vs0UUK5LA', 'text': 'My regular Thai joint wasn\'t open and someone had mentioned this place to me. I will go back to this place, only I will choose something different to eat.\n\nI went with the Shrimp and Scallops in Peanut Sauce. When she asked if I want hot, I hestitated than said yes. Than she said 1-5, 3 I replied. I could\'ve went with 4 or even 5, I like it spicy! Out of the whole dish, two bites were actually spicy. The shrimp and scallops were HUGE, there was only three of each in the dish. The dish was just okay. I didn\'t have time to research it which is why I went with the day\'s special, a "safe" choice.\n\nThe service was really decent, it was like they read my mind. I was taking a second bite thinking I wish there was more sauce in my dish when the waitress asked if I would like some. Than later I was thinking its freezing in here, thank goodness I had my sweater, when a woman walked up and said she\'s cold and if I was, and she turned down the A/C.  This same woman apoligized if she was being to loud on the phone, which it was loud conversation with the phone being passed around, but I barely noticed...I\'m used to it.\n\nThey were all very nice and my water was not allowed to get past the half way mark.\n\nI also got the Thai Eggroll (2) which were good. I like that they had the sweet and sour in the squirt bottles. It controls waste and its helps me aim specifically where I want it. LoL. The enitre meal was just under 20$, a bit pricey for what I got. But like I said, I went for the safe dish and will go back to try something different.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 3, 'date': '2013-07-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'q3Fa0PhTGzRl-05fXHIi4g', 'review_id': 'KT-lR3JHJ6i8NSHRfnu2Bw', 'text': 'A friend and I were meeting up for lunch and the original plan was to go to a different Thai place we\'d been to before.  Unfortunately that place didn\'t open until 5:00 and we met up at 3:00...fail.  Luckily I used my handy-dandy Yelp app to find other Thai places within a nearby radius and Thai E-San was the closest one and had a decent rating.\n\nIt\'s definitely a pretty nondescript building but I figured that a lot of the time those are the hidden gems that most people don\'t give a chance to.  We walked in and someone was already waiting with menus (I\'m assuming he saw us pull up through the windows) and took us to a table right away.  There was only one other group in the restaurant but it was a little late for normal lunch and early for dinner so I wasn\'t surprised.  It worked out nicely for us though as our waitress was able to check on us frequently and made sure our drinks were always full and we had everything we needed.\n\nThe menu is HUUUUGE!!  There are at least 70+ items to choose from so it\'s a little overwhelming at first and if you\'re indecisive like me it\'s quite the task picking just one thing!  I ended up going with the Spicy Fried Rice with Basil with Beef as the meat.  I also ordered the Thai Egg Rolls.  My friend got something with Silver Noodles, I can\'t remember what it was listed as on the menu.  The egg rolls came out nice and hot and crispy, flavor was good and I love that they have the sweet and sour sauce in bottles on the table so you can apply it as you like.  The main dishes came out not to long after and portions were very generous.  I ate more than I probably should have because it was so good and it looked like I\'d barely touched my plate.  Even my friend who is 6\'8" couldn\'t finish his plate.  We both concluded that we were happy the other Thai place was closed as this one had a bigger selection and bigger portions so it seems like it was meant to be!', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2013-08-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '34BRCAvOXu96DydxzduQHw', 'review_id': 'HHYYk8Txruh5byUoMGQv2g', 'text': 'We are lucky to live in a part of Phoenix that has 5 or 6 Thai restaurants within a few miles of our home. Thai E-San is my favorite. I went there again yesterday and had my favorite the green curry with tofu and vegetables. The food is delicious and the service is exceptional. I happily give Thai E-San five out of five stars.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2013-09-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'w0BRKdWckFPzwFg4Va6AMg', 'review_id': '5k5otAnBr4J6LdbYmWjGmw', 'text': 'This place is a very well kept secret.  The owner and staff are wonderful.  Service is great.  Updated interior very inviting.  Best Pa-naeng and Drunken Noodles in the valley.  We love this place! The Drunken Noodles are so comforting in the cooler months.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2013-09-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lSukjnlYV0rdWWGSn4eGNg', 'review_id': '5ZcjJwUl9247ZZPl0Q0KNg', 'text': 'Always good service, and good food.  I am a curry fan and they do it right.  Tons of flavor and just enough spice to add that dynamic, but not to overpower the dish.\nYUM!', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2013-09-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'AC4oMiQWgkXG8l87DEPbIQ', 'review_id': '-jDqxTbMDCGQHEHE2ZmGCw', 'text': 'Great customer service and delicious food.  Pui was very thorough and helpful when I ordered a large amount of food for our company meeting.  I think I found my new Thai restaurant.  Thank you and keep up the wonderful customer service.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2013-10-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'V8TuNMIpbDQUHyHdGmm-Qw', 'review_id': 'Ay9AtL-Plz6xcQ5rvmvfSA', 'text': 'Best Thai Food in Phoenix. Great Service, Great food. no gimmicks', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2013-11-19', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '8p8HZNmrkUBtMx_vmW9dNQ', 'review_id': 'CKmIoybtwU_gTETE4ItloQ', 'text': 'The Mrs. and I went there today.  Had the lunch specials.  We knew about this place because it came up when I listed thai restaurants...highest rated, on Yelp.\nA group of people came out as we were going in and they raved to us about how good the food is.\nWe found the raves to be no exageration!  We both had Pa Nang Curry: hers with chicken and mine with portk.  Very, very good.  We both had a 3 in "heatness" and while not that hot, it was a bit hotter than we would usually care for.  Maybe next time a "2".\nWait staff were very good.  The woman at the cashiers table (Pui) was very friendly and put us at home.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2013-11-20', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 6, 'cool': 4}, 'user_id': '8p4at4zdzCpueAmSBaorZA', 'review_id': 'hwcdZ7hfLDgEqcpiNiYowQ', 'text': 'My hubby and I went to the UYE set up by Liz S. last Sunday.  We had a really great time.  The buffet was very good.  I am a fan of yellow curry.  I wish it was not Tofu, though.  I had a taste of everything.  The only thing I skipped was the donut hole thingys.  I am being adventurous with beers also, so I asked them to suggest one, I had the Chang.  It was perfect with my meal.  This is such a reasonable place, you can enjoy your meal, watch the game, yes, they had the game on tv, have a beer and relax.  The buffet was only $9.50.  Thanks Liz, for setting this up, we got to experience a great place.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2013-11-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2qkHJ1oqE01DovTqpqCC0Q', 'review_id': 'GJVQfSslI32lIwnEr_qSLA', 'text': "I love this place. The food is good and the service is better. We visited a few weeks ago and had the pad thai. You can't go wrong with that. Tofu dishes are good as well, but nothing is better than the lemon grass soup. Yum.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2013-11-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1diI7PX0AxbbtiUB7nPbuQ', 'review_id': 'WHmTy04wW2LXa5BrlVQjgQ', 'text': '4 stars for food.  5 stars for Sunday brunch value and fun when we went with a dozen friends.  Love the yellow curry w potatoes.  Soup is terrific too.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2013-12-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'c9KQKjRGGxmsFQubtJXIPQ', 'review_id': 'uPvZjZAoovIO4u_HgokUHA', 'text': u"Wow!! We lived so close to this gem and had never been there; if not for a Living Social deal, we might never have found it; You can bet we will be constant customers now. We had dinner, and it was wonderful; now, I see the reviews for the weekend brunch, got to try it also.\nWe went for the combination platter for our appetizer, and yummy. Both of us loved it all, tho I must say the Satay was great and the Peanut Butter sauce almost as good as my hubby makes.(can't say better, or I will be in trouble). \nFor the entr\xe9e, he had a Stir Fried Basil, with combo meats, and he loved it!!!I was having a hard time choosing and my server kindly offered to help by asking me what I liked and how spicy; Have to say, he chose great; It was the Stir Fry Silver noodles with vegetables,, and chicken. Never had Silver noodles before, but sure will again.  Suffice to say we loved it all, and yummy on all the sauces.\nThe ambience is also nice, and we were treated so well by the staff we felt like VIP's!\nYou can bet we recommend it, and we cant wait to go back and try other menu items; The menu is extensive, and if it is all as good as last night, we will become regulars.  I sure would recommend you try it out. Prices are reasonable, also.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2013-12-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1aqVSQMZHMTxH0Hj5oIdqw', 'review_id': 'w4omAiIzbGbUOIUoeYCWjw', 'text': "This is my new favorite Thai place and not simply because it's near my home. It would be worth the drive. It is in a nondescript building (aren't most in Phoenix?) across from the Fresh & Easy at 7th Ave & Indian School. Inside it's very nice, including the large tables and throne-like chairs. The menu is extensive. Trying a variety of options and eating family-style, I can't remember the names of all the dishes except to say everything was good. Most especially, I can't quit thinking about the Thai ribs. I would swim in that sauce.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2013-12-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WP5xh0uwHACuDbHyLcHWoQ', 'review_id': 'Sn8mUI2PPPMfGQRgZZgGBQ', 'text': 'Great place with a beautiful atmosphere and great service. Try the silver noodle soup and follow it with some Pad Tai!', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2013-12-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'hn_DclKLzdxABRGGAuqKgg', 'review_id': 'JwRcsLSjSj7Yycnu6JZFFA', 'text': "Not bad. Cute decor, friendly staff. I thought the pad thai with tofu was a bit sweet - I like pad thai a little spicier, and it was greasy. Portion size was fair. Red curry with tofu was also too sweet. Perhaps that's the personal taste/preference of the owners.\n\nI think my other staple Thai restaurants in Central Phoenix were closed for a holiday and Thai E-San was open, I wouldn't mind stopping in, but I don't think I'd make a special trip of it. However, if you like sweeter Thai dishes, Thai E-San might be a good way to go.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 3, 'date': '2014-01-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'bry0tafQUcYC0uaJM8euMw', 'review_id': 'yCafCUhcnGRsLEm5fgC_2Q', 'text': 'Small little snook but very clean, food is delicous with great service, think I just became a regular !', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2014-01-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'Wh5pL_iTBOj3R4W7cJWEkw', 'review_id': 'COXLGI5GlU9CNKqrij2b7w', 'text': "Our Thai food craze continues...We were searching for a place close to Lux and saw this place. It's in this shady little strip mall thing, if it even can be classified as a strip mall. I'll just call it that for now. Anyway, we walked in here and the place was cute. It had an old feel to it. It was pretty empty. There was one other Person in there besides us. \n\nI got something with beef. As I usually do. I love me some cow. And my friend got the sweet and sour chicken, of course. Everything was super tasty and delicious. Service was good. And prices were good. We left satisfied.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2014-01-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'gGlCaAm6QbdwSPxtrr-HRA', 'review_id': '7kEwBcbRLDCSAPahz5kFog', 'text': 'This small restaurant hidden away in Phoenix was recommended to me by a friend a few days ago. Low lighting and traditional decor made the place feel welcoming and family run. I came here with a few friends after visiting a museum and boy the food was pretty good. The menu selections are for the most part traditional Thai choices ranging from curries to steamed fish. For the appetizer, I decided to get the Fresh Spring Rolls and those were great, I wish that there was a bit more shrimp in it however. After that, I ordered the Royal Curry at a 3 out of 5 spiciness and that was really good. They nailed the balance of heat with the coconut milk based curry and while it was hot, it tasted great as well! The staff is friendly and I would recommend this place to people who want to taste a more traditional style of Thai curry.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2014-01-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'DEKxmFrdzvyEUkeRX0Zodw', 'review_id': 'YBPu6GbHuAX5OT8YAdyOgA', 'text': 'Their food is good, pad thai is my favorite. There is one thing about them, they try charge extra on a small tiny thing which is not worth to do that. Anyways I think this restaurant is one of the best Thai restaurant in town. I always tip them well.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2014-03-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'HcEupkR_Lkg_fWWugHagzg', 'review_id': '1AANGcAD_L0njz_VzAJz4g', 'text': 'My fav thai food restaurant! Fresh food and good service. \nThe bathroom needs some TLC though.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2014-03-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '5q_h6Uir_bow-rDIjFfr6A', 'review_id': 'R4ReVWyu3ioZuJ88iorHsQ', 'text': "I went to dinner with a friend here last night and it was my first time at this restaurant. The food was awesome. We had the fried egg rolls, pad thai, and yum neua. All were very good.\n\nThe service was wonderful - the server did a great job and was very prompt. The manager even came over to say hello to us and ask how we liked our food.\n\nI will definitely be back. It's not easy to find good Thai in this city and this place is definitely a keeper!", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2014-04-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jg-sagBTTuSqHabHQ-f52w', 'review_id': 'w8t8i-PCkGtp6VGbl3DQuw', 'text': 'Ate here last nite. Ordered Masaman curry with only vegetables, my friend ordered silver noodles with shrimp. My curry was not that good to heavy, and thick. vegetables were lacking not too many. And the few vegetables that were in the curry were diced up very thinly and overcooked. very disappointing. I ordered brown rice which costs $2. And the small bowl was not even full. less than half full. my friend said his silver noodles were just ok. vegetables were overcooked. and their were not much noodles. The manager or owner or both came over and sat at our table to ask us how we liked our food. I metioned about the vegetables and my friend metioned about the overcooked veggies. and She was very gracious and asked us to come back and to make a special  request as to how we want the food. That was refreshing and made us feel validated. \n\nBefore we went to eat their we called to find out if they used MSG and the person on the phone said that "no they did not use MSG" so with that we decieded to go there to eat. \n\nI found out they do use MSG. As I woke up last nite with a splitting headache the type of headache I only get if I consume MSG. \n\nIt sad because I wanted to give this place another try. however I don\'t think I will return they use MSG and that is poison and it makes me sick.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 2, 'date': '2014-04-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'i7qUFnEVmNbyCMZ81FO5Bg', 'review_id': 'yFMoKPiBzQXpt3RQdonXuw', 'text': 'Want really good Thai food? THIS IS THE PLACE!\nThis is the best I have found in the Valley.\nEverything on the menu is amazing (yes, I think I have frequented here so much I have tried everything on the menu)\nThe staff is amazing as well, always make me feel welcome and at home.\nJust be sure to get here at least 15 minutes before they close.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2014-04-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yHYVuRjZQNVFaOYgzDv1Cw', 'review_id': '6nVmz405U5AysClvjhL-eQ', 'text': "We're from out of town and chose this restaurant at random as we drove around. We found the food very good and and the staff friendly with the owner stopping by the table to talk. I made a mistake in addition on filling out the charge slip. It would have cost me an extra $10 but the owner spotted it and corrected the math. A very honest thing to do. I would have never known. When I'm back in town, we'll come in again.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2014-04-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'exFNa0BhE81iURg_jVQZCA', 'review_id': '1g3uAvk5y00kHCH3O2UzHQ', 'text': 'The quality of their food is fine, but the value of the meal is weak. I felt that my Thai curry dish could have used more "meat" and vegetables since they added an extra dollar to the tab for the vegetables. We also ordered the vegetable dish in the brown sauce with shrimp for $12.95. The shrimp was good, but it just seems a bit pricey for a dish with just vegetables. I feel that I like Thai Rama (located on Camelback Rd) better for their value, service, and atmosphere.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 2, 'date': '2014-04-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '6-iwER6xUJHxRp_vgtfpQQ', 'review_id': 'FaE4An1n3YMgjP1o8nEgYw', 'text': "Excellent food!!! I had the Phad Thai and coworker had the Thai Fried Rice, lunch portions were very generous and as I had already said it tasted very very good. Restaurant was very clean and owner and staff was very friendly. If you like Thai food it's a must to go...", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2014-05-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 1}, 'user_id': '3gIfcQq5KxAegwCPXc83cQ', 'review_id': 'sZ6OMFFy6T6mCJPLxIl4Ww', 'text': "The husband and I got take out from Thai E San on Saturday looking for some delicious Thai food. The food was alright, but nothing to write home about. We each got a different curry, I had the green curry (4 star spiciness) and the husband got the red curry with pineapple (5 star spiciness). The flavors on both were good but neither were spicy.... like at all. That was a huge disappointment. I will say that the portion was large and the price was reasonable. I don't think I'd be back as there are other Thai restaurants in the area that I like better.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 3, 'date': '2014-05-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1g8Crb6WGQUsA2l2X3yVGA', 'review_id': 'F4CpaTD1EkzRaOqC7KPfXw', 'text': 'One of the best Thai restaurants in Central Phoenix. Very Very Authentic. Pui, the owner is a very kind, caring and hospitable woman. Nice Decor. Do not judge the inside by the outside. Great menu. Great Prices', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2014-05-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'H_1JwTui49Blnd_IXvIcUA', 'review_id': 'PWUUbjocBE4WzmMjnC5bWg', 'text': 'We just found this wonderful neighborhood place. Great food and warm, friendly service. We will be back soon!', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2014-05-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'frgwfOZ4CoD12Yack6xTYw', 'review_id': 'CoyMwCLqmk2sb7Tc0qc9sg', 'text': 'I had the Siam seafood special and it is spectacular.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2014-05-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'fIvDzLhs-cXbTKWp8P3eIA', 'review_id': 'kAhJ8NCWwh7f7vtJpE4OlQ', 'text': "Food was delicious! Unfortunately, I woke up with a migraine the next morning which lasted allllll daaaaay looooong. Another yelper mentioned something about MSG. I decided to try Thai E-San anyway....hindsight is 20/20.\n\nThis review is not because of the food or customer service, I'm just super sensitive to food additives.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2014-06-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fIvDzLhs-cXbTKWp8P3eIA', 'review_id': 'gSl7pkBYyK25MeNsyB5JHA', 'text': "I can admit when I'm wrong. Someone from Thai E-San responded to my previous yelp review informing me that MSG is not used in their food and to give them another try. Well, a couple of weeks ago I placed an order for pick up and did NOT have a headache the next morning. \n\nThe reason I am not giving them 5 stars is because my order was wrong. I will continue to dine here, but when picking up an order I will open the bag and look inside.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2014-07-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'p419or-dDs5z4K_dTZVq0A', 'review_id': 'H7r0NihiXkR5jB_g_svtLg', 'text': 'My first time here and only second experience with Thai food but I will definitely be back! It was so good and the staff was amazing!!', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2014-07-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '_Lz4b5QL0K8ndeyz2vxslA', 'review_id': 'RTp7PDhUca-0-mIpRb-JDw', 'text': "This little place is in the hood and I finally got around to trying it today. \n\n I'm a purist when it comes to Thai food...a good pad thai, a ton of peanut sauce, and some spring rolls are all it takes to make me happy. Luckily I was with a buddy who is a bit more adventurous than me...she had the recommended yellow curry and pronounced it delish!  We met the owner, who is a hoot, and thought the decor was very nice.  The food was great.\n\nI really appreciate the fact that the food meter goes from 1 to 5.  3 was just right for my meal and my buddy went big with 4.\n\nNow, how to get another star:  \n\nfocus on better service.  The staff was good at keeping our drinks filled but forgot to bring things to the table.....this is a minor quibble for me but may be a dealbreaker for others.\n\nMy noodles were also just a tad undercooked\n\nWe didn't have condiments at the table\n\nAll of these little touches will add weight to your reputatiion!\n\n\n\nWe both had leftovers to take home and the bill came to a whopping 28 bucks.  We left full and happy.\n\nGreat food and good pricing?  Less than a mile from my house? Yes, please!  Can't wait to try it again :)", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2014-07-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9PpOUS6hJSnFvTUWembgaw', 'review_id': '0oBMu4gxwnKI0dXzx3G2aQ', 'text': "I came here for the first time today for a late lunch. The service was amazing! The staff was so sweet, friendly and so helpful and really took care of me. The food was extremely fresh and the portion sizes were fabulous! I got the fried tofu for an app and the grand salad for my entree. Usually I am disappointed after a salad entree because I am still hungry afterwards, but that was not the case here! The portion was filling. The inside is decorated VERY well and I loved the beautiful bowls the food was served in. Overall, amazing experience and I can't wait to come back! I will post photos.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2014-07-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TKucqTvBlnOEk82am1f1ZQ', 'review_id': 'Nz_gSGFeHuFrwG1jRYIEJA', 'text': 'Looks MUCH better inside than out.  Fast, delicious food at a great value.  Could have spent the day just enjoying the soup that came with the lunch special.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2014-07-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'keWP5Ewpbz-3JgdZEWJMuQ', 'review_id': 'MFkqV1CRN4zXm9UTWkawjA', 'text': 'If you are near the Woodlea / Melrose area in Phoenix and are hungry...go here!  Great friendly service, great food, reasonable prices!  The coconut soup is fabulous, all of the curry dishes are fantastic, and the Thai E San sausage (listed with the salads) is really, really good!', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2014-08-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lMPTQT0jf6-S7AxhMoOZzQ', 'review_id': 'K6CxYMSvhu3H4ia3ph8CPA', 'text': 'Close to my house and had good pad thai. :)', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2014-08-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qU7qUaueqwE6DrFFIxcFqA', 'review_id': 'PSkBumZgWwsj5AlVgv74aQ', 'text': 'This is a favorite restaurant of ours. We like authentic Asian food and after going here for a while we took a trip to Thailand, which we shared with the people at the restaurant, who are from Thailand. The food is quite good and plentiful, along with Thai beer (Chang beer, which means "elephant"). We enjoy talking to the owner while there as well. We have taken friends and family to this restaurant over the years.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2014-08-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'W_t0JNlBgJBiqacTo_MR9g', 'review_id': '7zvLklTOWrkkE2a5Yz7W1A', 'text': 'This place is tasty! Had the chicken panang curry which was delicious.  Great lunch special, very attentive and super friendly staff.  You even get slices of watermelon at the end of your meal. The soup is delicious!', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2014-08-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JsNrdyPTEheGcrtotLQ69g', 'review_id': 'BuBHdYDwN4C09E91FUXQJQ', 'text': "My favorite Thai food in the valley! The customer service is the best I've had by far! And the food is really good. I love Thai food, and being from Portland, Oregon where there are a few great places that measure up to the food I had while visiting Thailand, I feel I can give an accurate opinion on this cuisine. The E-San's cashier has even wooed by fiance into loving this place, which is nearly impossible. I usually get the red curry with tofu, my fiance has tried multiple noodle dishes, pad thai, and tom kha soup, and he has been pleased with every dish he's had. We have tried multiple Thai restaurants in the valley and have mostly been disappointed, so now we just stick to ordering here.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2014-08-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'M6-uOuIvbeJ62aMO6dRW5g', 'review_id': 's71-rsm5CNgC9OAgOcmZKg', 'text': "The food here is great. The service is fast and the owner is always here checking in. I come in pretty often and they remember what I order, even if I change it. I wouldn't go anywhere else now that I've been here!", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2014-08-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'F5Rm2xtmWdbYVsnWLsXv7A', 'review_id': 'P06hwZ6JWhXxzrYQssM1kw', 'text': "I've been ordering to-go from here for the past year! Absolutely delicious every single time, and the service is always wonderful. Always greeted by the friendliest staff/owners.  The coconut soup with chicken and spring rolls are my favorite! Can't wait to dine in when I have more time. Until then, I will keep placing my to-go orders!", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2014-09-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'dqmXlUQyDh6d5U2_Zjb-Iw', 'review_id': 'yYdbkUlxu4yU1Ae3GQIppw', 'text': 'I am surprised by their rating. I tried the restaurant recently and was disappointed with their service.  Their  spring rolls were greasy and the vegetables were soggy. Tried their green beans with red curry the dish was salty and the beans overcooked  ph at thai was also  overcooked . Disappointed', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 3, 'date': '2014-09-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0U4Lkl8LxTTBaRdgXC6Wbw', 'review_id': '70-L5wvKsr5ikOeUZtGATQ', 'text': "Great food, great staff and parking.  The prices were good and very reasonable.  Can't wait to come.back..", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2014-09-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6yyOaGo9FM1PPdb8R-pq3w', 'review_id': 'Ak4TQAyEEJXM6LlZQa3HMA', 'text': "Come here during the week for Thai basil and pad Thai, get the tom ka it comes in a huge metal bowl with fire coming out the middle. Come here on the weekends for the buffet. It's huge, there are coconut curries, satay, spring rolls, and an awesome diversity of Thai dishes in varying degrees of spice.  I really miss being walking distance from this place.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2014-09-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '_FhcZI4BHkjemSjIbZ7NWg', 'review_id': 'ZzF-WqtYMOzzGmhqx2qmYA', 'text': 'Even though I arrived 10 minutes before they opened, I was happily seated and promptly served. My red curry was the perfect amount of spicy (medium) with all the complex flavors as expected in Thai food. The restaurant was very clean and the staff was friendly and speedy.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2014-10-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1g8Crb6WGQUsA2l2X3yVGA', 'review_id': 'ej_1ik6h1C0Q368bPJ_Vyw', 'text': "Its a good thing that one of the most authentic Thai restaurants in the valley is right around the corner from us. We go here for lunch and for dinners. We have always had great service, fabulous food. Just can't go wrong no matter what you order..", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2014-11-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'p3jwJsnF1ARgBaYev9tYRA', 'review_id': 'nNnwt5FQ0MUqATRgSusHDw', 'text': "Ab so lute ly delish..\n\nI luv Thai food.. I mean it's my very favorite..\nI've eaten at all the local Thai places.  But we only just found this one.\nWe ordered the Thai cashew pork, chicken pa nang, and the pad Thai.. \nAlong with Thai iced coffees..\nExcellent food, great friendly service.  Nice atmosphere.\nAverage price per person with drink and appetizers is about $17.00..\nAn absolute must try..", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2014-11-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6fboUxwhAsUMx1F9yCzlMQ', 'review_id': 'hOFadbEiA1-jnfGu2XY-Gw', 'text': "Best Thai food in central Phoenix, hands down.  \n\nIf you are looking for tasty, authentic Thai food that is prepared with fresh ingredients rather than an Americanized version of Thai food, Thai E San is the place you want to go.  We dine in and ordered take out regularly and we are always pleased.  The food is consistent and the flavors are very authentic.  The restaurant staff are pleasant and very attentive. The portions are a good size and their prices are reasonable, especially considering the excellent quality of their food.  \n\nAnd as a vegetarian I have to say that they know how to cook tofu and don't skimp on it in their dishes. And the variety of options here for vegetarians is very good. The tofu satay is a must.  Their vegetarian Pad Thai and Massaman Curry are 2 of our favorite dishes.  Everything we've tried has been delicious!", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2014-11-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6x0FU0k-31HYps6nAwFDsQ', 'review_id': 'VjoC6S-pNQCGpKvuegfv9g', 'text': "Out of school and starving boyfriend and I headed to thai esan with high hopes and empty bellies. We eat thai basically daily and we happen to work at a really delicious one. \n\nWhen I saw the outside, I wasn't expecting much. The place looks pretty divey and you would easily miss it. Inside is way different!!! So much decoration! Really interesting to look at everything! \n\nThe service was helpful although when my boyfriend ordered thai hot, she assumed he couldn't handle it and said she would give him a level lower hahaha. The food definitely wasn't spicy enough!! But everything was reaaaaallly great. Prices seemed to match the quality and portion we received. \n\nIt's on the way home, we will definitely be back again!", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2014-12-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qKqvVFP6PmxlS7-u0xjs3g', 'review_id': 'A4cwFgMaJMbuT8VHzARhew', 'text': "Stopped in here for lunch as I'm a Thai junkie. The service was okay, not very friendly or personal and it was not very busy at the time.\n\nI ordered everything spicy, and when it can it had good flavor with a raging spice to it. Needless to say I worked up a decent sweat by the time I left. The restaurant is nice, the food came out fast and hot, and the price is great! They have a large menu selection for everyones palate.\n\nGood place to stop for lunch or dinner!", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 3, 'date': '2014-12-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vO14FeLhQf2Vz1u2KtYIRg', 'review_id': 'LR0mcRWCKRnCt12bYsDnzg', 'text': "Came in since the reviews were so good and now I see why! Spring rolls = amazing!! BBQ Chicken = melt in your mouth! Pad See Yew = Fantastic! Massaman Curry = spicy but so so good! I'm kind of an expert in Thai restaurants and this is definitely one of the best Thai restaurants in Phoenix. Oh and super friendly staff! Helps when u tell them u saw them on yelp", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2014-12-08', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 7, 'cool': 2}, 'user_id': 'gx3ZRjh43OOuavKl_rXvrA', 'review_id': 'xRp1K_ZcVCM3G1fbD1MVGw', 'text': "Heat seekers, Thai E-San and Thai food in general knows how to serve up the heat!\n\nFor Thai food, I always order a soup, some kind of noodle, Thai tea and dessert. So to start, I did share with my room mate for dinner so let that be known before I am deemed a glutton. We did the Seafood Tom Yum, Pad See Ew and Mango Sticky Rice.\n\nThe Thai tea was good, sweet and strong (I didn't sleep till 3AM).\nSeafood Tom Yum had good flavor, not MSG laden, filled with seafood (mussels, scallops, shrimp, squid) \nPad See Ew with beef, yummy flat rice noodles with strips of beef, savory and spicy!\nMango Sticky Rice was good, though the rice was a bit too wet for my liking and the portion I felt was a bit small for the price point.\n\nFor all the food, we asked for Medium heatwise and I thought it was perfect! I do like spicy food though, but there is a burn!\n\nAll in all, Thai E-San puts out solid Thai food. The owner came by to talk to us and also made sure everything was alright with the food. The food tastes pretty authentic to me!", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2014-12-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'V6rhoTCw7S6H8eHwv2M6Vg', 'review_id': 'SXVVX5jbmB_QSq3AAekOAQ', 'text': "Seriously, I've been here like every other week for 2 years and still love it.  This deserves 5 stars.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2014-12-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'r4w5kdFHHKfEKODpeFSp6g', 'review_id': 'hjCn3tEl4DSSqA6KIVef0Q', 'text': 'Really great Thai food.  I am a creature of habit so I have only tried a few things on the menu.  The yellow curry with chicken is my favorite!  I get it almost every time I am there.  I am also a wimp so on a scale of 1 to 5 I get it on a max of 2.  Sometimes that is even too hot for me. lol  Service is always very fast and friendly.  Restaurant is super clean.  Free wifi too!', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2014-12-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '7wt6kyFKolkhT2KT2guivQ', 'review_id': '-A7SehKL9_G1gGasOX1rpg', 'text': 'I luv this place. \n\nToday I have a cold so chicken curry is exactly what I need to clear my head. .\n\nBest Thai in the city by far.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2014-12-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '43NCZMFc_guSFBbo9g_0rw', 'review_id': 'SUGaDu4xXlyUjbsTtjkYKA', 'text': 'Love this Thai joint. We love to order yellow chicken curry (spicy #3), spicy basil rice (spicy #4), spring rolls and the Thai tea is so good.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2014-12-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'knm3ZM6uv2jN7hc3yFRPuQ', 'review_id': 'Onq4RV5wYuVJ97FuHsoGow', 'text': 'This place is amazing and the owners make it that much better as welcoming as they are', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-01-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'niZngjfB-F3t_XANDrgUmA', 'review_id': 'yEfm3YbNMUr84g47MeP4sg', 'text': u"I typically judge the quality of Thai food by how well they make the beef salad, as was in this case. I ordered the beef salad to go, spicy level 5, which is hottest (I love spicy). The spiciness level is good, they didn't tone down. Overall, though, the balance between sour, sweet, and salty was off - I felt it was more on the sour side, and had to add extra fish sauce from home. The beef was supposed to be grilled where you can taste the charbroiled flavor, but I did not appreciate this at all; it had a more saut\xe9ed flavor. The portion was on the small side for the price. To be fair, the owner was very nice. I asked for the kaffir lime leaves (gives it a homely Thai flavor) and she gave me a handful on the side! Arguably the best Thai beef salad I had was Les Ros in San Francisco.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 3, 'date': '2015-01-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Gwn3q2G0kbrxD8qxSQE5_A', 'review_id': 'rm1GamijjV72Lz4x-nZMQg', 'text': "Waiting...waiting for the server to get to our table for drinks, waiting for the food. I have been here plenty before and there has been great service from their Caucasian server/waiter but he wasn't here tonight and the service is poor. And other tables are being served before mine when we arrived and ordered before them. The food is good but the service is poor hence the 3 stars, but I do have in mind it could be a low staffed night", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 3, 'date': '2015-01-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FQmsBNCuAT3-z50FoaSaPQ', 'review_id': 'ighHBybxV-xMQ9wa1vP0SQ', 'text': "Best thai food in phoenix. The owners, Pui is super friendly and remembers her regulars. Must eat! Can't give it a 5 because it is overpriced. Would eat more often if it was more reasonable.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2015-01-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'alZHXwBbNqoWdk4mKtr-cA', 'review_id': 'DnM--ODuBoUSU17rdbbj9g', 'text': 'I really hope this isn\'t the best thai Phoenix has to offer. It was decent. I don\'t like how they prepare the tofu and that\'s usually a speciality for me at thai spots. And then this is funny but not: we ordered brown rice. Didn\'t know about extra charge but don\'t care either. Lunches came out with white rice as supposed to. I mentioned I want brown rice. They were quick to scoop up our plates, put that white rice BACK for the next customer (not cool), and happily brought us each our own orders of $2 brown rice (we could have shared one). But!.... If white rice is included and I had to pay $2 extra for brown rice; wasn\'t i entitled to the white rice already on my plate as well, rather than it being "recycled" for next customers? Just saying', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 3, 'date': '2015-01-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'F_LGfrSw8uedpC4cHP8npw', 'review_id': 'ji8yhuqWzQjHUFKui75tLg', 'text': 'Worse service I had.  Waited two hours and never was served food.  People that came one hour after me got their food before me.  I will never come to this restaurant again.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 1, 'date': '2015-02-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZPYhCwX6T5z0wNC7sEMNTA', 'review_id': 'l_EVFk7AxFKTTHLRGJBUWA', 'text': "The BEST customer service I've had in a long time!  To go order. She explained ingredients of all 3 entrees; got a bottled water while waiting.  Greeted by 3 different employees.  Great job!  Good good too.  Usually goto Thai Lana, but think I'll be going here now!", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-02-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'K5qn1kyTpvM4rA6nSy1OYQ', 'review_id': 'v1xpIKwfYfDrn6KGOJDkcg', 'text': "After hiking at Squaw peak, my friend and I were famished and really felt like having Thai food. The place didn't look very promising from the outside but the interior's good. The owner is friendly. Egg rolls were fresh and crispy. The red curry with pinapple was delicious!! Masaman curry tasted great too. Food was finger-licking good. Definitely want to go here again!", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-02-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'i94JgBKT4T7pGco7W1S0OA', 'review_id': 'Gp3Zox4Yp6Ov4lkScaGblA', 'text': 'Great lunch special. The server was way nice.\n\nBeware of the spiciness level. I tied 3 (out of 5), and it was too spicy for me. The server saw me suffering and offered to give me another dish with lower heat. It was good!', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2015-02-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'RAWy3YCE-jwfyuGvwzUaqQ', 'review_id': '21z7Jsc_H3K_tjKd0wPoNA', 'text': "Their $7.49 weekday lunches are such a great deal. Even the soup that comes with the lunch is yummy. It's not on the lunch menu but they always make the Yellow Curry for me upon request. The Spicy noodles are very good as well.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-02-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-viAKyal6FgyAla2rfcx1Q', 'review_id': 'S4IHPz3F7Sge3quuRhrhWA', 'text': "Tried this place for the first time tonight -takeout. The service is great, nice on the phone, and were prompt making sure I was attended to. Got the vegetable green curry- 4star and pad Thai 3star. Green curry is nice, it was a true 4star spicy, vegetables crisp and cooked just right, but sauce did have more of a sweetness than I'm used to. Bf got the pad Thai, and he liked it. Will be back for sure!", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2015-02-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2-PGLtcgENN0wiiWfsKjjA', 'review_id': 'In8Ds3YCI-h785DI-00hUw', 'text': 'Amazing. Such nice people and they have the best curry and egg rolls and chili paste and crispy fish with green beans and....everything!!!', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-03-06', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'SxpTiEX7UKUKvRKnvvTZjA', 'review_id': 'Fr7S5AEUfD1QJtmheNBV1g', 'text': "Thai E San is an exceptional Thai restaurant. Here are some of the highlights: \nThe curries are all consistently good with enough heat to clear the toughest sinus. The specials change each week, the Gai Ping is a delicious chicken in peanut sauce with spinach, definitely worth a try. The spicy green bean (PIK king) is flavorful and can be made like all other dishes with a choice of meats or tofu. The Thai tea here is sweeter and smoother than Thai tea that I've tried at other establishments. \nService is exceptional, just be on guard for the part time comedian, his service skills may make up for the bad jokes.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-03-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PWO33y9HRhPWxD4bWJyo3Q', 'review_id': '_kD9OUrUNL7bR9K9LLigcQ', 'text': 'Authentic food and atmosphere / great food / good prices and friendly staff what else can you expect, Try the rice soup yummy', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-03-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Gwn3q2G0kbrxD8qxSQE5_A', 'review_id': 'RVOB2A9AsldIk_tkeJo1nw', 'text': 'One thing is great customer service. For the first time the owner of the restaurant responded to my review and took it as advice to better the restaurant. For that I change my rating from 3 to 5 stars because the only reason it was a three was customer service. Besides this, the food is amazing and priced very reasonably. Definitely one of the better thai restaurants in Phoenix', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-03-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hpSRnzxLYZlypNHHD3moxw', 'review_id': 'O0p7oVISDCN37qgLrKKgbw', 'text': 'Always amazingly delicious food and beyond superb service. Best Thai food hands down, my family and I only go here.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-03-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BCSWLzpaSmaTOMJYTFfHng', 'review_id': 'wkr8BHG8sGy1mV7e9hJoRQ', 'text': 'Chicken pa-naeng was absolutely amazing. Nice and spicy with the sticky rice was just perfect. Lunch portion was more than enough to satisfy the palate. Will definitely be going back!', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-03-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '59nBUtSuJ4PA-F8wHy44tw', 'review_id': 'Btrc3vp8pTyrCKD3lBSaSg', 'text': 'The curry and the pad Thai were so good! Defiantly added to our list of favorites! Thanks:)', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-03-30', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 3, 'cool': 3}, 'user_id': '7xeyJItJ4eiud9tSJJ0uAA', 'review_id': '448SOH44Xup-PaSVfNmq5A', 'text': "My first experience with Thai food was eating in a hole-in-the-wall restaurant back in my hometown run by a Thai woman who would never let anyone come through her kitchen doors and who was famous for her tantrums which would close down the shop unexpectedly.  The sole waiter was the Thai woman's husband who met her when he was abroad in the military back in the day, a grizzly old white guy who told horrible jokes.  The restaurant did very well despite the sometimes spotty closing hours.  Needless to say, my expectations for Thai food are very high.\n\nI've been searching around different cities trying to find Thai food as good as the food from my first experience and have been disappointed until I tried Thai E-San.  I don't know what it is, but there's something special about the aftertaste at Thai E-San that sticks with you.  This is excellent Thai food.\n\nWe had the 3-star spicy Pa-Naeng Curry with Duck and the Red Curry with Shrimp.  Both were spectacular and had the perfect combination of spice and flavor.  Portions were big enough for at least two meals or for two people to share, which is how Thai food should be - it often taste even better the second day.  Although we did take-out, the service was very friendly, and the smell... the smell inside this restaurant made me want to sit down and just sniff.\n\nI've definitely found my new Thai place.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-04-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fbUlu0ht8PwrZY5EKBJPaw', 'review_id': 'gujhVELrNk4r78kyp_s-WQ', 'text': "This place is the best!! We are so hooked, we've become regulars. The chicken coconut soup is awesome, the chicken teriyaki is great, the masuman curry is fabulous, spicy fried rice is great, but my favorite is the spicy green beans with pork or chicken. Honestly the list goes on and on....\n\nSo much flavor in each dish, and always consistently great. Even the Thai tea is the best we've had. We tried a ridiculous amount of Thai restaurants here in AZ this beats them ALL hands down, on food, service, presentation, everything!!! \n\nThe service is always great and attentive. The owner is so sweet and takes time to ask everyone there how their food was and generally cares. \n\nThis place is one of my favorite restaurants here in AZ!!", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-04-04', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 1}, 'user_id': '6oT_h3wgtiKOjnq2n57BjA', 'review_id': 'LTEkhrdFsIN-K2FZF_95og', 'text': 'I rarely give reviews but this place deserves a good word. Great service, genuine and friendly servers, great food, and clean! \n\nAnd a bonus, their water tastes amazing!!!', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-04-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'aqSyV_KPm1xIN1cjFO68aw', 'review_id': 'awe6teFDtCbgOU3hl23maw', 'text': 'I ordered the chicken pad Thai and egg rolls. Both were served quickly and with friendly service. I look forward to eating in or ordering out from here again soon!', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-04-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4-zqMmkuQdIDXiWXkN5Tpw', 'review_id': '6DM8LO2RnfhfTKMcz0_fdg', 'text': 'It was delicious !!  I had the flaming coconut soup.  It was awesome. And the spring rolls were great too', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-04-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '3HO7mvMp1klfkBUUqQCvZQ', 'review_id': 'B_AXqkNKob8M8_nNuVEcxw', 'text': "Best thai food I've had in a long time. Dishes are fresh and spicy. Wish I lived closer.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-04-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'NgfhXbhrEVLPRSXWiJ72IA', 'review_id': 'nDAXyxs9RfF7lzD-FXjhXg', 'text': "WOW... what a disappointment !!   I ordered for pick up.... Prawn Salad, Chicken Salad, Squid salad..... Pad Thai, and Tom Yum soup.    The salads were a wedge of iceberg lettuce with cold, boiled shrimp and squid.... just tasteless and boring.   The pad thai was bland.... no flavor.... and the Tom Yum soup?   OMG... one bite and I had to spit it out!!   It was SO un-believelably salty I thought I was being punk'd !!   Went right down the drain!!      I am in a desperate search to find great Thai food in Phoenix.... I keep going back to Thai Basil.... but there must be a stand out.   Any advice?    Thai E-San was the worst I've had yet.... and EXPENSIVE !!    Stay Away!!", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 1, 'date': '2015-04-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bHX2K6kTYK2INaHL8oHmSA', 'review_id': 'p0uIscDVqJxfIOpDU-37rA', 'text': 'Since we were just working in Phoenix for the weekend, I yelped "Vegan" to see what options this city had in store for us. Thai E-San was highly rated with great reviews that proved to be true!. The owner was great and let us know everything was made to order and that we could pretty much pick anything to be prepared Vegan. The Pad See-Ew and Eggplant were cooked to perfection. We ordered a 3 on the spicy scale of 1-5 and that was HOT, but so goooood. To-go portions were generous as well. Plenty of food for 2 people to share. If we lived here... we would definitely become regulars.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2015-04-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'AyD4_z6nPlk_wgUz9JtXMg', 'review_id': 'f_bTVEmaWztcQPYarLGOvg', 'text': "My bridal party decided to take me here to eat for my bachelorette dinner and when they called to make reservations the staff offered to call and have a stripper come out. I was like WTH kinda thai restaurant are you guys taking me to?!?\n\nFor a Friday night they were pretty slow. Place is pretty spacious and big enough to hold big parties. Please check the silverware and cups prior to using it. My girlfriend saw a lipstick stain on her cup. \n\nwe got the usual safe thai dishes: curry, pad thai, papaya salad, pad see ew, tom yum soup, etc. \n\nfor a party of 6... we got quite a few plates to do family style. the portions were really small. so we each couldn't either get seconds or get a generous amount. usually in LA it's easy to do family portions because the amount is pretty big. I zoomed in on my pictures that's why it looks like the portion is big btw. \n\nto be honest, nothing was really memorable food wise. if you truly had nothing else to eat and was craving thai then i would say come here. they ask if you want stuff spicy and would give you a very big scale to rate from. i believe it was 1-10 which is a really big scale to choose from. As a side note: I'm just spoiled by all the food options in LA and it's truly hard to not compare it to what I'm used to. Therefore my review may be totally different than a local. \n\n\nstaff speaks english really well. dimmed parking lot and inside. \n\n\nTips:\n-has its own parking lot. \n-takes reservations\n-cash and credit cards accepted\n-adds gratuity for parties of 6 or more. \n-small portions\n-indoor seating only\n-they do catering.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 3, 'date': '2015-04-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1C70bI8fyM3iJiKIHHilpA', 'review_id': '60vbkYEiB_48UF__mgs6RA', 'text': "Great food,  quick service. And a 4/5 spice level was a touch spicier than I expected.  Next time I'll stick with a 3!", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2015-05-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'psSxO_7PWbBbUiV2jB6BUg', 'review_id': 'Bfz5SgpSLmS11fvmDJu1Ow', 'text': 'This place is awesome.  I have been here several times.  The Thai Chicken Rice, The curries and especially the ribs are excellent!  The staff is very nice.  The tea is made from actual Thai iced tea without the milk.  SO when you get iced tea, it is awesome.  Just add a little sugar and no condensed milk needed!', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-05-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '9UK28WYQvS7aXyNfa_hLCQ', 'review_id': 'hKEWcHp3yU7SE8PODuX7Pg', 'text': 'Great lunch specials. I get the green curry special with chicken medium - only costs $8.15. The spice is perfect! They give a ton of food too for take out compared to other lunch specials. Everyone is very nice too!', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-05-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'by1mnU0rP1wd6yZgZsCr7w', 'review_id': 'DBA8HzoK5uGy_ugN5qO2xA', 'text': 'The best Thai food in Phoenix. Great atmosphere. Will never go anywhere else.  Must try!!!!!!  Thank you for the amazing service. Staff is amazing from the moment you walk in to the time you leave.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-06-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'y_Gk24o81E6OCyrrsdm2Kw', 'review_id': 'T6DZXYvCBGNNbYCKYxFfrw', 'text': 'Good Thai food. We love their drunken noodles, bbq spare ribs are awesome, and their sticky mango dessert is great. :)', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2015-06-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KYJS9gSlgk_OI7FTi-tDNg', 'review_id': 'WCITrhlnc_wzE7A6W63uew', 'text': 'The Chicken Satay was so good! The service is always excellent and the Thai ribs are my absolute favorite!! Really great food at a good price. Its a Favorite.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2015-06-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'f2DaPra5riUApMbDHM13nQ', 'review_id': 'SYmJ3iWic_JqEHr3KddkSQ', 'text': 'Great authentic food. I eat here about once a week now.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-07-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zEPgPypMQ4416IqMTha4oA', 'review_id': 'gFAh1QUxpZTMWuCg3PSJGg', 'text': 'The green curry and Pad See Yoo are excellent, and the staff is exceptionally (and very genuinely) kind and welcoming.  Thai iced tea is amazing and delicious.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-07-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'NNxvJ0vZgw8bj3hFl9EJeg', 'review_id': 'B6q7JfMwtZDQa_kltwjnaw', 'text': "Best Thai food in Phoenix. I've tried them all and this is the only place that satisfies a craving for Thai. Green curry and cashew stir fry are my favorites.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-07-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oUGmoziFCwNi2oUHB54SGg', 'review_id': 'FULDetIUxMujJHnH80mZGA', 'text': "Best Thai food I've had in Phoenix and very friendly staff. Environment is calm and relaxing  -  though I have only done take out", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2015-07-19', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': 'OrKTg8giugIcNopymvhAtQ', 'review_id': 'AARzBqBXyy65Mxv4jtzy5g', 'text': 'Thai E-San is easily my favorite Thai restaurant in Phoenix and I have tried almost all of them. \n\nLets begin with the service because it is amazing. The owner is always there and is so friendly and absolutely devoted to great customer service. The staff is friendly and the environment is great! The have sweet and sour on the table (some places are stingy with this and I love sweet and sour sauce) and fill water glasses frequently (a necessity when you order your food Thai hot). The portions are large and I usually leave with leftovers. I usually get the stir fried mixed vegetables with chicken and my husband loves the chicken red curry. The fried spring rolls are to die for! I highly recommend this Thai food and the service here.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-07-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zN53aKlrY5f4jWuqphxYRw', 'review_id': 'FGSKMEfp6TayuPbFcTwpwA', 'text': "Very friendly staff and welcoming environment. Service is very good and the food is the best Thai in Phoenix.  Have been to numerous other Thai restaurants in Phoenix, and haven't tasted better than here when it comes to traditional Thai cuisine.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-07-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ji-gfhbfPDTw2kuZGP9A9w', 'review_id': 'nRWrOmXLlZqyHLZvFOxs0A', 'text': "I have been coming to Thai E-San for years and it's probably the best Thai I've had in Phoenix. Service is great, always greeted warmly and promptly. Food is super tasty and great portions for great prices. I would highly recommend coming here to anyone looking for a good meal (and a joke or two from Rex -- just ask for one, you won't be sorry!)", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-07-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9AMj35fmTRYsomO_wpMZLg', 'review_id': 'dJdBP4dh8tRA-bCo_NwYvg', 'text': 'We love this place. The good is the best in Phoenix and the service is always so friendly.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-07-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rRezVmyS1nJBqGyOkxLxig', 'review_id': '6ahzezK3kjzBgB-xG87YnA', 'text': "I just moved into the area and I'm ecstatic to have found an amazing thai restaurant so close to me. Making a big move to an entirely different city is always scary, but to leave behind your favorite restaurants? That's a different story. A short walk down from my place reminds me of where I came from.\n\nIt doesn't get more wholesome than this! This is delicious thai food! The Massaman Curry with chicken is amazing! Honestly, anything in the Massaman Curry is a great choice! The curry is so smooth and the peanut sauce makes it so creamy. The crab puffs are so good! They are filled with crab meat, which is unusual to find in the landlocked state of Arizona.\n\nI am happy to have found this amazing thai restaurant a walk away from my apartment. I moved in a month ago, I've already had take out more times than I can count! If this wasn't so close to where I live, I'd starve! I suggest this restaurant to anyone and everyone! Go in, you won't regret it!", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-07-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oX-mDNESk0GegXtS_xe4lw', 'review_id': 'LnzXZDcZiRWFwK0w64rTTQ', 'text': 'I had the Pad-Thai which was fantastic. The noodles were perfectly done, and the sauce was tangy with a wonderful amount of spice. I was really happy with the amount of food I got for the price as well. \n\nI also recommend the angel wing appetizer. It can be described as a "Thai chicken nugget" very yummy with their sweet sauce.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-07-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qpAAMHi6e_CirzXHxwvalg', 'review_id': 'zr1yKbwn35BXNvC1WX_O9g', 'text': "This is my new favorite Thai restaurant in the valley. Their lunch specials are an insane value, and includes soup and a fruit plate for dessert. Their panang curry is some of the best I've had.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-07-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'AVX9EsrBlWTwjH6wik1KhA', 'review_id': '7Z26YAUqzsLLoY_RUBy4Zw', 'text': 'This place is fast and has a great selection of Thai food. I love spicy and their Thai hot is unmatched. Servers are very friendly and it is extremely reasonably priced. Definitely my favorite Thai in the valley. \n\n- Parker', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-07-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4j_bzchJhehZfpeByM-wdg', 'review_id': 'E-n4UCJ8y2xE8GUUyZKkzg', 'text': 'We started out with an order of Chicken Satay and the chicken was tender, juicy, and perfectly spiced, and we received 7 sticks, which was a great value for the price. I had the ping gai for my entree, and again, he chicken was perfectly prepared, and the peanut sauce was delicious and NOT overwhelming, which happens sometimes with this dish.  All around, A++++ would dine again!', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-07-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'gEYTqxD8HKC9FigbF8uhmQ', 'review_id': 'g5UPSpyNsRxW7ALIAqtV9A', 'text': 'Been living in the area for almost five years now and there a several great Thai restaurants in the area... and Thai E-San continues to be my favorite!  The Massaman Curry Chicken is excellent!!', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-07-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hx_hyJO_MfaVew6COOrLtQ', 'review_id': 'SbGXwYepGk8ii13FEUpX_w', 'text': 'One of my favorite places to have Thai food!  Every dish is great! My favorite is the silver noodle Pad Thai. But we enjoy all of the different dishes.  Prices are reasonable, and service is very good.  We visit often.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2015-07-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'p8F1syOdGMwGW8bIho5hQQ', 'review_id': '5xw5jrCt0zozK592c0q6aQ', 'text': "They just revamped the interior and it appears they can now fit more people in.  We always go in or lunch and getting a 4 spice is just fine for my above average gringo tongue.  Food is continually good... Service is always around... Owners always make you feel like family.  I can't just suggest one meal for all have been stellar.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-08-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'y3sOyQUiwL_dV38H652dfw', 'review_id': 'ftmh6WRzAxYM3FkYlkmXgQ', 'text': "We were greeted quickly and very warmly upon our arrival. I asked if they had a cocktail menu and they did not, so I asked for a mojito. They didn't know how to make that, so I asked for a tequila with soda and lime. The bartender came back to our table about 5 minutes later and said they didn't have lime. What?! Isn't lime one of the primary ingredients in Thai food? The crispy spring rolls arrived and while I would have preferred spring rolls without chicken, they were hot and fresh, if not a bit greasy. The pad thai was nicely seasoned but again, could have used the acidity of the lime to balance out the sweetness of the tamarind. My husband enjoyed his royal yellow curry with chicken and we shared the egg fried rice. Service kind of went downhill as the restaurant got busier. Our waters were not refilled and we were not asked if we wanted additional drinks. We sat around for about 15 minutes waiting for the waiter to ask if we wanted our check and finally, we just got up and went to the front register to cash out.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 3, 'date': '2015-08-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oYyQsVZw94bSNkqsjk9RAA', 'review_id': 'ReqVszoIAf2CP17Jt22OxQ', 'text': "After trying several different Thai restaurants, we've found Thai E-San to be the best.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-08-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5VG3auY-BTilgqQxQqo-mQ', 'review_id': '-QMqX3QiA2f5xLs_-kmyVw', 'text': "Love this place! Friendly staff plus great good. Best cashew chicken I've had since moving to Phoenix. Also love the chicken satay. Newly remodeled and great atmosphere.  We take all of our out of town guests here and they ask to go back. Yum!", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-08-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9z4sGAL1hu9rLJhcFZR8ng', 'review_id': '7nhSVlgPLRQGadEx5b8A-Q', 'text': "This is simply the best Thai I have ever had.  Every time I go it's just delicious.  Very flavorful and fresh ingredients.  And they make it to your heat level so you decide how hot it is.  The owner and all the wait staff are very friendly as well.  So far I've had the chicken coconut curry, the drunk noodles, garlic stir fry chicken, pot stickers/dumplings and all were top notch super yum.  Will be going back again and again.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-08-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xShK2aG0m3s9ByPXhVIPvw', 'review_id': 'n9IVE7CBHxiWYFVNJ-9Khw', 'text': 'The service was great and the food had that freshly prepared quality.  We loved our dinner. The meat was lean and tender and all the sauces were superb.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2015-08-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'U2v-B_EMlL_--gdkq8P2VA', 'review_id': 'TSF5Y1HacOlTq1Rwgw_FxA', 'text': u"C'est un tr\xe8s bon restaurant tha\xef  avec des serveurs tr\xe8s aimables\nJe vous conseille d'y aller", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-08-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bpcLevmR4L0hfhVSOtriXw', 'review_id': 'IODwV5WVFvRdjaQHT4z6Eg', 'text': "Best Thai experience that I've had in phoenix/in awhile. Wonderful staff, very inviting. Good was amazing! Can't wait to come back! \n\nRecommendations: drunkin noodle dish and the egg rolls!", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-08-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'NopyXj4o5FfGsioMNvCMqw', 'review_id': 'HBVlrXLYr_4lKeKB5wfIYg', 'text': 'One of the best Thai food restaurants in Phoenix.  If you are downtown do not miss it.  \n\nThey recently upgraded the interior so the ambiance is nice.  \n\nIf you were a fan of pink pepper in the north valley then you will love this place.  This is the same owners of the original, before it went downhill.  \n\nFried rice is excellent, crispy orange chicken is perfect. \n\nWe bring the family and are trying to work through the menu!!!', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-08-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pNxzP47yVRPH0qwO4sSbAw', 'review_id': '2WUI-EXPhb_4S5nfrwwTHg', 'text': "On a Monday, I decided to catch up with an old friend from my law enforcement career at San E-Thai (616 West Indian School Road, Phoenix, AZ 85013), one of my favorite inner-city hangouts. We met for lunch and shared the lemongrass soup with shrimp, papaya salad with shrimp, shrimp salad and a side of white rice. This healthy meal featured large, juicy prawns and fresh vegetables. The flavors illuminated my palate and worked quite well together. We ended the delicious meal with an order of the establishment's signature, coconut ice cream. The service was excellent and included a visit to our table by the owner. The facilities were exceptionally clean, and parking was readily available.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-08-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IVp0D6iHiIW9CGHkSO3mmg', 'review_id': 'A9zBmravvsMkMqXnLI2ojg', 'text': 'Love this place!  Friendly service and delicious food!!!', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-08-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1g8Crb6WGQUsA2l2X3yVGA', 'review_id': 'TBccKEhz3IYpVchmBsyE6g', 'text': "Authentic Thai! The spices are beautiful infused in every dish! Per my husband who is a self proclaimed connoisseur of Pad Thai, it's the best in the valley.  Fabulous!!! Great service!!!! Everybody who works for Piu is sooo happy", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-08-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0_4fT6Pb9JPzjZVklxGqCg', 'review_id': '-GyzB_pH3fQwh7aFyHsJrw', 'text': 'The food is fantastic. Service is excellent.  Very reasonable price.  Highly highly recommend this restaurant.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-08-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bA9spuq4PaFpC9pHdrdG-A', 'review_id': 'qwqgeQUWlmP4tCwUx8uilA', 'text': 'I am quite fond of the decor, and chu chee duck. Especially with eggplant. And all the staff are lovely people!', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-09-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Dpwk2HJIwjQ-Hrs5ulshSA', 'review_id': '42494BKQ-sbA1p5c2PurIA', 'text': 'We were at the Thai E-San recently as our friends had recommended it. The food was less than luke warm, like it was sitting in the kitchen and quickly put together. The restaurant was not even closing for another hour, so that was not an excuse. I am not in the habit of complaining, as the food should at least be hot when it arrives at the table. It was not as flavourful either. Very, very disappointed. I would not recommend it to anybody.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 2, 'date': '2015-09-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0_4fT6Pb9JPzjZVklxGqCg', 'review_id': 'oJJba6ECEe_9GY1xCiXCyw', 'text': "I'm back again\nAddicted\n\nThe food is great can't believe you have been open for five years and I didn't know..... lots more on the menu to try\n\nLove the yellow royal curry and thai toast\n\nSoup is best in country tom yum phenomenal", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-09-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'oZZrYKKDqabcSg1HMpl0IA', 'review_id': 'TdFVxZ67hyBjtyW55WyfHw', 'text': 'One of the best Thai food i had till date. All the spices were just perfect.\nAwesome hospitality by staff, especially by the lady at the front desk:)\nHighly recommended if you are in Phoenix.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-09-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'E3RGY08u0-pjCyC5iL1k1g', 'review_id': 'xqLXbLEZyyNPvFxkpjTUcw', 'text': "I absolutely love their garlic chicken and the servers and hosts that I have encountered have been super friendly. When I ordered carryout food it was packed, hot, and ready to go at the front. I just recently discovered this gem and I see myself being a regular from here on out. Over the past two weeks I think I've been there three times already. Can't wait to for my next visit.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-09-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'EesuZ2YaBYcMMzsGapoH_w', 'review_id': 'pdNDQAMJ92sRVl2KD2Fq6A', 'text': 'I love this place! Some of the best Thai food in Phoenix!  The owners are wonderful and extremely friendly and hilarious!  I always have an amazing experience!', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-09-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jDug_QhSmC0EQ1-cyEYx8g', 'review_id': '-d8sncnvUQTK_nLVh1_qEQ', 'text': "Have yet to find really good thai food in Phoenix area. Can anybody help??? Super friendly people otherwise I'd probably give two stars. Bbq chicken was sketch and drunken noodle was uninspired.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 3, 'date': '2015-09-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LjYWfkgH2pd0AL8eYtcqpA', 'review_id': 'CPkLl57xm10SBMpzdAuqYw', 'text': "Best Thai Food I've ever had. Incredible variety (can add squid to a lot of the dishes), and some regionally specific dishes that I've never seen before. \n\nThe owner came over and talked to me while I was picking up my order. She was super nice and really appreciative of her customers. Can't ask for more than what I got at Thai E-San.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-09-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rRwQbHmuaNUxbvO_y732Yg', 'review_id': 'J88JLtv_dd0jz0WHVWmLSw', 'text': 'Best Thai food in Arizona. The service can be a little variable, but the kindness of the staff and quality of food more than make up for it.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2015-10-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'Nc_pk1nvqOSW_Cmo5h_HVA', 'review_id': 'rRGrng1bajFqXsFZ2pwWeQ', 'text': 'Very awesome Thai! The restaurant is super clean, decorated tastefully, there were fresh flowers on the table which is not a must but very nice and inviting to see. \nThe staff was super friendly and helpful making sure drinks were always filled and we had enough rice.\nThe portions were generous, I had the duck curry and ended up taking half home because I was so full. They do a 1-5 scale, I choose 2, which was a perfect between mild and medium. \nIf you are in the area and craving Thai, you definitely need to go in!!!!!', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-10-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PxwZMqjLvesUIUZmXWmmHA', 'review_id': '9wNXmJpg__LOhu4M9Di2Hg', 'text': "I ordered Royal Curry with beef and Viet Egg Rolls to go. \n\nFirst impression was that the restaurant appears to be in okay condition.  The person at the counter was focusing on handling other tickets and was not friendly at all. It also looks like the prices were higher than the menu listed on Yelp from another user.\n\nNow to the food: The egg rolls were delicious, a little greasy but had a great taste.  The curry was just okay, the rice was hard and tasted under-cooked. The beef and flavor of the curry were both decent but not great. \n\nI don't plan on returning to this restaurant, I would rather go to Wild Thaiger.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 3, 'date': '2015-11-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'i94JgBKT4T7pGco7W1S0OA', 'review_id': 'PsfvDndwQrCny5vZvvgzzg', 'text': "Not to knock the lunch special (cheap, tasty, generous portion size), but the dinner menu is even better!\n\nWe had the Thai coconut soup with shrimp. The broth was spicy and rich and flavorful with lots of mushrooms. The six shrimp were large, plump and juicy. Too many restaurants overcook these little guys, but not Thai E-San. Word to the wise:  order a couple of sides of rice to add to the soup. That's the way the natives do it. And the rice soaks up all the goodness of the broth. \n\nWe also had the chicken larb. It was quite tasty, the chicken just cooked so it was juicy and flavorful. The dressing was minty and spicy. Wow, just, wow.\n\nBetween the soup and larb (I think it's on the salad listing), we had a full meal and left quite happy.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-11-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KIfugpN9JeJ80MQWvGPyAg', 'review_id': 'lpIuuhIqg3hlZl8qoeXlvQ', 'text': "Wonderful neighborhood Thai restaurant! We discovered it months ago & come back every time we're in Phoenix.\n\nLike:\nPad Thai\nSilver Noodle Soup\nPineapple Fried Rice\nThai Iced Tea\nService - server & owner kind & attentive! Come over & chat with customers\n\nWish:\nThey opened in Riverside Ca!", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-11-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yOW_07olC5HaDlrzpEKECw', 'review_id': 'j-yUElEJUXr-eeDgOzfa6g', 'text': 'Great portion sizes for the money. Every dish has been fantastic, though I am especially fond of the coconut soup. The restaurant is always quiet, clean, and the staff is always very welcoming.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-11-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'THYIqfnLV54VZ_v2hCfq2Q', 'review_id': '_lRV4ze-3IlX2lfxi_CzAQ', 'text': "I'm really picky when it comes to Thai Food.  Place is nice, clean, pretty no nonsense.  Staff is friendly.  We ordered the appetizer sampler.   I was not really impressed.  The fish cakes were flavorless and not a cake at all, it looked like it was poured in a mold.  Crab puffs/rangoons didn't have anything inside.  The chicken was not bad.  I had the chicken with cashew nuts.  It was good, but reminded me more of Thai Basil.  It was my friends favorite place so he wanted me to experience it.  I would come again but only for the lunch specials.  Not a date night place.  My favorite Red Thai has yet to be beaten.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 3, 'date': '2015-11-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 1}, 'user_id': '2AbBZM7n9EMwa0nK1yl0CA', 'review_id': 'wPuQagfP6Oh_G0mupA0K_Q', 'text': 'One of my friends chose this place and it was great! Excellent service, atmosphere and the prices were reasonable. The food was delicious and the restaurant was clean. I will be back!\n\nA solid 5 stars!', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-11-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'zkdZYm_qztodwsCRSyy_bA', 'review_id': '1phUqnOaKLZJQrWw23sO1w', 'text': "The only regret I have is not snapping a pic of the amazing dishes and beautiful restaurant. The staff is always attentive and the food is to die for. It's always made fresh and the ingredients look fresh as well. Every meal I've tried has been delicious.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-11-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-BQFGG_hrORLkEs8oigCjg', 'review_id': '2gMe0CDawOBCawjmEamTww', 'text': "One of my favorite Thai restaurants in Phoenix, I love the red curry with pineapple and the drunken noodle.  The service is always friendly and the food arrives promptly and tasty.  It's a great neighborhood place that will make a regular out of you", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-11-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'm3WdIs7FPmMek8733s4GJQ', 'review_id': 'yta-nngudR3i78VR1dF-yg', 'text': 'The curries I enjoyed, but the thom yum soup lacked depth and authentic fish/shrimp stock. Portions are a good size. Thumbs up on that! Overall really good, I was just disappointed with the thom yum. It tasted really just like a very plain hot and sour soup. Thai Basil is still my favorite!', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 3, 'date': '2015-12-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kStqYsGRvGKZd0S1M2wODg', 'review_id': 'HEBWZNHUnCcC9CsbRXtXKA', 'text': "Came here for lunch with my family. Staff is very friendly and even let us in 10 minutes early. Food is excellent, I had the spicy noodle with shrimp and it was delicious! Will definitely come back when I'm in the area.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-12-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'iwzaxgAPuYIOeJt2askQqg', 'review_id': 'lF2B539rxFuXaIpho6QEEg', 'text': 'Enjoyed lunch, the waiter was hilarious. We had a group of 9. We all ordered a variety of foods. I ordered a dish that was similar to Drunken Noodles. it was good, but I feel the food could have been warmer. The chicken satay was very flavorful. We ordered a hot pot that was really spicy. Overall the restaurant was clean and had good lighting.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 4, 'date': '2015-12-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'gqGEoX6ECqtjCoPicf0JAQ', 'review_id': 'oDco7_UwC3d--IxzY9Wfmw', 'text': 'We had the sampler appetizers to start with which was excellent.  Then we ordered the Thai Baroque chicken  and the Crispy spicy chicken sauce. All the food was awesome. Cozy little place. I will definitely visit this place again.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-12-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': '38D89nAgQ87Ag3wGOyXGbA', 'review_id': 'DQYBFpOY0Zjel6Bm8pKsrQ', 'text': "Great thai food in a strange part of Phoenix. Saw it was highly rated on Yelp and thought I would give it a try. All that was said on Yelp was true ambiance was cute and very festive for the holidays, food was served quickly and was great. Prices were very reasonable. If I'm back in town I will definitely be revisiting this fine Thai joint.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-12-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WFVf4psVH_REbu7BVi0qxQ', 'review_id': 'Xx07AKVs0Dxtzp_M6EtMmQ', 'text': "So yummy. My wife had the yellow curry; I had the spicy noodles with basil and chicken. I probably went a little too hot with a 4, but I still really enjoyed it. If you decide something needs more heat, they have the sauces and spices at the table so go lower if you aren't sure!\n\nThe unsweet tea is the delicious Thai version: no sweetener needed.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-12-15', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'm7vtKWpZ9wdEQ95wJxrMrg', 'review_id': '3RYeO4ngefaCy8rlA_yd0A', 'text': "Excellent food, very reasonable prices, convenient location in the Melrose district near the central corridor, and a pleasant and friendly staff makes this my favorite ethnic restaurant in central Phoenix. Even though it's not a huge restaurant, there is enough space for group gatherings. They also have the best Thai red curry sauce I've had anywhere. And, of course, free WiFi is always a plus.", 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-12-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fGTdCgq6k-YRgeS8mvEfAw', 'review_id': '5MiEHu8tbmGsR-BMYXJrXQ', 'text': 'Had the curry which had a good flavor. Also had the steamed vegetables with chicken which was a welcomed taste. The white rice was a great add on and they gave you a good amount to combine with meal. Did Thai level 4 and was mild to some others I have had but the taste was good.', 'business_id': 'VbXy3tH5RAu7HjT7VeMMgA', 'stars': 5, 'date': '2015-12-23', 'type': 'review'}
