{'votes': {'funny': 0, 'useful': 4, 'cool': 1}, 'user_id': 'lC4X2crUuxT9Ac9BlOX4Uw', 'review_id': 'yx0ApwvhX6nSZ2b_RbEM2g', 'text': "Generous portions and seriously good food at cheap prices. Although I'm no expert, I hear the food is remarkably authentic, with Japanese, Chinese and Korean influences. I especially like the Hawaiin chicken rice and pork laulau. Oh, and don't forget the mayo-macaroni salad served with every order. All this culture in a strip mall at the crossroads of Tempe, Chandler & Mesa. Aloha!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2007-02-23', 'type': 'review'}
{'votes': {'funny': 5, 'useful': 3, 'cool': 6}, 'user_id': 'FZXXSGOw4BBWmB7eyAGSnw', 'review_id': 'YiWDOUPvp9BB6sGTylB4yg', 'text': 'I was to have a lunch meeting here, but it took me a while to find this place.  Why?\n- I\'m still a moron while navigating Arizona streets, and I get confused with "N"orth and "S"outh addresses.\n- I ALSO found out that the numbering and directions change depending on the city.  As I was travelling North on Alma School in Chandler, I then turned around after a while because I saw I wanted a "South" address.\n\nAfter much confusion, I finally found the bland, yet clean restaurant in the mini-mall BEHIND Safeway, and had a good meeting.  After the meeting broke, I ordered a bulkogi and chicken combo, and the owner, Ray, sat down to chat with me.  We talked about how we both missed Oakland Chinatown and complained about the Arizona heat.  He told me about how he moved to Arizona some 30 years ago with his wife (who is from Hawaii), and how they started this restaurant a good 20 odd years ago, before the plate lunch fad hit the mainland.\n\nAnd he told me that weekends are a good time to come, so he can set me up with a new girlfriend.  Work your magic, Ray!', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2007-10-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 3}, 'user_id': 'vF4B6eFdoDmyV_l7MLHMzw', 'review_id': 'UiQcNt6VjgfikZnlbyClZw', 'text': "The food is AWESOME!! I looooove the Manapua and the Bulkogi or however it's spelled. It's the best!! the mac-potato salad is worth the trip alone!! I'm so glad my friend made me try it because I always go back when I'm on that side of town!! OH! and the fried wonton appetizers are the best too!! I love the sauce it comes with!! ALOHA!! :D", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2008-01-22', 'type': 'review'}
{'votes': {'funny': 8, 'useful': 4, 'cool': 3}, 'user_id': 'IMsUuPGFQoNMeZzbhqtiCw', 'review_id': 'XpqCuHIaV8aKgiuz9R4o1Q', 'text': "Ho, brah...heard dis place was da kine, went here wikiwiki at pau hana time....Finding ono grinds in Arizona is tough, yeah. Evens do, Arizona has choke local people. Whadda gives, you say brah? Do local people stop liking Hawai'ian food when dey come to da mainland? Ho don't look at me, brah, I'll nevah forget my first time grinding at Rainbows, washing down my plate lunch with a slush float...but anywayz....\n\nAloha Kitchen ain't Rainbows brah. It hints at da Islands with a linoleum floor and basic tables and chairs. (Dis assumes brah you come on a day other than Mondays, when da Kitchen is pau.) But as you walk around don't expect to see like shave ice, or spam musubi, or some guy with a wet okole.  Still, it's casual and relaxed and usually not loud n crazy.\n\nNot that I know fo sure brah. I always get da kalbi to go, and don't stick around der long. So you says to youzeself, brah, dis fella order one thing on da menu and he's gonna tell me how dis place broke da mouth? Brah, fo reals. Da proof is in da mac salad, scoops of rice, youze name it. Go to a chain like L&L or Ono....you see what I mean, bumbye. \n\nAloha Kitchen is strictly a counter place. Da grinds may come with a touch of ohana...but don't expect anyone to serve you. You order, you pay, an den you grind brah, An wen you done, you talk story until you're pau. Still, da girl at da counter is choke friendly, and never rude.\n\nWhuzzat youze say? Doesn't everything in Hawai'i cost more? Especially grinds? Fo sure brah...a trip to a supermarket in Hawaii can give you chicken skin. Good news is brah, da Kitchen won't do that. As of yet, nothing is over $10...but den again, is it gonna stay dat wayz fo evahs? No ways, brah, no ways. \n\nS if it is take out you crave, and you don't feel like Subwayz, or Mickey D's, den take youze opu to Aloha Kitchen, You'll be hundred of miles away from da beach, or waterfalls, or an ABC Store...But...you'll be full...an not just of aloha brah.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2008-06-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 4, 'cool': 2}, 'user_id': 'RLrzO8HyZ5EwDj2NZVGuzA', 'review_id': 'gGLM2z8znZnUpn3Osqa84w', 'text': "You might be in a mom & pop joint when there are employees under the age of 16.  I think one of the girls was like 13.  These guys know how to do business!  They are very friendly and when we had a problem with getting our order they gave me my money back without me complaining.  That made me want to go back before I even ate.  I got the mix plate 4 - Teriyaki Chicken and Katsu combination.  I liked the Teriyaki more.  I'd choose this place over Moki's, but I haven't tried any other Hawaiian places yet.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2008-07-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'JVeCUlDmcwJ3pteEdmzeHg', 'review_id': 'aDi9Y28mdxKInKBVVuJaYw', 'text': "Can you say, 'Plate Lunch'? \nThis place is pretty close to alot of the small family-owned shops in hawaii and they even have Spam Musubi and Haupia!!!....for those familiar with the 'ono-licious grinds' of the islands....I would suggest the kalbi ribs which are always my fav!!!!\nThis was a flash-back for me!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2008-09-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'Wy7f9DOuBEOenhnA7KIKoQ', 'review_id': 'eLwjvd8qbwftW3ELh7Eeiw', 'text': "Super Yum!  We were on our way to a lecture on Art Appraising and I wanted Hawaiian food, so I looked up a place near where we were going and found Aloha Kitchen. \n\nGary had been there numerous times before and said it sounded it good to him, so we went!\n\nWe shared won tons, and ordered chicken teriyaki and bulgoki and had 2 pineapple orange juices. \n\nEverything was really super yummy!  Our dishes also came with macaroni-potato salad which was delish! \n\nAND!  They have a recycling bin for the juice cans! yay!  I'd definitely hit this place up again if I were in the area.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2008-10-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '4JapGtmN58pZYo1ClbV8qw', 'review_id': 'YdUVwFHLgmG2fADYmWga5g', 'text': 'YUM. Seriously YUM. Thanks to Brandi L for introducing me to this fabulous strip mall find.The potato-macaroni salad alone is worth the trip to this spot. I adore the bulkogi but really, everything I have had here is very good. Stop by if you are ever in the area. In fact... I think I might do a pick up today!', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2009-01-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pFjyh-DmvUdjyQmsOf04jw', 'review_id': 'qMV5T-98YhZDhzmGzhz5XA', 'text': "I greatly enjoy their chicken Katsu and Bulgogi mix plate.  And their manapua is great as well (I always order two and give one away to whomever's with me).  I've been several times over the last year and have yet to be disappointed.  \n\nOne late Wednesday night we walked in on the surreal scene of ukulele lessons.  There was a veritable sea of ukelele enthusiasts from the Mesa area filling the left half of the restaurant, and between instruction some nice live music.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2009-02-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'cAz5WuhJ6rJEXphpwicyXg', 'review_id': 'ZYs9OHra6KDwYcAD9m2poQ', 'text': 'Believe it or not I heard about this place while I was in Honolulu! No kidding. I met the owners sister while working temporarily in Hawaii over the holidays. When the woman I was speaking to found out I was from Mesa she asked me if I\'d heard of Aloha Kitchen. I had not...which is weird as I only live about a mile from the place! But it\'s hidden behind Nello\'s so I\'d never noticed it before.\n\nSoooo...we finally went tonight. Super Ono! We tried the Bulkogi...so flavorful...slightly difficult to cut on the plate but so goood. The teriyaki chicken is so moist and tender...and the char from the grill just adds to the flavor experience. The Katsu was very well done. I\'ve had Katsu at some places that was so over cooked you could re-do the bottom of your shoes with it. This Katsu was very well done. \nMy one Step-daughter had the Won ton Saimin...she loved it. She couldn\'t believe someone would serve a bowl of soup so large. She wondered was it for all of us or just for her!?! \nWe ordered one Manapua after I explained to my husband what it was. He\'d never heard of it before. I of course had some when I was in Hawaii. After he saw one come out of the kitchen he had to try it. I just wish they had some with other fillings.\n\nEven though we had more than enough to eat we tried some pie. Oh my...what a treat. So so ono! Hubby had the Coconut Macadamia and I had the Chocolate Haupia...Unbelievable flavor.\n\nOur only comment would be...keep the food the way it is but put some character in the decor. We\'ll probably get the food to go in the future as the restaurant it self is blah looking. The Hawaiian magazines to browse are cool...as are the other things on the counter...but the tables and the ho-hum look to the walls don\'t make me want to "be there" or draw me in. It needs a warmer more Aloha look.\n\nBut all in all...Mahalo to the sister for letting me in on a place I had in my own back yard...Man I had to go to Hawaii to find out about it. Go figure!', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2009-02-27', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'ODW4e78LfvY5Ch4s1kzzjw', 'review_id': 'Q52zkjlECnuOnhtcARLWGQ', 'text': 'Best Hawaiian in town, this place was a staple for me in the college years.  I could live off the manapua.  The humble decor leaves you in for an even better surprise when you taste the food.  Had a friend that lived in Hawaii for several years and he said the food here was just like home.  They have music on some days and advertise cultural events happening in the valley.  Fun, cheap, good eats.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2009-03-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 2}, 'user_id': 'PMCp0FxxxC3PLi4BBgKf2g', 'review_id': 'U26l2x0uWeAa1-7DqTHQ0w', 'text': 'When you have lived in Hawaii, when you have experienced and understand the Aloha spirit and all that it contains you also will understand that food is important to the culture.   I can tell you stories about trips planned to infamous restaurants and eateries all over the islands based on lengthy conversations with many who live there.  Yes, good food is appreciated by the island folks.....so lets transition to Arizona where you can still find some folks from the islands.  As was the case there, the conversation quickly turns to great places to eat, and where to find that great island style food that we grew to love.  I was so excited to find that this place was good, and super close to where we live.  We have been there often since.  We have even used them to cater our oldest sons Hawaiian stlye Bday party last year.   Food is great, local style.   Just what the Dr. ordered.   A bit of Aloha in Arizona, cant get better than that.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2009-04-11', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '25QJFdXmXGSvRhU8m33_Iw', 'review_id': 'ySWqVX-cwwQ_8eBFUo9b0Q', 'text': 'Ive been going here for 15 years and still love it. Its one of my top 3 lunch places. Personally, I think this ranks up there with "plate lunch" style food you find in Maui.\n\nMake sure you try the Manapua - it\'s a meat-filled bun.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2009-07-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'pKzxhw0dvjR-kxz6-x16ew', 'review_id': 'gDv0A8aDyGz_87dHb0M3hA', 'text': "Being from Hawaii, I've been looking for a good plate lunch place in Arizona.  I FINALLY FOUND IT!  Aloha Kitchen gets an A+.  The owner, Ray, is a really cool relaxed dude and all the aunties in the back are from Hawaii.\n\nVery authentic Hawaiian style food.  All the classics from the islands within a 10 minute drive from my apartment!  Can't wait to go back!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2009-07-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6Z638tiXuMXpp1OvsIVl1A', 'review_id': '7tW4-aIJsVAXh_sFIhl2zw', 'text': 'I have been eating @ Aloha Kitchen since it opened. I worked right next door at Nello\'s. I was very excited when Ray opened his doors. I could only hope the food was as good as I remember when I lived in on the Islands, and it was. \n\nI have been going here ever since. Especially since they offer Manapua. You have to try it. (Steamed buns, stuffed with pork)\n\nMost other Hawaiian food places don\'t offer them and if you ever lived in Hawaii, particularly Oahu, you know what Manapua are and know what they should taste like. \n\nThe only thing I wish they had added to the menu, over all these years is "Pork Hash", Mmmmm I miss those.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2009-08-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'GyFmGA5UQZ4pXdx1lUH86g', 'review_id': 'ALIaTbRw2NNsP-8jlZEMnw', 'text': "i love this place. the beef skewers are awesome, the mix plates are awesome, everything is awesome. seriously, awesome. mini plates will fill your tummy, the regular sized ones are great for having leftovers for breakfast. the wednesday/saturday kalua pig should not be missed. and the chicken long rice ... oh my god. the chicken long rice. this is the only place in town i've found it, and i love it.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2009-09-18', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 3}, 'user_id': 'UPtysDF6cUDUxq2KY-6Dcg', 'review_id': 'S7C-cVn0DcgJG2_FEyOFBA', 'text': "Jam packed well after lunch hours. Full of mostly locals - Hawaiian locals that is. (That right there should tell you something.) I have not had island food this good since I left the islands.  I am serious - there is a place in Orem Utah called Matiki's and it was #1 on my list until this place.  SOOOOO freaking glad I found this place.  it will be the ONLY Hawaiian joint I hit up from now on!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2009-10-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'd9Lsgkamf02Gvu8V0ZXXKg', 'review_id': 'M3HyU2rx2Ola7otaPTebeQ', 'text': "If you didn't know better, you might think you're in the islands.  The food is fantastic, the staff are very nice, and the portions are right on.  2 scoops of rice, pasta-mac salad and a pound of meat.  Much mahalo!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2009-10-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LJPvRgTZWHlwpaYBauOOkw', 'review_id': 'dxXCzzobAXTS3XAazirJcQ', 'text': "had the bulkogi mini plate. very cheap at $5, but it's not really bulkogi - more like a thin steak with very sweet barbecue sauce - and the rice was too sticky. the lone bright spot of the meal was probably the potato-mac salad.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 2, 'date': '2009-11-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cdDVlatq0NxUNfnBLSwjCg', 'review_id': 'oPNVrt1rtpex3FeVKMMZAg', 'text': 'Fall in love with the food everytime I eat here!', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 3, 'date': '2010-01-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FL1xj5qKFZkU5GXVBj5TUA', 'review_id': 'xroIDbrc_5b59cyS3kKPZQ', 'text': "I love Hawaiian food and only found this place thanks to Yelp.  I have driven by hundreds of times and didn't know it was there.  \n\nThe service was awesome, I asked for a little help and the wonderful lady behind the counter offered tons of advice.  She was incredibly passionate about the food and raved that they had the best food around.  I instantly loved the place and I hadn't even taken a bite yet...\n\nI ordered the Bulkogi thanks to the yelpers reviews and they were right!  The fresh grilled taste and perfect korean bbq marinade put this over the top!  Also their mac-potato salad was amazing with hot sauce!  My wife ordered the laulau pork place and the lady was right, this was some of the best I'd ever had.  One suggestion:  ask for terriyaki sauce or something to go with the pork.  Though it was perfectly cooked and seasoned, it needed something to put it over the top.  \n\nI'm going back to try the short ribs ASAP!  Check this place out!  A gem!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2010-01-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'OMC3DRyGrDbq-oMtdRAH8Q', 'review_id': 'hURAivfzrb0rNlolxBkkwg', 'text': "I went here towards the end of the lunch hour push and it was still quite busy.  The line wasn't long, but most of the tables were full which is a good sign.  It is in a tricky parking lot, be prepared to pass it and whip a U-turn.  \n\nEverything seems to be cooked up nice and fresh so it took a few minutes to get our dish.  Upon arrival, I received a plate overflowing with food.  I got the Beef Bulgoki and Pork Katsu (sp?) combo plate.  I have had both of those meats at a Korean place (Cho Dang) so I assume that is the influence on these particular meats.  Both were very good.  A tiny bittle too gristly on the bulgoki, but it was easily cut off and the flavor was good enough to make it not worry. \n\n I chose my side to be maccaroni potato salad.  Yes, both combined into one which sounds a little sacrilegious but it was recommend by the woman taking my order.  It was actually very good.  The entire meal was very good and even someone with a healthy appetite like me was unable to even come close to finishing.  They pile the meat on top of 2 giant scoops of rice so it is definitely healthy portioning at this joint.\n\nCompared to the awful food I had at Paradise Hawaiian BBQ in Tempe, this place is at a different level.  I actually got more food, fresher food, and tastier food for less money.  \n\nThe place was clean and the staff was friendly.  I look forward to going back to work my way through the menu.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2010-01-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'KucBnMrhalzxnD9AWrxwYQ', 'review_id': 'jViGKX18Eg1iGUZ5SDSGUA', 'text': "Food is fairly authentic island food... it is OK, nothing fantastic. Then again, not much island food is 'fantastic' anyway.\n\nIf you love island food, go here. If not, you are not missing anything.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 3, 'date': '2010-02-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'gv_Cviz-zs2rn8R1kyOkjA', 'review_id': 'WCWw4rBEQ4wgUKzi7B7Xow', 'text': "...and the Five stars are not only because we've known the owners, Ray and Lynn for 20 years...as well as grinding there for just as long.  The food is always island style...which means broke da mouth, bruddahs and sistahs.  And Aloha Kitchen is always the busiest food kiosk at the Annual March Arizona Aloha Festival, for the past 8-10 years I can recall.  (The Aloha Festival is now held at Tempe Town Lake.)  So if you cannot get out to Mesa to check 'em out there, you can stand in line at the upcoming Aloha Festival...you won't be disappointed!  There have been many Hawaiian food establishments that have come into the valley since, Ray and Lynn opened over 20 years ago.   and, there are lots of good reasons (on their menu) why they are still serving ono-licious Hawaiian style food...its da sticky rice, brah....naw only keeding....Its da food!  Try 'em!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2010-02-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': 'QpojpZCkxbVWxUcwMWcmCg', 'review_id': 'E1p780tLX-ErcKJBFOdluQ', 'text': "A little slice of the Pacific Rim, caught under the broiling heat of the Arizona sun.\n\nIt's exactly as Island should be: Fast, fatty, surrounded by rice, and served in a styrofoam container with a side of macaroni salad.  This is food that you should be eating on a beach after spending a morning playing in the ocean.  I had to settle on eating it on my patio after working in my garden but the food tasted just as good.\n\nI rated it 5 stars, this is definitely food that deserves to be eaten.  But make no bones about it, if you hate island food, food from Korea, or macaroni salad.... this probably isn't going to change your mind.  It's comfort food for people who think flip-flops should be year round footwear.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2010-03-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XWGCBxSa_ZlDErwj6969Bw', 'review_id': 'ExqtL0ov8ErJfPdJx9EQCQ', 'text': 'Always good , the katsu chicken is great, they ran out of manapuas, bummer, eating some fried saimin noodles this time, best Hawaiian with out going to the islands.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2010-03-31', 'type': 'review'}
{'votes': {'funny': 7, 'useful': 9, 'cool': 9}, 'user_id': 'P2kVk4cIWyK4e4h14RhK-Q', 'review_id': 'Ees-jWu97XWyOZiqxNA9rQ', 'text': "You know that hole-in-the-wall Mexican/Chinese/Italian/Indian/Etc place you love that has pretty solid food and reasonable prices, the people are friendly and the decor is...hole-in-the-wall?\n\nWell, add Aloha Kitchen to the list as your hole-in-the-wall Hawaiian place.  The are friendly, relatively fast, priced for the beer budget and quite tasty indeed.\n\nLike a ripe pineapple ready to be eaten, Aloha Kitchen, um, Aloha Kitchen...I really have no idea where to go with the pineapple setup there.  The whole pineapple thing just seemed apropos to the Hawaiian theme and, oh well.\n\nTry it, you'll like it.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2010-04-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jv3OLWZotGJt3__ABfhBkg', 'review_id': '8iawL6BNy3jT_DHOrQY3Ew', 'text': "The food was great and the service was phenomenal! The food seems to be actually local as a very good portion of the patrons looked to be Polynesian. I had the Mix Plate #4 Bulkogi and Teriyaki Chicken combination and we also had some of the Manapua (Char Sui Bao) balls...can't wait to go back!!!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2010-04-12', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'nbofxFWHORebBHh10OgYLA', 'review_id': 'kHVn_qjHqgopqoul_doPWA', 'text': "Third time here in the past three weeks if that says something :)\nBig big fan of their Teriyaki Chicken, Bulkogi Beef, Shredded Pork (Lualua, I believe) and Katsu Chicken... Compared to L&L this place kicks some MAJOR ass... I dream of their macaroni/potato salad.. I cry for it in my sleep! :) lol! :D  my only issue is that they don't seem to offer free refills.. I could be wrong however. \nAn absolute MUST try if you like hawaiian, or korean style food.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2010-05-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bYdUMQluPbp_zbIs_RLYDQ', 'review_id': 'ao5eMSyc_SyXDJUCYlVNHQ', 'text': "I actually really like this place but at the same time I do have my issues with it. Fisrt of all, let me say that the manapua is to die for. Beyond that the menu is fairly standard Hawaiian. The saimin lacks flavor, the katsu is a little bland, the macpot is macpot.\n\nI will keep going back for the manapua (it's like crack), but I may just skip the rest of the menu", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 3, 'date': '2010-05-13', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 4, 'cool': 3}, 'user_id': 'TQ5eVGOFr_qB5_BbEd3Sow', 'review_id': 'gSTL5WA6nBTg9wqvTe73kA', 'text': "Yup, found it on Yelp.  And it wasn't very far from where my daughter whom I 'm visiting lives, so it only took me a couple of days to get here.  She came with me.  I got the Korean bol-go-ki- barbeque which tasted wonderful.  It came with a potato/macaroni salad and a scoop of white rice. I enjoyed all and had some leftovers to save for dinner.  My skeptical daughter (not the adventurous one of my three) just got a scoop of the mac and potato mixture.  She wasn't real keen on it and said she'd rather have them separate.  I also ordered one of the Manapua rolls. It was okay, but not as wonderful as the reviews.  I don't think there was anything wrong with it, just not my thang I guess.\n\nThe owner couldn't have been any nicer and I'm sorry I didn't know about this place (or Yelp at that point) when I was in Chandler for 9 months in 2007.  I'm collecting too many favorites to come to when I'm in town!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2010-06-22', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 3}, 'user_id': 'ODhV53XhesCBLJVfGsJGNA', 'review_id': 'iAkHtK8Z9MHFbw10gjihjQ', 'text': "So the boyfriend and I have been busy with moving into our own place in the area and today, we decided we'll stop by the Aloha Kitchen for dinner.\n\nFirst of all, we're not exactly new to AK.  We always grab lunch at their stand during the Aloha Festival.  With that said, this was our first time actually going into the restaurant.\n\nMy boyfriend got a combination plate of bulgogi and chicken katsu while I had the kalbi [short rib] plate.  For a $19 meal, I wasn't expecting too much --- maybe the same expectation as other Hawaiian eateries this valley is blessed to have.\n\nAnd I was wrong.  The portions are a bit smaller, the meat was a little dryer for the boyfriends plate, and everything was mediocre.  I must say though that my short ribs were delicious!  \n\nOverall, it wasn't that bad but it definitely doesn't taste like their booth at the Aloha Festival!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 3, 'date': '2010-07-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'WcnFWEVx9HO4eplGqvvr1w', 'review_id': '9EpwN-kQ7XKfUtMRj9HjtA', 'text': "Are you hungry and in need of a hearty meal at a fair price?\n\nThen Aloha Kitchen is the place you want to go.\n\nI've been coming here for years, and my family and I absolutely LOVE Aloha Kitchen.  This is a place that my kids always want to go.\n\nWhen I come here, I usually order one of these three dishes:\n\nChicken Katsu & Teriyaki Chicken Combo with white rice and the green salad.\n\nor\n\nThe J.R. Special\n\nor\n\nWonton Saimin Soup with a side of hot mustard to add another dimension to the broth.\n\n\nOnce in a blue moon, I'll order the Chinese Chicken Salad.  This thing is huge! (That's what she said.)  It's a bowl of salad of epic proportions.  It's also delicious.\n\nOther than the food, the prices are fair.  (Please pay with cash, so they can keep their costs low and pass on the savings to us.)\n\nThe staff is always, ALWAYS friendly.\n\nIf you are in the mood to hear live Hawaiian/Polynesian music, go there on one of their designated Wednesdays.\n\nDon't come on a Monday, since they are closed that day.\n\nSee you there.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2010-08-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'KSTOdz0lSFCkqBSRNwjERA', 'review_id': 'gBlCzFsUiCCJWTiegiTS8A', 'text': "My favorite and only place I will go for Hawaiian BBQ out here. Their teriyaki chicken is really good. The sauce is sweet and tasty. I also like their katsu. Nice, crispy and crunchy. Portions are big. I'm usually satisfied with a mini plate, which comes with: a meat of your choice, one scoop of rice and a salad (tossed green salad or potato mac). Their potato mac is really good. Sprinkle some black pepper on it and you're golden. Sometimes they have spam musubi at the counter. Yum. And also, they have hawaiian soft drinks in the little fridge by the counter. My fav is the lilikoi (passionfruit) regular or iced tea. The ladies here are super friendly.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2010-10-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '3TGup17SCV6uHsifmTKirg', 'review_id': 's4h-ztXMfbkkPyMUzs4IUA', 'text': "I heard about Aloha Kitchen from Yelp.  Apparently, they've been at this same location for around 24 years, wow!\n\nThe service was good.  The person who took my order helped me pick my entree since it was my first time there.\n\nI had the Bulkogi and Chicken Katsu combination for $7.95.  I wasn't overwhelmed by the quality of the food, but the flavor was nice and it was a good change of pace from the same old deli experience.  It was more than enough food for me, so I guess the price was right for the value.  Aloha Kitchen isn't going to become my new regular spot, but I'd go again.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 3, 'date': '2010-11-13', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'saiZmxzBIowJbMgPBW1Now', 'review_id': 'BbrIOfifTr6o6JTbkq1XrA', 'text': "Good, authentic Hawaiian food in the middle of the desert.  I enjoyed their Kalua Pig with Cabbage, Pork Laulau, Lomi Salmon, Chicken Long Rice and Manapua (steamed buns). This place has been around for years and there's a reason why.  \n\nThey should open another location in Phoenix -- preferably near 16th st. and Camelback.   ;)", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2010-11-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TQ5eVGOFr_qB5_BbEd3Sow', 'review_id': 'u4A8EEB4A8epTaCnsFyRAw', 'text': 'Mmmmm....everything I\'ve had here has been excellent!  My first visit I had the Korean Beef Bulgogi plate, small size for $5.  It was just as I remembered it from a place in Ocean Beach I used to go to, closed for years.  Instead of the usual mac salad, they serve a potato/mac mixture.  I liked it, my daughter didn\'t.  We tried one of the manapuas I heard people rave about but it wasn\'t my thang.  Probably an acquired taste so if you like them, I heard they were good here.  \n\nOther visits I\'ve had the salmon plate and the pork specials offered only on Wednesdays and Saturdays.  One time I had a shrimp plate that was the best one yet!  Yesterday it was the "Hawaiian Plate" with Kalua Pig and Cabbage, Lomi Salmon (like Ceviche with salmon), and the mac salad mix.  It was supposed to come with Chicken Long Rice but they were out of it so I just had white rice.  Everything was wonderful.  My daughter wasn\'t real hungry so she just got the 2 teriyaki beef stick side dish, $2.25, which I had a taste of.  Real good!  My plate was so big I took half home for leftovers.  \n\nI will keep coming back here!', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2010-12-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Pv7DGHzZ-uqIUdOsqPpsVg', 'review_id': 'X7sP_9nrOppecqKOr16X6Q', 'text': "I was jonesing for some plate lunch this weekend so I hopped on Yelp and saw Aloha Kitchen had good reviews. Yelpers, you did not let me down - this place is awesome!\n\nHidden away in a random strip mall is this gem of an eatery. It's an order at the counter and eat off styrofoam kinda joint. But the food far outshines any lack of ambiance. \n\nI ordered the mini chicken teriyaki and the boyfriend went for the mini chicken katsu. The mini comes with half the meat, one scoop of rice and one scoop of potato mac salad. And there isn't much mini about it. This was more than enough food. The chicken was super tender and the sauce was plentiful and tasty. The potato mac salad was a surprise, but a good one. I'm used to just mac salad but the addition of the potato kinda kicked it up a notch. I ate every last potato and mac!\n\nBoyfriend's katsu was fried to perfection and the sauce was served on the side. Bot of us left full and satisfied. \n\nNext time I want to go back on a Saturday so I can try the pork. If it's anywhere near as good as the chicken I'll be a happy island girl.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2010-12-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'hBOYJk_C7ymhVRMDMwyBDQ', 'review_id': 'qmqb0IhE7JSUcc5fmGJzTw', 'text': "We've been craving some authentic island food for weeks and knew Ono's Hawaiian BBQ would just not satisfy it! We ordered the Hawaiian Combo and Saimen and it was just like eating with the ohana!! The laulau, kalua pork, long rice-- all Ono!! Can't wait to go back to get another fix!!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2011-01-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uWr21MBjmfojZ4MFaVlong', 'review_id': 'FlyzBXddAxyLnLEi9MTumw', 'text': 'I spent 4 years in Hawaii, eating plate lunches and spam musubi almost every day. The chain hawaiian bbq places are ok, some are even good, but Aloha Kitchen takes the cake! It\'s one of the east side\'s best kept secrets. I went in on a busy saturday and ordered my staple: kalbi short ribs, all rice and a spam musubi. Both were fantastic! it reminded me of grabbing a plate lunch before heading to the beach. This place is tucked away in a random strip mall, next to a pizza joint, but it\'s worth the hunt and the drive. They have full size plates and mini plates, for those with smaller appetites. And, unlike the chain hawaiian places, they have REAL Hawaiian food: lomi lomi salmon, kahlua pig, manapua, stuff like that. This place gets a big thumbs up from me!\n\n\n\nHead to the east size for a real taste of the islands!\n\nOh, and on every 1st and 3rd saturday they have a Hawaiian music "store." A guy comes in with hundreds of old school and new music from every Hawaiian band/singer you can imagine! Hapa, Braddah Iz, Keali\'i Reichel, Sistah Robi, Na Leo Pilimehana, and tons more!', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2011-01-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'AeucYo8J-rZjcq09Wuqsjw', 'review_id': '1B1Gmi55knJbXAGR5E5GPg', 'text': 'effin delicious grub is what you will get here! Ridic amount of food ,without breaking the bank. Seriously. Got two large entree orders and three side apps to snack on all for $25, cannot beat that. You will have leftovers for sure! B/f had the Bulgogi and he loved it. I had the sweet and sour chicken, it was just as good. yummy.. no complaints at all, salad was good and their macaroni-potato salad was killer as well. The menu has Hawaiian, Korean, Chinese..all the food i cannot get enough of. We stopped in and ordered it to go, people working there and very friendly and we only had a short wait for the food. We will for sure be back, so glad i found this place...really is a hidden little treasure.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2011-02-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ihZ9UuuFI_UOySRqr3KFGg', 'review_id': 'DYFGLCSIft5nMivhEdwmEA', 'text': 'My wife and I went there a few times over the last month and every time one of us gets the chicken katsu.  We brought our in laws there and they liked it as well..given my wife and in laws lived in Hawaii and love this place speaks volumes.   Not too fancy and every time we have dined in, we noticed there seem to be a lot of locals/regulars...a good sign.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2011-02-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0beZngJ03EmIQfVcnlVK4w', 'review_id': 'k_jd6hNQQXSEIGGQp6zcOA', 'text': "The price was right, but I left still hungry..... Let me start by saying that if I was more into greasy/ fried food I would have loved it, but I'm not. I ordered the mini plate of chicken (not sure how to spell it) and there was still skin on it. Yuck! At closer inspection it was also loaded with fat. About half of my chick plate was fat. I didn't eat any of it. I did however eat off of my significant others plate. He ordered a #4. That was pretty good, but he also would not touch my chicken. The side salad was good and the little bbq buns were good. I won't be back because this style of food is not for me. However, if you have a hangover and need some grease to counteract the alcohol poisoning this is a place I would recommend.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 3, 'date': '2011-03-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1jjgnx45Q7KOR99Yp8i03g', 'review_id': 'XwpbmdLM5ID4-18uBkxWAA', 'text': 'I love, love, love the food at Aloha Kitchen.  My favorite dish is the Chicken Katsu.  No other restaurant in the valley makes this as delicious as they do.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2011-03-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'uZbTb-u-GVjTa2gtQfry5g', 'review_id': 'IepVuxdVb_rjkR5EUiC2LQ', 'text': 'Aloha!  Make yourselves at home at this cute little eatery serving a taste of the Hawaiian islands.  Dishes here are reasonably priced, with plate lunches that give you a lot of food for your dollar.  Wanting to try a variety of foods, I tried the Hawaiian plate.  The plate consisted of kalua pork with cabbage, clear noodles, and some lomi salmon.  The kalua pork was great, lots of flavor, slightly smokey, and not too salty.  The clear noodles were also very good in their savory marinade.  The lomi salmon was a bit salty for my tastes, but the salmon and other ingredients themselves tasted fresh.  All in all, a good place for a satisfying meal.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2011-05-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1gCUuM9Cowu71O2dz72RzQ', 'review_id': 'pRxwMtcQkPlRgoHg_dqnbw', 'text': 'Ok.so first visual impression was a regular drop joint hopefully with a good underlining" food".I got there mix plate#2 with beef and chicken katsu w rice and macaroni salad.the chicken tasted like boneless fried chicken cutlets w a side of Louisiana style bbq sauce" instead of katsu sauce,not good,the beef was borderline beef jerky, thinly sliced over sauced beef,some of it was tender,alot of burnt ends and grisly bites,with a copious amount of marinate.left a coating in my mouth,the rice was sticky and clumped apart,the macaroni salad wasn\'t bad but wasn\'t good,had to add pepper and there were chunks of russet patotos in it,that was first,and I really wanted the lau lau,but only on Saturdays.as well as kalua beef.I will go back to try the lau lau but not anytime soon.stay classy yelpers', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 2, 'date': '2011-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'K46kUag6aS0Vd4JjiaqNsQ', 'review_id': 'BJvQpCiQgjjPkzd01tIV6w', 'text': "Omg laulau. That really could be this whole post. It is one of the few things I miss from living in Hawaii. They only have it on saturdays, and call ahead to make sure they haven't run out. I had the platter, and ate the whole thing, which is not a good idea, because you will explode from being so full.\n\nThe atmosphere is pretty low key, and I absolutely LOVE that this is a real hawaiian place, not some asian fusion, we put a pineapple in it so its hawaiian wannabe place. \n\nOn top of the absolutely awesome laulau, they have hawaiian specialty take home stuff, I got a frozen bit of kulolo which I can't wait to steam and enjoy. They also have poi, but I've never gotten into the stuff. \n\nOh, and canned guava juice like I used to get in hawaii too, like biting into a real guava.\n\nI was in hawaiian heaven, a pleasant reminiscence of when I lived there.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2011-06-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 2}, 'user_id': 'nbofxFWHORebBHh10OgYLA', 'review_id': 'dw7MuzqlEvoGD5zHz7EAEA', 'text': "Aloha Kitchen is an endless source of incredibly awesome, well made delicious yum-foods! I've dined here countless times, and have tried all sorts of things from their surprisingly varied menu... When I was a carb whore, I used to go full hog on the Teriyaki Bulkogi Plate, and I'd ask for an extra side of the Macaroni Salad (it's SO GREAT), and savor each grain of their super sticky white rice.. Now that my diet has changed a great deal, I'm a bit more of a salad guy, and I'm thrilled to report that Aloha Kitchen has possibly the best salad I've ever had: The Chinese Chicken Salad.  It's huge, inexpensive, super fresh, tasty, and crispy. It features a truckload of Teriyaki Chicken, some fried noodle crunchies, slivered almonds, mandarin oranges, and a variety of really awesome leaves.  The dressing is exquisite too! I'm concentrating on the details of the salad, because it doesn't seem to get the attention it deserves in other reviews.. but as my love affair with salads grows deeper, and more serious, this may be the salad in which I judge all others against  Along with all of their other WOO HOO yay plates, if you're there while they've got Spam Masubi on the counter, GRAB IT. Or three.. I never knew SPAM could taste soooo amazing. Restaurants like Aloha Kitchen are a huge part of what I love about living in the Phoenix Area: Honest, amazing, affordable food that's served by independent establishments.\nOH AND: Their seafood anythings are also SO GREAT! They are also masters at the art of fried foods. Woot!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2011-07-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'S38N6O5wO9jekE4CwpVuLA', 'review_id': 'DZIdy0JIxxBe1i0RVR7Ggg', 'text': "Oh yea finally! I have heard about this place for quite some time, and finally made my way there. The food was FANTASTIC! I had manapua which was the best I've had since living in Hawaii. I also had the Bulkogi and Teriyaki Chicken combination plate with the potato mac salad. Excellent! \n\nThe atmosphere is low key and friendly and prices are reasonable. \n\nWhich is why I made my back a few days later after my first visit. \nThis time I got the chicken long rice. They only serve this dish 2 days a week, Saturday is one of them. It was a bit salty for my taste (I don't eat much salt) but other than that it was very good. \n\nThe best island food around!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2011-08-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9UK28WYQvS7aXyNfa_hLCQ', 'review_id': 'h_t2y_zE4ECaSBsaFmz_ow', 'text': 'Love this place. Friendly workers, food always tastes fresh and excellent portion sides. I recommend the potato salad. Especially love the Bulkogi Plate!', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2011-08-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'H0jBzLPgeusR84nqdkTO9Q', 'review_id': 'Otm0bkaMQUU3SGKWcpgALw', 'text': 'Aloha oe!  \n\nHad time to kill while running errands in Phoenix today so decided to pop in to Aloha Kitchen.  A little out of my way but so worth it.\n\nEnjoyed the charbroiled chicken teriyaki "mini" plate .. only one scoop of rice, the killer wicked potato mac salad and a smaller portion of teriyaki chicken.  Nice Char flavor on the chicken although I found the sauce rather sweet for my taste.  The chicken is chopped up dark and white meat and I\'m a white meat fan but I "suffered" through it!  FYI, the skin is on the chicken.  Wonderful sticky rice with teriyaki sauce on it.  But the potato macaroni salad is worth writing home (or Yelp) about.  Loved it in all its carb loaded goodness.\n\nService is slower than a typical fast food joint, but hey, if you\'ve been to Hawaii, you can dig it. \n\nI\'ll go back and try more items on the menu.  I\'d give the chicken teriyaki a 3 out of 5 (due to meat quality and skin still on) but the potato mac salad gets a 4.5.  Presentation,  my plate was too colorless to be super appetizing looking.  Overall a 3.5 but I\'ll go with a 3.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 3, 'date': '2011-08-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'wFweIWhv2fREZV_dYkz_1g', 'review_id': 'Cq6inWLNhiSyOcqD_fo4aw', 'text': "I'm not going to pretend to know what authentic Hawaiian food is supposed to taste like but my ex-boyfriend is from there and says this place is the real deal. He use to take me to eat here all the time and I loved it. So when I had a luau I knew I had to come here for some manapua and beef sticks. Aloha kitchen did not disappoint. I placed a large order of both and everything was delish and went smoothly.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2011-09-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 3}, 'user_id': 'Yq-pv-frxMeQT9zWtdgUEA', 'review_id': 'SucT1oamlEbUwA8kil-vPg', 'text': "This place is amazing, I love Hawaiian food. Everything is authenitc, fresh, and very tasty. The portions are good and always filled me up, and don't let my size fool you. I will bet money that I can eat more than you.\nYou order at the counter and then they will bring it to your table, or you get it to go. Next to the counter is a little case of exotic beverages, unfortunately I have never tried any of them.\n\nMy favorite things to get there were the teriyaki chicken with rice which is beyond delicious, and the manapua (I think that's how you spell it). The manapua is this strange, sweet-ish roll filled with pork and it is possibly one of the most amazing foods I have ever tried, and that's saying something!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2011-09-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'C5hDZleIfHtcXS9p4ZYBuA', 'review_id': 'qtXPBmX_xGoDQqNPn-y5bw', 'text': 'This Place has amazing food!  I LOVED the Mac/Potato salad.  You get a lot of food for the money.  The place is clean, nothing fancy.  The staff is friendly.  I will be back!  YUMMY!!!!', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2011-09-16', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 4, 'cool': 2}, 'user_id': 'ujdXQzw4x7y7tK6nEjIztg', 'review_id': '2NSqoR80n7_naZgU_riYJQ', 'text': 'I love that this place exists so close to my home ( about 7 miles away.)  I come here when I want to be transported to the simple, homey, delicious, what-you-see-is -what-you-get Hawaiian bbq joint.  With this comes healthy portions of fresh, delicious, and very authentic Hawaiian cuisine, always served with plenty of Aloha spirit.  The decor, like the entire experience there, is simple and unpretentious.  You walk in and order your food at the counter, then walk to the left and grab your cups, pitcher, and plasticware... just like at the places on the islands where you would find similar delectable delights.  The staff is always friendly, and I hope that the following story relates both this and the priority that Aloha Kitchen places on freshness and authenticity:\n\nI came here to eat with my lovely wife one weekend, and ordered the saimin (ramen), but they were out.  No worries... we were happy to order other delicious choices that day, but our Saimin jones had not yet been appeased, so we returned the next day.  When we were informed that they were still out, and that the shipment of saimin noodles would not arrive until later in the week., I (hopefully) politely asked just out of curiosity why one would have to wait days for a shipment of ramen, when it was likely available locally?  They let me know that while they value sourcing some products locally, certain ingredients (including the saimin..who knew?) needed to come from Hawaii to meet their standards of authenticity and freshness, and expressed apology that they could not provide what I wanted at that time.  Shortly thereafter, the owner came out to us and asked us if we like Ono (Wahoo), to which we replied with an enthusiastic "Yes!"  He then provided us with a large, delicious, and complimentary preparation of fresh Ono, which by the way was not on the menu, made sure that we were happy (not a problem), and had a nice conversation with us.  This is also typical of the down-to earth atmosphere and experience that keeps us coming back here frequently.  (though it is mostly the food ;o) )', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2011-10-05', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 0}, 'user_id': 'ydLUNjcGUl-nISKSrUUrGA', 'review_id': 'kThtDxIM7DMXRcS5ba-9Gg', 'text': "Have you ever had their wings here??? It's a must. Some may say it's a little sweet, but it has the sweet and tangy mixture fried to perfection. I LOVE their wings. (it's their special sauce ;) ) \n\nWe also had the salmon platter, which was ok. Standard. I liked the macaroni salad. I always enjoy that here. \n\nThey say they don't sell the manapau (sp? - char sui bao/sweet pork bun) on Sundays, but we asked, and they had it and made it for us. I remember it being a little better before, but maybe because we didn't eat it right away... it got a little hard and wasn't as good as I remembered. Oh well, lesson learned - eat the pau right when it comes out - hot and fresh. \n\nEmployee at the counter was very friendly. I was with a big group and she was very accommodating. It's a nice simple, casual place to eat. Good for a laid back place. Homey feel. Me likes!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2011-11-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rBodQHVvk-UwmMlmyvIkCA', 'review_id': 'ewQnCBVakWfLX0JEpgZkEQ', 'text': 'Seriously,  this is my absolute favorite Hawaiian food restaurant. I recommend everything I have every had there. I especially like the Bulkogi, fried saimin, island hot wings, and the best potato-macaroni salad ever.\n\nThey have pickup for catering too.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2011-12-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'a_9uEb1XN9r7yLWR3GlRxw', 'review_id': 'zZmB0x9msrhKZTZaLCqxsg', 'text': "I happened upon Aloha Kitchen on my last visit to Phoenix. The food was authentic and perfect. I grew up in Hawaii and was transported back to the islands and my childhood. On my fortieth birthday, it was the perfect evening. \n\nThe saimin, char sui bao, and the teriyaki chicken were great. I wouldn't recommend the haupia pie as authentic which is a good thing for the locals. When done exceptionally well, it is addictive. \n\nI will eat here during each and every visit to the area.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2011-12-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': '0mwGMnMvgvKd11do4u5J3Q', 'review_id': 'lk15-w3rkKIqtBQNhXq0tg', 'text': 'When I was a REALLY little kid, my family used to get take-out from here all the time. Then 15 years ago, I became a vegetarian, some other stuff happened and for some reason we just stopped going. Had nothing to do with the establishment I suppose, other than that there were a few closer options for take-out and we didn\'t go out all that often. I remember distinctly that the Manapua was my absolute favorite thing here as well as eating their rice covered in their teriyaki sauce.\n\nNow, 15 years later, I eat chicken and fish again...and one of my first cravings upon visiting my hometown was to come back and try this place again. Finally got to go recently, and I\'m hooked. \n\nEverything here is delicious. Really, you can\'t go wrong. I ordered a combo (number 4 i think?) which was teriyaki chicken and bulkogi combo, which comes with salad and rice and an orange wedge. The bulkogi is a pretty awesome breaded fried chicken thing that comes with a unique tangy BBQ sauce. Delicious. The teriyaki chicken is fantastic. It is the epitome of what teriyaki chicken should be, with a distinct hawaiian flare. There are sometimes a few, lets call them "less than desirable" cuts of chicken in there, but it hardly matters when you\'re scarfing it down like I was.\n\nThe rice brought me back, and surprisingly, so did the salad. The salad has, well, I dont know what kind of dressing on it but its delicious. I hadn\'t at all thought about it before coming, but when I tasted it I was instantly transported back to my childhood.\n\nThe only "bad" thing Id say about this restaurant is that its really almost better to get it to-go. There is absolutely no added benefit, taste or temperature-wise, atmospherically or otherwise to dining in. In fact the to-go containers seem to keep your teriyaki sauce out of your salad a bit better than the styrofoam plates you get in-store. The environment inside is very back-to-basics, no frills. I have no problem with that at all, but given the option, I think Id rather get the food to-go and just eat at home while watching a movie or something.\n\nAnyway, this is really very good food, and probably the best hawaiian food in Phoenix--at least as far as I know. A definite keeper and locale to frequent when Im in town.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2011-12-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'RKeLH3cM47vtyTaNNpC67Q', 'review_id': 'qzK4jHCH_Yxm1jjstXdhxQ', 'text': 'Ono!  Love the Hawaiian plate and Chicken Katsu!   Our new favorite in Arizona!   No need to go home to Hawaii any more (ok, ohana is one good reason).', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2011-12-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1nB6skFopaPCCPds1Bq81Q', 'review_id': 'pa6v3Z0_F9d_yo3aXLgRNg', 'text': 'Large portions!', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2012-01-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'fUG_SlQYpW23WnWjNu8WXA', 'review_id': 'RxoguI-hBH-61q9R_wPvVA', 'text': 'We eat here several times a year. All of the main dishes are excellent. The dining experience leaves something to be desired, though - plastic forks and Styrofoam bowls are awkward to eat with, and there is not much atmosphere. But the food is great.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2012-03-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 2}, 'user_id': 'dS8JExPAFBpkqAUadiP5nQ', 'review_id': 'lmkAuBVF0vXs9Li1uArmvg', 'text': "AaaalooooHa!  Five star best Hawaiian food right next door to the BEST Pizza (see my Nello's review) in Metro Phoenix!\n\nAll in all I first visited the Aloha kitchen next to Nello's as I was craving and on the hunt for some juicy Kalua Pig:  A very tender Hawaiian specialty slow cooked pork normally in an underground pit over coals for at least 5 hours or more! It's got that slightly addictive smoked tast.\n\nMany years ago, On a Saturday I happened by and ordered the Hawaiian Combo plate Kalua with Laulau and was hooked on the first bite!  Yes lurred in by Kalua and hooked with the Laulau line. I was not disappointed and have been coming back for more ever since:). Remember not to wait and phone call ahead for the Laulau is limited and extremely popular, many times selling out in early afternoon on Saturdays only!\n\nSPECIALS:\n\nHawaiian Plate (Wed. & Sat.) $8.95\nKalua Pig with cabbage, Lomi Salmon and Chicken Long Rice\nLaulau Plate (Sat. Only) $8.95\nPork Laulau, Lomi Salmon and Chicken Long Rice\n\nThe Salmon and tomato with onion salsa is awesome. This is a kid friendly place and very large portions, that gives them FIVE Stars for value. My wife gets the Aloha plates: She likes the Teriyaki Chicken and loves their Salads.\n\nALOHA PLATES:\n\nAll plates served island-style with 2 scoops steamed rice and choice of macaroni-potato salad or tossed green salad with creamy tropic salad dressing.\n**Special portion for light appetites.\n**MINI Plate\nPlate\nBulkogi Plate \n$4.95\n$8.95\nThinly sliced ribeye beef marinated in Korean barbecue sauce, charbrolied & \nserved on a bed of cabbage.\nTeriyaki Chicken Plate\n$4.50 $7.50\nCharbroiled boneless chicken marinated in special island teriyaki sauce,\nserved on a bed of cabbage\n\nSALADS:\n\nChinese Chicken Salad $7.95\nStrips of charbroiled chicken over lettuce, garnished with green onion, cilantro, mandarine oranges and sliced almonds, served with island-style tangy oil and rice vinegar dressing.\nSaimin Salad $7.50\nChilled island-style noodles over lettuce, garnished with green onion, cucumber, Japanese fishcake and Chinese barbecue pork; served with special oriental sesame dressing.\n\nHope you enjoy the Aloha Kitchen I could not review Nello's without mentioning this hidden secret:P", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2012-03-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'b0kPMpmBS8jml9WZJCjuAQ', 'review_id': 'odDXWL0tZbeaLwgqyDU8Uw', 'text': "Well, wish I could say this place was top notch, as the service was good. The Manapua was very tasty as was the Macaroni salad. The chicken katsu was unfortunately the worst I've had in the valley. The Bulkogi beef was okay but nothing special. One thing that should be mentioned is they only serve dark meat and white meat mixed chicken in their chicken dishes, and white meat only is not even an option. So if you are pretty much white meat only person like me this place is pretty much a no go.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 2, 'date': '2012-03-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 2}, 'user_id': 'wVSGZN8d3ao4ad97kEDzYg', 'review_id': 'KTnByo4UozGZB0GJhAd56g', 'text': "My family has been coming here since I was a little girl. For over 20 years now...\n\nRay, the owner, feels like a family member. I love that he chats it up with his customers. The guy is hilarious and makes you feel like a valued customer.\n\nOn to the food...did I mention I've been coming here for at least 20 years? I have had EVERYTHING on the menu and LOVE it all! It is authentic and delicious. I lived in Hawaii for a few years after college and whenever I'm missing the islands I head over to Aloha for some ono kine grindz :)\n\nSimple place, casual, no frills. Classic plate lunch style. \n\nThe best Hawaiian food in AZ, no question. You need to go.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2012-04-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'kk05snSafuIFK0lsxoMNzA', 'review_id': '_HuVuMleyoZ-Z-eQ_XFw5A', 'text': 'always great Hawaiian food.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2012-04-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'HEIAOkZen4foUk6UWoP4_g', 'review_id': '0W1W0jPXV0LKaUWtKjcRHg', 'text': "Awesome hawaiian local food. The best I've had in Arizona. Just like being on the Islands.  They need to make Loco Moco!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2012-04-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'utvgWVQlAgxaOuc8SRhGtQ', 'review_id': 'x8fjgGBupXv0Z5ovoOqbiw', 'text': "The atmosphere is kinda awkward, but their food is great. Their mac salad is really good, I wish they would use a little less Mayo. Don't get me wrong I eat every last bite! \n\nThe only thing that is annoying about this place is that they have this sign that says they accept visa but they prefer cash because they are a small business & so on & so on. It makes me feel bad when I use my card here. For that reason I have to pass this place up A LOT because I never have cash! Its either your going to accept cards or not. & for me that sign just tells me to not come here w/out cash.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2012-05-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'aWAzehzzbksicNXY0nT6_A', 'review_id': 'I45ki9ObL1oo_RF7gFjkVA', 'text': "Strip mall, family owned casual quick serve. Exactly what you would expect for the 'environment' of this restaurant. \nWhat you might not expect is the flavor!  Excellent dish - mix plate with Bulkogi and Teriyaki Chicken. Absolutely fantastic!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2012-05-23', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 5, 'cool': 3}, 'user_id': 'fUs5XxOR82Hfrnyl4wi2QQ', 'review_id': 'tyWPKzVDOSu8P57QfXJRtw', 'text': 'As an expat Hawaii guy, my family still loves "plate lunch" kind of foods.  So although Aloha Kitchen does not have great food, it normally is a relatively decent and passable place for us to pick up some plates when we are craving plate lunches and are too lazy to cook ourselves.  But in my opinion, this place is slowly getting worse.  The slight price increases are understandable and that is not the problem.  The problem is that they hire all these young kids who are sometimes more interested in farting around than paying attention to business.  \n\nSo yesterday my wife and  daughter wanted plate lunch stuff so they called in the order and called me at work to go pick the food up.  My wife warned me that I should open each box to make absolutely sure that the order was correct, since the last three times they screwed something up.  So when I got there, the food was ready and already all packed up.  I wanted to check the boxes, but the girl said the order was all there and read the order back to me.  Since she said the order was all there, I took her word for it and took the boxes home.  Upon getting home, my wife opened up the boxes and two out of four of the boxes were wrong.  Yeah, the entrees were seemingly correct, but the salads and sides were all wrong.  Boy did my ass get chewed by my wife for being so stupid for trusting  those young dufess kids!!\n\nFurther, my wife ordered the hot wings for her meal and the wings were not hot wings -- they were more like honey glazed wings and my wife said that they either changed the recipe or made a mistake.  My daughter ordered the bulgoghi, and that order was correct but apparently the meat was over-soaked in the soy marinade and it was super salty, super dark, and the meat was disintegrating due to being marinated for too long.  The order for teri-chicken was OK, but the order for fried saimin was disappointing.  The menu and the history of this dish at this place (like 25+ years) says that one of the condiments on the noodles is slivered char siu (sweet red roast pork).  But there was no char siu in the dish, only slivered, old, left-over, over-marinated bulgoghi....maybe that is why our bulgoghi meal was not very good -- they had a lot of old, leftover, over-marinated meat so they gave it to us and used some of it on the fried saimin.\n\nThere have been many competitors to Aloha Kitchen open Hawaiian style plate lunch places but most, if not all of them have gone under.  But as a plate lunch expert and aficionado, I can tell you that a good plate lunch place will be a gold mine here.  Not only expat Hawaiians and lovers of plate lunch foods, but even the other people will love those kind of menu items.  The problem with the other places and Aloha Kitchen as well, is that the food is not that good, and the menu choices are not typical of authentic plate lunch choices.  I understand the issue of cost control and menu standardization, but menu choices can be increased by  changing the menu for different days of the week, or, having a new special of the day each day.\n\nOh well, what do I know?  I have only run about 30 large corporations and small businesses successfully, so my ideas and opinions must be worthless!', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 2, 'date': '2012-08-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wJmj_ijVdpgzlfRulKcm4A', 'review_id': '99jWjrKVGAmIN2wNZmOgVg', 'text': 'love love love the mixed plate #3!', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2012-08-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PD8feAq-y3amrN59mZ5nkg', 'review_id': 'h2JI-VC6ewmRt0uof_RgaQ', 'text': "I haven't tried Hawaiian cuisine since I first went to Aloha Kitchen, but I have after, and I must say, this is the best Hawaiian food I have ever tasted. Try one of the combos, I like Mix Plate 3 and 4. They have really good macaroni salad that I usually get with the combo as well.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2012-08-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TJYLegdD8r_p5HOM6OgX5Q', 'review_id': '3AyBKdn2mgWF02cw3men_A', 'text': "Hands down, most delicious Hawaiian food I've had since moving to The Phoenix area. I have dreams about the macaroni/potato salad.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2012-09-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'QUVjBZnhcTKesMQSceKCqg', 'review_id': '_MSo1K83s9WIuiDtMvI6Og', 'text': 'Ordered the Laulau plate and my wife had the katsu.  We left there disappointed.  The food was so-so at best and for the price, felt the portion size could have been a little bit bigger.  Another red flag(for me personally) was seeing high school aged kids running the kitchen and the counter.  So with that being said, 2 stars.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 2, 'date': '2012-09-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'hcctCQy3bdZMezrUKkZLtA', 'review_id': 'aAdyk2DBeFuNYM-f7wQOsA', 'text': "Sorry AK, maybe I was just grumpy that day since I hadn't eaten for a gazillion hours....c'mon, I'm not the only one who goes all Beast Mode when hungry, right?...but the food here just did not hit the spot for our Hawaiian food craving. Let me start by saying the place itself looks like a legit Hawaiian restaurant with it's low key vibe and simple style. The menu has a lot of choices which is great. I, for one, have a go to meal plan when I nom Hawaiian style which includes chicken katsu and mac salad, of course. The food did not taste bad in any way...it just wasn't my style. The Katsu was thin, dry and chewy and the sauce was the tangier kind vs. the sweeter kind that I like. The mac salad was okay but the more I ate the less I liked it...when normally I order an extra side of mac salad to devour with my meal. Again, I may have just been grumpy gal that day but I still find myself craving my Hawaiian spot in the OC.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 2, 'date': '2012-09-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'axrhzW-tTLU_iWO-U0y6Jg', 'review_id': 'dU5WITckPDfb2OvNPNFlTQ', 'text': "I've never been disappointed with Aloha Kitchen...well, other than showing up on a Monday ready for lunch and then remembering they are closed on Mondays. My personal favorite is the Mix 1 plate...lightly battered fried mild white fish, teriyaki chicken, rice and salad. Time to update the decor though, been the same for a couple decades now.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2012-09-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'N_R2u8JZvxWOfKvp1uRdZQ', 'review_id': 'QDUZH12F55WLIM2ADPgnJQ', 'text': "Not Good. Lived in Hawaii for 3 yrs. Ate my fair share of plate lunches. Not at all what I expected. First of all, a plate lunch needs good mac salad. This mac tasted like KFC potato salad, (yes.it had potatoes in it). I had the teriyaki chicken. It was a bunch of dried out, day old, chopped up chicken, soaked in some bad costco teriyaki sauce. I can't believe I drove all the way out there for that. \n\nLove Ono's and L&L. Don't think I'll be taking another chance on Aloha.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 2, 'date': '2012-11-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '8SEU0lolGnsZ0rBCcGS8-w', 'review_id': 'MFzF32H4Knola3LoadQOjg', 'text': "Being born and raised in Hawaii this place isn't so great.   The only items that are good are the saimin, fried saimin, and the guava cake.  Everything else is pretty horrible including the spam musubi! They don't even cook the spam, it's like they sliced it out of can and placed it in the musubi mold. If you want real hawaiian food head over to Paradise Hawaiian BBQ at ASU!! They even serve meat jun there.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 1, 'date': '2012-11-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'v6CGBT0OoLRht9dzo7vaXg', 'review_id': 'PYvBhkGefgaI5OhF2zp7cg', 'text': 'Never once have I ever been disappointed. I\'m going to have to say this place is 1st ranked for me when it comes to authentic Hawaiian food in AZ. Their mac is delicious, the meat is never dry and always full of flavor. \n\nMy two personal favorites are the teriyaki chicken or beef and the bulkogi! Bulkogi means "fire meat" in Korean. It\'s grilled and marinated is yummy sauces. Definitely give it a try if you\'re in the Mesa area- you will not be disappointed!', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2012-12-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '44mrgkfQ6ZglLwF6vbNEZA', 'review_id': 'V7f5P0s2inaVYoRZXyJilQ', 'text': "From the outside, and even in, you would never know what to expect. Minimal decor, food is served on styrofoam plates, plastic silverware, not a large menu. None of this matters. The food is delicious. I had the bulkogi and teriyaki plate. It came with a choice of salad or macaroni potato salad, and served with rice. The meat was flavorful and the sauce was excellent. I inhaled everything and was tempted to order more. There's a reason they've been around for twenty some years.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2013-03-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '8-2W5CmkDl9vrkxRpkiPRg', 'review_id': 'ywjLkQqu8-lIR4ACH0nrFw', 'text': "Aloha Kitchen is damn good Hawaiian. After mourning the loss of my favorite Hawaiian haunt in Tempe, my wife suggested we try Aloha Kitchen. They've been there forever, but I hadn't ever made it over.\n\nThey're fantastic. Great teriyaki chicken: perfect tender and fresh and a great sauce, great macaroni/potato salad (the combo is nicely balanced, and no celery or relish, which are dealbreakers for me). They also whip up some mean bulkogi and have a great kalbi special pretty often. \n\nOverall, they're exceptionally tasty, well-priced, and even the mini plates are more than enough food for me, and I can put away a lot of food.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2013-03-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'T7J9ae0wTskrI_Bgwp-4cA', 'review_id': '3D6ICzE6qisTLUKN0F5Diw', 'text': 'This place has been around for quite a long time.  The food is delicious.  I highly recommend the beef bulkogi.  The rice and teriyaki sauce is also good as is the macaroni/potato salad.  The manapua are popular with my kids but they mostly eat the doughy outside and leave the pork chunks in the middle on their plate.\n\nThe prices are really good and I like that they have free water and lemons sitting out on the counter.\n\nThe only icky part is that the walls are really dirty.  You sit at a table and there is splattering of food and other debris on the wall right next to you.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2013-03-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'gLWA_hxaFRFQJWDTSGgGOQ', 'review_id': '4JnSSVk_BBYTey0FxgJscg', 'text': 'Best Hawaiian food on the planet!! Except maybe in Hawaii, but you get my drift. I love everything here! Bulgogi and Potato Mac salad!! Yum!!', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2013-04-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ojPkZyjbPub_higOvBy9JQ', 'review_id': '9GXRXxm4YBOn9yaI4lKZNg', 'text': 'So good...feels like your in Hawaii n food is amazing', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2013-04-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5bs9-7Fwjuv4HiQNFVZTEw', 'review_id': 'QYSCV3P-SMp4FNORInQP_g', 'text': 'Owner was a great guy...gave me a free BBQ pork bun just to let me try! Food was delicious!!', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2013-05-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '19z3TYK-S0tLQz33NIX3Gg', 'review_id': 'c7GIo9Fi6LrD7n0c6f3few', 'text': "I've been looking for a good Hawaiian place since I'm from the islands. I looked online and it had decent reviews. We decided to go about an hour before closing for take out. I ordered the katsu and teri chx mix with mac salad and she ordered the teri beef and chx mix with mac salad. We took it home right away and ate. My plate was ok, not what I was used to. The katsu sauce was more like cocktail sauce and the mac salad had potatoes in it. Her teri beef was very dry.  About 2 hours later we both started feeling queasy. I was up all night in the bathroom with FOOD POISONING. Idk if it was the mac salad or the katsu bc I was way worse than she was. Never again will I eat here and I'm going to contact the management. It shouldn't matter if its the first order of the day or last of the night. Quality should be consistent.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 1, 'date': '2013-05-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 4, 'cool': 2}, 'user_id': 'KnDlTIgDpFJbrUJSgBCgDA', 'review_id': 'ekWi-M-fzqTPrpTSMTvlig', 'text': 'I love coming to Aloha on my lunch break! The food is excellent I love the combo with the katsu chicken and teryiaki chicken. Its big enough that I can take some leftovers to my 3 year old who also loves this place! Its fast, good cheap and service is good!', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2013-05-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'azS2I2xOXWxoVlgpISAYDQ', 'review_id': 'w_F8EHpzxzPap5PT0aM2JQ', 'text': 'Best stateside Hawaiian meal since visiting Maui. Brought back memories of Aloha Mixed Plate (AMP).', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2013-06-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': '2BiT4UmTnrnipyJTcBb6QA', 'review_id': 'cs3RAyQXwFlAXikiC2MxTQ', 'text': 'I grew up in Hawaii, but I\'ve lived in the Phoenix area for over 10 years. I had heard of Aloha Kitchen\'s existence and it was on my to-do list for a long time. I went today and was disappointed. Beef was mediocre at best- very salty and swimming in a syrupy teriyaki goop. Wife wouldn\'t eat the rice as it, too, was slimed by the awful goop. Chicken katsu and katsu sauce was OK. Aloha Kitchen is what I\'d call a zombie restaurant: the living dead. The "blech" food and the dated, worn decor tells me that the owner(s) stopped caring a long time ago. \n\nI won\'t be returning to Aloha Kitchen. Maybe it\'s time for them to say "aloha", as in "goodbye". \n\nThankfully, we have Ono Hawaiian BBQ in town. Tasty and consistent.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 2, 'date': '2013-06-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'V3XipfYV1U4WYbe6Whjzlg', 'review_id': 'NR4jfdl72DnQ5E_QZqTNvQ', 'text': 'Great food. Awesome wings!', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2013-07-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'Ptn3l_rOA_gUB3-4EVIACw', 'review_id': 'PP6XnRcNZ9_wTgU7vHbOiQ', 'text': "My husband and I tried this place a week or two ago and LOVED IT! Everyone was nice and it was busier than we thought. Didn't take long to get our food. AHHH ITS SO GOOD!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2013-07-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8P1KV7pcA0GlOWxcpKXlIA', 'review_id': '58NpIus3P6m6Hs5Egu4aZg', 'text': "Definitely enjoy this place.  Very solid food, reasonable prices, good specials.  Check it out... but look for their hours first.  I think they close early on Sunday and aren't open Mondays.  We've shown up a few times and they aren't open...", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2013-08-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'OpNmmfxln34ABAS6TdY3tg', 'review_id': 'UYyxkCf6lIVRozCmQfLDAg', 'text': 'Best hawaiian food, great service, friendly people....i love it! Def. As good as it gets', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2013-08-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'XwTRAOVraHgO1s-HmsqeSw', 'review_id': '4VCOWytmEmeYj5TfM0nIJA', 'text': 'Small mum and pop business that\'s been in the east valley for over 25 years.\n\nThe price and meal portions have been on point.\nAside from their usual menu, they also offer "Specials" for the day. \nService is prompt, and warm... Yes, with the aloha vibe.\nFood? Let\'s just say we have yet to eat something we do not like! ^_^\n\nJust remember, it\'s very busy during lunch and most dinner hours. So be patient if you are in there round those times. Alooooooha! \n\nXx', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2013-08-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'KvTP-y_hq3V9BWcuuHL9RQ', 'review_id': 'l6fw6TRjVmYGRxfzaZgnHw', 'text': "Love the food. Went on a whim to try something different, can't stop going back. It clean, they are super nice and the food is much for not much $. The manupa everyone talks of is the best!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2013-09-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': 'nMHu8rkh1wkKn5Md0MzNHA', 'review_id': 'gF7TrhJUfWa6JDGG7f64Rw', 'text': "I was finally able to drop in Aloha Kitchen today with my daughter and her Hawaiian boyfriend and we weren't disappointed. \n\nThe restaurant is little more than a little cafe but we went for the food, not ambiance. After perusing the menu over, I decided to get a mixed plate, which had Bulgolgi (they called it Bulkolgi), chicken katsu, sweet rice and choice of salad. I wanted to try the 'creamy tropical salad dressing' on the green salad, so my daughter and her beau went with the macaroni and potato salad. She ordered the charbroiled salmon but he, being Hawaiian, had to custom order and made a custom mixed plate of teriyaki chicken and J. R. Special. AK happily complied. \n\nOur lunches arrived in 12 minutes, hot from the fryer/char grill/flattop. The plates were literally overflowing with food. My katsu and Bulgolgi were excellent. The katsu was crunchy on the outside but oh so tender on the inside. I was worried that my Bulgolgi would be dry but it was tender and juicy as could be. The sweet rice was, well, sweet rice but good! I tried the entrees from the other plates and they were outstanding as well. \n\nThe Mac/potato salad was good but the green salad was just so so. \n\nThe owner stopped by our table to ask about our meals and we offered him a seat so he could tell us about the prep. AK makes all of their marinades, sauces and garnishes by hand. The only bottled products are the condiments offered at the condiment station, plus the soft drinks.\n\nHe stopped by later as we were finishing to check on our satisfaction. For those who gave negative feedback for service, I think AK has been listening. \n\nWe will definitely return but with bigger appetites. Had to leave half my rice behind :-(", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2013-09-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_uy_on3_S4gcTzPk9CoDrA', 'review_id': 'x8kRaDYHvku-hfUWvjtX0g', 'text': 'So good! I get the chicken katsu/beef bulkogi mix plate with macaroni potato salad and a Manapua. You will become a regular after the first try!', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2013-10-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yB6a5WtjUA0xKTnbW9tMfw', 'review_id': 'Y7YsQrfM9nK3D0urw-H7eQ', 'text': 'This place has been my favorite restaurant since I was a kid. Absolutely love the manapuas, the island wings and pretty much everything else. I hope this place never closes. In the fact they need to expand more throughout the valley.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2013-10-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'ekx-pxSmerTofP1VEyjwXQ', 'review_id': 'wNLNDWrBUS0W8YK0XWbBmQ', 'text': 'My wife and I stopped in this weekend after reading some of the glowing reviews on YELP and we were very glad I did.  This place is not about the flash, but about the food. \n\nWe ordered the Chinese Chicken Salad and a Mixed plate and split them both (which was perfect as the entree was way too much for one person).  The food was fresh and delicious and we will be heading back soon to try more of the menu.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2013-10-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '-TRyTk0eUxzI1XCnaqLPPA', 'review_id': 'ZINh5mhvgAFdUWw8kU_Kuw', 'text': 'Drab location in an unassuming strip mall. Bathroom was so dirty. Service was mediocre at best! We had teriyaki chicken, katsu, and fish. The fish tasted like egg. The chicken was really good. The salad was a store bought bagged salad with thousand island dressing. Katsu was decent.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 2, 'date': '2013-12-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 2}, 'user_id': 'lgJXQ8UQPpUOe78RAsAjzw', 'review_id': 'WVnee-mXlNMtkXXTCKfYag', 'text': "We came here just for the guava cake!! It was very good. I asked my boyfriend to get it for me on my birthday. Such a unique flavor for a cake. I'll be back to try their food.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2013-12-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DJuaMH7zSXdGbXydnOxvBQ', 'review_id': 'lX4oa7GbRQo9-Ww0hkb7Tw', 'text': "The food is delicious enough to eat every last bite of the large portions. Can't get enough!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2013-12-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_zQ-nRDAArkFr4CF08WfDw', 'review_id': 'sDc49wuvbXgj3dkl9yZTSg', 'text': 'The best Hawaiian food in phoenix. We go about 2 to 3 times a month. I always am impressed with how nice the young kid at the register is. I always get the special and have left overs for lunch. Thanks for the good food.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2014-01-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wjJKN2x0xbxqZEWUPzOdZA', 'review_id': 'oiKvyIZZMgzhL_EKbabqWA', 'text': "Tiny little restaurant tucked into the corner of a not-so-busy strip mall. It's a little difficult to see from the street.\n\nThe decor is awful, and is in need of a serious makeover. Super friendly service both over the phone and right when you walk in.\n\nI probably go here once a month. The chicken teriyaki/Katsu plate tastes good, but I get those chewy pieces of chicken (I call them chicken boogers) in my plate every time.  Fish has been a bit bready for my liking They definitely give you a pretty good serving size, because I always have food left over.....I'm a big eater too!\n\nCoconut shrimp is not made here as I've seen them take a bag from their freezer and cook it. I'm sure (although I'm crossing my fingers it isn't true), that the other food may be cooked the same way. Very disappointing to see that.\n\nIf everything was made from scratch here, this place would've gotten 5 stars.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 3, 'date': '2014-01-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'E_n7osw1ZhCIVJj_PBYzjw', 'review_id': 'lkmD9Gz9ULEPZ3RB56r_XA', 'text': "Incredible! Absolutely amazing experience here. My boyfriend is from Hawaii and he was in heaven after the first bite. Everything smelled amazing and tasted even better. I can't wait to come back next week for poki.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2014-01-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '1jyywqwuX6OmCbYFedJ80A', 'review_id': 'K6CS_9sI_Cl0PmsFPLyOqQ', 'text': "Amazing!! I'm from Kaua'i, born and raised. Have lived on the mainland for 15 years now and have never found such an authentic Hawaiian eatery. Everything from the simple atmosphere, to the owners and staff. And the food. My god the food. The laulau is as good as any I've had back home. Lomilomi salmon, amazing. Kalua pork, katsu. Saimin. And the freaking manapua. This is the ONLY place in AZ to get the real deal Hawaiian food. Can't believe it's taken me so long to find it.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2014-01-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'bWNjCQyTJttofo3dKtTTPQ', 'review_id': '2wTbevP9Y9tj-pA-JrhbvA', 'text': "You would only go to this place for the food, as the ambience and decor is non existent. But the food is worth checking out if you are looking for something different. We were in town for a house hunting trip and I found this place on Yelp. We visited on a Saturday night fairly early around 6pm.\n\nWhen I went to Hawaii many, many years ago, I fell in love with Lau Lau which is a chunk of pork steamed with spinach in a banana leaf. Aloha Kitchen had these as part of a special that night which also came with kalua pork, saimen noodles, rice, and lomi salmon (salmon sashimi salad with tomatoes). This was a huge dish and could have fed both my husband and I. All of that food was only like $10! I am not an expert on Hawaiian food but it was very tasty. My husband had the other special which was teriyaki chicken and coconut shrimp. He was very happy with his dish as well. \n\nThis place is a great bargain. We were on a per diem and for under $25 we were both WELL FED as the portions are very generous here. All of the food is served on/with disposable plates and utensils. But don't let that turn you off, the food is worth trying out.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2014-01-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'E_YQqn2dvjkf9kEQ_5Ui8A', 'review_id': 'Eaq1Vu9sUNjFSQXJKmPHLA', 'text': "By far the best place in AZ for Hawaiian food. The staff was friendly, easy to order and you know it's fresh when it takes awhile to get the food. Hit up this place before noon because it gets busy when everyone arrives there for lunch.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2014-02-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'HFTmwmRYMmNnwpJ6c7077g', 'review_id': 'hLNtERG1Arw_xMLesWGk9Q', 'text': "I grew up in Ewa Beach, HI so it's always nice to find good Hawaiian food. We've heard this was a great place if you're craving Hawaiian cuisine. Kahlua pork and Laulau tastes great! BBQ is great too! Will be back!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2014-02-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WJuO7l6D-ZBxAbW8LNVJ5Q', 'review_id': '5VJHg9KzQtBDnY73DlGadw', 'text': 'this place is tucked in a corner of what one might think is an abandoned strip mall at first glance. unless you are searching for this place you would probably drive by it every other time without a thought. Now the food however is worth the stop. i love Hawaiian food and this place makes damn tasty food. asides from the aesthetics of the location and the overall decor, my one major problem with the place was that they had no spam on their menu. no army base stew, no musubi, no spamwich, not even a basic hot Hawaiian breakfast. i mean come on! other than that, worth a stop just for the food experience and i would go back because its hard to find good authentic un-western influenced foods in arizona.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 3, 'date': '2014-02-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '-wriANYaRMcQrjgBFvEBXA', 'review_id': '4CdFPbdmyoZESpnsZhu24Q', 'text': "My friends and I had lunch here today.  It was exactly what other Yelpers described... Nothing fancy about the decor but the food was good and the staff extremely nice and helpful. We ordered wontons as an app and should have gotten 2 orders.  Entrees were Bulkogi, which was tender and flavorful, JRs chicken, similar to a spicy sesame chicken, teriyaki chicken, no surprises and chicken katsu, sauce was good but don't fry it in the same oil as the fish items.\nWe all decided it was worth coming back and would be even more excited if they delivered!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2014-02-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IFc_NLA04PTXeH7G11UEJA', 'review_id': 'dG3uRMPBfxNQJ-k2Uv8WoA', 'text': "I love this place.  Small hole in the wall type of Hawaiian place with the best food!  They serve a lot of it as well.  I can't get enough of the potato/mac salad and love the coconut shrimp.  Warning Saturdays are BUSY!! however, more authentic Hawaiian food.  If you get there early enough you can get Spam Musabi.  The Manapua seems to be a favorite, especially with the kids.  Super friendly people work here.  The decor is not much to look at but the place is clean.  Makes you feel like your in Hawaii!  Minus the tropical breezes, wonderful beaches and cooler temps.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2014-03-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qc-HxqAlORE9e94BX3WgSg', 'review_id': '7a1wUcnqjmxn6a96BxC-gg', 'text': "This place is a little hidden gem!  I have come to eat here a handful of times in the last few years of living out in the East Valley, however, I do not come as much as I should.  This weekend, I had my step-daughter, Kenzie and my daughter Riley with me. So we went on a food adventure as we often do when we have free time.  I ordered the special of the day (Saturday) Ahi poke and a side of pork laulau.  Ahi poke was seasoned well and had an oyster sauce type of marinade, green onions, onion slices and tomatoes. I can only eat so much oyster sauce in one sitting, I don't care if I am Asian or not- there are still some flavors Asian people don't like. LOL  The pork laulau is the real reason I came because they only offer it on Saturday. It does not look appetizing but once you get the taste of the pork it really does just melt in your mouth.  Kenzie couldn't stop eating it.  The baby on the other hand would rather eat some pepperoni's- she doesn't know what she is missing yet. Too bad today is Monday and they are closed, otherwise I would be coming for lunch today.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2014-03-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'h5-yhYHT-1Yk4h7q7vjQDQ', 'review_id': '5dJIQPJg3k1ZymbZ_Zu3wQ', 'text': "I really love this place...there really is no better Hawaiian food in AZ.  I ordered to go.   First,  everyone is so friendly,  The girl at the counter was very good about answering menu questions,  and brought me my take out instead of just yelling my name.   I had the mix plate #1, which mixes 2 battered fish filet and teriyaki chicken.   The chicken is dark meat,  cooked on the flame broiler then sliced and coated with a thick teriyaki sauce.... Yummy! The fish was lightly battered and perfectly deep fried... Moist and tender.   And of course,  you have to order the Potato Mac for your side,  you won't regret it.   I also had a spam roll... Yes,  a sushi style spam roll.   It was only $1.50, but it's certainly not one of the best things I've eaten there,  I just couldn't get into the taste of seaweed and spam together. Oh well,  I had to try it.   Over all,  another great experience.   I can wait to go back on Saturday... I'm craving a laulau plate!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2014-03-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'DyJ1iuOFheZbwdzajdH6bg', 'review_id': 'KMGchEeLDkCxIeleMTQL4Q', 'text': 'We are going to play a little game called "Whats the most important part of a plate lunch"....any answers? No? I will tell you, It is the rice. Yes, the rice. People like me, who are from Hawaii (Maui) to be specific do not even consider food without rice a meal. So imagine my disappointment when opening my plate lunch and seeing the travesty that was under my kalua pig...it was closer to mochi then it was to rice. Other than that everything was awesome.....it would of been amazeballs if the rice was right.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2014-03-27', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'zqQbzM1Z-FP_26EWJOXemw', 'review_id': 'b3gclqCEtVxdMh2iP7lwmw', 'text': "Use to live in Phoenix while going there for school and work.  Came back this past week and the food was great as usual.  I also brought a friend who's never tried Hawaiian food and loved the mac/potato salad, katsu bulgogi plate.  Keep up the great work guys and Mahalo.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2014-03-28', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 2}, 'user_id': 'TvxFC55kyohNh-n-Yy4z5w', 'review_id': 'oc_l5snCkOmXu95RV-eK1A', 'text': 'I came here with some friends the other day and I was pretty skeptical because there was nobody in the restaurant, but i was pretty impressed. I got the Chicken Katsu and it was SO GOOD. Our food came out pretty quickly and the Mac was to die for! I always love Hawaiian BBQ and this might be my new go to place. I also got a mini and it was plenty of food for me. I think a regular sized meal might be enough for two people to share or to have leftovers for another meal!', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2014-04-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'YVGdz4BMzlJk4SQPmhUU1A', 'review_id': 'Qy2DuOx-ucsjmP2LmZqdOQ', 'text': 'If you want very, very good "local" food, this is the place to go. Located in an easy to miss strip mall, this is no \'upscale\' establishment. It doesn\'t need it. The food is superb. I have eaten here numerous times and tried just about everything on the menu. One must have: manapua. They are melt in your mouth good! Their teri-chicken is flavorful and always comes with "2 scoop" rice. You will not go hungry here. Even their "mini" plates are plentiful.\n\nIf you come on a lucky day, get the haupia (coconut pudding/cake). \n\nPerfect for a lowkey, great meal, any day of the week!', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2014-04-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'KgSJzb7x1xC00b_L7MXEXw', 'review_id': '-W13fp_sZBtFTyogBCUPaQ', 'text': "I love this place!  Been coming here since 2000 when I moved here from Hawaii.  Whenever I need my comfort food I order the fried saimin. It's the best! But today I tried the hot wings and I'm upset I haven't ordered them before because they're so ono! A little sweet with some spiciness to it. And still crispy too.  I highly recommend!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2014-04-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'vzz3h4kSzxUa8HOpM7il6A', 'review_id': 'K9CH9DOH8d3EYOCwZalQZQ', 'text': 'Aloha Kitchen - a true "Hole in the wall" or "mom & pop" type of place. I\'ve driven past this place many times and always said I wanted to give it a shot. Finally I did with my g/f and it was a joy. The ambiance is very chill and relax. But you come here when you want to eat good food. Good comfort Hawaiian with a bit of Asian flare.\n\nThe mix plate combos are the winners here. I guarantee you won\'t leave the place hungry. So are the specials. \nThe Manapua or pork buns(Sipao) are me and my g/f\'s favorite appetizers. In fact during Saturdays, if me and my g/f are out n\' about and we want to get something to snack on, we get the Manapua and some Spam misubi. LOVE IT! We both love spam  misubi and the way it\'s done here...Awesome.\n\nIf you are in the neighborhood and want to get a great meal with a very low key and simple place, come to Aloha. Parking maybe tight since it\'s a very small strip but again...you come for the food.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2014-04-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CfQT7aDQTP2n61zKLqaqjQ', 'review_id': 'jSEd2phBEiwA5LRaHiyH3A', 'text': 'Food is consistently good, very friendly staff. As good as island food gets!!!!!', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2014-05-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'T04vQvLzqU9MBOdnVWsyog', 'review_id': 'WCBNKOptlLlviBhY1-vAXg', 'text': "Aww Damn! This place....how did this one get by me for so long. The food here is fantastic portions are huge and service is wonderful. Had the beef and teriyaki chicken combo and it was ..... There has to be a better word than delicious it was superb. Live on west side and this is one trip that's worth the drive. Definitely one of my new favorites, it's refreshing to see a mom and pop business succeed..... Awww Damn!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2014-05-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 2}, 'user_id': 'cGXRyFLfsQKwTxGbeqQEpQ', 'review_id': 'sQBbW8YB2TsM7oBlZOKk0A', 'text': "OK,\nJust HOW DID I SCREW THIS UP!?\n\nOne of my all-time favorites here in Arizona-land and I don't have a review on this place?\n\nSay What?\n\nWith that said, let's get to it shall we? This is definitely a long time in coming!\n\nOne word here:  Fantastic!\n\nLook, I lived in the state of Hawaii for a few years.  After moving from paradise, back here to the mainland, I missed the food sooo much.  While I now live in AZ, I found this little hole in a wall called Aloha Kitchen.  Look, this isn't the place where you're gonna take a hot date, unless she's from Hawaii herself, but if you want real authentic Hawaiian type food, with a tad of Hawaiian atmosphere thrown in, please do yourself a favor and stop on by.  You won't be disappointed.\n\nMy favorite here, and I'm addicted to it, is their Teriyaki Chicken.  Simple, no fuss no muss.\n\nIt's a great place for a quick lunch or even a simple dinner.\n\nIf and when I ever move from Arizona, I'll certainly miss the food and people of Aloha Kitchen.\n\nRant Out,\nMahalo!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2014-05-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'PCLBPfdOkNpolkCI8_7C9A', 'review_id': '7XSXguud65tLAR786LzQ6Q', 'text': "I have no idea where the boyfriend found this place but he suggested for us to go here and we all loved it! \n\nI had the bulgogi and katsu combo and I loved the katsu. It came out hot and crispy. Bulgogi was okay because I was expecting it to be Korean flavored but it wasn't so it threw me off a little. I would go for the teriyaki next time instead because my boyfriend had that and it was amaze-balls  \n\nAll in all, we all enjoyed it and would definitely come back. The service was good and it didn't bother me that the decor was non existent but just wish the place was a little bigger because with all the tables, I felt a little cramped.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2014-05-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZxaRXfMpg6MTMyZazmYQtg', 'review_id': '4rq8wmPu5zO85XKiWbFWQg', 'text': "If it wasn't 110 degrees outside i wouldn't know I was in Arizona. This place reminded me exactly of a spot I went to in Honolulu. Food was perfect, atmosphere is laid back as expected, and the price was on par with the experience.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2014-07-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hn9YAMer6l5E4GFQKjTm2A', 'review_id': '0zOM2XnNTjUCI2H07bc_Gw', 'text': 'Stopped in for lunch on Saturday and this was the first time here. Service was excellent! Informative and helpful. We ordered the 2 specials to go and were out the door in 15 minutes.  The food was excellent. We had the lau lau and Hawaiian plates.  I was skeptical of the cabbage side dish but it was so full of flavor! Very nice surprise for a hole in the wall place inthe neighborhood.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2014-07-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CpiMuXc8yfxkQrbEt7tNrA', 'review_id': 'ycjvB4Jl6ANvcCsY2VwZow', 'text': "I've been to Hawaii a couple of times to visit an old friend who moved there. Whenever I crave a plate lunch here on the mainland like they do on the island, I usually hit up Aloha Kitchen.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2014-07-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '554F39EQ2C1v3uXC8yTMiw', 'review_id': 'mhHbAnOEwp9QehpXAZpADw', 'text': "We've been in Arizona for over 3 years, and when my husband and I need a taste of home (which is often!) we head to Aloha Kitchen. The owner is a local boy born and raised in Hawaii, and he had it down. The hubby and the daughter always get a saimin (noodles in soup) each, then we get Manapua (a Chinese steamed bun with pork), fried won tons, and then we each get a plate. My new favorite is the JR Special. It's fried chicken with the spicy-teriyaki wing sauce. Ummm. Husband gets the chicken katsu with bulgogi (thinly sliced BBQ beef). Yummy! They also have Aloha Maid drinks (which we grew up on!) and guava cake (which is amazing!). If you get the chance, go here.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2014-07-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'yy7KcZHaag2y8mknbJYEmA', 'review_id': 'w7DuuIEvJBmwCA0mU30-fw', 'text': "Good authentic Hawaiian food. Just like hawaii. I love how it's a family owned restaurant and the good is to die for!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2014-08-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'K76wyqlxDZboQv1icH4dfA', 'review_id': '0btwY0Cqbp2ekkyjfoiOEQ', 'text': 'Great food!  The mix combo plate with bulkogi beef and teriyaki chicken is my favorite.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2014-08-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'i-8jVgyJUkP6eolJJk7GtQ', 'review_id': 'Jx0uQ8Vmmn25vYJa-69Few', 'text': "So much food!!!!! If you even think that the regular portion might be too much, it is and just go for the mini portion. There food had good flavor and I love the sauce. The only thing is the steak was kind of fatty. But hey that didn't stop me!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2014-08-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VPVirUfXX2Tzq6N1AzF-8w', 'review_id': 'ETapluUytTECor9vGtziXw', 'text': "This place is bomb! The JR specialist my favorite. Sometimes is better than other days and sometimes it's different. It depends on whose cooking the food! It has it's pros and cons. But over all, the service is great. And the food is okay!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 3, 'date': '2014-08-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cUeFrgBzMhRjOb_6CeGpYg', 'review_id': '4XjzZAlA5fTQP4e5Ck738g', 'text': "They have Manapua! The girl told us it's hit or miss on whether or not they have it, but we got lucky. I also got the Kalbi plate which was a bit overpriced and very fatty, but had some of the best flavor! Just a heads up - bring cash for a tip, their card machine doesn't let you add it on.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2014-09-07', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': 'z-BZgr0IELPNFXRUIGojCw', 'review_id': 'QQX1E8mS8-uTUey-DIkF3A', 'text': "Aloha Kitchen is Mesa's best kept secret.  I've been coming here since I was a toddler (so about 20 years! !) It's my favorite food in the world, literally better than anywhere else. I always get the teriyaki chicken plate with the potato mac with a manapua, yum!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2014-09-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'IS0WyCkOeSXbEzSmASW9EA', 'review_id': 'IA6BPX9MTVpuVon78Xs_rQ', 'text': "I can't get enough of their manapua. Or, really, anything. The food here is delightful. I love the coconut shrimp, the chicken Katsu is mouth wateringly scrumptious, the bulgogi is always delicious... heck, even the salads (green or macaroni) are yummy. You'd be best served to arrive early if you want manapua... they run out from time to time. But really, that just gives me another excuse to come back.  All this for a reasonable price, to boot. Aloha Kitchen, I'm always happy to see you!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2014-10-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'WYZhXxZKgrlGlM6zRtYm5Q', 'review_id': 'HFlSbrXE3XRRVp8M9btsGQ', 'text': 'The mini plate is definitely more than enough! I lovee the Bulkgogi beef. Only thing that disappoints me is they only have dark meat with their chicken dishes, which is a bummer because I only eat white meat! But the beef definitely makes up for it!', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2014-10-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'o5XFz5kf7egnoa2PA-53oA', 'review_id': 'niL-wY3v0tzHvLVTA2L_7Q', 'text': 'Glad we found a nearby place to fulfill my chicken katsu cravings. Staff friendly and offer to go menu. Wish they had apple ice tea! Nothing fancy but portions are decent for what you pay for.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2014-11-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'QhfaeEbQFaiNeiZS5nEM7Q', 'review_id': 'jpzrDVYvHVgGZjdlUgBhvg', 'text': "I don't know what all the fuss is about this place. The beef bulkgogi was dry and salty. The manapua was very flavorful and soft but the only thing that saved the meal was the saimin, it was unbelievable. Otherwise this place maybe gets two stars. I was there on a Wed. night around dinnertime it was packed! This was my  first time here. I don't know if I will be back, maybe if I lived closer, or maybe when I get cravings for saimin.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 3, 'date': '2014-11-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'sAgfMMshIfoy-mbRS1WjMA', 'review_id': 'QYDvr1Ef3NS_LhobdKds1g', 'text': 'I love Aloha Kitchen. Been coming here for years. The chicken katsu is great. Highly recommend. Make sure you bring an appetite. The mix plate portions are pretty big.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2014-11-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bbgZi4r3lTQGyY0M9dOsjg', 'review_id': 'uhMz0wLfOyYSW9BLLSSAHQ', 'text': "It's not just great Hawaiian food, it's just great food. Period. Everything is so fresh and authentic with lots of the specialty ingredients flown in from Hawaii. There's a reason this place has been here for 28 years!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2014-12-06', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 4, 'cool': 2}, 'user_id': 'RFpApVLkcVTU-aC6UteiLA', 'review_id': 'WL_LCz7JxWZxCqyZ_Q5aUw', 'text': "If you have a hankering for Hawaiian cuisine, this is seriously hands down the best place in town. When I'm having a bad day, this is where I go for comfort food. They have plate dishes that are consistently the best, and specials that are so good they sell out practically every single day. \n\nIt's been owned by the same family for as far back as I can remember, and they really take the time to get to know their customers and let them know they appreciate their business. Seriously such a hidden gem, I can't even begin to tell you how much I love this place!! Chicken Long Rice on Wednesdays and Saturdays keeps me coming back year after year. \n\nWorth checking it out. Support a local business and your appetite will thank you for it later!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2014-12-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'eLwTl7CTvx10D1sFy7IX3Q', 'review_id': 'V8D4ZC8zeoJ4Pdug3GFrnw', 'text': 'Foods always spot on delicious, I frequent here multiple times a month and it never disappoints!  Friendly staff and Family run!!\n\nSometimes theres a bit of a line but, its well worth it!!', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2014-12-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '66oDhsKSB_eSrhCKiERDow', 'review_id': 'Wn6aS4HIwXLUJGmqyhpc6g', 'text': 'The only place besides the L&L that closed down in Mesa that I have found saimin (haven\'t been to Happy Valley L&L).  Unfortunately, sometimes the broth is WAY too salty (like inedible, makes you sick to your stomach salty) and the filling on their wonton is too "crunchy" when soft in the saimin (Water chestnuts inside?  The filling texture is fine when they\'re fried...)\n\nThe fried wonton are tasty and the spam musubi are delicious.  They seem to run out of musubi fast some days though.  Even with their specials, their menu is very limited, so don\'t expect anything similar to Rainbow\'s or even L&L.\n\nWhen I last came in they had done a refurbish/redecoration on the interior and spruced up the walls.  If looks better than what they had before.\n\nDefinitely a step above the likes of Ono Hawaiian Barbecue.  If only it wasn\'t so far from me now!', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2015-01-08', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 5, 'cool': 3}, 'user_id': 'RlkX7bgqg_q8aSOCVtNcJw', 'review_id': 'yCgTGx8XnuFUCpb5cb_3Ng', 'text': "I gave this place 2.5 stars. \n\nBeing a fan of Hawaiian BBQ, I was excited to check out this place after reading all these great reviews. However, I was quite disappointed with my visit. \n\nFirst off, the ambient looks old and tacky. The servers' straight faces while interacting with customers didn't help. I felt like they could care less about what they're doing there. \n\nRegarding the food, I wanted to try the manupua but they don't offer it on Sundays. Additionally, when I put in an order for fried saimin, they didn't have the charsiu originally (or spam to substitute either). So I ended up with a mini order of chicken katsu to go. \n\nThe food came out really fast. The potato - mac salad is indeed flavorful and addicting. Chicken was crispy from the outside and juicy inside. Although it's a mini order, the portion is really good for the money you spent. I also like how they have two self-serve stations of water, one regular and one is cucumber infused. \n\nOverall, great food and portion! Not so impressed with the ambient or service though.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 2, 'date': '2015-01-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'pwvXT_0YQ7nAkNPQZO2x6g', 'review_id': 'fElZ16M68-qc20c2VBwx2g', 'text': "I love Aloha kitchen, I've been going for the last three years now, and it is fantastic. I always get the beef bulkogi, with a side of coconut shrimp and teriyaki sauce. The beef bulkogi can be hit or miss, where as the teriyaki chicken isn't necessarily as good, but is more consistent on taste. I love this place, and will go for years to come.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2015-01-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'gE9OAeJ_IXY575wmI-8YEg', 'review_id': 'TJYO2E0M_QLW5wwW3ZJQ3Q', 'text': 'One of the only places to get manapua and kalua pork around here. Authentic Hawaiian! So good.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2015-01-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'O19ZfP4icfRmaXxXDplVsg', 'review_id': '4hUdA4wOKPRKTdu5ngd-Xw', 'text': "Decent Hawaiian BBQ. Giving 3 stars because it was comparable to franchises such as Ono Hawaiian BBQ or L&L.  I expect mom and pop shops to be more unique in flavor and this just didn't have that extra kick I was looking for. Siamin bowl was bland and broth was salty like the packaged ramen noodles.  Mixed plate with bulgogi and teriyaki chicken was good and portion was plentiful. Friendly and clean atmosphere.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 3, 'date': '2015-01-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'lsfiWIQgU1AJULRJGDkFqQ', 'review_id': 'UeIJu7VzaGafLO0k85B0Ww', 'text': 'i don\'t get what people see in this place. dreary ambiance, stifling and muggy air (no airflow and circulation), inefficient staff (but nice) , average to below average food, weird and strange customers, blah, blah, blah.....katsu chicken was a greasy cutlet of breading with very little chicken served with cocktail sauce. i thought i was at pete\'s fish and chips. rather than the "eat at pete\'s" bumper sticker i\'m going with the "aloha aloha kitchen" sticker. as in hello goodbye kitchen. never again', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 2, 'date': '2015-02-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'n2GuphLflReQrxT8vt4RwA', 'review_id': 'IM-za25sRFr97dTE2UIrsg', 'text': 'Amazing I have been going here for only a few months. Every time has been excellent ! Quick service quality food !', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2015-02-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FEJt4rZgikhJqPXnnyld_Q', 'review_id': 'XugcwvNyAjuAch1f3-ne-Q', 'text': "Can't go wrong with their mix plate #3.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 3, 'date': '2015-02-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'CvA_6YUEItww4DOEd-cZfw', 'review_id': 'M4CQQ81_wr0uZIl9qkBu7w', 'text': "I used to eat here in high school..i graduated 2001..lets say ive been craving it ever since...theres NO Hawaiian restaurants in the tristate ny nj area....google maps says it'll take 35 hours to get there if i start now...thinking about it.. :)", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2015-03-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6yTkDWCDGGH_5-Pr165WUg', 'review_id': '--ogX6BW5GMB2tktSOlvwg', 'text': "This is a local joint for a quick bite of meat and rice and you should give them a try, good food. They have good cake and cha sui bao too. I love the options of mini plates. Honestly the serving portion is too big in most of the restaurant in the valley for my petite size so I can order anything here and not feeling like I need to take the leftover home for the next day as I don't like to waste food. The restaurant is clean and the food arrived quickly and tasty.  I ordered the teriyaki chicken and hubby had the Katsu chicken.  Both dishes were excellent in flavor and taste. We will be back again please don't change anything We love you the way you are. :)", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2015-04-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bRRaxW93FgLFSpUrV6DJsQ', 'review_id': 'pRCq0qGrLsl5ryJn7yifOw', 'text': 'Been coming here for 5 years and the food is very tasty. Always recommend them. \n\nCons: dining room looks old and staff could show SOME enthusiasm. :) \n\nThis place is under marketed ... More for me.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2015-04-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'UIn5YbjNZQeDNB3ZqyO5LA', 'review_id': 'BrlqRgG-tlgM-7TRV6oN9w', 'text': 'Soooo good!!! Aloha Kitchen has amazing Hawaiian food, friendly people, all in a cute little restaurant! It\'s a charming "hole in the wall" - in the best way! Try the teriyaki chicken - amazing! And their cakes are out-of-this-world. Yum! I\'m drooling just thinking about my lunches there!', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2015-04-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nDQwe1OZLY83Xjew_EcdEg', 'review_id': 'xGnucwAtv9wJ7y8TG2gRjQ', 'text': 'Got say...my wife and I loved this place its awesome!..very friendly staff and the food was very good!..I will return...', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2015-04-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'maUtMEgvC87VZvoUMbmDLQ', 'review_id': '5eJWBXw7gRaT9I9m6PodRQ', 'text': "I work in the area and there's a really good Hawaiian BBQ place nearby. I discovered this place by people in my building were talking about this place, so I wanted to give it a try. Well, I'm glad I did. This place is excellent. Friendly staff, mom and pa operation.  Outstanding food. They have variety of mixed plates, soups, and great salads. I always get mixed places, they consist of Katsu or teriyaki chicken or their beef. Macaroni is good and you get two scoops of rice. Great lunch spot, check it out.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2015-04-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZLklUKILujnaPvPeGOTZCQ', 'review_id': 'mKjeYJpM7msenUIgVGFJYg', 'text': "Truly delicious and close to authentic Hawaiian plate lunch you'll find on the mainland. Ono's is a great Hawaiian plate restaurant but aloha kitchen stays true to it's menu without getting too franchise-like the way ono's has.  Pork bun rolls. Chicken katsu. Teriyaki chicken. Potato-macaroni salad. Bulgogi pork. Even the cucumber mint water in the dining room water jug is fantastic. Hidden gem in mesa too.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2015-04-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nDQwe1OZLY83Xjew_EcdEg', 'review_id': 'Up9qkqUFV2cUmZ4ZaObnnQ', 'text': 'Got say...this place is awesome!..very friendly staff and the food was very good!..I will return...', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2015-05-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'dqmXlUQyDh6d5U2_Zjb-Iw', 'review_id': 'ot59vuCF64H54cvrCnqPzg', 'text': 'Tried it for the first time . They were very busy on mothers day.  We tried several dishes starting with coconut shrimp.  The shrimp was a little salty and could have used more coconut.  The beef was like Jerry and very salty. The teriyaki chicken was overcooked and salty. Service was slow. Best part of the meal was the chocolate cake', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 3, 'date': '2015-05-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zz4iaqRAIT-wju1J8wicgA', 'review_id': '5Sxs4hpIc_iNjSRAZvly3Q', 'text': "My guy friends from Hawaii raved about this place so much, that I finally had to join them and I haven't ever looked back since. This place is in a strip mall that most drive by without noticing. I love love pretty much everything from them. I will cry from time to time, let's be honest, monthly, when I can't get my hands on their Mac salad. Any other Hawaiian place in the valley isn't as legit as this place.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2015-05-20', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 1, 'cool': 1}, 'user_id': 'sHeD1MXfvJsLSOd9vwQyBQ', 'review_id': 'Ns-nPJC8Jnvzqr1Ma0QDaA', 'text': "Dis place stay serving local kine grinds since 1986 - that stay last century, bra. Everybody else went come late to the Hawaiian BBQ/plate lunch gravy train. L&L was one contendah but now they stay gone from da east side (still get da one in Flagstaff - oops no wait I mean North Phoenix). Ono Hawaiian BBQ, Moki's, Golden Hawaiian BBQ - they all ok but dis place stay da real deal for decades now. When dis blala get homesick dis is da place fo' kaukau li'dat. Even the staff working here speak da kine - pidgin to da max bra, buncha tittas and mokes. That's authentic, bra, I no shit you. So my favorite here is da combo #2 mix plate. That's da one with Chicken Katsu (deep fried chicken cutlet that they went chop up li'dat) and da kine - bulgogi (yobo kine marinated beef). Plus two big blala portion scoops rice and macaroni salad. Many places make da macaroni salad mainland style - this stay Hawaiian style, bra, cannot compare. For drink I went always get da kine Hawaiian Sun juice drinks but now opu too big so gotta get da kine water bottled in Hawaii and blessed by Madam Pele instead. Dis last time I also got da kine, Manapua. Was good - you can get something sorta li'dat if you go eat da kine place dat serve dim sum. Dis one remind me of da kine I used to get fo' twenty five cents from da truck dat came to my school fo' sell dat and rice cake to all da keikis way back in hanabata days. I went come with some folks from my workplace. Da wahine I went come with tried to order one Salmon salad. I went tell her you need either da kine glasses or da kine remedial reading classes. It's Saimin not Salmon. She went give me stink eye - bra, I was just trying fo' help li'dat. Anyway, dis stay part of da lunch rotation li'dat. Plenny parking, bra - same mall as da kine pizza place - Nello's I tink. On weekends they get mo' betta selection - poke and laulau li'dat. Check it out, bruddah! Mo' betta than pig, mo' betta than poi. I give this place da big shaka sign. Hawaii!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2015-05-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'wU1-l1rOlQ0gHzYFnFv-8g', 'review_id': 'rLfN-8LkarVdHrTGVXPQCw', 'text': 'I had ordered the bolgogi beef :)  To be honest it tasted somewhat like soy sauce or something similar.. maybe teriyaki..  I like my bolgogi with a sweet ginger flavor and a great sauce.  However it was still good and Ill be back again!\n\nTry the tea with your meal..  yum.\n\nI wish they had kalbi short ribs!  If they do at some point I would be a regular.  \n\nWould have been 4 stars if everything wasnt served on styrafoam. :)  And please put more mac salad on the plate.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 3, 'date': '2015-06-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'f3ffIxQGD3r9W44yHrPmog', 'review_id': 'Oe12FXHWQagCh2KC966uNA', 'text': "Have been going here for more years than I can count. Their manapua's are awesome but they don't serve them on Saturdays! If you are looking for fancy: don't go here. This is a low key, laid back place that serves amazing local food.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2015-06-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'K76wyqlxDZboQv1icH4dfA', 'review_id': 'vYzF5IKGHTSsbx4Us5aM0A', 'text': 'Still the ONLY Hawaiian food place that sits well with me.  They are amazing over at Aloha.  Really nice people as well.  Wish they would deliver!!!', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2015-07-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'aPzzylbvgH8MmqBgKO6xBg', 'review_id': 'HdD1UnAlFKG9Q55X-XdXOw', 'text': "I've been going here ever since I was a little boy and it never disappoints me. Every one is so nice, and the food is amazing! Cheap and tastes good, I usually get the mix plate with chicken teriyaki and Katsu, with potato Mac and a couple manapuas!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2015-07-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Q0sP7SBxCi2vyhBBNaZiWg', 'review_id': 'zXXad0D4rWDKkdLBlhkMmQ', 'text': 'Amazing plates here!', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2015-07-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'VnIR7hgjrGTyKLDcL_4oHw', 'review_id': '7OHm1lMO_ZDD5RTNFvrfjQ', 'text': "Hands down best Hawaiian food I have ever had.  This is legit.  It's home cooked Hawaiian food.  Try the bulgogi and the katsu chicken.  It will blow you mind.  If you are starving and want a pre dinner or maybe just extra delicious foods get the manapua.  This is a sweet bread bun with sweet and sour pork inside.  I'm getting hungry just writing this.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2015-07-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2lamo0Ug4YGLolVlN3Yi5w', 'review_id': 'tCy_qH49WHV78DwWaNqIFw', 'text': "Wow this place is on my top 10. I truly feel like I'm eating home cooking. I've been twice in the last two days and brought in a few patrons who also enjoyed it. I got the katsu/chicken teriyaki one day and katsu/bulkgogi the next. Their macaroni potato salad is amazing and I don't usually go for it.  The rice also was well and had good flavor with the teriyaki all in all a ton of food for a good price.  Don't forget an authentic Hawaiian drink in the fridge", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2015-08-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '6yFQRiVrbs72fdKF0d2ISg', 'review_id': 's9n1SfJdY8MlYkQNax0PGg', 'text': 'Delicious food. Love the teriyaki chicken and sweet and sour chicken. Everyone in there is always so nice.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2015-08-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'nBPUcVAeQNtnRh1GomxmVA', 'review_id': 'AxH3e53J8YkV57gPRsI6ZQ', 'text': 'Fantastic and authentic food from a local small business. Good stuff, worth trying; worth repeating. Very reasonable prices as well!', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2015-08-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BClR7Tx4RpDn3DjiBe2JnA', 'review_id': 'S8DeWS3CdrZX_ZVXGdSWng', 'text': "Looooove this place! Blows the other Hawaiian places in AZ out of the water! Prices are on the low end and two can expect to eat for about $23. Only critique I have is that they should open later than 8p. I can't tell you how many times I've been there till close and there is a line till the last minute", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2015-08-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IHMP7pN0D4W_CcIr9ff95Q', 'review_id': 'KibH1i4fjgfM8hS9h0ekzg', 'text': 'I love the food at this place.  One of the most authentic Hawaiian restaurants in the valley.  \n\nI highly recommend the food at Alpha Kitchen to anyone craving "plate lunch" from The Islands.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2015-09-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'eyk_XU4ZsayAnr4eUtPtEQ', 'review_id': 'bb6JvCD8OcCxDKhQ7_Aj4w', 'text': 'This is the best Hawaiian food I have had in Arizona.  We usually go once a week to pick up dinner after work, usually ordering to go.  I have only had to wait for my food once, but the whole restaurant was packed on a Saturday for dinner.  We will continue to eat at Aloha Kitchen for every Hawaiian meal we need.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2015-09-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 't1fY5oWqySBabKWnuf5wPA', 'review_id': 'AveHlz4lEocwdGsjJMkF5g', 'text': 'So delicious! Very fast, friendly, and delicious:-) teriyaki chicken is the best in my opinion but everything Ive had is great', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2015-09-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qZfuiT14MOrU1fH9AARBfA', 'review_id': '2PJyIGzoAz3Afh67v_G56g', 'text': 'We love this place and travel from Gilbert about once a week to eat here. IMy boyfriend always gets the Saimin and I always get the coconut prawns with teriyaki chicken, it is amazing!', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2015-10-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'rJwBvKQ2MKme0c7lmpdyFw', 'review_id': '_K9LPNAr5kdT7U5HoMBzvg', 'text': 'FANTASTIC!!!!!!  Pricing is great as well.  Many a Loco Moco I have consumed and this one was rad!  No Hawaiian food in Santa Fe so this turned out to be a real treat.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2015-10-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '14zExR4sZj-J32rhLJVPaA', 'review_id': 'Ahb7agFHJQaKKISBYyzzcg', 'text': "The reviews were super great for this restaurant and I agree. You want to eat here. I had the coconut shrimp and teriyaki chicken plate. It was so good and the price is reasonable! You will not leave the table hungry. And when I closed my eyes I thought I was in my favorite place on Maui. A big hug to the cook! I will be back. I can't wait to try something else to eat here.\n\nMy only negative is the staff began to spray and clean tables near me and I could smell the cleaner instead of my food. This is a big big turnoff for me. I don't want those chemicals in my air or food. I want to smell and taste my yummy dinner!\n\nGet there early since this restaurant closes earlier in the evening. Parking is a little crowded, but be patient you'll find something.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2015-10-04', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 3, 'cool': 0}, 'user_id': 'H_LkqiUY0FtNMJ6qWYZP-Q', 'review_id': 'P66bAuCJb36lU20x8lDoFA', 'text': 'Two stars for the chicken... I am glad I read the reviews to prepare me for my experience. \n\nWe walked in and the cashier is standing behind the counter with her hands on her hips, just staring. So I said, "Hello, were you waiting for us?" She just continued to stare with no reaction.\n\nWe ask, "What\'s good?"  She says, "I don\'t know."  A long pause then says, "Do you have any questions?"  We replied, " We just asked you a question."\n\nOh boy.... So we decided to share a meal. \nThe fried chicken strip things were good and thats about it. \n\nAnd she brought us our food and said if you want an extra plate they\'re over there. Oh you mean over where you just walked past the extra plates. \n\nDon\'t think, pretty sure we wont be back. Mostly positive I will not be craving anything on the menu.....ever. \n\nJust being honest. When service is this bad personally I don\'t think it is worth the experience.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 2, 'date': '2015-10-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5Vv7wl3lsJyfprgaYW52sA', 'review_id': 'GXVXDyx8BKHzUtNbBVx1fQ', 'text': "Amazing food and generous portions. Great staff and clean dining area. I like the rice topping. I see why they've been there for 30 years.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2015-10-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qKfceRHpoYNIDV1HryX_hw', 'review_id': 'kjR72-XS13_xCP5r8bT4Xg', 'text': 'Sooo Big\nSoo Yummy\nSooo homey\nSooo friendly\nSooo Alohaaaa\n\nSooo Big\nSoo Yummy\nSooo homey\nSooo friendly\nSooo Alohaaaa', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2015-11-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'zZo9OxSQEMitg0g7aG-N6Q', 'review_id': 'AuF5PMtObKfRilJ_mFsUYQ', 'text': "This place was pretty good, the service was alright I felt pretty rushed when I was trying to order. The lady at the register wasn't  very welcoming. If you want poke or musubi they sell it on certain days. If you're looking for some great Polynesian food go to Ono's Hawaiian BBQ. It's the closest you'll get here in Arizona besides Aloha Fest in March at Tempe Town Lake.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2015-11-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'bkR1tRtCi5ZG4qbdYM-LYg', 'review_id': 'cpPgUxoZWxJD6Ez4e4bDdA', 'text': "Aloha Kitchen has yet to disappoint. My coworker introduced this to me for lunch, and oh my gosh, I couldn't be happier. \n\nThe serving sizes are GIGANTIC! He and I often split the Mix #3 (I think) with teriyaki and katsu chicken. This is accompanied by two huge scoops of rice, and your choice of side (I always go with macaroni salad). To top it off, you get a slice of fruit. Definitely some bang for your buck happening here.\n\nThe other day, we tasted the pink guava cake, and it was quite tasty. There is a gelatin-type layer on the top, which is tricky, as I expected it to be more like marzipan. However, this is not a bad thing, Definitely a fun treat (and bonus, it's pretty).\n\nThanks Aloha for helping me break out of the Subway/Jimmy John's lunch rut I had been stuck in! I'll be back soon.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2015-11-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'NmLJmbkM3WMLxY9f5ymGGg', 'review_id': '8JapozLzMoR896O5TDZGtA', 'text': 'Honestly some of the best food around...staff is always very pleasant and helpful. Lots of food and prepared quickly. Very solid establishment! Makes me happy just walking thru the door!', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2015-11-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'C3CZUpMizOPOqyPe7UKZXQ', 'review_id': 'uVbIgtzXNiWaa7XmcKvRfQ', 'text': 'My favorite piece of Aloha in the desert.  We drive from the far West Valley to eat here. Wish we could duplicate them, but no other compares. :)', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2015-11-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IKXRvnZbGLSGjri3-U83Kw', 'review_id': 'atcjvMZgi2HoGxwsXDVJmw', 'text': "What a fun place!  We were visiting Mesa, and chose Aloha Kitchen based on the Yelp reviews.  What we got was great food, tons of it, and a spirit of aloha!  Will definitely return if we're back in Mesa!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2015-12-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'WLESCgnX2abpip3e57IqgA', 'review_id': 'slg6lxsUYBKG0Tc0veI6QA', 'text': "Some days it's good and some days they seem stingy with the portions of food in the plates, I guess it all depends but it's good just depending on how they prep and pack your plate.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 3, 'date': '2015-12-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hvCW6zaQWeKqwnsoPR2uew', 'review_id': 'A8rgI8vJCp1YyBQPiAuXDA', 'text': "Love coming here! The food is always great and the prices are good too! Good place for lunch friendly staff and very clean. I always get the teriyaki chicken and coconut shrimp combo it's excellent! Big portions and comes with have choice of garden salad or macaroni salad and 2 scoops of rice. Kid friendly and kid approved food!", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2015-12-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QxayvgVgaYzv_ai9U3bBGQ', 'review_id': 'up8WODUt9Vfzyi0tXnadEw', 'text': "I randomly checked this place out for lunch one day after being told good stuff about it. I definitely would say the food here doesn't disappoint. I got the bulkogi and chicken katsu platter. Great flavor and even though it was lunch time the wait time wasn't long. This is a small restaurant so can be hard to miss and fills up quick. Especially at lunch time. So when going for lunch get there early.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2015-12-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QydICLYBSHbfxO5rXG0jXg', 'review_id': 'QshIKIv3oGjIhUaf53dVWg', 'text': "Best Hawaiian food ever! We will be sure to come back next time we're in the area.", 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2015-12-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'fGDxzST95OS2rAEnGiq8nQ', 'review_id': 'KzM6i93wuZ7Tj5750v24yQ', 'text': 'Decided to try this small Hawaiian spot. Walking up to the counter the ladies were all super friendly. I got the teriyaki chicken to go, which service was surprisingly fast and great portion for the price. The presentation even for the food to go was really nice, not to mention everything tasted super fresh!!! I will defiantly be back!!!!!', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2015-12-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yqYVE82cgrfTVRlnhmVcxA', 'review_id': 'ESSlNGdc95fDwts0MWRW4w', 'text': 'I would give this place 3.5 stars. The staff is really nice and the place has a good amount of tables and is clean. The food was just okay though. The macaroni salad had too much mayo in it and the meat was a little red and burnt too. I got a mini bulgolgi plate.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 3, 'date': '2015-12-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Hn5kxQQ4dyjiBsvOgO6v5g', 'review_id': '1IBaqsbOV_Y6U51XiPi-hA', 'text': 'Ridiculously good.  Probably the best meal I have had in sometime.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 5, 'date': '2015-12-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'rSWimK97bWVw9nEDw1AE1g', 'review_id': 'xMVKcZhrVp7nt41X140mhQ', 'text': 'The food was pretty darn good but too much Styrofoam is being used. Styrofoam plates and cups. Plastic utensils. That stuff is lousy for the environment. It takes like bazillion years for it to get into the water system.', 'business_id': 'vIDQO_9Ytf10vEndDOih8Q', 'stars': 4, 'date': '2015-12-22', 'type': 'review'}
