{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'Puv7uq6Wx4AtL_jVpC4d3w', 'review_id': 'dUP1IlsJAfUH5AoTrqpL-w', 'text': 'Picture yourself on a line with a mix of people of all races, all economic backgrounds... you are tugging at your shirt, praying for some airflow in the hot North Carolina summer.  You step up to the counter and an older woman with a hairnet grabs a pad and you say "White meat chicken dinner".  She says "Quarter or Half?"  You look at your waistline, and retort "Half - white meat... and a sweet tea please".  She reaches back behind herself and grabs a white cardboard box among stacks of boxes.  You can see beyond her that fry cooks are frantically throwing things into these same boxes.  She approaches with the box, grease stains abound and you pay and leave (there are no seats here).  You can\'t believe that your mouth can create this much saliva as you race back to your office/house/school/park.  You tear open the box to find deep fried nirvana.  Crispy, golden fried pieces of chicken with succulent meat that falls off the bone, french fried potato coins, fried hush puppies, cole slaw and a dinner roll.  They usually include two or three napkins in the box - grab a few more....', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2005-09-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'K5dxGhJ99TmS6La6krwkcg', 'review_id': 'U3E9tXyJ0aGaPqTewIdgQg', 'text': "Price's is great because it is a Charlotte legend.  The chicken is greasy, the tea is sweet, and the potatoes come in tot form.  The only draw back here is that they arent open for that many hours and are closed on Mondays (I think on the weekends too).  Price's will always remind me of my elementary school picnics in Latta Park.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2007-02-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'AJtc4UMsCDw8QJQMyfHa_w', 'review_id': 'i7FHZF_l57P8pTBqRQP4FA', 'text': "This place is known throughout Charlotte for having the best fried chicken around, and I have to say that I was not impressed.  The line is long, and for the wait just wasn't worth it.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 3, 'date': '2007-05-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jY5lDpTGBNYvpMu4hJCIkA', 'review_id': 'JAJPZPBx4WbEbug7YMRVRQ', 'text': "Best fried chicken in town...but, seriously, I can only eat it once every few months.  Let's just say...so much grease and fat, I can actually hear my heart clogging up.  But if you know you're going to need to take a double dose of your cholesterol medication, then it's nothing but good!!!  Also, this is probably the only place in Charlotte that I'd say you WANT to go during the rush of lunch.  There are some true characters both as patrons and employees...go, stand in line, check things out...but be ready to order when you're up!  They will not take any delays so just be prepared.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2007-08-06', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 1, 'cool': 1}, 'user_id': '71Gnwsn6XGae6n1PEu72ng', 'review_id': 'ToWk2BZqLMxoP3t9Pr_JaQ', 'text': "Man this place is so overrated. The gas station on south and east has way better chicken!!  I'm also not a big fan of their potato rounds(the gas station has wedges).  I also feel like I'm in 1950 as the two cashiers are white old ladies and the 7 people sweating in the kitchen are all black.  There is also no dining-in.  Not thats a problem with me, just giving the heads up.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 3, 'date': '2007-08-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GlCyezPQqiuTxtbYmo2WFA', 'review_id': 'vwai-4TvRr5Hui0UMG_IVQ', 'text': "EXTREMELY greasy. I felt like I was doing years of damage to my body by eating the fried gizzards here. \n\nIt is good though, don't get me wrong. Like another reviewer said, you can't eat here every day (unless you want to be obese by week's end).\n\nAlso it is very cheap. You can get a full meal with sides for under $10.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2007-08-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nvHggLuzeJSufcpNEI49Mg', 'review_id': 'ugyaQ350MYJ8cN2-0G0MNQ', 'text': "Price's is one of the few places in Charlotte where you can find a cross section of every demographic within the Queen City. There's a reason why this spot has been in business for as long as it has, the food is great. Price's has been featured on the Food Network as well as major print publications and there isn't anywhere in the Metro Area that you can find a better Fish Sandwich. ENJOY!!!!!", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2007-10-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'M6p6vdtm_zLoFetbaTj1lQ', 'review_id': 'PqMDsPSq3zEYZm0pOomBHA', 'text': "This is about the best friend chicken you can find.  I think they brine the chicken first, because it's got a salty flavor. Chicken was crunchy.  Hush puppies were to die for.  Really good.  \n\nPS - Bring cash.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2008-02-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': 'QZI_yB4_up2CJ1QnLwKVog', 'review_id': '2cgzywnuivx2AZNz79S9iQ', 'text': 'Nothing better for my tummy than a box of fried stuff. Chicken (dark meat of course), tater tots, and fritters all in little pizza box to go. Killer....though my tummy said he would have to add an addition if I ate there more than once a month. \n\nEnjoy', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2008-06-01', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'YCJH2ytVOKH9VTXOrVEqCg', 'review_id': '_2XdRwzmf1LjxUIYyacDHg', 'text': "Oh this chicken was so finger licking good. It didn't taste like it was processed with chemicals like KFC does.  This place was hella buzy on a Saturday afternoon.\n\nMy only complaint is that I got a chicken burger which is actually just a chicken leg (with bones) put in 2 buns, so I had to pull out the meat.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2008-08-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'bncphLxDEF6gFGvFXuYwDQ', 'review_id': 'T9axVAtFuq90E6NId1lXIw', 'text': 'Greasalicious.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2008-09-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '8ED8BPCXKXZnGsVMyl5Bhw', 'review_id': 'vsYd2w1KvPi6hT5DonNxUw', 'text': "I don't eat meat, but I eat at Price's for the sheer anti-glamour. Their potato salad is other chicken fixin's remind me of eating at my mom's church on a Sunday afternoon. It might not be great for a pickier vegetarian, but I've made many a meal out of potato salad and slaw and the greasy glow of lips of my loved ones. It's worth going just to see what the hype's all about.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2008-09-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'bSH9mL1WMDbQtLEpqcj9HQ', 'review_id': 'oiR3VWlf8dATL04RV1Zx0g', 'text': "This is the best fried chicken in town! Whenever I go during lunch, the line extends out the door onto the sidewalk. \n\nThe only reason I didn't give it 4 stars is because they don't accept credit cards and I wish they'd offer fries instead of tater tots.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2008-09-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ITwewV_k1EcFgxfWNlssqQ', 'review_id': '7SVLGtfN3Nln8pBxrd0rzg', 'text': "If you're within two blocks of this landmark restaurant, it's likely that you're being lured in by the smell of tasty fried chicken. The lines can be long and overwhelming, particularly on sweltering summer days, but once you get your cardboard box filled with fried chicken and sides, it's worth it. \n\nKnow what you want before you get up to the counter and have cash ready. They don't take plastic. Also, there's no where to eat at Price's. You'll likely be tempted to start eating the greasy meal in your car.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 3, 'date': '2008-10-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nHsj0cHOiroAsmDfF50BtA', 'review_id': '-mXL_7CkBKcu6OKh9d5SCw', 'text': "I'm not a big fan of fried chicken (I prefer the chicken breast off the bone), but there's ALWAYS a line at Price's, no matter what time you go past it, so we had to try it.  Plus, I'd heard rave reviews for their chicken.  \n\nThere's no seating (it's all take-out) and they close early for dinner (6:00 p.m.), so you'll need to stop on the way home from work if you work 'til 5:00!  \n\nAnyway, we picked up some fried chicken one evening and brought it to Freedom Park to eat on a picnic table.  It made for a nice summer picnice and, for fried chicken (which I already mentioned I'm not a big fan of in general), it was very good.  It had a lot of flavor and everyone enjoyed the casual hands-on dinner.  We tried the potato salad, too.  It was also good (although we didn't use our hands for that).  \n\nAll in all, if you're a fan of fried chicken, Price's is a good place to go.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2008-10-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'OS35HwesZaL6v0fqnLACLA', 'review_id': 'B6Bq84cr_JwW4OnBQnz6xA', 'text': "waiting in line to order is a treat -- you never know whom you will meet.  often, there seem to be 50 people ahead of you in line (on line for New Yorkers), but the line moves quickly.  The chicken is the apotheosis of fried chicken.  If it's going to kill you, it needs to taste this good.  take out only", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2008-11-02', 'type': 'review'}
{'votes': {'funny': 5, 'useful': 6, 'cool': 1}, 'user_id': '-_1ctLaz3jhPYc12hKXsEQ', 'review_id': 'hg4lQYf3jyQzZjxFjnr1Bw', 'text': "I have to say that Eric is about as spot-on as it gets.\n\nI don't really like fried chicken with bones either.  I'm a breast (no bones) man myself.  But I love me some Price's chicken.  That's how good it is.  There's nothing quite like forcing yourself into that mass of humanity and coming out with a greasy box of chicken (and fixin's) and running through the meadow to your family in Freedom Park and digging in.  Unfortunately there seems to be less chicken in the box when you arrive at the park than when you left.  I don't understand how that works.\n\nNonetheless - it's greasy.  That's what makes it good.  Deal with it.\n\nThe Coop doesn't close at any particular time, no matter what anyone says.  They close when the chicken runs out, so if you want chicken, you get there early.\n\nIn other words, don't get your underwear in a bunch to get there just before the doors close, because there is a very good chance that it's all going to be gone.  These people have been doing their job for a long time - they aren't going to run out right at closing time.  That's when they go home.  That means everything is shut down and cleaned up then.  The chicken will have been long gone by then.\n\nOn the process - it's like the Soup Nazi, without the need to stand in line and move two steps to the left.  It's more like a somewhat-controlled mob.  Have your cash ready and when you get to the counter, place your order.  If you get to the counter and don't have your order, be prepared for someone else to take your place.  And don't go getting upset, okay?  You've now been warned.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2008-12-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'Aa66Zs6Lf_1_0_g50F9JVA', 'review_id': 'Y-IuLDEiRGVGTbLxX_ILhQ', 'text': "Greasy, heavy and artery-clogging. Every time I have their dark meat chicken dinner, it makes me wonder why I let myself do that again.\n\nAnd it's so worth it. The way fried chicken meals are supposed to be, if you ask me. Mmm, tasty.\n\nThere's a huge line there all the time for a reason. \n\nBut they do have it down to a science. The line goes fast.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2009-01-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'BUvIl49ZzfAvkgoyC1m96A', 'review_id': 'qSs2rBccdN9HFznZT8szMg', 'text': "I'll keep this short. The Coop is an icon in Charlotte and it's an amazing holdout of old time southern food service in a town that abhors anything over a decade old. The cook process and customer counter operation clearly hasn't changed a bit in 60 years or more of prosperous business. \n\nI go on rare occasions for the experience, not the food. The chicken quality and fry quality is OK, but the taste is pretty bland across the board, and there's not a healthy bite on the entire menu. What impresses me most is how clean and efficient the place is - like a hospital operating room... that fries chicken.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 2, 'date': '2009-01-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 4}, 'user_id': 'D4udabSXvSaiQFYEW-yKMQ', 'review_id': '_d8yREs1j4BPAiHMEXGZjg', 'text': "A solid fried chicken establishment.  Despite the long lines, service moves fast.  A good value with local flavor.  I ordered the meal with chicken, hush puppies, coleslaw and tater tots.  The chicken is very crispy and well-seasoned.  Personally, I like a little heat and spice, but this was very good (and greasy).\n\nThe sweet tea is WAY too sweet for me, but then again, I'm from the west coast, so sweet tea is a foreign concept for me to begin with.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2009-02-16', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 3, 'cool': 1}, 'user_id': '1hAJEyQpDZxJ2ih_txNdRA', 'review_id': '1o0zRDLO4HBmYCSrAagGYQ', 'text': 'Not sure again whay the hype is about.  I have seen this place even in Bon Appetit magazine!   I have tried this place twice now and I think I may just prefer, gasp, KFC.  Sorry you charlotte die hard fans.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 3, 'date': '2009-03-06', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 1}, 'user_id': 'x9_fmyeY4-FcCa6KSpxuGw', 'review_id': '4Ewiy95BYDBGfNzrCYQ_Xg', 'text': 'As they say in the south, "Tastes so good, it makes ya wanna slap yer momma!"  \n\nI\'m not generally a fried chicken fan, but the thought of picking up a chicken here just sends my mouth to salivating!  I don\'t know what they do to the chicken before they batter it, but whatever it is, it\'s nothing short of amazing!  Most places you\'ve got blah chicken after you peel off/eat the skin- at the Chicken Coop, their chicken is melt in your mouth amazing!  It\'s the kind of chicken where you catch yourself sucking on the bones! (Sometimes it\'s worth the shame of bad manners for that last little bit of deep fried heaven!) Hands-down the best fried chicken I\'ve ever had.\n\nFor those that aren\'t fans of dark meat, you can order a "whole white chicken" for a little bit more.  Prices are insanely low for this quality - I guess it\'s because they keep it simple and stick to what they\'re good at!\n\nThe other reviewers have it spot on: Always crowded, but line moves fast. Cash only. Park in the lot behind the alley, take it to your car & eat it there. Have your order ready when you get to the front, or they\'ll skip you. Don\'t you dare talk on your cell phone while placing an order. (Remember Seinfeld\'s Soup Nazi? Yeah, it\'s a little like that!)', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2009-03-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'T_kMEgHqIqwbHR_7yhqWFw', 'review_id': '0kQuNWTzJfvU7l1m2IvyQw', 'text': 'The chicken is well worth all the accolades (Food Network), the sides are disappointing.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2009-04-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'y6tOSRh3Xng3XKjVFoE2qw', 'review_id': 'pVGvolsLkG1wpLLw23Qb4A', 'text': 'Oh, that\'s good chicken. Moist and greasy with a nice crunchy coating. Can\'t be good for you, but makes a great treat if you feel you need one. \n\nThe ordering experience is worth going.  Organized chaos. Aside from the handwritten "no cell phones" sign, once you walk in the door you don\'t know if it\'s 2009 or 1950.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2009-05-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 5}, 'user_id': 'QJLI1ifWAs-JV8ArBg_Y6w', 'review_id': 'DoekWC7vnNAu-1c_XSJ-rA', 'text': "I remember going to Price's when I was a kid with my grandparents not knowing anything about its reputation. I would get a chicken sandwich and of course some sweet tea and eat in the car with my grandparents. As I got older, I started to enjoy my trips to Price's more and more. Now that I'm an adult, I have seen Price's famous chicken in Bon Appetit magazine and the long lines waiting to get some chicken and sweet tea. Being a native Charlottean, I have a special place in my heart for Charlotte landmarks such as Price's. In addition to it being a Charlotte landmark, the food is cheap and delicious. So what if you have to take your food outside or in your car to eat? Its all part of the Price's experience. The hushpuppies, sweet tea, and chicken are delicious and worth the wait and money. The hushpuppies are big and flavorful. The chicken is moist and succulent. The sweet tea is sweet but not too sweet. The fish and shrimp are also really good. Make sure to bring cash since they do not take cards and be prepared to wait in line.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2009-05-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'nBgEj6ig-1ur0ZJqNFIg8Q', 'review_id': 'wnndLofgaopB9nllRdzaNQ', 'text': "I really *really* wanted to like this place.  The reviews were so positive and the business really has that we've been here forever feel.  \n\nThe chicken was tasty but a little dry and didn't seem to be seasoned at all.  The hush puppy was good not great.  Enjoyed the tator tots but then again, they were just tator tots.\n\nI can't say this place is better than any fried chicken joint (even Bojangles) but it is historic.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 2, 'date': '2009-05-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'Syn0IvWg-M7I4G2t_XyHoA', 'review_id': 'V5vcYak0SbEKp1HS4Zig6g', 'text': "Price's Chicken Coop garners three stars for the overall local experience, however, it would be a must do if it did not cut corners by serving Sara Lee's prepacked pecan pie or Costco style bulk buy rolls, instead of homemade biscuits - this is a chicken restaurant and biscuits are a staple with ones chicken dinner in the South, so I'm told.\n\nThe multiple chicken dinner offerings are served in square cardboard boxes, similar to small pizza boxes and no dining room or washrooms are available, so plan on bringing some wipes or making a trip to a local gas station to wash up after you chicken lunch. Although I was not aware of this when we arrived, I opted for a chicken sandwich, for minimal mess, however, the sandwich consisted of boned chicken in between two pieces of bread, so I still had to gnaw on the chicken pieces. The chicken itself was prepared well, in that it did not have an overly greasy aftertaste. The sides, which included Burger Kingesque style hash brown rounds and hushpuppies were fine too. \n\nPrice's Chicken Coop is a area instutution in Charlotte and should be visited when looking for local attractions.  Parking is available in a back lot as street parking is limited to 20 minutes.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 3, 'date': '2009-05-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'svkcc6NiBYPp2wfqRo1FQw', 'review_id': 'e1VI4w6BFD5O_DqiYrcq_Q', 'text': 'I was not impressed- I have had Price\'s Chicken Coop several times and I am always left wondering "What\'s the fuss about?" It even was written up in Gourmet! I don\'t understand. Perhaps one of my main objections is the hours of operation which forces many people to eat this stuff cold. I like it hot and crispy, and the skin is greasy and not crispy at all and fairly bland.  Not flavorful enough for me and while the outside is greasy it still managed to be dry.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 2, 'date': '2009-05-29', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 2}, 'user_id': 'WW6vhuwvhJdOMl8mmZVLZg', 'review_id': 'Dc6nFZj0y7kBN9L4fcfkTw', 'text': "This is the best fried chicken in the country. Greasy yes. Tasty yes. You don't go here for atmosphere or even to sit down. You go here for the chicken. They hand it to you in a paper bag and by time you get back to your car the bag is soaked through with oil. But when you taste the chicken all your thoughts of heart attack will vanish.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2009-07-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 2}, 'user_id': '2ZAsOeJ6jpF4f0Ngdl6svA', 'review_id': 'fXaILyhvBjX6tQ9xP997LA', 'text': "Diabetes and heart disease in a box... but yummy.\n\nThe chicken is subtly fried - not a whole lot of breading, but very crispy. The chicken has obviously been brined because it is very flavorful and juicy.\n\nWe ordered the fried shrimp and 1/4 chicken dinners.  It's pretty much all pretty unhealthy.\n- fried, totally breaded shrimp or 2 pieces of chicken\n- tons of deeply fried tater tots (I think they were fried several times because they were SUPER fried\n- a few hush puppies (but that's all you can really eat)\n- a white dinner roll (think Wonderbread)\n- a little condiment cup of cole slaw\n- pickle (the only healthy?? thing in the box)\n\nThe fried shrimp was meh...  too much breading.  Cole slaw - I like KFC's better.  But the chicken...  I'd have to say it was pretty darn tasty - the best in the country?  definitely up there.  The iced tea - well, it was too sweet for my tastebuds (it tasted like diluted honey; my 6yo loved it)\n\nThe people there were actually quite pleasant and nice - not chatty, but very nice and friendly.  There are two soda machines (75 cents for a can) if you want something besides the iced tea.\n\nThough there is no place to eat, outside the storefront there are some grassy areas to sit and eat.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2009-08-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'AiGzGXyPrs2tQ-y1xsQ4FA', 'review_id': 'tdDoHnz3kSUmMWz367z4XQ', 'text': 'It is worth a trip here simply to experience the line waiting to get your food.  All kinds of people and it was quite interesting.  \n\nI watched the cooks fry the pieces of chicken and I\'m pretty sure they don\'t season them with anything other than flour, salt, and pepper and the taste of the food reflects that.  As another reviewer mentioned, "grease" is not an ingredient!  The taste was acceptable.\n\nThe hushpuppies were classic North Carolina.  I was quite surprised (and disappointed) that they use Sara Lee pre-packaged dinner rolls instead of biscuits typical of southern comfort food.  \n\nI can\'t believe I\'m saying this, but I would recommend Bojangles for a southern fried chicken (and biscuits) experience.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 3, 'date': '2009-10-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ZYViW3rchpcdHS7afeLekA', 'review_id': 'gQNgdCE8Tp0QBI-cOQiC6w', 'text': 'Hell yeah!', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2009-10-07', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 0, 'cool': 0}, 'user_id': '_ZsXp_NomT-PxOiKyyKfBw', 'review_id': 'Jy-TxjDAlWj_0OSjmSJwJQ', 'text': 'for all of you nimrods who would give this place anything less than 5 stars, its obvious you have no idea what good chicken tastes like....KFC or Bojangles better!!&^&*!#%????...you GOTTA be kidding me.."they use Sara Lee rolls instead of biscuits"...they\'re there to FRY CHICKEN, not bake bread..."the tea was too sweet"..ITS SWEET TEA, its exactly what sweet tea should taste like so either man up, or shut up.."its greasy"..no sh-t, its fried chicken!!..i\'ve eaten fried chicken just about everywhere its made in the US and this is the best i\'ve found..plus they give you a boatload of food for around $7-8.....don\'t listen to the naysayers here, they\'re obviously brain-damaged', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2009-10-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'hChxnZWW0K0DdPPrgvErUw', 'review_id': 'PciBemghFIE14rn4EPJ3yA', 'text': "i'm no expert on fried chicken being from new york city, but oh my Lord.  That is some good chicken.  The spices that are included in the chicken and the pockets of juice that are formed after your first bite? Love it, it's addicting and I am so sad that my project in charlotte is ending next week!", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2009-10-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'veeA53Z1NP4GWPZMIxOQsg', 'review_id': 'OVeX0iVD2XynKQuorBwHLw', 'text': "Way back when I was visitng Charlotte for the first time I remember driving by this little place with a line out the door.  People used to rush out and start devouring their food immediately.  On nice days there would be people sitting on the curbs, boxes on hoods of cars or simply folks walking down the street stuffing their face.  And yes - i was one of those people.  Price's is a charlotte insitution and worth a trip if you are in town and like fried chicken.  If not ..i feel bad for you depriving yourself of one of lifes pleasures but oh well ...", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2009-10-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Dg-EPaMJeUKqZ683sPjt9Q', 'review_id': 'pZQ63rXGrKy8qOQXDs8T2w', 'text': 'If you visit Charlotte are live here you have to try it , its a famous spot. The chicken is good and services very fast. But I dont think its the best fried chicken in CHLT....that goes to the Chicken box', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 3, 'date': '2010-01-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 5, 'cool': 3}, 'user_id': 'ZcEstCa4fDhNXrkZ8_Gh0Q', 'review_id': 'lM6MZh12tWmPLtDis0lsew', 'text': "I have never been into the store, but I have had friends bring me food from here and it was some of the best fried chicken in the world, coming from Los Angeles, I liken it to Roscoe's Chicken and Waffles..  the sides were all good too.. everything is super tasty, but you feel like you gained 5 pounds after you eat it..  it is Southern comfort food heaven.. friends that came to visit when I lived in Charlotte would insist on getting some chicken and hush puppies there before heading to the airport..   one of those local gems.\n\nGood portions for people who want more for their money..  but prepare for a wait especially around lunch time.. I have heard the line is Loooooong.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2010-01-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Km6afa57rlQ5cGogHKDkVA', 'review_id': 'sNjXV8mbyplnwUl04UeNTA', 'text': "I grew up in the neighborhood and have been eating Price's chicken practically since they opened. They have made a very simple lunch into a household name!!!", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2010-02-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'aCGT39Y5yN1295fElWHPyA', 'review_id': 'rBOulQcvKH5YjTqOgsvgow', 'text': "Price's is the reason I'll never move back north.\n\nGet the chicken dinner (dark, although I usually prefer white meat myself) and the sweet tea.  I've heard everything is good, but ... the chicken is so damn good, I couldn't possibly bring myself to order anything else.  To do so would be like ordering seafood in Omaha.\n\nThe two reviewers who would prefer Bojangles to Prices??  I don't know what's wrong with them, but there's definitely something odd with that.  The best I can tell you is to go yourself.  You'll love it.  I've taken 1/2 a dozen people to this place and all of us are addicted.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2010-03-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 10, 'cool': 0}, 'user_id': 'NzWLMPvbEval0OVg_YDn4g', 'review_id': 'bQEo594ugCmtO7B6ekqp9g', 'text': "What a bummer! \n\nSo I moved to Charlottes Historic Southend last week and knew right away that I had to try the ever-raved about Price's Chicken Coop. \n\nI had high expectations- since Ive heard nothing but great things about this place.  \n\nI went this Saturday for lunch and ran into a crowd (expected) but I heard the line went fast- and just figured it was a good sign! After about 15 minutes of fully-expected wait time I made my selection the 1/4 lb white chicken meal complete with a roll, hushpuppies, and coleslaw for only $6!\n\nI walked down to the Common Market to grab a drink and sit outside to eat my meal- (CM rocks by the way!) ...\n\nWhen I actually ate my chicken I was more than disappointed. While I am never one to completely disregard an eating establishment because its a so-called hole in the wall (as this is) I do expect it to be sanitary. I immediately encountered a large black curly hair (that was definitely not mine) ... I was so disgusted- I put that piece in the garbage and tried to regain some of my appetite  and at least give the other piece a try. The chicken was fairly dry and definitely nothing special. There wasn't a lot of meat at all - and Ive had better chicken at KFC  which isn't saying much. ...The Coleslaw had no carrots or anything and was ok in flavor- basically a sweet watery-mayonnaise shredded cabbage mixture...nothing great. The highlight of the meal were the hushpuppies- which were perfect in every way.\n\nI do feel like I will give this one more chance since everyone else claims it's so great...maybe I just had one outlying bad experience.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 1, 'date': '2010-04-03', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 8, 'cool': 4}, 'user_id': 'R6lRupz_Jo51n8WJGJYdOQ', 'review_id': '_MLh3G7onHjeF68Wl2IK6w', 'text': "Why the 5 stars you say? Prices never disappoints me. They are ALWAYS consistent. I can actually eat their chicken cold and still be happy. The customer base is super eclectic. The restaurant is subjectively charming and how can you not smile when you see people with shirts and ties sitting on the street curb eating chicken? \n\nAs we know there isn't anything special about fried chicken. Don't go buying fried chicken expecting some elaborate 20 step preparation process. Its just fried chicken. But fried chicken is comforting for everyone and always induces some type of nostalgia. Its a simple dish and Prices does it right: Moist, tastes like chicken and not overwhelmed with spices or anything, and lastly crispy batter. \n\nThey don't have real sides here. Just slaw, potato salad, taters and hush puppies. Although they offer other menu items, I only get chicken usually. Gizzards (yuck) are okay here too. =) \n\nThighs are just too greasy for me and breasts are too meaty. I like a 30% meat, 70% skin/batter mixture. So I'm a wing kinda guy and Price's has damn good crispy wings. My only complaint is that they chop off the wing tips. Yes I said it, I love wing tips! I'm still waiting for them to offer fried chicken skin. lol", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2010-04-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 5, 'cool': 2}, 'user_id': 'lpZtfD-vCqUER1yGKEvUPw', 'review_id': '2XES9qUPkAxNlbj5izRFqA', 'text': "Good fried chicken - no big shock there. This place has been a Charlotte staple for eons. \n\nHowever...I have to say I actually LOVE their fried shrimp dinner! The tartar sauce is delish. It's not super heavy breading, either. And I could probably eat 1,000 of their hush puppies without blinking. \n\nI'm not the biggest fan of their coleslaw - but I'm not a huge coleslaw fan anyway, so don't hold that against them. If you're a healthy schmealthy eater, there's no need to go to Price's, there's nothing remotely healthy on this menu! :)", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2010-04-19', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'hChxnZWW0K0DdPPrgvErUw', 'review_id': 'x5dyj4vFB5SEZ0NZOCCNwA', 'text': 'Because the South does have an excuse for high obesity rates with fried chicken like this.  Price\'s fried chicken is SO good that I bite off the bones accidentally, and say aw f* it, i\'ll suck on it for the flavor.  I just keep repeating to myself, "dont swallow the bones deanna, don\'t do it, it\'s not smart. resist deanna resist."\n\n$4.21 for 2 pieces of fried chicken, slaw, and sweet tea with no ice. So cheap!!! I don\'t know why anyone would give this place less than 4 stars. I just don\'t.  After having tried fried chicken all over in Charlotte and supposedly good fried chicken in nyc by a chef that hails he\'s from the south -- holy crap people mess up fried chicken big time. \nYou know how sometimes it seems like asian girls are remarkably skinny and tiny?  Well price\'s fried chicken can change the skinny part for any asian girl.  You want to fatten up your asian girl? Price\'s fried chicken is the place to go.\nTip 1 - get the dark meat. \nTip 2 - to prevent food coma, chicken sandwich (basically two pieces of fried chicken with bones in between 2 pieces of neglected buns.\nTip 3 - get the dinner box for dinner with extra hush puppies', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2010-04-27', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': 'lcsK55jluEFam7RlEzSqUQ', 'review_id': '42znqXxyreHjkin-u58Zzg', 'text': 'Having been on the hunt for a crunchy tender fried chicken.\nThis place takes the prize (sampling over 50+ different establishments).\nThey proudly boast peanut oil is used in the fryer... which has a high flash point meaning the crispier fried chicken :), sealing in the natural juices.  Not like KFC (which uses a pressure cooker to push the oil into the meat).\n\nPeanut oil tends to be more costly than other frying oils.\n\nThe only reason I found this place was driving down to Charleston and wanted to find a place where the locals go.  When a hole in the wall shack and saw a line of locals out the door and around the block in a run down neighborhood.  I knew it had to be special.\n\nIf you love hush puppies like my ex-fiancee, this is THE place to go as well.  Only if she stuck around long enough for me to take her.\nLOL', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2010-04-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 4, 'cool': 1}, 'user_id': 'OXzYyZSHo9Dl6Qd0s_o2Ig', 'review_id': 'miMx6WWr9CcTkZug3fOj0w', 'text': "I love Price's Chicken Coop! CASH ONLY though!!! Go at 11:30 AM and a Saturday and you usually won't have to wait. Other than that you are probably going to have to wait. There is no messing around here - pick a line quickly and know what you want and be fast about it. I have been here when fights have broken out and the cops were called. Just don't screw around and cut in line and you will be fine. I always get the half chicken white or dark (comes with hush puppies - so good and tater tots). It also comes with a side like coleslaw which I swap out for the potato salad. The coleslaw has a weird after taste or something. Get the fried apple pie too near the register - yum!", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 3, 'date': '2010-05-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '9mr_h5pk0Shpyt78B54FXA', 'review_id': 'VQmcbKFYxIF2cPuqL18QiQ', 'text': "If you thought you've had fried chicken before you've been kidding yourself!  \n\nPrice's Chicken Coop is a little intimidating for a newcomer (it can be VERY crowded) but just remember these two tips: bring cash and pick a line.  If you follow these two rules one of the sweet old ladies who work the registers will have you out of there in no time eating the best chicken of your life.\n\nNo, they don't take plastic (although there is an atm inside), and no, there is nowhere to sit.  Get over these two facts and you are on your way to a delicious meal of fried chicken and whatever sides you choose!  Right now they have a dark meat 'sandwich' meal (consists of 2 pieces of dark meat, slaw, and a roll)  for about 3 Dollars.  I usually grab that and go across the street to the grassy area and munch down a quick lunch or snack.  Everything I've ever had there is great...but their specialty is the fried chicken so I would strongly recommend that to new-comers.  The thing I love most about Price's Chicken Coop is that it brings people of all walks of life together with the common interest of good fried food.  The customers come from all walks of life and the employees and patrons are very friendly, even under the busiest of circumstances.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2010-06-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'lKCyhjuDQS8yv-pS0TIQPg', 'review_id': 'ZviwH-41STApdZxhZBuHWA', 'text': 'Best Fried Chicken Ever. Several national "chicken" articles have said so, and so do I. \n\nNot much else to write, so I will provide you some rules about getting your food from Price\'s. \n1) Bring Cash- No Credit, No Debit, No Checks, and No ATM nearby. \n2) Don\'t Go on Sunday or Monday- they are closed. \n3) Don\'t\' be late. When they say they close at 6pm, they mean 6pm. \n4) Don\'t talk on the Cell Phone when ordering- or you wont be ordering. \n5)You don\'t eat AT Price\'s- there is nowhere to sit. \n6) Don\'t bite into the chicken sandwich. It is a Price\'s tradition- your chicken still has the bones, even on the sandwich. \n\nLast but not least, ENJOY the taste, the smell, and the atmosphere of this one-of-a-kind chicken joint!', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2010-06-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'Dffv5Z1ux-Oa8slVhBn11g', 'review_id': 'N9uyRhBHpfb12_I7YliYgw', 'text': "I heard great things about Price's. A colleague invited me to lunch one day and I finally got to try it. Unfortunately, I wasn't very impressed. I wanted to like the food- but I just didn't. Maybe I'm spoiled by my moms southern fried chicken recipe.  :)\n\nAdditionally, it didn't sit well with my stomach. Yikes! But if your stomach can endure lots of grease, you may like it.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 2, 'date': '2010-07-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 1}, 'user_id': '_x2V6okVsJzo2fDLBHC6pg', 'review_id': 'R4eFPLCM0GJ8MBkvFBk5kw', 'text': 'For all of the hype that Price\'s generates, I thought the chicken was so-so. However, the experience of going, ordering, and eating is enjoyable- you can watch them breading and cooking the chicken behind the counter!\n\nWe ordered two white chicken dinners- came with white meat, cole slaw, a roll, tater tots, and hush puppies. The chicken was not spiced according to my taste- a little bland, but was good and cruncy. The chicken was juicy inside. The cole slaw was full of pickles and did not complement the rest of the food well. The roll was store bought and the tater tots were the frozen kind. The hush puppies were good and homemade as far as I could tell. \n\nPrice\'s is take-out only, and only accepts cash. Plan ahead to have enough and a place to eat. Their online menu is outdated, and everything was about 25-50 cents more expensive than listed online. Be sure you know what you want when you arrive- ordering is fast paced and they rush you because it is a busy place! \n\nI went to Price\'s with high expectations, but unfortunately was not thrilled. It is a good "Southerrn" meal, but I\'m not sure I would go out of my way to go back.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 3, 'date': '2010-07-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': '7gAKXYdqYu5LfmpAHVSHVA', 'review_id': 'rYeL1YWeBGcB9tRc43IYYg', 'text': 'Some of the best fried chicken in the south, certainly the best in Charlotte.  We have this catered at work a few times a year.  The restaurant itself has lots of character and is in an interesting neighborhood (on the train tracks by fat burrito and common market), so it makes for a good stop and some interesting photos.  You can smell the fried goodness as you drive up from blocks away.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2010-07-18', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'pdTzRcRFpnri8rtyH1FiFQ', 'review_id': 'bQfUr1gTgTb7CxBXK9-DSw', 'text': 'Some of the BEST Fried Chicken in Charlotte...that has been here since I was a kid! \nWhat more can I say??', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2010-08-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'nep9Gv-YnoQB-p1wXBfJ5A', 'review_id': '08uiS2jDkOhYeZkdl3LkGw', 'text': 'Hands down, best fried chicken in Charlotte, NC!', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2010-08-16', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 3, 'cool': 1}, 'user_id': '0Xf077zYsmp13A5YtKPJ8Q', 'review_id': 'diUBylYYd8gt_bu5-oF7yA', 'text': 'I don\'t even know what to say about this American old timey masterpiece.  \n\nIt is a fact that I\'ve got hypertension, even at 150 lbs, and have had since I was 18 years of age.  My BP looks like a cricket score, no kidding... one would be surprised.  Because of that and my desire to get in better health I have gone to extremes to try to live beyond 65 years of age... so I usually avoid these kinds of joints.\n\nI ended up lost within myself, using my teeth to rip off parts of chicken in between catch breaths.  I was so happy. I sat in the car, hunched over my armrest, feeling like the Buddha. Honest, I didn\'t stop eating until it was gone, like a good boy. I ordered the 1/4 white meat chicken dinner, which included two wings and a thigh and sides documented by other Yelpers.  Next time I\'m going all dark, baby.  \n\nOh, and there will be a next time because I know I won\'t eat fried chicken again until I can come back here. $7.85 for a full dinner and a tea without ice, including tax. How do they do that? (Their tea was the best I\'ve had on this particular trip, but I\'m damn sick of the sweet tea. Northern boy for life, no matter where I go).\n\nYep - no seating and friendly but insistent and brisk service.  My only wish was that I got more than two hushpuppies.  Please give me more hushpuppies instead of 300 taters!\n\n5 stars is characterized by Yelp as "Woohoo! As good as it gets!" For me, this epitomizes Price\'s Chicken Coop.  It\'s apparently been there forever, nothing\'s ever changed (except for their zealous hatred of mobile phones, changing with the times, but in an ornery way!), places like this are still around but are evaporating in America.  Their fried chicken is simple and awesome.  \n\nBest fried chicken I\'ve ever had.  If someone\'s got better - you better step up to get your rep up, player!!\n\nThe ordering fiasco and unwritten house ethics are a treat. I\'m asking, please, go appreciate these sorts of places.  You\'ll wish you did when these places go away... and as a mere visitor to Charlotte, I say long live Price\'s Chicken Coop.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2010-08-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'c6vXlUq_RJbxbV2CHGOl_Q', 'review_id': 'trqkhvU7Ql6Pz7lz63M6og', 'text': "Just about the best Southern fried chicken you will ever eat. They also have fried fish, shrimp, chicken livers, and gizzard plates. They have sandwiches but I wouldn't waste my time on those.\n\nThis is a takeout only, and parking is on the street or in one of the lots close by. I usually just eat my prize on the hood of my car. For fried chicken lovers, this is as good as it gets.\n\nOh yeah, best to come early.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2010-09-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zJtcWAUYGbOMoQRNwGGP4g', 'review_id': '8Xk5L3itmLufIXNYudICfw', 'text': 'Ahh...Chicken Coop, my beloved Chicken Coop....Oh how i love thee. I have grown up eating at this place, I have ate everything thing on the menu at least 3 times in my live time but i will ways go back to my fish box with a side of shrimp. I have tried many time to get my shrimp they way they do but i always fail. The tarter sauce is slamming, its not to tangy or anything its just right. I also love their tea with crushed ice. In my opinion there nothing better than Chicken Coop and if you say it is ill call you a liar LOL. If you are a health nut your better off driving by but if not stop in a try every thing.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2010-10-17', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'whKpnugMnWTz3UjlrN71yg', 'review_id': 'QBug6G6izBYljv43BFLd0Q', 'text': "While I don't agree with those that say it's the best fried chicken in the world, I do agree that it's a great local find in Charlotte with really good fried food. It fits perfectly well into the Southend scene and offers locals and out-of-towners an equally god experience. The place is packed by 11am and does not slow down until it closes or the food runs out for the day. They only take cash, so make sure you check the wallet before hand and don't be scared off by the people standing around the sidewalk as it's normal. You'll order quick, get your food quick and be expected to leave quick so the next person in line can get their order on. They have fried chicken and fish...for me, chicken all day long. Add some hush puppies and slaw and it's a good day. Go see for yourself!", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 3, 'date': '2010-10-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'VpVp2Ws2RZKWyy5mL3Rfdw', 'review_id': 'LeLfuFc3niKX9hR1HKSvuQ', 'text': "The chicken is simply made and simply excellent. The coating isn't overpowering and fairly light in texture which is great. You can smell the aroma of the chicken all the way from the Bland St. light rail stop. I tried a 1/4 dark dinner and a dark sandwich and I really think the sandwich is the way to go. The higher price for a 1/4 dark meal is on account of the addition of tater tots and a couple hush puppies and the substitution of a roll for a sandwich bun. The roll and the tater tots while good are not particularly noteworthy and make for an awfully heavy meal. The dark sandwich (2 pc. chicken, cole slaw or potato salad, and a bun) is a perfect size for an average lunch and won't leave you with a food coma. It's cheap too coming in at $3.26.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2010-10-30', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'lbkmF875WzwhV8xUXXPmMg', 'review_id': 'vBTiZSL2XucXyEp-vV8RCQ', 'text': "Awesome fried chicken!  Quick lunch service even when they're busy-take out only.  An easy walk from the Lynx Bland Street station.  They only take cash but do have an ATM machine wedged in the corner.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2010-11-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '_ZsXp_NomT-PxOiKyyKfBw', 'review_id': '4bzjmfPlSC8cIzhHifIGkQ', 'text': 'Some of the more recent 2-3star reviews, I gotta say: look at the posters and some of the other places they reviewed, and then take their slagging of Prices w/a grain of salt. These "hip young Charloteans" look like they never ate anywhere that didn\'t serve a $20 entree and 30 different type of "COOL" martinis. Prices serves some of the best fried chicken in this part of the country, if you don\'t like it, just stay away, don\'t slag it. Go eat some sushi or crepes, why don\'t ya!', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2010-11-04', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': '4G68oLRY3aHE5XUt_MUUcA', 'review_id': '506XrTduihi1m5IibZhghQ', 'text': "Whenever we have guests from out of town we always get them to try the friend chicken experience of Bojangles and more importantly.... Prices Chicken Coop.\n\nWhen I first heard about this place from my dad it was hard for me to grasp the concept.... you just have to try the chicken. It's not dine in... just take out but the line is out the door for a reason.\n\nI am not a liver person.... but I hear their fried liver is the best. I'm just in it for the chicken. It's unique and tasty.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2010-11-11', 'type': 'review'}
{'votes': {'funny': 10, 'useful': 5, 'cool': 7}, 'user_id': 'cxTh9xxqbs-m8Paq6jAumg', 'review_id': 'Kzg7Lghnm11i5-qXA2DdUg', 'text': "Cheap, tasty, delectable chicken that makes my mouth do a happy dance? Check.\n\nSaid chicken meal including taters, hushpuppies, slaw and a roll? Check\nCheap coffee for under $.75? Check\n\nCharging for mustard and hot sauce? Check (being a frugal girl, this would bother me but they only charge a modest amount of $.05 so I can justify spending the extra nickel plus it amuses me)\n\nPeople watching aplenty? Check!\n\nGrease stain on my shirt? Double Check!!!\n\nPrice's has everything I want yet don't need that's why it's only a once or twice a year stop for me. However, I didn't go last year so does that mean I can double up this year? We shall see.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2010-11-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '7lOsOgwt5nayU7ClqMjmbA', 'review_id': 'i9836kv2MFEsuHdgPE3vYw', 'text': "Ezell's???  Sorry Oprah...you need to head down South to Charlotte for the best fried chicken, and look no further than Price's Chicken Coop.  Ezell's is tasty, especially the spicy chicken...one bite of Price's and this will be one of her 'favorite things'. And the Colonel?!?! Yeah, along w/Duke basketball, this chicken gives Kentucky another reason to hate the Tar Heel State! \n\nThe chicken here...in one word...LEGIT!  Crispy, moist tender meat...yeah all of the adjectives you use to describe delicious fried chicken...multiply it all by 10!  The seasoning is spot on and it's consistently fried to perfection. \n\nI was introduced to this bird a few months after I moved to Charlotte during an office potluck and all other fried chicken became an afterthought. This place has been around forever which means those fryers have had all of that time to season like a good cast iron skillet. I was told they fry in peanut oil, which is THE oil to fry with in the south, but the menu pictured on here says Veggie oil...big difference! I haven't lived in Charlotte since '06 so I really hope Price's hasn't sold out, like McDonald's after they quit adding beef tallow to their fries! This just means I'll have to go back and find out for myself. Pretty much every office gathering included this chicken, so I've had lots of experience w/Prices! I've taken many out of town guests to this place too for a perfect taste of true southern goodness and they all agree. \n\nDo yourself a favor, next nice day in Charlotte pack small cooler, go to Price's and grab some of your favorite pieces, then head over East Blvd to Freedom Park for a picnic....ahhhh...Charlotte...", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2010-11-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'c1qSD6NRfWkiI4lT9IBesg', 'review_id': '58_o7QoYnRrjNRuBTMZgxw', 'text': "I really like Price's.  They not only put out some great food, but they're (get ready for a cliche) a genuine institution and really add to the Queen City's culture.\n\nThere's pretty much always a crowd of people waiting in line at the counter, and you might think on your first visit that you're in for a long wait, but that's not the case.  They keep everything moving right along, and the wait to order is actually the longest part.  Once you've placed your order, it only takes a minute or two for them to politely hand you the goods, neatly stuffed into one of their distinctive white boxes.\n\nUnless you are extremely hungry, I'd say the 1/4 chicken dinner will fill you up.  The 1/2 chicken dinner is a meal for two.\n\nsome people aren't a fan of the sides (the little circular tater tot type things, hushpuppies and slaw), but I think it's all pretty decent.  The hushpuppies are maybe a bit bland.  But the chicken is the star here.  The breading is fantastic, and they manage to perfectly cook the chicken, which is hot, moist, and always delicious.\n\nDon't forget, it's take out only!", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2010-12-24', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '_oslxmoNd2lB4OvYa5hUqw', 'review_id': 'Dtozq2SFFiSxFzPbO8h4jw', 'text': "I want to build a Price's Chicken Coop in my house!   Best chicken I've ever had.  I am jealous of the locals in Charlotte who have the chance to eat here whenever they want.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2011-01-05', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'VrYf8_GlH5yn98gzGhUaaA', 'review_id': '8wF1HpljS5DL685Lh00KiA', 'text': "Just OK. Not quite sure what all the hype is about. \n\nChicken was decent. Pretty sure those tater tots are frozen. Paying for packets of hot sauce - seriously? Although I think I can afford 5 cents.\n\nGizzards were actually really good, so I would recommend trying. I have grown up eating them with white gravy which I think would have made them so much better, but that may just be personal preference. \n\nTry Price's just to say you have, but don't get your hopes up too high.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 2, 'date': '2011-02-08', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 2}, 'user_id': 'rp43ixMyu_-E6s40y5g0wQ', 'review_id': 'GMwfpJm1PqG4-nHX07Ed5w', 'text': "I am a native Charlottean and grew up on Price's Chicken. I remember waiting in line with my mom many a weekend!  A few years ago I decided to see if it was still around and was NOT disappointed. It's still the best hands-down fried chicken I have had. The sides are great also, have not had a bad experience here! NOTE: If you are used to Kentucky Fried Chicken or Bojangles, you may not like Prices. It's the authentic version of fried chicken. Perfect picnic food. I'm a lifelong fan.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2011-02-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'C_HqwbpOGt78-iAVaHVqgA', 'review_id': 'mxBRBdxdtRGJbby89bHnOw', 'text': "The chicken here is very nicely cooked, but seriously under-flavored. I suppose if you don't like spices in your fried chicken, then you will be very happy. However, I like some spicing in the meat, so I wasn't that excited about the chicken. It is well friend, tender and juicy, but just lacks some of the punch that even Bojangle's provides.\n\nIt's really the sides that disappoint at Price's, though. The tots are bland and the coleslaw is no treat. Because the meal as a whole doesn't come together, I'm in no hurry to go back here,", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 2, 'date': '2011-03-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'nDCEck8C1cXzUj9FuDDJ9g', 'review_id': '2p56-vspuQUHv0CN_OvARw', 'text': "After reading an article about Price's in the now defunct Gourmet mag ... RIP :-( which said Price's is the best fried chicken in The South. Since fried chicken's home is in the The South, that means it's the best fried chicken in the country and by default the world. So damn. Unassuming Price's Chicken Coop, in my boyfriend's hometown, the best in the world? And why havent we gone here yet? Seriously it seems like we never got the chance while in town. But this year FINALLY, we tried it.\n 3 hungry guys and I .. open saturday afternoon.. there. Pulled up to the line coming out the door. I knew there was no seating but was still thought it funny to see all kinds of people outside on the sidewalk, across the street on the grass next to train tracks, in cars just chowing down. They couldn't wait. More good signs. And although the line was long we were literally in and out with 4 mixed piece dinners in 10 minutes. extra 5 cents for some Texas Pete hot sauce packets no prob. With my first Cheerwine in hand, we made our way to the steps of the builoding next door. Hush puppies .. best ever we all agreed, little tater tots .. bonus.. soft roll .. for me unnecessary so I passed it down, cole slaw was forgettable but cut through all the friedness, but the chicken was the best I ever had on par with my late great-grandmother's. One person in the group disagreed because he favors Dion's in the Keys (but he only eats it when he's drunk :-) sooo .. juicy & perfectly seasoned and a HUGE portion. Best Ever. Will stop by every time I pass through Charlotte for sure.  \nOH & CASH ONLY!!", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2011-03-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'aDGuKi8nlQhdigF11MqKEA', 'review_id': 'oZ3Wnb1GJD0CMlZzCU1P3A', 'text': 'This is the only place to go for fried chicken!', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2011-03-27', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'GZPmUmnnH7rx3xUzF5vqwQ', 'review_id': 'FFiwEfcwY6qbn3J-JKd2wA', 'text': "I finally got around to trying Price's Chicken Coop.  I made it there on a Thursday about 5:45 which 15 minutes before they close.  The cliffs note version: Cash only (there is an atm), carry out only.  I got the 1/2 chicken all white which was under $10 including tax.  It came with tater rounds, hush puppies, coleslaw and a roll.  This was all contained in a nice white square cardboard box with the menu/checklist of contents printed on the top.  It took me about 20 minutes to get home and the chicken was still pretty warm.  The crust was still crispy and the chicken was still moist.  With fried chicken your gonna have grease, but to me it seemed to be just about the right amount.  Is this the best chicken I've ever eaten?  No, but it rates up towards the top of my list. It reminded me of the pan fried chicken my grandmother used to make, which to me is the best chicken in the world.  Yes the tater rounds are frozen, but they were crispy and delicious to me.  And I have never, ever heard of tater rounds ever being anything but frozen.   The hush puppies were excellent.  The roll was standard packaged dinner roll. The slaw was diced, with not too much dressing and little bit of a bite.  Overall Price's Chicken Coop serves old school fried chicken that is some of the best I have had and to me the prices was very reasonable.  I haven't been in Charlotte too long, but I imagine if I had been here 15 or 30 years ago it would still be the same except for the prices and that is saying something.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2011-03-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': '6n1Gb-yHpw4ke0oSAFOOnQ', 'review_id': 'MCrmGRbA05Vvm5fi5UsDXw', 'text': "I got around to driving here for lunch one day and wow I could smell the place before I could see it. I don't have much fried chicken experience but their chicken is moist, tender, and crisp on the outside. Knowing it's probably a heart attack in a box makes it even more delicious! Sweet tea is quite a foreign concept to me coming from out west, but after one sip I had to buy another cup. I wish there was some form of seating available though, maybe a couple chairs outside or something at least?", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2011-03-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'a4w7o047KPacPksbJVIfHQ', 'review_id': 'ykTkhFAKAfT92p2qk0TNpw', 'text': "Very yummy!\nRead about them on Yelp and in the Charlotte eNew's Magazine. \nWent for the first time today, I alwayds drive by, but finally stopped. \nWalked up and let the cashier know I was a newbie. \nShe was super helpful letting me know what they had, what options I could pick, and don't forget the tea. :-) Yum\nOur dinner plate was filled. Def going back.\n\nP.S. Cash only :-)", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2011-03-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'wEXZJLxTvruHhe-LQWXnQg', 'review_id': 's-xV-fqD3QSF9i9d0ZxIQg', 'text': "So, after hearing all the hype about this heaven sent fried chicken, I decided to finally bite the fried bullet and go check out the coop. After walking in and trying to elbow my way into one of the 5 so called lines, I grabbed my 1/4 dark with hush pups and hit the road. Overall, I think nostalgia is what keeps this place going, because the chicken is just okay....nothing better than if you know how to soak a bird in some buttermilk, dredge in seasoned flour and fry. Hush pups were a bit dense and bland...needed some onion bits or something. Anyways, been there and done that, and must say Church's is better.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 2, 'date': '2011-04-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'LvGC0do89uWKWbNrqFFwHA', 'review_id': 'GHsOZWGUpYU4zJkxfTpCgw', 'text': "I had to try this chicken! It was good! I got the 1/4 white dinner.\nThe wing was ok, but the breast was really good! Not too greasy, not overcooked, seasoned well.\nI picked at the potato rounds, cole slaw and hushpuppies; they were not bad.\n\nI should have brought cash with me, but since there was an ATM inside, I figured it would be ok....BUT...the ATM inside failed for me; it did not read my card. I went to a BofA ATM and came back.\n\nI did not have a long wait since the dinner was already prepared and boxed.\n\nPrice's is worth trying again...just bring cash...don't let the ATM inside fail you as it did for me!", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2011-04-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'qlYjP4O4BJXE9XaF9MqTYA', 'review_id': '04tAhGNJvnh0c2ZOBhOARg', 'text': "I wasn't impressed. Especially if you compare it to Popeyes. Nothing compares to Popeyes. I tried their gizzards, hush puppies and tots. Eh. I guess if you're in the area craving fried chicken this is the spot. Cash only.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 3, 'date': '2011-04-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FjIJCvtmane7hBqhd31Amg', 'review_id': 'XjW1Uxme2IL2hOxbgF4WdQ', 'text': "This establishment as been a fixture in Charlotte as far back as I can recall, so every time I go there it's like a blast from the past. So with comes the good and the bad. Luckily the good mostly outweighs the bad and I'd never turn down a plate from Price's. However, it's not quite worth the hype to break my neck to get over there to get a taste of their fried bird. It's a no frills place and that's fine with me as long as the food is great, I always get the 1/4 white plate and just remember to stop by the ATM before you visit because it's cash only which I can respect for a place that's been around as long as the coop but it would be nice if they offered some type of card service. The chicken to me is good, but not great. The give you a healthy portion and the skin is yummy and seasoned just right for me, but when you get down to the meat it just felt kinda on the dry side to the point I kinda lost interests in what I was eating. They throw in a bunch of sides but it's just sort of an overload of bread and starch (especially the overkill hashbrowns) Hushpuppies are decent, don't really care for coleslaw much and the roll is nothing special. All and all, it's a good place for some solid throwback style chicken, but not the best chicken around by any means.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 3, 'date': '2011-04-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tmn-Zc9XA3aH3JbrI-SDTQ', 'review_id': 'th6Ixdc62ZIdoLz8VLkBTQ', 'text': 'Best fried chicken in town! Nothing else needs to be said.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2011-05-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wc0IlzGW9Zl70T8jDI9f_Q', 'review_id': 'yHec3BSGEkGd-xzFSYciiw', 'text': 'Best Chicken spot ever.....', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2011-05-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'wGWFzdgnSEe7C6UjoW8Q3g', 'review_id': 'Nh0lng474Pwzztqhj6clUA', 'text': "Good God. This is ridiculously good chicken. Sides are meh but who the hell cares?  The best fried chicken I've ever had?  Perhaps not. I still am partial to Beach Road Chicken Dinners in Jax, FL and their sides are anything but meh but this is some damn good stuff!  Slap some hot sauce on it and I dare you to not start wolfing a drumstick in your car...", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2011-05-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'MTXFOOVDh-l0RhvcpJJhMw', 'review_id': 'jex7Y6ipbUOBOtRrUIsD5w', 'text': "Not sure what the hubbub is about this place so took the fam to check it out....ummm big mistake.  Chicken is way to greasy and really wasn't that flavorful.  Give me Popeyes or KFC or heck even Bo', over it.  Sides were not to good either.\n\nif you must go for the experience of it, then shoot, go for it, but I doubt you'll go back again.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 1, 'date': '2011-05-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '3eY9tFgtCwCu6iRy6NZLHQ', 'review_id': 'RxbO-LIL-5Id2511YM1aXQ', 'text': 'Today our business needed some food for some good ole\' southern boys who enjoy chicken.....So, when they say chicken, there\'s only one place to go - Price\'s Chicken Coop.\n\nSo what do you feed a bunch of guys......10 Full birds, add a few tater tots, and you have a party.  ( I have added photos)\n\nSure the parking is a little skimpy, sure the place has no tables, sure the place has a no cell phone etiquette policy (which is nice, just look for the signs), sure this is standing room only place, but this place KNOWS chicken. This place has the business plan to succeed,\n\nDo one thing right, and continue to do it over and over and over.....\n\nPeople do not stand in line for mediocre food or mediocre service, they stand in line to be a part of the culture to have the best Chicken, not just in the Carolina\'s, but as many will state and put in writing, the whole USA.\n\nThey are closed on Sundays and Mondays , so if you are new to the town, been here a while or just seem to know BO....., You need to see why the are rated one of the top chicken spots in the nation.  \n\nThese folks are only open during Tuesday - Saturday 10am-6pm.\n\nIf you want to see what a real entrepreneur looks like, see how many people are working in this small, busy place on any given day.\n\nChicken Coop = "America\'s Chicken"\n\nOh yeah, CASH ONLY!\n\nNCFoodGuy', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2011-05-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'Zzg-GeJE7Wvyxm4v7JFljg', 'review_id': 'EgeO3JX_feE5hUEFBTIYbQ', 'text': "Advice - Bring Cash, be prepared to stand in line.\n\nThen get prepared for the best fried chicken of your lifetime.  I am admittedly not born and bred in the South and no one in my family has a clue how to make homemade fried chicken so my experience in life thus far has been buckets of KFC. \n\nKFC doesn't hold a candle to whatever they have going on at Price's, it is certainly a no frills place, it's takeout only, and it's not open on Sunday or Monday.  I have only gotten the quarter chicken white meal for $6.25 with a sweet tea of course, an extra 75 cents.  I can afford that!\n\nThe meal comes with the chicken, a roll, the most delicious tater tots in the universe, hush puppies, and some pretty tasty cole slaw.  It is served in a cardboard box that is already greasy when you leave the place.  After you eat you will need a nap and I would suggest only going here once a month at most for fear you will have a heart attack if you frequent it.  But it is so delicious, the chicken is juicy, the outside is crispy, and the sides and sweet tea are amazing.\n\nIf you are ever in the South End or Charlotte in general you have to make a stop here!", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2011-06-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5KZmI27uVZxliUthxg5GoA', 'review_id': 'EjHOYCqlzjlWlDEn4F4Afg', 'text': 'Better than KFC and even Bojangles!  Friendly staff, fast service, cheap greasy goodness all around.  Bring cash.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2011-06-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'PjSjKd53V9yOkIbGGhFI5g', 'review_id': 'BXLzhx8aaSHBFE0v90tfWA', 'text': 'its hard to compare this place to places like bojangles or popeyes because its not supposed to be a cajun style chicken...i got to say this reminds me of good ol edmonsons in fortworth...instead of the hush puppies i could had used some jalapenos...the flavor on the chicken is lite and suddle, not too salty either which was great. not a lot of oil in the chicken which was a plus. the tater pops and hush puppies were good, good as it gets for fried sides. i like this place because its got some character and history...i got the two piece dark meat dinner and it tasted good to me...ill probably go back if i want me some refined southern fried chicken', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 3, 'date': '2011-06-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '7PXmPa2UzdslaVngZjYwxw', 'review_id': '2bVwJXr2WuKSLpa16jH9iw', 'text': "It's really good chicken.  It's not the best I've had - that goes to Paula Deen's restaurant in Savannah, GA.  But it's the best I've had in Charlotte, and there's a lot of good fried chicken in Charlotte. \n\nPros:  Never had a bad meal here.  Too much food for one person to eat.  Hushpuppies and tots are spot on and just add to the carb explosion.  I toss the roll immediately.  Cheap for what you get - you're not at KFC spending $3 on a greasy chicken box with starchy instant mashed potatoes.  It's a dive.  I love dives.\n\nCons:  Crazy hours - caters to the lunch crowd in Southend, or someone who can sneak out of their Uptown cubicle for an hour.  I think they're closed on Mondays, which makes absolutely no sense but that might be when they're chopping chickens for the week.  No place to eat, but you don't want to eat there.  Take it to your office and make people jealous.  Again, it's a dive.  So it's not for everyone I guess.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2011-06-26', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 0}, 'user_id': 'gExkcQH-gW8UUV34VTnK_Q', 'review_id': 'OuX2NvBjkenZ7Ohe0Eh9EQ', 'text': "I love fried chicken. I love it, especially the wings. So when I heard about Price's slap your momma goodness, I was psyched to try it out. \nOk, $12 for just the bird seemed a bit pricey, but they're independently owned, so I overlooked it. Bojangles has a lot more wiggle room in pricing, because of the sheer volume. \nWhat I couldn't overlook, at the end of dinner, was that it didn't taste better than Bojangles. Now, I do love Bojangles, but I hoped since I was paying more for somewhat home-cooked taste that Price's would be worth the price. It was not. Not bad, just not super-dope-crazy special--no matter what your hipster friends tell you.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 3, 'date': '2011-07-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 2}, 'user_id': 'i2kyF_-54q_fQC632bH_zQ', 'review_id': 'ovE5oE-VoZQEQJTW7XleWg', 'text': "Being from New England I knew during my time in the south I would have to try some high quality fried chicken. Price's Chicken Coop was the spot the locals informed me about so I made my way over to give it a try.\n\nI ordered a fried chicken sandwich, which was a large over sized breast served between two slices of bread. Bone and all.\n\nUpon first bite I was in heaven. I had never had southern fried chicken like this before and I thought it was just amazing. Crispy and juicy, cooked to perfection.\n\nThe chicken was loaded with flavor and everything about it just tasted amazing. Price's Chicken Coop is worth checking out.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2011-07-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-5ZMPflBM4s1qfSi02ZdRw', 'review_id': '5rF0-yc0RcJDTDk1tDi71A', 'text': 'At restaurants, I typically gravitate towards salads, chicken dishes, and "fresh" choices. For lunch, I\'ll more often pack yogurt smoothies instead of picking up a burger.\n\nSo when I let my "gastronomical" hair down, it\'s for something over-the-top. Elvis sandwiches, cheesecakes-I like them all with a little less guilt than normal.\n\nWhen the opportunity came up to take my brother for a proper fried chicken, I was all ears and tastebuds. Price\'s is as much about the history and environment as it is about the clucking. The whole store is the size of a post office, and lines are more of a clump. The menus are scrawled in Sharpie, and there\'s other personal reminders by the counter. "We reserve the right to refund your order if you use your cell phone in line." "Cash only." It\'s a little bit like a Seinfeld episode, but the cashiers are not stern socialists.\n\nI handed over $10 for a sweet tea and a cardboard box of the namesake "chicken dinner:" 1/4 white fried chicken, "tater" rounds, "slaw," cornbread hushpuppies, a roll, with a fork/ketchup/salt bundle packaged like a military ration kit. And loose change.\n\nThe chicken\'s looks, sounds, and tastes good enough to be labeled "Charlotte\'s best." It peels right off of the bone and the skin crackles like a fire. The sides make it a feast-to-go. The hushpuppies were undoubtedly the second best part.\n\nThere are no seating areas inside the building, and it gets packed with customers and hurried cooks. It\'s kind of like the Apple Store of fried chicken: lots of business and traffic, but you\'ll get your chicken and be more than pleased with it.\n\nIn fact, you may want it all the time.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2011-07-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yW7miuDH6Xjrgt2k5ZfczA', 'review_id': 'Ddy7vsg5VsPZZudveIMhNg', 'text': "Ohhh my god. So here is the deal. It's cash only, you can not eat there and they only serve fried chicken, tater tots and cole sale..oh and hush puppies. It was and is the best chicken I have ever eaten, bar none. If you don't go to this place when your in Charlotte your missing out.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2011-07-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'fZK7au90OT0DOTX4Obfmjg', 'review_id': '8_Jug9wNXYda1ipOnM7B_w', 'text': 'If you like your fried chicken fried in peanut oil & served by people in hair nets, then this is the place for you! Get in, get out, nobody gets hurt. As my southern friends say " get some on \'ya!"', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2011-08-03', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 1}, 'user_id': '1zeoMI3V744rpZSnp29K3g', 'review_id': 'HGBCYjGD9EpMrKur0eMmvA', 'text': 'Was looking for some good fried chicken after moving from the deep south and this was the best. Great price and alot of food and the setup along with location make it feel like a real southern Moms and Pops spot.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2011-09-11', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 2, 'cool': 0}, 'user_id': 's9I4KMcrHKki44g_eTrYqQ', 'review_id': 'JVbCX9ol6cDHjLKSl2zO-w', 'text': "I know this place is a Charlotte institution - it has been around a long time and has a loyal fan base. \n\nHowever, the only time I went to Prices, I opened my takeout box only to find a large dead black fly in my chicken. Yucky!!  No bueno!!\n\nI immediately threw it away and haven't had the appetite to try again. \n\nMaybe it was a fluke, but that was really gross.  :-(", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 1, 'date': '2011-09-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'bsWOddAF1l7Gn1KYeqaF5w', 'review_id': '6AmQmSDsWQI8-rnourBtfA', 'text': "Price's is the best fried chicken I have had down here in Charlotte thus far! I love how quick the service is. Not very convenient that its cash only but there is an ATM inside. I find it humorous that you get a package of ketchup attached to your fork by way of a rubber band. This is no four start establishment, far from it, but the chicken and the price is worth returning.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2011-10-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'PkZzbg8KUgznRxx11fCVrQ', 'review_id': 'CABkVJJelTGb-ML7mHj8Rw', 'text': 'Fried Chicken; in every city, there is a place that cooks it with the idea, that it should be a great value, and it should hold up, even when packed in a "to-go" container.   This is such a place, in fact, it\'s only a takeout place, so don\'t bother planning an evening there, unless you like sitting on the sidewalk or dangling out of your car. \n\nI mean, the friend chicken here is good.  The drumstick is juicy, meat is tender, and the same can be said about the thigh also.  The batter coats it just right; no heavy glops of batter, when you bite in, you feel the skin giving way, to the decedent meat underneath.  The flavor is always present, the idea that it\'s a hug from the inside out, you get.  Sure there is a lot of great Fried Chicken places around Charlotte, but this one is the simple, working man\'s delight.\n\nIf you get the dinners, you also get Cole Slaw, Tater Rounds, Hush Puppies, and a nice roll. It\'s a perfect portion, you aren\'t going to be asking for me, for at least an hour, but you aren\'t going to be in a coma either.  Their sweet tea is the Maxwell House stuff, which is basically the base for most sweet teas, what you might expect to have been served by family or in my case, southern born friends. Yes I said it, maybe your parents served Lipton, but this tastes just about right in my mine. \n\nIf you can get there before the rush, you might see the front of house, without trouble, but with orders made in minutes, you are assured, even if you take a few extra moments, you are still going to be rewarded with yummy food, that will make you happy, and smiling. \n\nGo here, lots of street parking, just off the beaten path, they close at 6pm, so beware.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2011-10-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JRT-rjTdDDJqfUqvuwRWBQ', 'review_id': 'qfqL0cTpdqMJOhC9iRMcQA', 'text': "As far as fried chicken goes, you probably can't find any better in Charlotte area.  It's amazing... Personally I would like it a bit spicier but nothing some hot sauce can't fix.  Cash only... take out only.  Very good good.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2011-11-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'yqE-amtEYN2PCV19h03-eg', 'review_id': 'crUhL0goCkwNZEFvdEbbgw', 'text': "I took a tour around Charlotte, and the guide gave this place mad reviews as we drove by. After the tour, I just had to go back and try it. It was good, but I really expected more. I thought it was a little salty. But, I really did like the batter. I would say it's one of the best one I've had.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 3, 'date': '2011-11-04', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 3, 'cool': 2}, 'user_id': 'FDG85sQMtHuI2a0ix9ZBcw', 'review_id': 'eVOWlRQ4_zfn2M9lDOVRLQ', 'text': 'this is a good spot to pick up some food. \nSTAY AWAY FROM THE BURGERS... the name of the place is PRICE\'S "CHICKEN" COOP... not Burger King.\n\nChicken sandwich = 3wings (bone in) and a bun\nPerch dinner is good (u get 5-7 pieces)\n\nBut to be honest... its just a chicken spot.. you have to work pretty hard to mess up Fried chicken (especially being a business).\n\ni believe its overhyped. (not meaning its not good). Kinda makes me think of those long lines out the door of Starbucks. (it can\'t be that good..... can it?)\n\nall in all....... if you\'re looking for some good chicken.. and TEA (kinda too sweet for my liking) if you don\'t mind passing other places just to get here...\n\nComeeeee onnnn downnnnnnn!!!!!!', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2011-11-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'J0h_oB2VEhMTlcqKmspjWQ', 'review_id': 'JZ9BTAQyYpfSwtulXe-8vw', 'text': "It has been a while since I have visited the Coop.  Primarily because of their hours and open days since I don't live in the area.  On my way Uptown, I made a stop with the kids.  Since they don't accept cards, I had just enough cash to order two meals for three people...no drinks.  We always order the chicken which is always satisfying.  The tray is served with the round hash browns but we usually substitute one for the potato salad.  Their potato salad is SO GOOD!  However, the price and amount that you get are not equal.  The serving size is smaller now, probably 3-4 tablespoons at most.  This is only enough to feed a one-year old!  I was disappointed.  I don't plan to visit the Coop anytime soon.  It is no longer worth the trip, nor the $.  In addition, there were loiterers outside panhandling (against the rules) which is not good for business.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 3, 'date': '2012-01-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'e2TuJ1yK8lOULnsKcndpxA', 'review_id': 'A1BaoCBxouzl0meD6rftQw', 'text': 'Best fried chicken you will ever eat. Cash only, take-out only, usually a long line to wait, but well worth every second.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2012-01-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'LX59imm8z-6HbaIc_D1bhA', 'review_id': '45F-Hnv-dedtyNa_vPfIig', 'text': "Saw a posted news paper clipping that was a bucketlist for Charlotte. For food, it said you have to try Price's Chicken Coop. This place lived up to the hype. Had tastes of the fried dark chicken, the hushpuppies, the cole slaw, the sweet tea and the sweet potato pie.  All of these (particularly the chicken, the hushpuppies and the sweet potato pie) were some of the best of that dish I have had in my life. Also went with a friend and we were able to get a lot of food for $7 combined.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2012-03-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'FB_kqMLsd8BKIydQUUC_Ag', 'review_id': '3_VmZqmJvtP24idjLHXkBQ', 'text': 'Let me start off by saying that I am from the North and do not know fried chicken like the people in the south.  Prices Chicken Coop is a staple in Charlotte.  I have been here 3 different times and every time was quick and tasty.\n\nIt is only take out and they only accept Cash, they do have an ATM on site.  \n\nThe chicken is the best I have had and the sides are also great.  When I am in the mood for Fried Chicken Prices always hits the spot.  \n\nI also believe they close at 6 everyday.  Definitely worth a stop if you find yourself in southend.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2012-04-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'LUgrUVhnqUZaPliIN-tnqw', 'review_id': 'hzDM3MgOLmURCKNBmg6oQA', 'text': "Best fried chicken I've ever had. A Charlotte landmark, you must go here. They give you so many sides - hush puppies, tater tots, coleslaw and a roll - that my fiance and I get the half a chicken, white and it's more than enough food. 2 breasts and 2 wings with all those sides. $10! It's a deal and worth every calorie. Eat outside on the grass by the light rail, makes for a great Saturday lunch! Oh and we just bring water with us. There's also fresh tea and a soda machine if you want a soda. Make sure you bring cash! Cash only!", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2012-04-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'h6ANB0LnT4vAELRSj_uAOg', 'review_id': 'uKI4TkItaWTvjdVk_esnrQ', 'text': 'If you feel like eating fried chicken, this place is pretty good.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2012-04-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '942j8L5V_0cNSMBNr0yBKw', 'review_id': 'uYWBKqAht_E4XN39XyagOQ', 'text': "Good fried chicken. Perch dinner is good too.\n\nNot much to add here that hasn't been reviewed already, but I'll mention the basics:\n1. Only accepts cash.\n2. Gets crowded, so do everyone a favor and move to the side if you're reading the menu and deciding.\n3. They close around 6 daily.\n4. Even though there's no parking signs on the road, its ok to park and quickly grab your fixing of chicken or fish.\n5. Its only a take out joint - no seating.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2012-05-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_Y4TZl2yYk24E-usDLyRzw', 'review_id': '6OrOtCPQShzQvB3pRkyu0g', 'text': 'Great fried chicken at reasonable prices.  I\'m not a fried chicken expert, but this place was delicious every time.  I personally Price\'s more than Sallie Mae\'s in NOLA (who sometimes gets the "best fried chicken in America" label).\n\nSome details about this place:\n\n- Cash Only\n- Private parking lot in the back (entrance to parking can be difficult to notice)\n- Takeout only\n- Gets crowded, so be ready to order when you get to the front of the line\n- You can order sweet tea at the counter, for other drinks, there\'s a soda machine on the side.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2012-05-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'zknkjK_N53QU9MWjAkppUg', 'review_id': 'qjB-SYp2GqBDqoyz-AvcsA', 'text': 'not much to add..... hint about parking in the front was DEAD ON take a few minutes and watch them - it is a well oiled machine. how they prepare the food, fill the front chicken bins and it is really really CLEAN\n\nthe batter is light ...\n\nthe chicken is tender and it is really good!\n\nwhenever i am in the area - i will stop and get some more!\n\ni am amused how they charge you more for the iced tea IF you get it WITHOUT ice - with the small cups they give you for the tea it can only amount to pennies but that was cute ... LOL', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2012-06-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'neAN8bWOJyj5x1-SMCIOYQ', 'review_id': 'CCvfidzLQXORYig4kgqC6Q', 'text': "Pretty good chicken. I expected my mind to be blown so in that sense i'm a little disappointed but it's still solid. I got there at 12:05 to no line, but right after, it blew up.  I wouldn't say it's worth standing in line for super long for.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 3, 'date': '2012-06-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'UCkM00rkSeA9fXFENWyH9w', 'review_id': 'zG5vYxp6UPILERUqXqcQEw', 'text': "This is simple: Prices has the best friend chicken on earth. Period. Full stop. End of. I've had fried chicken all over the US and the world, but this is by far the best!\n\nThe only knocks I can give Prices is that a) it's cash only; b) it's carry-out only, and there nowhere in the immediate area to eat except your car; c) the side dishes are a bit of an afterthought; and d) there's always a huge line. As others have said, if you don't know what you want, or if you're talking on a cell phone, STEP OUT OF THE LINE so the rest of us can get on with our day.\n\nThat said, my tip is this: the most popular lunches are the 1/4 chicken dinners. During the lunch rush, a couple of employees will make these non-stop and stack them up. But sometimes the dinners don't get rotated out properly. The 1/2 chicken dinners are made to order each time, so if you order one of those you're guaranteed that it's fresh and hot.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2012-06-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '685Gbhk4U812RSi8iKQ4Tw', 'review_id': 'WG2XwZpIHQ4ujKCz6mTDrg', 'text': "Quick service and authentic fried chicken, but I wasn't completely blown away.  As the other reviews have said:\n\n1) It's cash only.  They do have an ATM.\n2) It's carry out only.  They were kind enough to recommend a park (Latta Park) down the street about 6 blocks east, and clearly we weren't the only ones that thought it was a good idea, because we saw at least 3 other people at that park with Price's boxes.  \n\nThe chicken was tasty, and the sides were good.  Better than Bojangles, but not the most incredible chicken I've ever had or anything.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2012-06-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 2}, 'user_id': '1wnxQQ1ZI2la5shlEKPHGg', 'review_id': 'H02SGVWE0hP5uETXf22kug', 'text': "Their name tells their tale. You come here knowing what you want and if you don't make sure you read the menus that are posted on the windows on the storefront. The cashier/server doesn't have the patience for your cell phone talking or slow-minded decision making. The customers behind you won't have the patience either. Of course I'm talking about their lunch rush. You can go off-peak hours and receive a little more graciousness from everyone. \n\nI usually get the 1/2 chicken combo and call it a day. It'll feed you plenty and probably  someone else if you have a small appetite. Great chicken that doesn't have thick layers of breading. Just enough to give you that crisp crunch before sinking your teeth into the moist seasoned chicken. No greasy aftertaste either. Just simple fried chicken and sides that are plenty enough.\n\nThey serve buckets also if you want to come with your family. HOWEVER, do not expect any seating in the place. It's a get your food and get out kind of establishment. You'll usually see business men chomping away next to a construction worker. My kind of place. No fancy decor or titles, just food. \n\nGo here and not KFC, you'll thank them.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2012-06-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9DyCuKS2WKxSZhLCMUg5Ww', 'review_id': 'De-1n2T3a9rlM_HSYqoKiA', 'text': "3 stars for the food, 4 stars for the price\n\nI stopped by for a quick lunch to-go around 11:30am and it was pretty crowded, but service is speedy with multiple cashiers. It's carry out only and cash only. \n\nI got the dark sandwich special which is a fried chicken drumstick and thigh between a plain roll with coleslaw or potato salad on the side. I'm not quite sure how to eat this as a sandwich (since the bones are still in the chicken) so I sort of ate it separately. The potato salad wasn't good, so maybe I'll try to coleslaw next time. The fried chicken was great: crispy on the outside and juicy on the inside. It's well salted so no need to add extra and it goes well with the bread. Condiments/sauces cost extra (besides salt) so if you want some additional flavor to your meal, don't forget to ask for some. \n\nFinally, service--besides being fast--is friendly. It made my food purchasing-experience a lot more enjoyable. At $3.26 (tax included) a lunch, I think it's a great deal.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2012-06-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'W21paR0wler-gTHXHWXVqA', 'review_id': '1yJBEezMmLBccTUl2VDrAw', 'text': "If you don't absolutely LOVE this hole in the wall, you need your HEAD EXAMINED!", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2012-07-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ujYEq2GrLbTDtAakjfcpBg', 'review_id': 'IMwcE-O1GvSj5bzZjii6hA', 'text': 'It was OKay but I don\'t see what all the hype is about.  I\'m from Maryland and made Price\'s one of my "must go" spots when I visited Charlotte in May 2012.  The wings are SOOOO small...OMG!!  They were just ok to me, the best part of the experience was getting tater tots instead of fries.  (Reminds me of my high school days..ahhhh)  \n\nAnyway, I can get the same pressure fried cooked wings from any of the Armish Markets here in Maryland and the wings are much more satifying.  \n\nPrice\'s is now off of my list of places I MUST visit.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 3, 'date': '2012-08-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Ea6DETSU_5NgwgUm5qGhmQ', 'review_id': 'Jtm3EGnUrIkQznDsB_gSCw', 'text': "Perfect place to grab killer fried chicken on the move. Best I've had in the queen city. No nonsense, friendly, blue collar all the way...love it.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2012-08-25', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 2}, 'user_id': 'MaJb-XiZ263_SSmneBmgYA', 'review_id': 'mss2bHq98Z4QVHRjYrQzzA', 'text': 'I tried to go here after the DNC convention in Charlotte on Friday, and they ran out of chicken!  Not to be put off, I was back Saturday afternoon for lunch--heavenly day, they had chicken.  So I got their 1/4 white box with tater rounds, cole slaw, sweet tea, and hush puppies.  I\'m not a huge fried chicken connoisseur, i just like what I like.  Overall, i found the chicken good, well fried, but very very salty.  And the tea was SUPER sweet.  Like, get a cavity immediately sweet.  The hush puppies and tater rounds were fantastic--hot and crispy.  The cole slaw was ok, again, a little sweet.  I bought a small side of potato salad, and that was pretty good.  Overall, the whole meal was good, just the chicken was too salty.\n\nCash only!  But super fast, they aren\'t messing around.  Know what you want before you get to the counter!\n\nThis is total sacrilege, but I\'ve become quite attached to the fried chicken at Cracker Barrel on Sundays (so much so that my family and I say, when traveling, "Chicken Sunday!" in hopes of stopping there on our way somewhere.)  And I think their fried chicken is some of the best--hot, fast, juicy and delicious and not greasy at all.  This didn\'t quite measure up to that.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 3, 'date': '2012-09-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pThrLlm3dOQ_gofKFRFuhQ', 'review_id': 'x-y_P3Em3sjtVu6V7DNTnA', 'text': "Yum,  yum, yummy fried chicken and hush puppies! Tried to eat here before, but, long story, didn't. Worth the wait. It's a landmark for some folks in Davidson. Now I know why. Chicken a little too salty and slaw...well, I had one bite and had to throw it away.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2012-09-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': '2t3ORPSxz1juP97LeQAamw', 'review_id': 'RBT_Gf5V5KbKaAfMOa146g', 'text': "I lust for great cried chicken and have been trying to try Price's for about eight years now. I finally went Wednesday. It's just average, deep fried chicken...nothing better than I can get in Milwaukee. It was pretty cool to see the pace at which they make their chicken, around forty employees were busting their hump in a pretty small space and they were moving some chicken. I'm an old guy and remember chicken in small farm community cafes that was fried in pans..a whole different animal from today's deep fried bird.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 3, 'date': '2012-11-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'I1WILQ2Ok1U8igHUE9iIdQ', 'review_id': 'CWjd64PVPqaTIorWW0C49g', 'text': "The only thing great here was the service - in & out under 5 mins.\n\nHad the whole dark chicken & the fish & shrimp dinner.  The only real edible item was the tater rounds.  The chicken had obviously been cooked earlier in the day & left to sit.  The fish & shrimp so heavily breaded it was like playing where's the fish & shrimp.  Both had been previously cooked & had been sitting.  The fry on the items made it taste as if the oil had not been changed in a while.\n\nWanted to love like everyone else but Bojangle's & KFC works for me.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 1, 'date': '2012-12-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': '7pwj5n51oQE3Nk7WrQ-ttw', 'review_id': 'p8NbKOsfKbr5trJpYW68Kg', 'text': "Simply put, the best fried chicken I have ever had! Mind you, I'm no connoisseur, but this was 110% legit; crunchy, juicy & ripe with flavor.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2013-02-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BtkpYGIyRChVVfTlWl-QaQ', 'review_id': 'TSkR7lp2ROEOx-BgGqwrlw', 'text': "I've been living in Charlotte for about 13 months now, and it took me this long to finally try the all-praised Price's Chicken Coop. I promise it won't take that long for me to return! \n\nThe chicken was fantastic and amazingly worth the hype. I had the 1/4 white meat chicken dinner.. comes with tater rounds, slaw, hushpuppies, and dinner roll. Also got sweet tea (an obvious good decision). The tater rounds were a little salty, but good. Slaw was surprisingly great and flavorful, not overly-mayo saturated. Chicken was very flavorful, crispy, not greasy and unbelievably tender. I was with another friend who got the chicken sandwich... which had breast and wing on a bun (bones included). A little odd, but I guess you're supposed to remove the bones yourself and make a sandwich.. ?? \n\nThe service was tremendous also. The woman helping us was very nice and answered all questions willingly. Sometimes you go to well-known places for the first time and the cashier will be a little curt due to answering the same questions over-and-over... not the case here. Cashier was very, very nice and attentive. Even though it was lunchtime with lots of customers, we were in and out really quick.. about 5 minutes. \n\nAlso, expect to eat in your car... there's no where to sit. I understood this before going, so it was no surprise. Ended up eating on the trunk of my car, it was such a nice day it was great... felt like we were tailgating without the beer. The street was littered with chicken bones so we definitely weren't the first with this idea.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2013-02-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XJwiv5u7h1giaxgYAOz8jQ', 'review_id': 'uTLQ6sioLqib4U_9Jt1Y_Q', 'text': "I don't see what all the hoopla is about. I've had better fried chicken. But it's still pretty god. \nCash only is kinda annoying as is the lack of parking. But you get your food pretty quick. It's mostly a locals joint - so they take orders pretty quickly too.\n\ndark chicken is best", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 3, 'date': '2013-02-13', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 2, 'cool': 1}, 'user_id': 'fI-B_Im67uBIbF9KyMa8zQ', 'review_id': 'ZMo1GyiatmtEhVdtTd90WA', 'text': "This place is all hype. The chicken is very crispy, but that is all. There is no flavor and very bland. On this day I decided to try the fish sandwich since it gets as much praise as the chicken. What a joke!!! I am from the south so I don't mind grease. Man this sandwich was to greasy for me. The first bite was hard like it had been over cooked. Midway through the sandwich I felt something in my mouth while chewing. It was a bone. Who has a fish sandwich with bones in it. On a positive note, the tater rounds are very good. They remind me of Hardees hash browns. I'm not sure that I will be back here again.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 2, 'date': '2013-02-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'NhMriXLOc0LGlU7SYKm6nw', 'review_id': 'Yp7mzEqIZasyFwSXWIzb1g', 'text': 'Hubby and I came in October and shared a 2-piece chicken dinner which came with a soft dinner roll, a generous portion of crunchy tater tots, a small container of slaw and potato salad, all served in a well-organized packed pie box .  The chicken had a crispy light breading and the meat was very juicy and flavorful.\n\nOnly cash and take-out here.  They have a very efficient assembly line to get hungry customers served and on their merry way!  Fortunately, there was a nice grassy knoll across the street with plenty of shade ... this served as the perfect spot for us to savor our yummy lunch!', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2013-02-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'VFOwxpOWH9RZ3iMelkRd7A', 'review_id': 'jMLrV2RKnG6-4LlW4oDs5Q', 'text': "Some of the best Fried Chicken I have ever had in my life.  So old school so you know it's good.  And it fits my budget perfectly.  They are doing it right!", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2013-02-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KPMu3LKxQ_KGCcVpen6ZIw', 'review_id': '9a_1845Zg9pGXr1xFveChg', 'text': "A fun drive by adventure while passing through Charlotte. The handy tip from our cashier to take our boxes to a lovely neighborhood park around the block for a picnic dinner was what really made the experience... you don't have to eat on the trunk of your car!!!!", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2013-04-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'qEBjkG1zY7PVQh-VG3F_1Q', 'review_id': 'HASirdhjsWE926mvSiTMNw', 'text': "Delicious! I wish they have places to sit. It was so crowed in there just to ordered...\n\nGreat prices for what u get and chken was the best I've ever had", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2013-04-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': 'W6U7LB2F3enGLxMNwW898A', 'review_id': '4jPZ2E4bjm2eyBXJH97bUg', 'text': "I really don't see what all of the fuss is about over this place.  The chicken is decent but nothing worth writing home about, doesn't have any sort of kick.  Sides are okay, tater rounds are probably the best part.  Why this place constantly wins best fried chicken in Charlotte is beyond me.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 2, 'date': '2013-04-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'liWRT_d1o5U9WUCot3SVjw', 'review_id': 'vD5hsOjmjeHPMqJb-YYN3Q', 'text': 'PRICE\'S CHICKEN COOP\nI have to admit: I am a sucker for fried chicken. Since I\'m in North Carolina to visit (future) family, eat as the Southerners do. As we drove through downtown Charlotte, I noticed a long line of people spilling out of Price\'s Chicken Coop and decided to give it a try. The waiting room was packed with African-Americans and Rednecks! This had to be one good fried chicken joint! As I was waiting in line, there was a Redneck who looked like he could pass as GLEE\'s Beck Jackson\'s brother talking to himself how "damn good" the fried chicken was here at Cooper\'s. When I told him I was from CA, he immediately said that KFC sucks and that the Chicken Coop made absolutely the best fried chicken ever because of their secret sauce; that was why he\'s come here already over two-dozen times!!! This man here is a true fan!\n\nWe ordered the whole dark meat chicken (4 drumsticks & 4 thighs), and the fish sandwich with tartar sauce. The sandwich was OK - nothing special... but the chicken... now, that was something!! Admittedly, it tasted similar to KFC\'s classic fried chicken, but less greasy and fried. Super tasty, although a bit too salty... but then again, it\'s fried chicken! If you\'re into fried chicken, this is the place for you, evidenced by the endless line!\n\nOrdering was quick. Food tasted great!. Drawback: it\'s a take-out place only, so there\'s nowhere to sit and eat greasy fried chicken, which can be quite messy. Most people eat in their car. Otherwise, this place was the bomb! Drink lots of water, though, because the salt will make you very thirsty. This Californian certainly enjoyed this North Carolina classic and will definitely come back for more next time!', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2013-05-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '_imI4sjdeylLZdNbQeWSag', 'review_id': 'atBOVFt2wbzbFlC7xaQKdQ', 'text': "Had this chicken on more than one occasion.  It has to be the worst crap I have ever had.It has no spice to it whatsoever.  It tastes like someone just threw flour on it and nothing else.  The only thing I did like from there is the potato salad....don't know if they still have the potato salad because I haven't been in years.. Bottom line I have had better chicken from Bojangles. This crap must have some kind of mind control drug in it to convince all these people in Charlotte that this chicken is special.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 1, 'date': '2013-05-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'PM2jXrlVzik1jDwwahLJJQ', 'review_id': 'K87k13FlxhzcKp4HcojO9g', 'text': "FINALLY made it to the Coop and really enjoyed it! Since I moved to NC, everyone has said this is the best fried chicken around...so here goes:\n\nAll previous reviews are correct, there is no where to sit inside, it's cash only and I suggest you KNOW what you want when you get to the counter because they move fast...and it seems to always be pretty packed! \n\nI got the four wing dinner with hash browns, slaw, hush puppies and a roll. No substitutes allowed, whether you like it or not that's what you get.\n\nThe chicken was delicious, hot and crispy and just plain good.Actually it was better than I expected! The hash browns were also a big win for me...I only wish they threw more in my box! And at least two or three packets of ketchup...come on...ONE packet is not enough!!! \n\nI didn't care for the slaw or hushpuppies but the chicken was good so heck yeah I'm a fan...\n\nDefinitely bringing my folks here next time they visit.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2013-05-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'pOq_PAPjFp6zBoTsLalxSQ', 'review_id': 'bR6v5w9mR7od2v3Bd8UPRQ', 'text': "I was at Price's Chicken Coop last summer and realized I never finished writing my review, so here it is.\n\nThe best fried chicken I have ever had. This thing is by far and away the best. Its better than anything else called fried chicken you can find anywhere else.  \n\nNice people, great chicken with the delicious hushpuppies and taters. I am thinking of flying to Charlotte again just to have this chicken again. I'll probably have it everyday for lunch if I could :-)", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2013-05-24', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 1, 'cool': 1}, 'user_id': 'PDVT8Lshz0z6Cy4A4Ee3zA', 'review_id': 'IGsjcysP8ee6lFbVH0TRHA', 'text': "If you don't like the Chicken Coop, something is wrong with you. That simple.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2013-06-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': '-II53vTdzYOauYeXY7PP0g', 'review_id': 'yxFljntcBK_245Ce-R8vvQ', 'text': 'My go to spot for fried chicken. Funny, when you go around lunch, people park and eat on the street, sometimes you see people sit on the lawn across the street enjoying their lunch, somewhat communal, but the main thing you see is everyone walking out with their white boxes of fried chicken goodness. Consistently good. \n\nMy usual is 1/4 white dinner, comes with a breast and a wing. In the box, is a nice portion of tater tots, two corn bread hush puppies and cole slaw, finally a white bread roll. \n\nThe fried perch was good as well as the fried shrimp. \n\nThere is a reason why Prices has been here for as long as they have. \nGreat place!', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2013-06-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '38U8WV4j1ckkW8FGqBBy6Q', 'review_id': 'uQuQsSs6N-nq-cU5dAqlOA', 'text': "Believe the reviews!\n\nThis is indeed the best fried chicken you will ever try! Priced very reasonably but bring cash, that's all they will take. The fried chicken is very crispy on the outside and very flavorful inside and not greasy at all. This place is so good that you'll see people of all walks of life coming into this place... and yes, even the bankers!", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2013-06-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'p5EXXTs-eVFmEzq5-NFd3Q', 'review_id': 'fQpF3BAS9X6uarVKLZmefQ', 'text': "I absolutely LOVE Price's Chicken Coop! \n\nI was born and raised in the south, which means that I know good fried chicken and Price's Chicken Coop is the best fried chicken I've ever had. If you don't believe me then just try it out and let me know what you think. Oh and just so you are ready for the fried chicken extravaganza, let me give you a some tips for a successful trip to Price's.\n\nTip 1: Price's only takes cash...seriously. There's an ATM in the restaurant in case you forget to bring cash.\nTip 2: Be prepared to wait. During the typical lunch hour the lines have been known to go out the door, so don't be surprised if you experience the same thing. \nTip 3: There is NO seating...NONE. Luckily there are many locations (such as the Bojangles down the street) that are ok with you eating Price's there as long as you purchase something. I recommend getting a side at the location of your choice because Price's is known simply for it's chicken...there are other sides, but you come for the chicken. \nTip 4: Price's makes a set amount of chicken a day and once they run out of something then there is no more (one night I went around 5:45 pm, right before it closed, and all they had left was wings). \nTip 5: It's closed on Sundays and trust me, after your first taste of Price's you will be craving it on Sundays just like you crave Chick-fil-a.\nTip 6: Be prepared to enjoy the best fried chicken you've ever tasted!\n\nNow that I've prepared you for your experience to Price's, let me tell you why it's so amazing. The breading of the chicken is to die for! It's crispy, golden brown, and seasoned to perfection. Then after you get over the awesomeness of the breading you get to the actual chicken, which is so tender, juicy, and flavorful that you will wonder how Price's makes such fantastic chicken and how you've lived so long without it! \n\nSo if you want the best fried chicken you've ever tasted then you must go to Price's Chicken Coop. The location is very small and if you blink you'll miss it, but once you make the initial visit you will be very happy that you stopped in and you will be counting down the days to your next visit.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2013-06-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'E1Wu-YuaNJWgQqSIsW8K5Q', 'review_id': '_FeOjRPo8tWkYwwr8sdxcg', 'text': 'Eat the chicken.  Skip the sides.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2013-06-19', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'bEEOlaSQrlPBZVQw4bjdUA', 'review_id': '-62mCw4--bIBm4kl3Jg2rA', 'text': 'Just great fried chicken! Have become a regular when a fix is needed. No onsite eating unless your car is considered. Mostly always packed with customers, but product moves fast. The prices are very reasonable.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2013-06-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'r9WaI1XRjdwJzCe6gGdS-w', 'review_id': 'PPTkiwfpG9cEhfocVfO-Jg', 'text': 'man, the chicken is damn good here... definitely one of the best fried chicken joints in the country in my book.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2013-07-09', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 0}, 'user_id': 'j60JaPr8l-pproz4Q7BuMQ', 'review_id': 'vP5GwUfcTgO1wmJ6IGenuw', 'text': "When writing a review about Price's, you have to talk about the fried chicken! so let me jump right in and say it's delicious. I was a bit skeptical about what the fuss was about, but I can definitely see why people like it so much. \n\nIt's always packed in here. They only accept cash. There don't allow substitutions. And they charge for hot sauce.\n\nBut you know what? all of that stuff is fine. The chicken is awesome and the price is very very reasonable. I recall the hash browns also being really good too. The hush puppies, slaw and roll weren't bad.\n\nThe chicken was excellent. Definitely a must try when you're in Charlotte!\nDo it! boom.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2013-07-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 0}, 'user_id': 'kbumen3WgUyYtiDAMrkYlA', 'review_id': 'YTl0zclNHS6IUUvNTz2hLA', 'text': 'as far as fried chicken goes, this place is great!!!! Beware of the hours and they only take cash. Deffinetly worth a visit.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2013-08-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'qFbnxpEalGpfZvUnEIZX6Q', 'review_id': 'nC0C_qlWP9WUkwFI_HwPIA', 'text': "Best chicken I have ever had! Giving 4 stars just because they didn't allow substitutions and because they don't have a place to sit to eat. Other than that you really have to try this chicken.\n\nCustomer Service: Well they were packed so I understand that they can't stop and be super friendly but it was nice.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2013-08-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '1RbbgoTL8loi7qYbJI3H8w', 'review_id': '2XzsQ5nOxqBROSuBf8_ZzQ', 'text': "Service was great. I went around 3:00 to miss the traffic. The chicken is good for takeout spot. i prefer there chicken over KFC, and pop-eyes, or NYC crown or Kennedy's .\nThe tater tots where cold, nothing special, Cole slaw good, and hush puppies are good. Sweet tea is done right. The Chicken greatest quality is the flakiness.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 2, 'date': '2013-08-22', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'To9pdTt6gcc31Xrl2w_Dxg', 'review_id': 'fXnsAdF2x5GvbHmk1w-1-Q', 'text': 'Chicken was hot and juicy but lacked flavor -- nothing special. Tea and sides were OK.  Must be a local legend but not nearly as good as the hype.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 3, 'date': '2013-10-16', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'SjDv_hX-3MuMnZyfcxetMQ', 'review_id': 'PPYg11FFqUcm3GiwOL8J5w', 'text': "Oh My Goodness!! Oh My Goodness!!! Don't walk run folks....", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2013-11-08', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 3, 'cool': 2}, 'user_id': '_PfzyJIqUsn-X6q77ywjEQ', 'review_id': '_xMXgsR47EbA0tX9fN3ErA', 'text': "Amazingly simple and fabulous fried chicken (very moist and much better than the chicken I had at a soul food place in Uptown that someone recommended - won't mention by name, but rhymes with Hertz).  The place is tiny, but they pack you in with 4 registers going when I was there, very efficient and friendly staff taking your orders.  The dinner plates are a great deal with your choice of white or dark meat and they come with tater tots, hushpuppies and coleslaw in a handy cardboard carrying box.  Basically a perfect meal in a box.  They have exotic gizzards and chicken livers for those brought up on those parts, and they also have sandwiches.  They anxiouisly offer you southern sweet tea with your meal if you so desire, and they also have fried pies (apple and sweet potato that look delish).  I highly recommend this place, and will be back next time I'm working in town.\n\nP.S. Not a far walk from Uptown, about 15 minutes straight up Tryon, and the chicken was still warm when I brought it back to my office.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2013-11-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Fu5WbEYvYANGVxwBuYgMkw', 'review_id': 'G8UCL6tvZQ_u4wwaehvqIQ', 'text': "We were in Charlotte for a few days and we had to check out the famous Price's Fried chicken Coop. It did not disappoint. the chicken itself was great, I wouldn't say the best I've ever had like some of the other reviews but it's right up there, the Cole slaw was awesome. But I think what makes this place great is the family atmosphere, nothing fancy it's a very basic down home southern chicken joint with friendly workers.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2013-11-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SHKTw4-iVeVia8q9OZy3gw', 'review_id': 'a4tfiJDgtfPjAg0s2MtFGg', 'text': "I am Australian and on a trip of a life time in the Northern Hemisphere and southern food was on the top of my list for must do's while in the country. I ordered the 1/4 white chicken and some iced tea from the extremely helpful lovely server and strolled across the road to sit on the grassy slop opposite the cafe. After I took my first bite I said out loud to myself 'so this is what fried chicken is meant to taste like'. It was moist and absolutely delicious and the tea a must accompaniment. Great service, fabulous food and an overall experience not to be missed while in Charlotte.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2013-11-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 's7GaXaqXkQa4pGp-NxRjhw', 'review_id': 'f1MTQBL1KKW6V73MxlCPdw', 'text': 'Best chicken I have ever had. my wife and I  boarded on a plane form Lax, to Charlotte, on Thanksgiving night. to go to the chicken coop on  Friday and Saturday.   we check    the hours of operation on web site which shows open  on Tuesday / Saturday..         well guess what.. The coop was closed  until next Tuesday!\nIt would have been nice if they would have posted the holiday hours of operation. \n \nnow I guess we can go and visit are new grand baby . In Charlotte', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2013-12-01', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'NESzjLpjWixicUlFd5Oxtw', 'review_id': '8-4Myt9ooJjeTJEsTYCF6A', 'text': 'Wish I had never eaten here because now I am addicted. I have avoided for years and finally broken down and tried... now I have been back almost weekly since. The chicken is the BEST, I have never had friend chicken so good.. its still just as good cold or the next day (for breakfast of course). I have been mentioning to people I went and they say its so good, they hadnt been in while and end up going and getting re-addicted to it. The place is busy, packed.. and bring cash.. service quick thou - 2 registers and 4 cashiers, its great. Its a must visit if you are from out of town or have guests here. I think I will eat there Friday!', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2013-12-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'AFQVLirbuzvBq9nUnRt5zQ', 'review_id': 'UNcRYRMppLIAFVrRSNX48Q', 'text': "Hands down the best fried chicken in the south!!! It's the perfect balance of crispy outside, juicy inside! \n\nThe place is very unique as it doesn't have seating. You order up and there are a dozen employees working the fryers! \n\nThey charge 85 cents for canned soda and 5 cents for hot sauce, but you have to have hot sauce on this chicken.  They are cash only so be prepared!\n\nI was put into a solid 30 minute food coma after eating this chicken as it's very greasy! But completely worth it and will return soon! ...just not for lunch during a work day! \n\nI suggest eating there on a Saturday or Sunday when it's nice outside so you can just hang outside of the building.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2014-01-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'cyQSLCxooGYIML7wLNpOZA', 'review_id': 'cW272pcXJ9t58Kvj8Hxo5Q', 'text': 'Chicken is very good. Great texture.excellant portion of food. Price is good for the amount pf food they serve. Wouldnt classify it as the best chicken on the planet but would def. Recommend it if your in the charlotte area..', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 3, 'date': '2014-02-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'E4cWjfDvTwKwhgXoZDwlBA', 'review_id': 'roC8AeKsdDpkuOTckuGXwg', 'text': "Price's may just be the best lunch value in Charlotte. Eight bucks bought me a lunch plate piled with a juicy pair of chicken wings, hush puppies and fries. Is it the best fried chicken in the South? How the hell should I know? But it's damn good food, and a local institution that'll kept you coming back again and again.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2014-02-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'XAA3QjWsCTd4Ip5iKvHADw', 'review_id': 'VWb-21e5GmvwulBikDjm7A', 'text': 'Best fried chicken in town, a great walk in get your food and then enjoy.  Super fast service with very friendly staff that always welcomes you with a smile.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2014-02-27', 'type': 'review'}
{'votes': {'funny': 23, 'useful': 23, 'cool': 22}, 'user_id': 'VhI6xyylcAxi0wOy2HOX3w', 'review_id': 'jloUftvwKAuSOJBPtRENvA', 'text': 'Popped in to give this place a try as I\'ve heard nothing but good things about their chicken. And the raves are correct. This is really good chicken. A meaty chicken breast that was moist with a very crispy batter that wasn\'t so thick that it overwhelmed the chicken.\n\nI got a two piece dinner, which came with a dinner roll, a small tub of cole slaw, some tater tots, some hushpuppies and the previously mentioned chicken - one wing and one breast. The tots were excellent. Not too greasy at all, but I was glad to have the one packet of ketchup for dipping.\n\nThis was a serious "fried" plate. If they could fry the cold slaw and the dinner roll, I\'ll bet they would have done so.\n\nNote: This place is TAKE OUT ONLY. There is no dining area that I could see.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2014-02-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'lsAVoy7xEjwk8_5cpffWmQ', 'review_id': 'h31VY1KRswMXaB1e1swKzg', 'text': "They say that after finishing his filming, Lenny Kravifz missed Price's chicken so much that he had some flown to him out of state.\nWhether true or not, it seems plausible.\nPrice's chicken is HANDS DOWN THE BEST fried chicken anywhere. \nThat $9 styrofoam carry out box contains love: a half chicken all crispy and brown, deep fried tots, 2 hushpuppies (terrific!), a great little tub of cole slaw poked with a pickle slide and anchored with a toothpick, and an inexplicable uncut hamburger bun. My box lasts 2 full meals for me and that's only if I share the wing.\nThe place is as rundown as you get, there's nowhere to eat. You might get some streetside parking or a spot behind the strip but eating in your car is usually the best option so the chicken doesn't cool too much. If you can make it to the park, so much the better. There are always 4 lines with several people in each and boy, do they crank those orders out! You can get a sweet tea but sodas require some change for the coke machine off to the side. They don't come any no frills-ier.\nThe chicken swims in a lake of oil which is somehow mastered by unseen hands. It is always served perfectly cooked: so hot you can still see bubbles but still moist. It isn't a crust, either - that skin is chicken crack. OMG GOOD.\nThe hours are weird, the parking is odd but the fact that it is filled with African American grand-mamas tells you that it is worth it. Oh, and it is. Just ask Lenny Kravitz.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2014-03-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'SjDv_hX-3MuMnZyfcxetMQ', 'review_id': 'T7TuUMvbfq31U5mTzZVkQA', 'text': "The food is great and I can't deny it but I had to take away a star for the meet and greet aspect. I'm not one of those who you need to know my name when I walk in but I like knowing that no matter how well you do as a business you care that I came. Nothing was said and nothing was done but it's just the vibe that I get each time I go which makes me not go maybe as often as I could.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2014-03-14', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': '2mkJq24ewdAgxhk1bd76tQ', 'review_id': 'ZBg9O55oND7GME7jPypvFQ', 'text': 'I had the 2 pc dark meat dinner. The chicken was perfectly fried, skin and meat were so well cooked. My problem with it was that it had NO flavor. That was really disappointing because everything else about it was good. In addition, I was not impressed by the sides. I could have bought those sides at walmart and made them myself;there was nothing special about these sides. The sweet tea was the best part of the meal, good lawd the sweet tea was amazing.\n\nOverall, Popeyes is better. On to my next search for good fried chicken!', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 2, 'date': '2014-03-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'GrA3BLjRjAKvFYwSqN_4cg', 'review_id': '3qwQ9MjuSML0ek-HFFr33Q', 'text': "Well worth the extra calories for lunch. The fried chicken is what I went for and I was not disappointed. Ordering was a little confusing but they quickly take your order, give you your drink, it's cash only, and deliver your order in a card board box with everything you need. It was busy at about 12:30 on a Saturday afternoon and they have a ton of staff working to take care of the crowd. I had potato salad and the slaw---they were ok. Mayo based and I prefer vinegar based. No biggie, I wasn't there for the sides. Hush puppies where great. I did get a 1/2 chicken both white and dark meat. It was delish and I think anyone in Charlotte has got to go at least once. \nThe only thing missing is somewhere to sit, although I wouldn't want to sit inside as anyone sitting inside for an extended amount of time would come out smelling like they were frying the chicken.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2014-03-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 1}, 'user_id': 'Pg25K4dbwsFAE4JaHqN5Qg', 'review_id': 'XPiy17DSdXWPIeXnvZeyLg', 'text': 'I decided to come here the first weekend when I moved down to Charlotte in September.  Absolutely the BEST FRIED CHICKEN I\'ve ever had.  Luckily, I located this small, hidden gem situated in South End on the first shot. \n\nComing from the north, there\'s not much options out there besides your typical KFC and Popeyes.  And to be quite frank, I am not usually a huge "Fried Food Person", but I swear there is something special that Price\'s does to their chicken.  Whether its injecting it with some type of marinade or coating the entire batch with crack, every bite is memorable.  Juicy inside and fried to the perfect crisp.   \n\nNow lets talk about the service.  I have to admit...first time coming in with no cash, I was chewed out from one of the old southerners in the front counter.  Make sure you bring cash!  And make sure you withdraw your money quick, otherwise you will be the last in line (high customer flow).      \n\nOverall, Price\'s Chicken Coop is a one-of-a-kind hole in the wall with a mix of a NYC attitude/service.  Their quick and get to the point.  Best of all, the food is amazing.  \n\nP.S: Don\'t forget to buy their legendary sweet tea.  It\'s a perfect compliment with the meal after downing all that grease and delicious goodness.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2014-03-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9v8sLBSnMGiLJNsjwXzF-A', 'review_id': 'Occl_Rqkb8ZDBwurrK8DyA', 'text': 'OMG!! Crispy, perfection! Very tasty too! Beware, this place can be addictive! Park right on Camden St (not in back), run in and jump in line! \n\nAlways packed, but  lines moves quick. PUT YOUR CELL PHONE AWAY. Cash only.\n\nRecommend half chicken = 1wing, 1thigh, and 2 breasts. Oh, the Sweet Tea is awesome too. This place is legendary. There since 1962!', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2014-04-02', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'sRa17POgU534LCjkHL1xRA', 'review_id': '7NC4Wqxqv9cosdMD4nrejw', 'text': 'My son and I went there for lunch on Saturday - we ordered a mixed variety to share - fried chicken, fried shrimp, BBQ, slaw.  For me the chicken was the star with the shrimp a close contender.  Amazing chicken - moist, crisp, perfectly seasoned.  The shrimps were big, fresh and not overly breaded.  Six pieces for about $8.50.  Excellent - old fashioned place takeaway only, very nicely priced.  Highly recommend.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2014-05-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '9vx9_9yTyA6OYO5j_xtPqA', 'review_id': 'VBLIiWHJTUqgmO3-tshFyw', 'text': 'Price\'s is INCREDIBLE.  Consistently good, consistently fresh and consistently great service.\n\nI have grown up on their chicken, at parties, church events and family gatherings.  They\'re catering is just like their walk-in, you just get a huge box of chicken and make it home with a few less pieces than you started with. \n\nI have taken many visitors "not from around here" to Price\'s and it always wins them over.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2014-05-21', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 0}, 'user_id': 'LXyjKLZsuWsD5BeUItZMaQ', 'review_id': 'SwO6cD-cCWUCdXGXlBKGNA', 'text': "The chicken at this place will haunt my dreams. \n\nTwo boxes of **incredible** fried chicken, a couple of generous sides, and sweet tea for just $33 -- when I tell people about this back in San Francisco, they may never speak to me again. \n\nWhat a find! I'll be back later this summer for sure.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2014-05-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'JW8vYaECz4lVBdGzaJyjiw', 'review_id': 'oCrVMdlMinXGentrj7A33Q', 'text': "Ordered a quarter dark dinner with a side of potato salad and sweet tea for under $10 - plenty of food for one. Came with a drumstick and a thigh, bread, slaw, tater rounds and hush puppies. I don't usually like drumsticks but this was not dry at all!  Potato salad was creamy and not mushy, flavourful with a hint of tang.  Hush puppies weren't bad, better than most I've had in Charlotte. Slaw was creamy with a hint of sweet. I usually prefer newest tea but this was good. Sweet but not too sweet. Chicken has a nice crisp outer layer and moist all the way through. Tater rounds are pretty standard. \n\nI went on a Saturday afternoon, not packed, good service. I sampled the gizzard and liver. She made suggestions on what to order based on what I wanted. Was willing to sub the slaw with potato salad but I wanted to try both. For $0.90 you might as well try the potato salad. And for $0.85 you might as well get the tea. Or two. Or a gallon. \n\nWish they had homemade desserts. They have a variety of commercial desserts like Sarah Lee pecan pie slice, pound cake, nothing too exciting. \n\nIt was an overall great experience but the chicken was lacking in flavour, hence the lost star. The chicken should be the highlight and it fell short. It had a great crunchy outer but otherwise bland. Nothing beats mom's fried chicken. \n\nExpect to be greasy for days. You get one whole packet of ketchup. If you like it saucy bring your own bottle of ketchup. I came home so I didn't care. Not sure if I'll be back.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2014-06-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'xbn1RTN7dQhLEV1FIitRyA', 'review_id': '6naZWPBQayjlXI0eQcpKqw', 'text': 'Okay, not as good as people told , chicken kinda too plain, no flavor! But a lot people there , and a long line to wait.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 2, 'date': '2014-07-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'klOEDxOUPPXe-2Hd_BGwmA', 'review_id': '7ytTRFuzJ7JOdXeGkZLqWg', 'text': 'Ordered 1/4 white box for lunch.  Also ordered gizzards to share with my party (not the most popular party gift).  \n\nFive stars for chicken- delicious and moist. Possibly the best fried chicken I have ever had.\n\nFive stars for tots- great texture and taste.\n\nFive stars for the price. One of many good and economical lunches in Charlotte. In Phoenix (home) it seems like chain fast food is the only way to eat lunch under $10.\n\nFour stars for the slaw\n\nThree stars for hush puppies. Dry and not much taste.\n\nThree stars for gizzards- too light on the breading for my taste.\n\nI will be back but stay clear of gizzards.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2014-07-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'JWZ-90QJ9pPNgsp66f62Cw', 'review_id': 'iID88YXrCwTz6MAL3K42KQ', 'text': "First stop upon arrival from NYC!  It is basically a fast food restaurant with great fried chicken!  We ordered the whole chicken all dark meat with a sweet tea for 2.  The meal consist of 4 thighs and 4 drumsticks.  There was no seating inside the restaurant so we ate the chicken in the car.  \n\nChicken was amazing!!!  It was not too greasy and super crispy fried skins.  Although it was a tad salty and not as juicy as I wish it would be.  Don't get me wrong, I enjoyed this first meal in Charlotte.  But I'm comparing it to some other fried chicken spots where the juice runs down your chin at each bite.  The sweet tea was very refreshing.  \n\nPrice's chicken coop was a great start to my trip to Charlotte.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2014-07-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Y6LwLDD_0FVKS_wWXxwrBg', 'review_id': 'sXgP99lWdfqiwWji09NF2w', 'text': 'Two words: Hangover Cure. (Okay maybe that\'s four).\n\nI\'m from a small little nugget town called Trinity in NC so I welcomed the small cookout-fundraiser feel of this place. "Get you some fried chicken. Get you some fried fish!" It highlights Southern staples in the heart of the city! \n\nA little nauseous from the night before, I NEEDED some grease. So I got me a "plate" and it was bombbb! (Reference my pic) Oh and I\'m a hugeee pepsi fan, and any soda lover knows that drinking out of a CAN is key and they had vending machines!! Whew!\n\nNeedless to say, what everyone says about this place being Heaven\'s restaurant choice in Charlotte is true, my hangover was healed! Hallelujah!\n\nYou\'re welcome.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2014-07-31', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'X36p3mD4oqBE53sASc_Ykw', 'review_id': 'qZIYr7ZKH0UEjUnqmGO_dg', 'text': 'A really good FRIED chicken option, but to me, it did NOT live up to the hype!\n\nThe good: Very tasty Fried Chicken batter. Some spiciness, and good crunch. Prices are dirt cheap!\n\nThe average: Potato Salad was decent but not "knock your socks off" variety.\n\nThe bad: Hush puppies. I LOVE HPs! But these were soggy and just not that good. Some others of you out there have raved about them....well not MY version! I\'ll have to give these another try!\n\nThe Service - Phenomenal! The lady who helped me recognized that I was a first time customer, and she guided me through the menu. \n\nOverall this was a good place! I need to come back and try some things again.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 3, 'date': '2014-08-14', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '1nqDMU17-gYHS87z6PoUNQ', 'review_id': 'k2JxBUPEbe0wMVzGe79HOg', 'text': "Wow! Best chicken anywhere and done by really great people.  Just hate it that I don't live closer by....but it is worth the drive!", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2014-08-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 2}, 'user_id': 'zKIypkLCTNdcVNKI4-LQPw', 'review_id': 'Rn6ZzkhzDswmoFlXZ-THGA', 'text': "I'm not sure what else to say about this place that hasn't been already said. This place is LEGIT. Lines are long but goes fast. Chicken has always been fresh as can be when I go there.\n\nChicken is the best I have tried in the south so far.\n\nThe service was top notch also. The south for sure is very very nice and friendly and this place is no exception.\n\nThis is my place to eat again when coming back to NC.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2014-09-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5WnZbqXkhbh7J65ozsNPpw', 'review_id': 'ocNqIyf_iTU4yy71AFZ5ug', 'text': "My Prices Chicken experience was pretty rad. The chicken was well seasoned, moist, and fried to perfection. The slaw was a little heavy on the vinegar but tasted great after a little pepper was added. My only negative was the soggy greasy tater rounds. The amount of grease and texture (almost mushy) was a little much for me. However, mine was picked up and driven a good ten minutes before I ate it so that could have played a huge part in the finished product.  Over all it was a great filling meal for 6 bucks you really can't beat it.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2014-09-12', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 2, 'cool': 1}, 'user_id': 'xxNNSpo9HMfHEEaT215fuQ', 'review_id': 'uRiAQVyUm9nvq73rudTKxw', 'text': 'The other reviews for this place are really spot on. Cash only. No seating. Take out only. Be prepared with what you want (kind of feels like the soup nazi a little bit, and I am slow to make decisions - panic mode!). But it\'s pretty darn good.\n\nThe chicken is fresh and crispy. I had the 1/4 chicken dark meat meal. Really good chicken. They don\'t do fake/over processed  chicken, no boneless anything. And when we asked the lady at the register if they did chicken strips, she smiled and said, "no, baby, this is real thing only."  Perfect response.  I\'ll definitely come back here, with a little blanket to sit on the grass.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2014-09-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'wKdF97FxYQZbhBRa5ulEAA', 'review_id': 'MGVrUTrHMfy6vR0RUnZ0KQ', 'text': 'Best fried chicken anywhere... The only reason for the 4 stars is because their side options are lacking quite a bit... I have gotten used to having mashed potatoes and gravy and a biscuit with my fried chicken... maybe some mac and cheese.  Here you have picnic sides (potato salad, tater tots, etc...)  But the chicken is well worth the trip alone and it\'s extremely affordable and not processed cheap chicken.  I recommend just getting a "whole bird" and have at it with a friend or 2.. more than that and you are going to fight over the last pieces for sure! \n\nThe place is an older building that looks like a front for a crack house or drug smuggling operation but if it ain\'t broke.....   the people are extremely friendly and service is pretty fast depending on the time of day that you go.  Saturdays a great time to try it for the first time and take it for a picnic or just lunch... \n\nWith that being said...  \n\nNOTE: NOT OPEN ON SUNDAY OR MONDAY!!!  You don\'t want the same disappointment I had when I tried to go for lunch one Monday to be denied at the door.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2014-09-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zgKN0jcNaNaY46xsDaxYTw', 'review_id': 'ejasOyRTH3Y64BRsBzFIhg', 'text': "After reading all the raves and talking to a few locals, I put Price's on my hit list and felt I had a slam dunk for some down home Carolina mom and pop fried chicken.\n\nSo I got there on a rainy Wednesday at 11:30 AM to beat the lunch rush. Great, no lines, a no frills civil rights era looking store interior and 5 eager cashiers ready to take my order. I ordered the 4 piece or half chicken dinner, a side order of livers, and sweet tea. There was a short wait for the livers. \n\nWhen I was called to get my prized white box of chicken, I felt like my number came up for a bingo jackpot. Could not wait to sink my teeth into what may be the best fried chicken I've ever eaten in my life.  \n\nGot into my car with rock star parking right in front of the store (no customer tables and chairs) and carefully arranged my food around the center stick, dash, and passenger seat. Finally the moment of truth - I picked up a leg and bit into it.... I then closed my eyes in disbelief. I almost cried. \n\nIT WAS COLD. IT WAS NOT CRUNCHY. IT WAS PRE COOKED FRIED CHICKEN. AND TASTE WAS NOTHING THAT WOULD BLOW YOU AWAY. \n\nNow, I recall all the chicken parts were sitting in separate piles waiting to be assebled into boxes to tame the crowd. The only thing I saw that was actually cooking, that hit the hot grease in the row of deep fryers, were my chicken livers. \n\nBut I will say the livers, tater rounds, hush puppies, and slaw was pretty good. They do a brisk business as many people were in and out with their white boxes of chicken. i JUST DON'T GET IT.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 2, 'date': '2014-09-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'VDAbMc0V5R_cFjvxynXmig', 'review_id': 'BdTDfJ-LNHcrd0wSVuG6yA', 'text': "Charlotte's version of Seinfeld's Soup Nazi!  Get in line,  order from the board,  put down your phone,  and cash only.  But the food is on point for southern fried take out.  I love the chicken,  but I think they have the best fish sandwich or dinner in the area.   8 oz of fish on a roll for $4.25.  Awesome.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2014-09-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '1K50PvXa6l5PBXZXhzkB-g', 'review_id': 'SQ6g84FupSjAKWiXEx4UJg', 'text': "This place is probably going to give me high cholesterol, but who cares, the fried chicken is just about the best I've ever had. It is crunchy while still being tender and juicy. \n\nThis placed is TAKE OUT ONLY, which is fine. Lines get a little long but they are pretty good at getting people in and out. Also, try to know what you want before you get to the counter. It can get a bit overwhelming trying to read the menu and decide what you want while you have 20 people waiting behind you. Oh yeah, CASH ONLY!\n\nThe sweet tea is PHENOMENAL. I can't even put to words how good it is. In fact, it's actually ruined sweet tea for me -- anytime I have sweet tea all my mind can process is how it's not even close to being as good as the sweet tea at Price's.\n\nThe missing *star* is for the fact that the sides are just OK, nothing out of this world.\n\nThis place is a MUST GO to, if you are in Charlotte, North Carolina.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2014-10-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'anSt11bQRenDwFRqGjigTQ', 'review_id': 'AYgbKDfBluPSPkQOHo1q-A', 'text': "I've heard a lot about this place and made a point to try it.  You have to make a point as their hours are quite short in that they close at 6 pm and are not open on Sundays.\n\nIt is definitely an experience, especially to be seen.  The restaurant is a carry out only with just a counter and a line of cashiers.  They're all dressed in white, with a slight dusting of flour that has likely wafted through the air.  It looks exactly like a scene out of a 1950's cafeteria.  There's even an overseer, also dressed in white, who fits the bill, older, heavyset gentleman, watching very carefully the ongoings through his black horned rim glasses.  I asked and they told me it's a long lived family business.  Now, I'm not describing this to imply a negative light, but rather it really is an experience to behold that reminds me a lot of small towns in Texas back in the 70's where I grew up.\n\nNow to the food.  If you don't like chicken or chicken parts, you've come to the wrong place.  They're an efficient menu that cooks chicken and chicken accessories many ways as long as it's fried.  It's true southern fried chicken.  I've tried a few other establishments in the fine city of Charlotte to partake in these southern dishes that I aren't quite replicated in Baltimore, and I'll have to say that in my opinion, they won't rank the best chicken for me.  I'd say it's OK.  I found the skin a bit salty to my taste. And it was a bit dry for me.  But in all fairness, I think the place I have in mind which is the best, the chicken is cooked in lard.  Yeah, so there's that.  So, I wouldn't eat lard fried chicken except for once in a blue moon.  I am pretty certain that Price's does not use lard, though I didn't ask, as it would be too expensive for such a large operation.\n\nI would have taken some photos, but there are like 3 signs in the establishment highly suggesting you don't use your cell phones or other electronic devices.  I was scared that I unholstered my iPhone, I'd be run out of there, soup nazi style.  But I checked and there are some photos already for this restaurant that some brave souls took already which I think are descriptive and of the only things you could take:  fried chicken and the ordering counter.\n\nIt is certainly better than the chain chicken restaurants.  So, it's good chicken and a sight to behold.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 3, 'date': '2014-10-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'T7eyOatIKKQyW9WopkKI9w', 'review_id': 'xIc-XQMuUztkszoCH2Jwzg', 'text': 'first time ever checking out the famous fried chicken joint!!!!!\nsuper friendly staff,and the service was pretty fast.\nI had the 1/4 white chicken box. it comes with a breast and a wing,2 hashpuppies,coleslaw,good amount of hashbrowns and a roll. oh the 1 packet of ketchup,lol\nOK,the roll is like the one you get from the grocery store. \nhashpuppies were good ! and hashbrowns ,cant go wrong with those !!! \ncole slaw is meh,the texture is too watery and a bit acidic. not a fan of it.\nThe fried chicken was excellent !!!! it was meaty ! you get a good amount of meat for the breast ! its like twice the amount of meat compare to other fried chicken places.\nthe meat is tender and moist. however, i wish they had hot sauces or had spicy marinated chicken options.  \noverall great deal for $8 !!!!\n\noh i think they only accept cash at this place!', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2014-10-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'm3udgZ7qhq2nYIpAua6ZVA', 'review_id': 'GeWvND8VWouaQmFOqE4eDA', 'text': 'First stop on Roadfood NC tour. Crispy, moist fried chicken. No seating. Inexpensive and super - fast, friendly service. Got the fried gizzards, tater tots, hush puppies.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 3, 'date': '2014-10-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '7WIhy4u6Xf4_L1cBxaGAzg', 'review_id': 'O7Z188MCTCnVXDm2qNnkuQ', 'text': '4.5-- really. Authentic southern fried chicken. Being from another part if the country I was a little lost looking at the menu. But ordered successfully. \n\nAnd had a great JUICY well seasoned chicken breast. Or a 1/4ofa3-1/2lb chicken sandwich. The way to go is the dinner. Because it includes hush puppies and potato rounds ( tater tots).  \nTake some time to absorb the atmosphere. And order a 1/2gallon of sweet tea yum !!', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2014-10-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'f4Vzl2My5q5XVehYQhVkKw', 'review_id': '4oIJu0LWA3YFT07lJIEXFg', 'text': 'This place is the truth!!!! 3 wing sandwich + sweet tea extra lemon every time. When in Charlotte come here and they never disappoint. GEM', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2014-11-03', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'hSRWl8J6wKTnF2i6wd84zg', 'review_id': 'Sv4_2xigD01OCdBOjTkgPw', 'text': "Fried chicken like no other. Thin crispy outside and moist inside, a mountain of tater tots, Cole slaw, soft roll and the best hush puppies. That's the dinner or just take home a whole bird to share!", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2014-11-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'zknkjK_N53QU9MWjAkppUg', 'review_id': 'g6X4GDR_uuhyqBBbXwnFMg', 'text': 'actually better than the first time and that goes some.\n\ni enjoy the food production in preparing & cooking your food. love me some white meat and they do it right! It is not dry and is tender .... that is an accomplishment!\n\nIn my travels, I always look for barbecue FIRST, then a good local place for fried chicken. Every community has someone who canary the hell outta of some chicken1 Every community - remember that.\nWell ...... Price\'s Chicken Coop is that place in Charlotte.\n\nIf you are visiting you have to try it!\n\nIf you are driving through Charlotte, it is absolutely with the slight detour. \nYou can continue your trip humming to yourself contented & satisfied. You will thank me.\n\nThey have it figured out. They charge 85 cents for sweet tea BUT $1.50 if you don\'y want ice in it. That is funny because we all order "light ice" or "no ice" so that we can get more drink. \n\nThey know that trick and make you pay for it! \n\nThat is too funny!!!', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2014-12-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'COAKn0ijPA3rTbONRiEc8w', 'review_id': 'yszPenSgKVFfpurB-T2x9A', 'text': "I was pretty underwhelmed with the chicken. Super friendly staff and the price isn't bad but the chicken was nothing to write home about. \n\nI will say it wasn't BAD and for the price I really have no complaints. It just didn't live up to the hype for me. I got the dark meat combo and the chicken was borderline dry! Only thing I thought was excellent was the sweet tea. Maybe the best I've ever had and I'm not even a sweet tea fan!", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 3, 'date': '2015-01-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'kqwcE_qJHQ8eaGUxJjrl2A', 'review_id': '84S079kBhOSUgR331ER5Mw', 'text': 'Went there around 2pm on Tuesday. Chicken was good, the potatoes tasted like they had been laying around for a while, same with the hush puppies. Sweet tea was great!', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 3, 'date': '2015-01-09', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 5, 'cool': 1}, 'user_id': 'bRIk0mT3GU51Zsrn2UpKIg', 'review_id': 'cqQ8KLVsTNVhk2dxeod2GQ', 'text': "When a place has almost 200 reviews and an overall rating of 4 stars, there is a reason and there is truth to it.\n\nI can tell you what anyone else on here writing a review will tell you - the fried chicken is good. Pretty great actually. The slaw didn't do it for me but the sweet tea will knock your socks off with diabetes it is so sweet. I mean this in a good way. Do yourself a favor and get the tea without ice. Or just buy a half gallon. Trust me.\n\nI also ordered fried gizzards and while I thought they needed more flavoring, I almost ate the entire package before I got out the car. OOPS! \n\nMy coworker placed an order for a 1/4 dark sandwich which was a great deal for $3 and change. It even came with a side.\n\nThe lady who helped me at the counter was very patient with me and let me split my orders up since I was ordering for the office. I was prepared with what I was ordering and maybe that is why.\n\nExcellent service, Excellent Fried Chicken and Excellent Sweet Tea.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2015-01-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'eShGsOh5EgQeygZwmdPz-A', 'review_id': 'YBVYDaDHw9HiigWql26RWA', 'text': "I was pumped to go get some fried chicken after hearing raving reviews about this place. Due to the awesome prices I couldn't resist just getting a whole dark chicken. The whole experience was pretty quick with minimal waiting time. Had to rummage up the dollars I had in my wallet since it was cash only. Luckily had a few dollars left over to help out my friend. \n\nThe box was filled and the chicken smelled delicious. If only it tasted that way. There was an odd taste to the chicken which was almost like soap. It wasn't a deal breaker and was still edible, but that wasn't the only problem. The chicken first of all is way to bland, where is the flavor! Secondly, it tasted like it was probably left out for a while. I heard some people complain that it was too greasy, but I don't mind me so artery clogging liquid. The chicken king right down the street from me is a much better choice. Popeye's is still leagues above this. Maybe I'll give it another shot due to its reputation, but I don't have high hopes.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 2, 'date': '2015-01-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'utf9leB95ec7WNQ3VYdLWw', 'review_id': '6N2g336My2BYU4b1xwRwhw', 'text': 'In my opinion just an average chicken place nothing to write home about just basic good chicken bad parking in a bad location very busy around there traffic wise also.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 3, 'date': '2015-01-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Gjk_MNboKKAL-n-F1SnWVw', 'review_id': 'Fgh_1KpnXq_BvOL8lS2NNw', 'text': "Great bang for your buck! The dinners are huge, way too much for me, so I usually just get the fish sandwich and swap out the bread for some hush puppies. The fried chicken here is greasy but sooo delicious. I've tried the fried shrimp here too and they're good too. Staff is very friendly and service is always very fast when I go.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2015-02-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '39FFe_Im8muGn2HX-bl-AA', 'review_id': 'olqZJfF8n3aMARE6LwOUHw', 'text': "I'd heard about this place but had never really looked it up or found it.  Since we were in Charlotte for the day I decided to find it and check it out.  It wasn't too far from the South Park area where we were staying so we hit it for lunch.  I'm a big fried chicken fan and I like to try out the chicken at most restaurants and buffets in the area if I have a chance.  My brother-in-law had told me he had gone here and really lied it.\n\nIt's strictly carry-out..no tables, no parking.  You have to park on the street.   Unfortunately we didn't order a dinner so I didn't get to try any of the sides...we only wanted to try their chicken.  My wife and I both ordered a breast and wing.  I had a sweet tea.  The chicken is as good as most of the people say.  Nice and juicy, crisp skin.  Since we didn't order a dinner they gave it to us wrapped up in a thin paper and a lot of napkins.  I would say it's some of the best chicken that I've tasted....not the best.  The best chicken I've had in South Carolina is Bernie's in Columbia.  This would run a close second with Shealy's Buffet in Batesville-Leesburg area.\n\nI'd like to go back and try a dinner next time..  Highly recommend the chicken though.\n\nCash only...no credit cards.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2015-02-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Sq1xD83V8PwZifeeEcTH4g', 'review_id': 'Uo708UB-bOQoxKyOKdm3ww', 'text': "HOW HAVE I LIVED IN CHARLOTTE FOR NEARLY A YEAR AND NEVER EATEN HERE????  Delicious, juicy, amazing chicken.  Can't wait to go back and eat all the chicken!\n\nDown side is parking is atrocious and they only serve tea.  They have drink machines but you have to put exact change in.  Lame.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2015-02-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KFF_u2ytqs2Z_EHolxHsNw', 'review_id': '2C2gu7jqwG59N2GUF5ggDg', 'text': 'If you haven\'t been to Price\'s Chicken Coop, you\'re missing out on the best fried chicken in Charlotte - this is a fact. Price\'s has been around probably longer than I have and with good reason. The location is awful but, is it worth it? YES! If you give money to beggars - bring an extra buck or 2 because half the time there\'s someone just outside asking for money (hey, it\'s true - I\'m not knocking them). You\'d think the location would be a deterrent for  your more businessy types but, all walks of life are found at Price\'s. If you want the best fried food that you\'ve ever put in your face-hole - you can\'t beat Price\'s. You can\'t eat in - it\'s to go but, I wouldn\'t dare call it fast food (I also wouldn\'t dare call it healthy - it\'s what they call "food for the soul"). PS. my grandma (who has lived in dilworth for longer than I\'ve been alive) says the fried fish at Showmars is better. (Still, the fried chicken is the best).', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2015-02-14', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 5, 'cool': 3}, 'user_id': 'I90SP-xjPO8LLfZXSrAAFQ', 'review_id': 'TAcksu9AGKXNtPPv91U7-Q', 'text': "There are places in this world that exist to do one thing and one thing only.  They know their limitations.  They don't overstep their bounds.  They keep it between the ditches.  Price's Chicken Coop is such a place.  They make fried chicken.  \n\nI heard a lot of hype about Charlotte, NC's Price's Chicken Coop - its been slinging fried chicken since 1962; its been featured on the Travel Channel;  its got a reputation as a go - to place.  So a friend from Charlotte took me there so I could give it a try.  I admit, expectations were high.   So let me get some housecleaning issues out of the way before I dive into the chicken.  First of all, its not a restaurant. It's a take-out joint.  They have no seating.  Second, bring cash - they don't accept plastic.  \n\nNow for the chicken.  I ordered gizzards.  When I see 'em, I order 'em.  And, because I had never been here before, and even though I have a predilection for dark meat, I wanted to try both white and dark, for the whole experience.  So my buddy and I ordered a whole bird, cut up.  \n\nIt was late lunchtime and the place was bustling - no parking lot, just the curb.  We entered and ambled up to the counter and ordered.  The walls and ceilings were stained from years and years of deep frying.  It is a real dive (and that's not a bad thing).\n\nHaving opined on the chicken gizzard at length before, (see my review of Florence, SC's The Drive - In) I will only say that these gizzards were subpar; puny and overcooked, not made to order, and a total disappointment.  The whole chicken fried was just ok, mildly seasoned, a bit greasy.  The sides:  cole slaw, tots and hush puppies; nothing to write home about.  All and all the hype is much greater than the bite.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 2, 'date': '2015-02-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 2, 'cool': 1}, 'user_id': 'Oj4Cy2THk0Eh-N2NO3iJgA', 'review_id': 'tphv7QLnNz7t-DZgquhAjw', 'text': 'After reading reviews, I thought this was the place to try on my one night in town to pick up my daughter from the airport for a spring break visit to Boone.   \n\nThe chicken was very tasty, with crispy skin and moist while being cooked perfectly.  I enjoyed the potato rounds but felt that the coleslaw had an odd flavor and the hush puppies were pretty bland.\n\nThe staff was friendly and efficient and my order was placed and packaged in under five minutes.\n\nWhile I prefer Nashville style hot chicken, I would return if I was in town for some good ole southern fried chicken!', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2015-03-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '8CRolweVoTvIyp9y_5d8dg', 'review_id': 'Hsmv3RfKowamtQ5085_hjA', 'text': "I got the white dinner, it was a TON of food. The chicken was so juicy and tender. Absolutely perfect! It comes with a roll, a bunch of mini hash browns and 2 hush puppies. It's really crowded at all times so be prepared to wait in line. CASH ONLY!!!!", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2015-03-05', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'N-6XYqbnzLpUs97MBasOnQ', 'review_id': 'uYEEWAzGqMWowz5bfLnIuQ', 'text': "Worth the hype? Absolutely. We ordered a whole chicken mixed, tater tots, slaw, rolls, and tea. Between the two of us we destroyed it all. Is it greasy? It sure is but in a good way. The meat is juicy and flavorful all the way to the bone. It was ridiculously crowded but still got in and out in under 5 minutes. Some reviewers are going to be pissy about anything but I felt it was worth the drive. We'll definitely be back and next time we're getting some fish and shrimp.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2015-03-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TNP8QR5czmgMteXjfptalA', 'review_id': 'gSHTmT_J6UzuFeVaTMKR-w', 'text': "Did NOT live up to the hype. At all. \nI want to just chalk it up to an off day, or a fluke bad experience, but they forgot my order completely, my husband found the three wing sandwich left a lot to be desired, though my son seemed to really enjoy his hamburger. And tater tots were heavily fried with a lot of residual oil and a little over crispy, and the hush puppies had very little flavor other than oil and bread.  Because it's not an eat in establishment, plan to eat nearby, either in your car, or in a nearby park. I think the chicken may have been improved upon had we eaten it a little sooner. We drove around for about 10 minutes trying to find a shady spot to eat. But I have to say, I've had great fried chicken, good fried chicken, and okay fried chicken. Frankly my last trip to Popeyes was more satisfying all around.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 1, 'date': '2015-03-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'EP-B9fGj6pBVdvLaLbqalA', 'review_id': 'S4HSSZiIQ1u2SXdx8HUlzQ', 'text': 'The chicken was decent, moist and seasoned well. The portions were a great size for the unbeatable prices! The tater tots were also delish, as was the sweet tea. \n\nThe livers were over fried and dried out. The dark meat "sandwich" was a couple of dark meat pieces (bones and all) thrown onto a bun. Maybe that\'s a southern thing I\'ve never heard of?\n\nIt was a good experience while we were passing through Durham, but I don\'t think it\'ll be a regular pit stop on our travels.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 3, 'date': '2015-03-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'aGYGJrTgOQ7uagBJm5ncOw', 'review_id': 'pVnlkUjb8xVvjYr9PUFJ0g', 'text': 'There\'s an old story that still circles about a man who tried to rob Price\'s Chicken Coop. It was a typical busy lunch time and business was good, lines were long. He walked in brandishing a gun and demanded money from the registers. Before he could react one of the men running the counter drew one of his own and shot the would be caper down before calmly saying "next please". Weather there is any truth to this tale we may never know but once you step inside Price\'s and realize the neighborhood it which it sits was once full of grit, you want to believe. \n\nThis is old Charlotte, tried and true. Don\'t expect to pay with plastic or eat with anything other than the cheapest plastic utensils available. In fact, the only thing you would need them for is the slaw, which is good but that\'s not why we\'re here. Get some baby wipes together because those thin napkins won\'t help get that grease off your fingers. Oh and take your box and get out of the way. Drive home if you dare, the smell will have you getting crumbs on your alcantara in no time. Do yourself a favor and go on a nice day and use the built in table on the back of your car. \n\nFirst time? go for the quarter dark, tea. If you like white meat get the wings box. Nothing against the breast cut but the meat to coating ratio favors the meat a bit much for my tastes. Shrimp box is amazing, like your favorite Calabash place but with better batter. If you want a huge card stock rectangle full of iron rich nuggets, they have that too. Chicken sandwich is an old style idea, let the customer pull the meat off and stack it on the white bread roll themselves. Sides? I dig the Kennedy piece tots and the hush puppies just fine but after all they are just sides. \n\nStop by the south side with a twenty and a smile, you won\'t regret it!', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2015-03-26', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'mtgoV6nSueJC9SgYRYYF0g', 'review_id': 'KOj8icC2StGgMGbOpQj4Ag', 'text': 'You know when someone tells you that "You have to try" this or that... or "This is the best place."  Typically, either your expectations are too high and you are let down, or the place really isn\'t that good in the first place.  Well, Price\'s Chicken lives up to the hype.  This is THE best chicken I have ever had.  I do not say that lightly.  It is counter service, and even the long line move fast... I would recommend going at an off-time so you can be in and out because the lines get long.  Definitely try this place.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2015-03-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ZafP5QNCPuF-ku7L-Rt3wA', 'review_id': 'wFge8XbZCC3m5W73aZI0AQ', 'text': "It was okay. It's overrated at best. Nothing unusual by any means. Crazy menu I think. Oh, the on-street parking is horrible.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 2, 'date': '2015-03-28', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '4651zZR_dUgs-k-JJcG4Ww', 'review_id': '4IPfBF423hg6kPzHgovXlw', 'text': 'Fried Chicken was hot and on point! The shrimp were not impressive and pretty bad to me. Play it safe and enjoy the fish or chicken if you want to indulge in fried food! The iced sweet tea was near perfection!', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 3, 'date': '2015-04-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '77MlG-NQVKDibwXdK8RW4w', 'review_id': 'Mwz1bW25qr64JBKTVJXqFw', 'text': 'Amazing chicken. Ah-maz-zing. The tots were just a tad overcooked fir my liking. Cole slaw was bomb.com. Definitely coming back and recommending to friends and family.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2015-04-07', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pad_WKs6PFh3RO8MWPwmAA', 'review_id': 'A_MwMYtTJQ1gvjURE3lsOw', 'text': 'Uschhhhh! The chicken here is the best. Expect a long wait but its worth it. The chicken was juicy and not dry and seasoned just right. After eating please dont forget your fried Sweet Potato Pie "KLAWD"', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2015-05-04', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'ZzH8eT_kaflG2_piqIWkUQ', 'review_id': 'EetWO9wnzRqEBJl96Tj4YQ', 'text': "Wow not what I was hoping for. My first ever experience was very short of the expected hype around this place. Very friendly staff food came to me quick but the negative parts come now. I sit in my car bite into my breast and nothing but oil and grisle come out. Very little meat very greasy. The wing was far better then the breast I'm sure the legs would be decent but for sure not the best fried chicken I've had. Not even the best fried chicken in charlotte. I wanted to love this place but can't say I'll be back.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 2, 'date': '2015-05-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'cLTwu7S1Fd92riDdtB0Hqw', 'review_id': 'tgV7D4RMn-mw9hg5k-jzZg', 'text': 'Cash only and take out only. It was good. I was way out of my comfort zone, but I ate it up. I expected my "sandwich" would not be bone-in meat. And I didnt automatically expect my tea to be a sweet tea. But I devoured it all.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2015-05-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'pad_WKs6PFh3RO8MWPwmAA', 'review_id': 'bftp_U7_9T3gI5Gb_bYA3g', 'text': 'Charlotte - Uschhhhh! The chicken here is the best. Expect a long wait but its worth it. The chicken was juicy and not dry and seasoned just right. After eating please dont forget your fried Sweet Potato Pie "KLAWD"', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2015-05-18', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'IzIHqzyiCUCd8e-qXZd7dg', 'review_id': '6jahC11rwtvgBv8wZGTL7A', 'text': 'Tasty, crunchy chicken goodness! Classic sides but not mind-blowing. The chicken, though. Yum.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2015-05-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'UbpmRvXTFl95VKzRsObQ3w', 'review_id': 'IJ31nepIxoz8cSWP-1Hi9A', 'text': "When the Carolina Panthers first began and an enormous stadium was opening within walking distance, people asked them will they open on Sundays.  They said no.  When the whole world started using debit cards, people asked them will they start using them?  They said no.  When drive throughs took over, would they...?  No.  How about speeding up your cook time?  No.  You could cook faster at a higher temperature.  No.  How about delivery?  No.  How about expanding?  No.  What about a new swanky building near the fancy condos?  No.  How about new uniforms that aren't from Mayberry RFD?  No.  And on and on and on.\n\nThis may be the very last truly authentic place left on earth.  The fact that their chicken is 'Price'less is poetic.  I truly applaud them on all counts.  They deserve every accolade they get.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2015-05-30', 'type': 'review'}
{'votes': {'funny': 3, 'useful': 8, 'cool': 0}, 'user_id': 'XBEFCBTJBLCLfNrjRu2fgg', 'review_id': 'BlJs-f8FOCXMrgJU1Ne4vw', 'text': "Thinking about eating here? Consider this first. The owner of Price's is likely the scummiest businessperson in the United States that I have had the displeasure of knowing existed. Sure, his chicken is actually not bad, but hear me out.\n\nIf you park in the private lot for Price's after 6pm, YOUR CAR WILL GET BOOTED OR TOWED. No exceptions, EVEN FOR CUSTOMERS. It's absurd to think that there are people like this in a first world country who would hire his own towing truck service in order to extort people, including his actual customers, out of $50.\n\nIf you care just one bit about where your money goes, DO NOT EAT HERE.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 1, 'date': '2015-06-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 3, 'cool': 0}, 'user_id': 'HjGk_PBMOb17A7B_L1NSqA', 'review_id': 'QU6FhkjE4XLOos8Siv5t0Q', 'text': "Fried Gizzards.  Forget the chicken.  As an undercover Southerner, I was giddy with excitement that Price's had that rare bit of fried offal.  Like little chunks of deep fried erasers, gizzards don't really have any flavor, but a chewy rubbery texture.  At Price's, they're not bad, but not great either.  Which kinda sums up the rest of my experience.   \n\nLocated in an up-and-coming area of Charlotte, Price's Chicken Coop stands out among all the hipster-ish boutiques popping up.  The shop was bustling when we arrived - people were coming in and out with white boxes.  \n\nI wanted to love Price's.  I read most of the yelp reviews - the good and the bad and played Russian Roulette with my stomach.  I lost.  \n\nThe smallest portion size, which is 1/4 of the bird, or about four pieces, is enough for two people.  Coleslaw was forgettable and the tator tots were lukewarm.  The breading (the most critical part) was flavorless with no seasoning or salt.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 2, 'date': '2015-06-05', 'type': 'review'}
{'votes': {'funny': 2, 'useful': 1, 'cool': 0}, 'user_id': 'LfuDMPZEuZ_IblrvC2kaXQ', 'review_id': 'y3CMChNumoVpYifsX0OyJw', 'text': 'It was recommended as some of the best fried chicken in the nation by Bon Appetit Magazine, Diane Sawyer, Jay Leno, and the bus driver on my tour of Charlotte, so as a bona fide foodie, I knew that I would have to give their chicken a try! And yep, I think that they were right! The marinated chicken is seasoned just right, breaded with crispy deliciousness, and deep fat fried in a marvelous taste producing peanut oil. The results were simply yum! A half chicken dinner is reasonably priced at just over $10 and comes with potato rounds, Cole slaw, and just about perfect hush puppies. Now, all of that deep fried goodness may not be really good for you, but you could just consider a salad for dinner while you enjoy chicken bliss for lunch!\n\nTwo warnings before you rush over...they accept cold hard cash only...keep your cards in your wallet. Second, the food comes in a box to go. You will have to be patient a little while longer to enjoy the food in another location. Please consider the safety of all around you and do not scarf down the chicken and drive. Enjoy the bird responsibly!', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2015-06-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '41iLS-omXEmhbXpVAZT_EA', 'review_id': 'xR7_mXmhijmp7AKo2js9dg', 'text': "A smidgen above Average at best. Have no idea why this is continuously hyped. Don't get me wrong it's good but it's not all what everyone makes it out to be.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 3, 'date': '2015-06-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'G9VZ5-diu3tFtzE6DZsrhw', 'review_id': '7H915q8WShnP4zJ04Pev9Q', 'text': "Best fried chicken I have ever had, period. The skin is just right, crispy, without being overly greasy. Price's must have their own private supply of special, meaty chickens...I always feel like their full chicken meal is one of the best deals in Charlotte. Give them a try (bring cash - no credit cards) - if you like fried chicken, you will love Price's.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2015-07-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'glzRad3_l42hALvjB9p97w', 'review_id': 'ehEXpbhmFfmSBjSzaq0jCw', 'text': "EXCELLENT!!!!  Some of the best fried chicken I've ever tasted.  This place can be crowded, but it is so worth the trip and the wait.  It has been there for years and famous in Charlotte.   You can't eat there, you have to take it to go.  They give you a lot of fried potatoes and hush puppies with the meals, which makes you feel even more full.  But I would definitely go back to just get a half chicken and nothing else.  LOVED IT!!!!!!!!", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2015-07-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Hg4GF6sHT_9tuHIvrfpkpw', 'review_id': 'Gd62zZ4ZQtAWVfYRUbG_EA', 'text': "Since I had never tried Price's chicken before (and after living in Charlotte for 3+ years walking distance to Prices, that is a travesty!), my husband and I decided to break our Pescatarian streak and eat some fried chicken!!! This placed is AMAZING!\n\nWe came by around 2pm on a Saturday. There were suprisingly alot of people here. The place is a hole in the wall, take out only, CASH ONLY, place. We decided on the 1/2 mixed chicken dinner. And a sweet tea for me.....$0.89 ya'll!!!\n\nThe dinner came with hash brown rounds, a breast, a leg, a wing, a thigh, coleslaw, and a roll. The chicken was cooked perfectly. Super juicy and the crunchy skin was just delicious. The hash brown rounds were pretty good as well....maybe a bit more fried than I like. Didnt try the coleslaw (it's just not my thing) or the roll cause i was so engrossed in the chicken.\n\nIf you have a fried chicken craving, this is the place to go!", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2015-07-21', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'tUBIeeEhNdE_kxqLAiUhtA', 'review_id': 'ToR0KYMkX98s1zGgiO72ig', 'text': "Love a hole in the wall fried chicken place ( see Harold's in chicago).... This was fantastic . The people who work there are darling. Worth seeking out.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2015-07-21', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': 'HBRsJ0cXz4sBGERhLhBLkQ', 'review_id': 'R62spcXHBx7liNzt1b1W-A', 'text': 'The fried chicken is really good. However, the hushpuppy was missing the sweetness of a hushpuppy. The tots were over fried.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2015-07-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Hs9lXWyxXvQd6pAfHJrBUw', 'review_id': 'Q-P4NH6c82TvnJAwB39ISg', 'text': "Anyone from New Orleans would understand & appreciate why making trips here when possible is good for the soul. (but probably not for your waistline!)\nThey've taken frying chicken & fish (as well as other accessories to those two staples) to a high-art. \n The fish sandwich, in my opinion - is a bargain at $4.80 - and tough to beat by any other fish sandwiches costing three times as much at fancy brewpubs. It's one of my all-time favorite things to eat in Charlotte. \nThe fried chicken is a 10 outa 10 - you can't get any better unless your grandmother makes it. \n\nAs other reviewers have probably noted, walk in  ready to order and don't be on mobile phone!\n\nThis institution is a neat experience and a must if you are passing through or live in the Charlotte area.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2015-07-24', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'w2JrGGqTaQ12-ohj76RXdQ', 'review_id': 'iVWyvculSlMLTy_OnNmFgg', 'text': "This place has the best fried chicken I have found in Charlotte! The skin is crispy and great flavors. The chicken is juicy and comes with tater tots, slaw and a roll. 1/4 white chicken meal was a lot of food. The line was long but the checkout was quick. One tip of new, this place doesn't have seating so expect to eat in your car or take it home. Don't let that stop you though as it's awesome. They also only take cash.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2015-07-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'BrLRxwyMIi6LdFdXmReZaA', 'review_id': 'PVMr2CoAOcUFc-yQffl1dQ', 'text': 'One word... amazing.  Bring cash', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2015-08-11', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'QrsI4-TMslLx6GoPNyEnyQ', 'review_id': '9nZQi8IzQ7yu64_L1RAGlA', 'text': "You can't beat the chicken here! It's a legend in the Charlotte area. Cash only, not a lot of choices. The choices thing down at bother me since there's not a bad choice you could make here. Their homemade sweat tea is AHHHHMMAZING.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2015-08-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 1}, 'user_id': 'BNXO7lqT3mQI3rt7gC55Bg', 'review_id': 'eo6RDoVAvoK6B2yXqMLpJg', 'text': "You know for all the hype that price's chicken coop has and the publicity that they have had I was kind of disappointed. Don't get me wrong here, Their chicken is not bad and people like seeing that they have been in business for more than 20 years. Oh btw I saw a reviewer here that commented about being towed if you park in the parking lot behind the store, it is true. I ordered a chicken sandwich expecting no bones in it and I literally got a drumstick between two slices of wonder bread??? but i'm not judging it based on having bones in a sandwich, there just was not any WOW or THAT'S good to the chicken. \n\nEveryone raves about Price's Chicken Coop being the best chicken in Charlotte but to be honest I have to say that Shell station on South blvd has the Best chicken in Charlotte, I was skeptical at first eating fried chicken from a gas station but WOW!", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 2, 'date': '2015-08-13', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'vTzr2PJHdw8-pJxNekz9Qw', 'review_id': 'DjDRVeXrhy5iPhQTltPbNQ', 'text': "Big buildup..BIG LETDOWN. \n\nPlaced was packed at lunchtime. I didn't mind the wait for this supposedly legendary fried chicken. Ordered a whole fried mixed pieces box and the iced tea too. \nAs soon as I bit into it in the truck my WTF alert and gag reflex met each other and shook hands. You can get this exact bland, semi dry chicken in any part of the ghetto in the Bronx! Come on! This is overpriced garbage. Threw it all away. \n\nI've had legendary fried chicken in Charlotte before. Anyone remembers how the Coffee Cup used to fry chicken? \n\nTheir sweet tea was nice...but the tea flavor is nearly drowned out by the waaay too excessive sugar used.\n\nFly by this coop. It's a sad commentary that so many rave about substandard fare when Coffee Cup should've left an indelible memory.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 1, 'date': '2015-08-20', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 4, 'cool': 1}, 'user_id': 'He6ZibRNyBAGvC-QHOrPkw', 'review_id': '0Wf70Q53XIF9H0ZhoVhnOQ', 'text': "I've lived in Charlotte 13 years, and I JUST made it to Price's. After all the hype I've heard, I've gotta say, I was a little let down. I mean, it was fine... but just fine.\n\nThe fella and I stopped in on a Saturday around 5:00 (they close at 6:00), and the place was fairly busy. We both got the 1/4 white chicken dinner, and the lady behind the counter was really friendly and helpful. It's probably good to know what you want when you go in there because there's a lot of hustle and bustle, and it could be a little overwhelming.\n\nSince there's nowhere to sit, we walked back to our truck and popped out the tailgate - a pretty fun afternoon picnic! There were people sitting across the street in the grass, too. \n\nSo, the chicken was okay, but mine was a little dry. The tater tots were really good, but if you'd given me Bo Rounds, I'm not sure I could've told the difference. The hush puppies were pretty delicious, and I'm not a slaw eater, so I skipped that.  The fella is a slaw aficionado, and he said it was just ok - nothing to write home about. I got excited thinking the roll was one of those tasty yeast rolls, but it was pretty tasteless.\n\nOverall, I was pretty underwhelmed. Maybe my expectations were too high or maybe it was an off day for them or maybe their reputation is better than their food.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 2, 'date': '2015-08-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '5vhNLKg9EeFWBBoheSQPYw', 'review_id': 'ppq_GG-AXalp5eio4GSfgw', 'text': "When I first got to Charlotte, I quickly learned that Price's is a staple of South End, despite the fact that you'll feel like you've stepped back 50 years in time when you see the building and realize that it's cash only! Their fried chicken is, without a doubt, among the best I've ever had. Absolutely delicious and perfectly fried. I recommend trying both white and dark meat. The sides that come with the dinner plates are cole slaw, tater rounds, hushpuppies and a roll. The sides are all good, but nowhere near the ballpark of amazing that the fried chicken is in. Go for the chicken!", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2015-09-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'x3rNlJwGWHWHS-ODQ0TmQA', 'review_id': 'pWtdbWBjJMofb0F_RIRF1g', 'text': "I didn't like it at all. We got chicken, fish and shrimp. They all tastes the same (like batter and old frying oil). The hush puppies were so disappointing. I would never go back or recommend it to anyone. We shared a lot of food for 6 of us, paid $50ish and everyone who had the meal with us didn't like it at all. My friend said that the best thing about the meal was the coke. He's right.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 1, 'date': '2015-09-08', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'KRA54Y_PCVYTrrZ4eTUzBA', 'review_id': 'suulNitrpQkbRdwthq53Lg', 'text': "The best fried chicken in all of Charlotte. Taking home a full of Price's chicken is one of the most satisfying feelings in the whole world.  It's crispy and easy to suck down, you tell yourself you're only going to have two pieces but end up having ten. The sides aren't anything special but they aren't bad. I wish they had mac n cheese but you don't get everything you wish for.\n\nNot a sit down place but the staff is still friendly. It's best to call ahead, pick up your order, and then chow down.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2015-09-27', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'TTRTYUH9kxQOSvkVenus9A', 'review_id': 'dSdMF1zF9lV7B8skaCQW3g', 'text': 'Best Chicken Anywhere, The Coop is own by the Price\'s and has been a family owned business for several generations. My family has been going to Price\'s for many decades, Through my travels I have learned all Chicken isn\'t created equal, and Price\'s is at the top of the coop...  The Chicken is cooked to a Crispy perfection, you will seldom fine elsewhere, and the price is the best deal around.  The Tea is real brewed southern tea, sweetened brewed to perfection...\nThings to take note of: \nThis is not a sit down to eat place, however on any given day you will find people sitting outside, because that is as far as they could get before giving in to the delights of those first bites. \nThey are not open on Sundays or Mondays \nAnd they close everyday at 6pm\nThey do not take Cards or Checks  "CASH ONLY"', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2015-10-05', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 1, 'cool': 0}, 'user_id': 'p2yYMMxD639sGBYYocT5sg', 'review_id': 'Ff8T2LdknUKVRormn9w-tQ', 'text': "The chicken gets 5+ stars but their sides are not that great (fine, just generic). Then again, if you're visiting Price's for the slaw, you're doing it wrong. I'm certainly not an authority on the matter, but it is the best fried chicken I've ever had. \n\nI recently had some family in town who grabbed lunch there on my suggestion. They liked it so much they went back a couple days later (even though we had a lot of other recommendations for them)! \n\nDon't be intimidated by the long lines as the cashiers keep everything moving smoothly despite the small space.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2015-10-20', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '2mkJq24ewdAgxhk1bd76tQ', 'review_id': 'd0Q8zag9x6ZPOQZ6QaOusw', 'text': 'Updating to 3 stars. Gave it another shot or 2 and tried the fish and shrimp in addition to the fried chicken. The seasoning was much better the last time I went, thoroughly enjoyed it, but that just shows the inconsistency of the seasoning each visit, which is no bueno. The sides are unimpressive, as I said in my previous review.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 3, 'date': '2015-10-22', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 0, 'cool': 0}, 'user_id': '3SWfzuODQ8MY30vGr0t_IQ', 'review_id': 'nfotaU-n0AS4vGSbIds5Hw', 'text': 'It\'s pretty amazing fried chicken!!  That\'s literally all that really matters.  Yes, you\'re like going to wait in line at the very least for 5 minutes, but it\'s going to be worth it, so deal with it. I\'ve never tried any of the other dishes at all unfortunately, but there is a full range of menu options and sides.  Each Chicken Dinner comes with tatter tot/hash browns that are "crispy goodness" and also a small side cup of coleslaw and a dinner roll.  I don\'t like coleslaw at all, but I tried it because everything else is good.  I still didn\'t like it but people say it\'s good so you be the judge for yourself.  My friend ordered the bbq sandwich which included the coleslaw on it which she was unaware of but she loved it.  \n\nAlso, they make the best sweet tea on the planet!  Yes, I said it.  Don\'t waste your time getting one of the cups of sweet tea.  Pay the extra $1 or so and get a half gallon for yourself or a couple people and pay for a cup of ice and enjoy it.  We ordered just two cups and went to a nearby seating area to enjoy our food and the weather.  We loved the tea so much that my friend walked back to the store just get a half gallon so we could keep the refills flowing.\n\nCome for the chicken, wait patiently in the quick line, and fall in love with the sweet tea.  You won\'t regret the trip.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2015-10-25', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': '857aIJVBi7R-x9r9NLAcVg', 'review_id': '-M5AiHwJBK8HpAxo6Ao_AQ', 'text': 'Best fried chicken and shrimp I have had in a long time. They take cash only so bring cash.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2015-10-29', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '-qy8bNYF9qXobQz_ztHpEg', 'review_id': 'ITL2rN0dhdYfY7w7rJB97w', 'text': "Went here with some of my family when they were visiting. I've lived in South End for nearly three months and walked past this place/heard about it many times. I had the 4 wing dinner which is a lot of food for the price. It was all fresh and delicious! Chicken had the perfect amount of crunchy exterior and juicy meat. Only reasons I didn't give five stars are that their hush puppies are nothing spectacular, but you only get two of them and the .85 tea is mostly ice. \n\nI will definitely return in the near future!", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2015-10-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 1, 'cool': 0}, 'user_id': 'Te8CcZxvM3uRXKRUTVSvrQ', 'review_id': 'IyIARAvuNCWO1qKfy1A8gA', 'text': "Overrated fried chicken, quicker than fast food especially if you are craving for fried chicken, cash only, half chicken white only (2 breasts and 2 wings) costs $10.70 now, price is photo is dated. Still best fried chicken is Morazan's Pollo Frito in South Blvd.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 1, 'date': '2015-10-30', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'P96fJArqj1iGQTrtLJOxjg', 'review_id': 'Of05EJT13Rs2wXXjgKkyrg', 'text': "Best fish sandwich in Charlotte. They are nickel and dimey but the food is inexpensive so it's not a big deal. I love the potato salad. Reminds me of family cookouts. The slaw isn't anything super special but it is fresh. I've actually never had the chicken. I'm going to assume it's amazing just based on how good the fish is.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2015-11-15', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'N1rUsPsRaikH1SW_cAoJhg', 'review_id': 'Xd-vnCQFEEm1C2X5sQtFgA', 'text': 'Holy smokes this chicken was amazing. Cash only!\n\nThe only downside is that there is no seating inside, whatsoever.  Most people got the box of fried chicken and ate it inside their cars in the parking lot.  There\'s a little park next door but it was too cold to eat outside. \n\nORDERING - get in line behind someone (I believe there are several lines) and then know what you want to order.  If you get a "meal" which is the default it comes with tater tots, cole slaw, hush puppies and then the chicken.  You can specify what type of chicken you want as well.  \n\nFOOD - Since it was two of us, we got 1 meal and then I just got a side of dark meat (thigh and drumstick).  \n\nThe tater tots are interesting because they are shaped like coins, but are SO GOOD.  So crispy and tasty.  \n\nCole slaw wasn\'t bad, maybe a little creamy.\n\nHush puppies were also very tasty.  Had a fried onion taste almost.\n\nFried chicken - it was just the way I like it, crispy, crunchy, and crumbly.  Not like a thick piece of fried skin that seems like a coating.  The chicken was moist, hot and flavorful.  Definitely the best I\'ve had.\n\nOverall, worth coming to try - make sure you take a look at the hours and be prepared to eat in your car.  So crispy and delicious.', 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2015-11-15', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'D-2f-UUrCVhzVSGyGzUvjQ', 'review_id': '7q02ZtDqAY8P04C2GiWbfw', 'text': "Price's is a hole in the wall. Takeout only. Fried chicken is the best ever. Worth the trip!", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2015-11-17', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '5Vfo-SZOEvsVNVBIbFydrg', 'review_id': 'LpLlcXKWMfuuC4-RlfUWgw', 'text': "Its alright chicken for the price.  Nice when your on the way home and you don't want to cook.  Their hours are horrible for being customer centered.\n\nIt would be awesome for group catering and the staff service was wonderful.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 3, 'date': '2015-11-23', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'ETCwKbo2RBSDoLtIGW96eg', 'review_id': '2EM14MOoR7wmA2o9CAUVmQ', 'text': "Best chicken in Charlotte. Ordering is easy, if you don't know what you want yet, don't go up to the counter. Cash only. Just get the chicken. You'll love it.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2015-11-29', 'type': 'review'}
{'votes': {'funny': 1, 'useful': 2, 'cool': 1}, 'user_id': 'u8fuWjSrPSZLsqmcnVcm4A', 'review_id': 'oX-aLv99n2flNX_sCb4BTg', 'text': "Drop your bags and head to price's. Seriously, since it really is that good. I didn't want to jump on the bandwagon and give this place a 4. But I honestly didn't have a problem with any part of the food (if we're talking about the lack of seating, well that's another story). \n\nLike what others said, enter the store and jump into one of the lines once you know what you want. The folks there knows how to work fast to get you in and out ready to enjoy your chicken. My boyfriend and I shared a whole dark chicken (4 thighs and 2 legs) and a side of hush puppies. First off, the prices here are insane. I didn't know that you were still able to get a whole chicken for 10 bucks anywhere in town.\n\nOk, finally the food. The whole car ride home my boyfriend and I were dying to grab a taste of its crispy chicken because the smell was so strong. However, it was worth the wait. The skin was so crispy and you can taste that they use fresh oil for frying the chicken. The meat was tender and fell off the bone. The hush puppies were great as well, better than most places for sure.\n\nWould I come back again? Most definitely. It's already on my to do list when I come back to Charlotte", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2015-12-01', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': '0aZveXk9uFLqX714aZa4Nw', 'review_id': 'eizfsp4k23b865gBHgvznQ', 'text': "I know I'm going to take a hit for this but,  went there Saturday just before closing. I guess for many who grew up with them it's an inbred delight. Coming in and trying them for the first time I really saw little to get excited about. You 'green' tasting cole slaw, fried tater tot disks, a roll, and good fried hush puppies, then your choice of meat. The chicken apparently the premier meat.  Well, the chicken, not much flavor, and my breast meat was bad, too dry, way too dry. Honestly I've had better, moister chicken breast at BoJangles and Golden Corral. The tater tots are, well, tater tots. The coleslaw, often you find coleslaw that has a 'green' or raw taste, I've had worse, the slaw had a slight raw taste and was just ok, again, one notch above bland that even the single dill chip on top couldn't salvage. Let me finish with, they are average, not great, not terrible, except terrible dry breast, they should cook breast separately so they can get it out sooner, chicken breast is done ten degrees sooner then dark. Over cooking is the single cause of dry breast meat. Also, for what's it's worth all the fried food wasn't greasy and that by itself it a super positive.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 2, 'date': '2015-12-06', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 1}, 'user_id': 'FOHwqjObnLIzbQcwfXMtxQ', 'review_id': '_zsiwDmT6zx90ztXa6JenA', 'text': "It puts me to sleep! I genuinely love this place, and it will put you to sleep. I got the 4 piece wing chicken  dinner.  It comes with a roll, hushpuppies, chicken,  tater tots and a small coleslaw.\nYou have to have cash, no credit cards.\nThe only thing is, sometimes because the food is cooked and ready to go it isn't as hot.  But it's still delicious. Love it", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 5, 'date': '2015-12-10', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'jPohDsYza0aVw0Yxe5qGZw', 'review_id': 'Ng0QTh1Ff0DSMoROVEggtQ', 'text': "I don't know why everyone wets their pants over this place. It's okay but nothing to get excited about. \n\nThe chicken pieces are small and blandly seasoned. I think Bojangles chicken is better in both taste and size. I do like the potato rounds (they give you a ton), and the hush puppies are very good with an onion-y flavor. I don't eat coleslaw but my husband does and he says it's downright awful. He throws it out every time. We've gone there maybe 5-6 times and each time I'm left wondering what the rest of Charlotte sees and tastes that I'm not getting. \n\nTo be fair, my husband disagrees with my post and says he'd give them 4 out of 5 stars. He loves their chicken. Go figure!", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 2, 'date': '2015-12-12', 'type': 'review'}
{'votes': {'funny': 0, 'useful': 0, 'cool': 0}, 'user_id': 'Zy_JOyhzbwRbYSmJuve_IQ', 'review_id': '3NzWDCGYqW_T9bwPvfMywQ', 'text': "So far this is the best fried chicken that I've tried in Charlotte. If definitely come back for more. The chicken was tasty and juicy. Seasoned very well throughout each bite. It was greasy but what do you expect from fried chicken. Make sure you have some wipes if you can't wash your hands at a sink right away. It's a pretty small place. Go here for take out. There is no parking lot. You have to find street parking. Service was fast and friendly.", 'business_id': 'WUtPI9rJbs7ET1gPhULnDw', 'stars': 4, 'date': '2015-12-14', 'type': 'review'}
